[
  {
    "text": "Trump names his own pick for IRS commissioner, breaking from tradition  —  With the choice of former congressman Billy Long, Trump apparently plans to oust Danny Werfel, who is partway through his five-year appointment.  —  With his announcement late Wednesday that he'll appoint former … ",
    "url": "https://www.washingtonpost.com/business/2024/12/05/billy-long-irs-commissioner-trump/"
  },
  {
    "text": "Trump names ICE chief and makes another round of immigration announcements  —  President-elect Donald Trump on Thursday night announced a new round of nominees and appointments to tackle his aggressive immigration and homeland security agenda.  Trump said he was nominating Rodney Scott as commissioner of Customs and Border Protection.",
    "url": "https://www.politico.com/live-updates/2024/12/05/congress/trump-ice-chief-rodney-scott-00192974"
  },
  {
    "text": "Elon Musk spent a quarter-billion dollars electing Trump, including financing mysterious ‘RBG PAC’  —  The super PAC, which defended Trump on abortion, got its more than $20 million in funds came from the “Elon Musk Revocable Trust.”  —  Billionaire Elon Musk poured more than $20 million … ",
    "url": "https://www.nbcnews.com/politics/2024-election/elon-musk-spent-quarter-billion-dollars-electing-trump-financing-myste-rcna182922"
  },
  {
    "text": "Elon Musk Spent Over $250 Million to Help Elect Trump  —  The enormous spending from the world's richest man quietly fueled allied groups and was revealed only now, as Mr. Musk plays a key role in the presidential transition.  —  Elon Musk, the world's richest man, spent over a quarter … ",
    "url": "https://www.nytimes.com/2024/12/05/us/politics/elon-musk-trump-rbg-election.html?unlocked_article_code=1.fU4.tdM1.sEjWdyrognld&smid=url-share"
  },
  {
    "text": "Why I Just Resigned From The Los Angeles Times  —  I have been a contributor to the Los Angeles Times op-ed page in some fashion for more than 15 years.  For the last three years, I have been the Senior Legal Columnist, writing regular weekly columns about Trump's legal troubles, the Supreme Court, and a wide range of other topics.",
    "url": "https://harrylitman.substack.com/p/why-i-just-resigned-from-the-los"
  },
  {
    "text": "House Republicans vote to block release of Gaetz ethics report  —  House Republicans voted on Thursday to block a Democrat-led effort to release a long-awaited Ethics Committee report on allegations against former GOP Rep. Matt Gaetz of Florida.  —  The House took a step to effectively shut … ",
    "url": "https://www.cnn.com/2024/12/05/politics/house-vote-matt-gaetz-ethics-report"
  },
  {
    "text": "Biden Team Considers Blanket Pardons Before Trump's Promised ‘Retribution’  —  White House officials believe President-elect Donald J. Trump's selection of partisan warriors for top law enforcement jobs indicates that he will pursue revenge against his perceived enemies.",
    "url": "https://www.nytimes.com/2024/12/05/us/politics/biden-trump-pardons.html"
  },
  {
    "text": "An architect of Project 2025 is pressuring Republican senators to confirm Pete Hegseth  —  The think tank behind Project 2025, the conservative blueprint linked to President-elect Donald Trump, is launching an effort to back Trump's imperiled selection for secretary of defense in its latest attempt … ",
    "url": "https://apnews.com/article/project-2025-cabinet-nominees-heritage-foundation-hegseth-d770431b8022159dc3f6c53458bdcf0e"
  },
  {
    "text": "Anthem Blue Cross Blue Shield calls off surgery anesthesia cap … - The decision covered plans in Connecticut, New York and Missouri.  — The insurer had based the decision on surgery time metrics from the Centers for Medicare and Medicaid Services, NPR reported.",
    "url": "https://www.axios.com/2024/12/05/blue-cross-blue-shield-anesthesia-anthem-connecticut"
  },
  {
    "text": "Trump picks David Perdue to be ambassador to China  —  Donald Trump has selected former Georgia Sen. David Perdue to serve as ambassador to China.  Perdue has significant business experience in Asia, including China, something he ran on during his Senate election in 2014.",
    "url": "https://www.politico.com/live-updates/2024/12/05/congress/perdue-to-china-00192969"
  },
  {
    "text": "What if everyone had masked up?  Analysis of app data has an answer … What would have happened if everyone in the United Kingdom had worn high-grade masks during the COVID-19 pandemic?  A modelling study 1 has estimated just how sharply transmission might have dropped.  —  Access options",
    "url": "https://www.nature.com/articles/d41586-024-03976-0"
  },
  {
    "text": "Tulsi Gabbard's views on Russia shaped in part by Kremlin propaganda outlet, ex-aides say  —  U.S. intelligence has deemed the Russian news site RT to be a propaganda outlet.  —  Former president and Republican presidential nominee Donald Trump embraces former Rep. Tulsi Gabbard at a campaign rally … ",
    "url": "https://abcnews.go.com/US/gabbards-views-russia-shaped-part-kremlin-propaganda-outlet/story?id=116430097"
  },
  {
    "text": "Trump's Fans Are Suffering From Tony Soprano Syndrome  —  Some conservatives are embracing the villains in what are supposed to be cautionary tales.  —  In every Judge Joe Dredd story I've ever read, there is at least one almost comically obvious moment when the author makes clear … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/12/elon-musk-judge-dredd-autocrat/680881/?gift=Je3D9AQS-C17lUTOnl2W8CBSmuV2OiRdoa9ckmQzxaU&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Torrent of Hate for Health Insurance Industry Follows C.E.O.'s Killing  —  The shooting death of a UnitedHealthcare executive in Manhattan has unleashed Americans' frustrations with an industry that often denies coverage and reimbursement for medical claims.",
    "url": "https://www.nytimes.com/2024/12/05/nyregion/social-media-insurance-industry-brian-thompson.html?unlocked_article_code=1.fE4.fm3v.Yzd8hJFtI4Xu&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "In the case of Trump loyalist Ric Grenell, loyalty did not trump all  —  He and his allies mounted an aggressive effort for the top diplomat role.  —  As Ric Grenell made a bid after the election to be Donald Trump's secretary of State, a flurry of social media posts from MAGA influencers started popping … ",
    "url": "https://www.politico.com/news/2024/12/05/grenell-trump-cabinet-loyalty-00192785"
  },
  {
    "text": "Stop using generative AI as a search engine  —  A fake presidential pardon explains why you can't trust robots with the news. … How many presidents have pardoned their relatives?  It turns out this is a tricky question to answer.  —  Following Hunter Biden's pardon by his father … ",
    "url": "https://www.theverge.com/2024/12/5/24313222/chatgpt-pardon-biden-bush-esquire"
  },
  {
    "text": "Musk, on Capitol Hill, says ‘get rid of all credits’  —  Elon Musk, the billionaire electric vehicle mogul whom President-elect Donald Trump has tapped to help lead a government efficiency task force, told POLITICO's E&E News on Thursday that he wants to eliminate tax breaks for EV buyers.",
    "url": "https://www.politico.com/live-updates/2024/12/05/congress/elon-musk-electric-cars-00192848"
  },
  {
    "text": "A Bipartisan Slippage in Standards  —  Biden's pardon of Hunter is as disconcerting as Trump's more exotic administration nominees.  —  We're seeing bipartisan slippage of standards.  —  It is embarrassing as a citizen to see the president of the United States pardon his son … ",
    "url": "https://www.wsj.com/opinion/bipartisan-slippage-of-standards-biden-pardon-hunter-trump-unusual-administration-nominees-289e0952?st=mvEjpV&reflink=article_copyURL_share"
  },
  {
    "text": "Secret Service leader erupts at GOP lawmaker over 9/11 questioning  —  Acting Secret Service Director Ronald Rowe and Rep. Pat Fallon (R-Texas) engaged in a shouting match that persisted over gavel banging, as Rowe accused the lawmaker of politicizing the 9/11 attacks.",
    "url": "https://thehill.com/policy/national-security/5024290-secret-service-leader-erupts-at-gop-rep-over-9-11-questioning/"
  },
  {
    "text": "Manhattan Medicare Murder Mystery  —  Only about 50 million customers of America's reigning medical monopoly might have a motive to exact revenge upon the UnitedHealthcare CEO.  —  Members of the New York Police crime scene unit investigate the scene outside the Hilton Hotel in Midtown Manhattan … ",
    "url": "https://prospect.org/health/2024-12-05-manhattan-medicare-murder-mystery/"
  },
  {
    "text": "Wealthy Americans are still ducking the IRS crackdown on non-filers … WATCH NOW  —  WASHINGTON — Tens of thousands of wealthy Americans are not complying with recently revamped Internal Revenue Service efforts to get them to file tax returns, according to data obtained exclusively by CNBC.",
    "url": "https://www.cnbc.com/2024/12/05/irs-crackdown-on-wealthy-americans-faces-roadblocks-.html"
  },
  {
    "text": "Incoming Trump administration plans to deport some migrants to countries other than their own  —  The transition team is preparing a list of countries to which migrants might be deported when their home countries refuse to accept them, according to three sources familiar with the plans.",
    "url": "https://www.nbcnews.com/investigations/incoming-trump-administration-plans-deport-migrants-countries-rcna182896"
  },
  {
    "text": "Dems quietly boosted Nebraska's independent Senate candidate in the final days of the election  —  Senate Democrats' main super PAC dropped millions into an outside group supporting independent Nebraska Senate candidate Dan Osborn.  —  Democrats kept insisting that an independent Senate candidate wasn't one of their own.",
    "url": "https://www.politico.com/news/2024/12/05/democrats-dan-osborn-nebraska-senate-00192843"
  }
]