[
  {
    "text": "Trump Stepped on a Rake Yesterday—and He Knew It  —  DONALD TRUMP DOESN'T ADMIT TO MISTAKES, but he knew he made one Sunday morning.  —  For 96 minutes, at his first of his three rallies that day, Trump barely looked at his teleprompter.  He darkly obsessed about election fraud … ",
    "url": "https://www.thebulwark.com/p/trump-stepped-on-a-rake-lititz-rally-grievances"
  },
  {
    "text": "Trump is confident on election's eve: 'It's ours to lose'  —  Former President Trump thinks it's his election to lose as voters go the polls to elect a new president.  —  If he's right, he'll make history, becoming the first former president to lose office and then win it again since 1892.",
    "url": "https://thehill.com/homenews/campaign/4970776-trump-election-loss-challenge/"
  },
  {
    "text": "Trump Claims “Illegal Alien” Voting Is Rampant.  His Own Party Disagrees.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  In public remarks, former President Donald Trump has repeatedly … ",
    "url": "https://www.propublica.org/article/trump-pennsylvania-rnc-training-video-undocumented-voting-election"
  },
  {
    "text": "Elon Musk's $1 million-a-day voter sweepstakes can proceed, a Pennsylvania judge says  —  The $1 million-a-day voter sweepstakes that Elon Musk 's political action committee is hosting in swing states can continue through Tuesday's presidential election, a Pennsylvania judge ruled Monday.",
    "url": "https://apnews.com/article/musk-million-sweepstakes-lottery-pennsylvania-krasner-4f683c48eb7dcc57f183e54ef16e7320"
  },
  {
    "text": "Elon Musk lawyer says $1 million voter giveaway winners are not random  —  Elon Musk's pro-Trump group does not choose the winners of its $1 million-a-day giveaway to registered voters at random, but instead picks people who would be good spokespeople for its agenda, a lawyer for the billionaire said on Monday.",
    "url": "https://www.reuters.com/legal/judge-weighs-challenge-elon-musks-1-million-voter-giveaway-2024-11-04/"
  },
  {
    "text": "U.S. Presidential Contest, November 2024  —  Harris +4 Points Against Trump Nationally  —  In this final, national NPR/PBS News/Marist Poll before Election Day, Vice President Kamala Harris edges former President Donald Trump among likely voters nationally including those who are undecided yet leaning toward a candidate.",
    "url": "https://maristpoll.marist.edu/polls/u-s-presidential-contest-november-2024/"
  },
  {
    "text": "Harris leads Trump by 4 points in final PBS News/NPR/Marist poll; gender gap closes  —  Vice President Harris leads former President Trump by four percentage points, according to the final PBS News/NPR/Marist poll of the election.  —  In their national survey of likely voters … ",
    "url": "https://thehill.com/homenews/campaign/4970396-vice-president-harris-leads-trump/"
  },
  {
    "text": "Editor Jon Ralston's 2024 Nevada election predictions  —  I should have done the mic drop in 2022.  —  Picking the winners in the top two races, both of which were agonizingly close, should have been the swan song, the ride off into the sunset on my oracular career.",
    "url": "https://thenevadaindependent.com/article/editor-jon-ralstons-2024-nevada-election-predictions"
  },
  {
    "text": "Russia Suspected of Plotting to Send Incendiary Devices on U.S.-Bound Planes  —  Two devices that ignited in Europe, officials say, were part of a covert operation to put them on cargo or passenger aircraft  —  Western security officials say they believe that two incendiary devices … ",
    "url": "https://www.wsj.com/world/russia-plot-us-planes-incendiary-devices-de3b8c0a"
  },
  {
    "text": "Russia Suspected of Plotting to Send US Incendiary Devices  — Poland cites alleged sabotage effort without naming Russia  — Officials cite attempt to send incendiary devices via DHL  —  European and US intelligence officials believe Russia is behind a plan that would ultimately place … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-04/russia-suspected-of-planning-to-send-incendiary-devices-to-us"
  },
  {
    "text": "Missouri sues DOJ in effort to block poll monitors  —  The Republican-led state of Missouri on Monday asked a judge to block the Justice Department from dispatching lawyers to St. Louis to monitor adherence to federal voting rights laws on Election Day.  —  Missouri's attorney general … ",
    "url": "https://thehill.com/regulation/court-battles/4970552-mo-missouri-lawsuit-doj-monitoring/"
  },
  {
    "text": "Dems worry: What happens if the speaker's race isn't over by Jan. 6?  —  House Democrats are increasingly alarmed by a potential threat to the transfer of presidential power: a protracted failure by Republicans to select a speaker if the GOP keeps control of the chamber.",
    "url": "https://www.politico.com/live-updates/2024/11/04/2024-elections-live-coverage-updates-analysis/certifying-election-worries-00187266"
  },
  {
    "text": "Illinois man arrested after punching election judge at polling location  —  Case follows numerous attacks on the voting process and threats of violence, even as officials say voting is safe  —  A man in Illinois punched an election judge at a polling location and was arrested on Sunday … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/04/illinois-man-punch-election-judge-polls"
  },
  {
    "text": "NBC Gives Donald Trump Campaign Time During NASCAR Race, ‘Sunday Night Football’ in Response to Kamala Harris' ‘SNL’ Appearance  —  Trump appeared in spots that aired during Sunday's coverage of both sporting events on NBC, speaking directly to the camera.  —  NBC is giving former President … ",
    "url": "https://www.hollywoodreporter.com/tv/tv-news/nbc-donald-trump-campaign-free-ad-time-nascar-race-kamala-harris-snl-sketch-1236052709/"
  },
  {
    "text": "Trump's Crowds Are Dwindling as His Campaign Winds Down  —  The former president likes to talk about the attendance at his rallies, but empty seats and early exits have grown more common.  —  Donald J. Trump has spent parts of the last week of his campaign speaking in self-aggrandizing reverence … ",
    "url": "https://www.nytimes.com/2024/11/04/us/politics/trump-rally-crowds.html"
  },
  {
    "text": "Quincy Jones, music titan who worked with everyone from Frank Sinatra to Michael Jackson, dies at 91  —  Quincy Jones, the multi-talented music titan whose vast legacy ranged from producing Michael Jackson's historic “Thriller” album to writing prize-winning film and television scores … ",
    "url": "https://apnews.com/article/quincy-jones-dead-a9e31c7e39c448d8971519f47a22dd21"
  },
  {
    "text": "Algerian Boxer Imane Khelif Has XY Chromosomes And “Testicles” : French-Algerian Medical Report Admits  —  A shocking new development has emerged in the case of Algerian boxer Imane Khelif after a French journalist reportedly gained access to a damning medical report revealing Khelif has “testicles.”",
    "url": "https://reduxx.info/algerian-boxer-imane-khelif-has-xy-chromosomes-and-testicles-french-algerian-medical-report-admits/"
  },
  {
    "text": "Poll: Harris has massive lead among swing state college students … - Another factor is how many out-of-state students attending schools in swing states vote there vs. in their home states via absentee ballot. … - In a race that included Green Party candidate Jill Stein and Libertarian Chase Oliver … ",
    "url": "https://www.axios.com/2024/11/04/poll-harris-trump-swing-state-college-students"
  },
  {
    "text": "Donald Trump Has Lost His Sh*t  —  I woke up Saturday morning, as you may have, to the sight of Donald Trump performing fellatio on a microphone (no, I'm not linking to it).  The clip that was making the rounds on X was 27 seconds.  As I scrolled down, I noticed a tweet from a MAGA person scolding … ",
    "url": "https://newrepublic.com/article/187847/donald-trump-fellatio-microphone-rally"
  },
  {
    "text": "How to Get Through Election Day  —  Store up some enlightenment for the white-knuckle hours ahead.  —  This might be nostalgia talking, but I miss the old Election Nights, the kind we used to have before the stakes became so gruesomely high.  No one was warning of “existential consequences” … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/11/election-results-grief-minimization/680517/"
  },
  {
    "text": "The Dark Money Kingpin Behind Election-Day Chaos  —  Through dubious lawsuits, conspiracy theories, and voter intimidation efforts, conservative power player Leonard Leo helped lay the groundwork for distrust and upheaval.  —  Right-wing activist groups with ties to conservative Supreme … ",
    "url": "https://www.levernews.com/the-dark-money-kingpin-behind-election-day-chaos/"
  },
  {
    "text": "Mini Poop Statues Appear At D.C.'s Mysterious Turd Monument ‘Honoring’ Trump  —  “A monument isn't a real monument until cheap souvenirs are involved,” reads an email from the anonymous group behind the statue mocking Jan. 6, 2021, rioters.  —  LOADING  —  WASHINGTON — It's been two weeks since … ",
    "url": "https://www.huffpost.com/entry/poop-monument-trump-jan-6-insurrection_n_6728f0f2e4b05debb72b6f29"
  },
  {
    "text": "Musk's political posts viewed twice as many times as political ads on X  —  Elon Musk's political posts on X have received more than twice as many views as paid political ads on his platform, according to a new analysis conducted by the Center for Countering Digital Hate (CCDH).",
    "url": "https://thehill.com/policy/technology/4970808-musks-political-posts-viewed-twice-as-many-times-as-political-ads-on-x-analysis/"
  },
  {
    "text": "Two potential futures for Trump: The presidency or prison … - His legal team largely succeeded in delaying his criminal trials until after the election. … - And Justice Department policy prohibits the prosecution of a sitting president. … - On Nov. 12, a week after the election … ",
    "url": "https://www.axios.com/2024/11/04/trump-prison-sentencing-criminal-cases"
  }
]