[
  {
    "text": "Donald Trump asked Volodymyr Zelenskyy if Ukraine could hit Moscow, say people briefed on call  —  US president encouraged Ukrainian leader to step up deep strikes on Russia  —  Christopher Miller in Kyiv, Henry Foy in Brussels and Max Seddon in Berlin  —  Donald Trump has privately encouraged Ukraine … ",
    "url": "https://www.ft.com/content/b66f03b5-e295-4f8c-92ba-516a527d588c"
  },
  {
    "text": "Fed up with Putin, Trump offers Ukraine arms and tariffs  —  America will supply air-defence missiles and may punish countries that trade with Russia  —  After his first post-election call with Vladimir Putin in February, Donald Trump gushed about the “great benefits” of a rapprochement … ",
    "url": "https://www.economist.com/europe/2025/07/14/fed-up-with-putin-trump-offers-ukraine-arms-and-tariffs?link_source=ta_bluesky_link&taid=687650f1c14bc7000191059b"
  },
  {
    "text": "I'm ‘disappointed but not done’ with Putin, Trump tells BBC  —  Donald Trump has said that he is disappointed but not done with Vladimir Putin, in an exclusive phone call with the BBC.  —  The US president was pressed on whether he trusts the Russian leader, and replied: “I trust almost no-one.”",
    "url": "https://www.bbc.com/news/articles/c1e02q12z32o"
  },
  {
    "text": "U.S. Inflation Accelerated in June as Trump's Tariffs Pushed Up Prices  —  The Consumer Price Index rose 2.7 percent from a year ago, as the global trade war started to bite.  —  Inflation accelerated in June as President Trump's tariffs started to leave a bigger imprint on the economy … ",
    "url": "https://www.nytimes.com/2025/07/15/business/cpi-report-inflation-june.html"
  },
  {
    "text": "Inflation Picks Up to 2.7% as Tariffs Start to Seep Into Prices  —  Prices were up for furniture, clothing and other tariff-sensitive items  —  Inflation picked up in June, a potential sign that companies are starting to pass tariff costs on to consumers.  —  Consumer prices rose 2.7% … ",
    "url": "https://www.wsj.com/economy/inflation-hit-2-7-in-june-in-line-with-expectations-8f92a8cd?st=e76k8B&reflink=article_copyURL_share"
  },
  {
    "text": "US consumer prices increase as expected in June  —  U.S. consumer prices picked up in June, likely marking the start of a long-anticipated tariff-induced increase in inflation that has kept the Federal Reserve cautious about resuming its interest rate cuts.  —  The Consumer Price Index increased .3% … ",
    "url": "https://www.reuters.com/business/us-inflation-expected-rise-june-with-tariff-driven-price-hikes-2025-07-15/"
  },
  {
    "text": "The Five MAGA Factions Waging an Epstein Civil War  —  The Leopard Will Eat the Face  —  TRUMP WORLD FELL INTO CHAOS just before the weekend, as the shock from the Justice Department's Jeffrey Epstein memo continued to reverberate.  Donald Trump's initial response—a long Saturday-afternoon post … ",
    "url": "https://www.thebulwark.com/p/five-maga-factions-waging-civil-war-jeffrey-epstein"
  },
  {
    "text": "Trump is flunking his Epstein test  —  For years he insisted on a deep-state plot that only he could expose.  Now he says there is nothing to show  —  Cult loyalty is blind until it isn't.  Donald Trump's populist truth test now seems to be at hand.  Whether or not the “Epstein files” exist is secondary.",
    "url": "https://www.ft.com/content/4d7e000a-67ab-4585-a485-63588424381f"
  },
  {
    "text": "House GOP blocks Dem maneuver to force release of Epstein files  —  House Republicans on Monday night voted against attaching a Democratic amendment to landmark cryptocurrency legislation that would force the Justice Department to release the Jeffrey Epstein files.",
    "url": "https://www.axios.com/2025/07/15/trump-epstein-khanna-doj-democrats-republicans"
  },
  {
    "text": "Trump admin faces GOP blowback in Congress over Epstein  —  The simmering MAGA revolt over the Trump administration's handling of the Jeffrey Epstein files threatens to spill over into the halls of Congress. … - “I don't think the American people are gonna move on that quickly … ",
    "url": "https://www.axios.com/2025/07/15/trump-epstein-republicans-congress-bondi-bongino"
  },
  {
    "text": "Supreme Court Clears the Way for Trump's Cuts to the Education Department  —  The move by the justices represents an expansion of executive power, allowing President Trump to dismantle the inner workings of a government department.  —  The Supreme Court agreed on Monday that the Trump administration … ",
    "url": "https://www.nytimes.com/2025/07/14/us/politics/supreme-court-education-department.html"
  },
  {
    "text": "The Trump Administration Is About to Incinerate 500 Tons of Emergency Food  —  Federal workers warned for months that the high-energy biscuits would go to waste.  —  Five months into its unprecedented dismantling of foreign-aid programs, the Trump administration has given the order … ",
    "url": "https://www.theatlantic.com/health/archive/2025/07/usaid-emergency-food-incinerate-trump/683532/?gift=hVZeG3M9DnxL4CekrWGK34UoPtkCxvKSW-rp40Qt1-Q&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "The Enshittification of American Power  —  First Google and Facebook, then the world.  Under Trump 2.0, US statecraft is starting to mimic the worst tendencies of Big Tech.  —  For decades, allies of the United States lived comfortably amid the sprawl of American hegemony.",
    "url": "https://www.wired.com/story/enshittification-of-american-power/"
  },
  {
    "text": "Irish tourist jailed by Ice for months after overstaying US visit by three days: ‘Nobody is safe’  —  Exclusive: For roughly 100 days, Thomas says he faced harsh detention conditions, despite agreeing to deportation  —  Thomas, a 35-year-old tech worker and father of three from Ireland … ",
    "url": "https://www.theguardian.com/us-news/2025/jul/15/irish-tourist-ice-detention"
  },
  {
    "text": "Lead investigator into Biden's use of an autopen signed letters with a digital signature  —  House Oversight Committee Chair Rep. James Comer, R-Ky., used a digital signature to send out letters and subpoena notices related to the Biden autopen investigation.",
    "url": "https://www.nbcnews.com/politics/congress/lead-investigator-james-comer-biden-autopen-digital-signature-rcna216719"
  },
  {
    "text": "Trump says Club World Cup trophy will remain in Oval Office after tournament's end  — US president was given trophy earlier this year  — Chelsea won newly expanded tournament on Sunday  —  Donald Trump has claimed that the Club World Cup trophy that has featured prominently … ",
    "url": "https://www.theguardian.com/football/2025/jul/14/trump-says-club-world-cup-trophy-will-remain-in-oval-office-after-tournaments-end"
  },
  {
    "text": "ICE declares millions of undocumented immigrants ineligible for bond hearings  —  A memo from ICE's acting director instructs officers to hold immigrants who entered the country illegally “for the duration of their removal proceedings,” which can take months or years.",
    "url": "https://www.washingtonpost.com/immigration/2025/07/14/ice-trump-undocumented-immigrants-bond-hearings/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUyNDY1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUzODQ3OTk5LCJpYXQiOjE3NTI0NjU2MDAsImp0aSI6ImQyNzRmNjMwLWE4MjQtNDMwYi1hZDU1LTUxNjg3NzA1MWU4NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzA3LzE0L2ljZS10cnVtcC11bmRvY3VtZW50ZWQtaW1taWdyYW50cy1ib25kLWhlYXJpbmdzLyJ9.rceL8rWTDoUkGGjtDBssAsvEI63vqxUKB2RvL1BdsCA&itid=gfta"
  },
  {
    "text": "Trump's Brazil tariffs are ‘grotesquely illegal,’ says Nobel Prize-winning economist  —  President Trump's threat to impose higher tariffs on Brazil is “grotesquely illegal,” says Nobel Prize-winning economist Paul Krugman.  —  Brazil was among the countries Trump threatened with tariffs in letters posted to social media last week.",
    "url": "https://www.npr.org/2025/07/14/nx-s1-5464923/nobel-prize-winning-economist-paul-krugman-discusses-trumps-use-of-tariffs"
  },
  {
    "text": "Bessent Suggests Powell Should Leave Fed Board in May  —  US Treasury Secretary Scott Bessent suggested that Federal Reserve Chair Jerome Powell should step down from the central bank's board when his term as chair is up in May 2026.  —  “Traditionally, the Fed chair also steps down as a governor … ",
    "url": "https://www.bloomberg.com/news/articles/2025-07-15/bessent-says-formal-process-for-powell-succcessor-has-started"
  },
  {
    "text": "More than 75 former judges urge Senate committee to reject Trump judicial nominee Emil Bove  —  More than 75 former federal and state judges on Tuesday called on the Senate Judiciary Committee to reject the nomination of Emil Bove, President Donald Trump's former personal attorney, to a prestigious appeals court judgeship.",
    "url": "https://cnn.com/2025/07/15/politics/emil-bove-former-judges-reject-trump-judicial-nominee"
  },
  {
    "text": "Capitol agenda: Thune barrels ahead on rescissions  —  Senate Majority Leader John Thune says he will bring the first procedural vote to the floor Tuesday on the White House's request to claw back $9.4 billion in spending.  It's not clear he has even the 51 votes necessary to start debate on the package.",
    "url": "https://www.politico.com/live-updates/2025/07/15/congress/thune-rescissions-funding-vought-collins-johnson-appropriations-00452928"
  },
  {
    "text": "I'm a Genocide Scholar.  I Know It When I See It.  —  A month after the Hamas attack on Israel on Oct. 7, 2023, I believed there was evidence that the Israeli military had committed war crimes and potentially crimes against humanity in its counterattack on Gaza.",
    "url": "https://www.nytimes.com/2025/07/15/opinion/israel-gaza-holocaust-genocide-palestinians.html?unlocked_article_code=1.Wk8.qHnC.tm-Sl4pqA4ez&smid=url-share"
  },
  {
    "text": "DOJ urges Supreme Court to turn away Epstein accomplice Ghislaine Maxwell's appeal  —  The former Jeffrey Epstein associate is currently serving a 20-year sentence.  —  Jeffrey Epstein and Ghislaine Maxwell attend de Grisogono Sponsors The 2005 Wall Street Concert Series Benefitting Wall Street Rising … ",
    "url": "https://abcnews.go.com/US/doj-urges-supreme-court-turn-epstein-accomplice-ghislaine/story?id=123752067"
  },
  {
    "text": "Exclusive: NIH to dismiss dozens of grant reviewers to align with Trump priorities … - Max Kozlov  —  Search author on:  —  PubMed Google Scholar  —  In an unprecedented move, the US National Institutes of Health (NIH) will soon disinvite dozens of scientists who were about to take positions … ",
    "url": "https://www.nature.com/articles/d41586-025-02221-6"
  },
  {
    "text": "DOGE Denizen Marko Elez Leaked API Key for xAI  —  Marko Elez, a 25-year-old employee at Elon Musk's Department of Government Efficiency (DOGE), has been granted access to sensitive databases at the U.S. Social Security Administration, the Treasury and Justice departments, and the Department of Homeland Security.",
    "url": "https://krebsonsecurity.com/2025/07/doge-denizen-marko-elez-leaked-api-key-for-xai/"
  },
  {
    "text": "Republicans renew a bid to remove noncitizens from the census tally behind voting maps  —  Republicans in Congress are reviving a controversial push to alter a key set of census numbers that are used to determine how presidents and members of the U.S. House of Representatives are elected.",
    "url": "https://www.npr.org/2025/07/15/nx-s1-5467533/counted-in-the-census-congressional-redistricting-electoral-college"
  },
  {
    "text": "Trump's new wall: His push to oust legal U.S. residents … - Trump's administration is allowing those TPS deals to expire — for more than 700,000 immigrants from Haiti, Venezuela, Afghanistan, Honduras and Nicaragua so far, with other countries' renewal deadlines looming.",
    "url": "https://www.axios.com/2025/07/15/trump-strategy-deport-legal-immigrants"
  }
]