[
  {
    "text": "Trump could soon be in big legal trouble for inflating his net worth  —  New York's attorney general wants a speedy ruling in the case over Trump's business dealings.  —  New York Attorney General Letitia James is seeking a speedy judgment against former President Donald Trump for allegedly inflating … ",
    "url": "https://www.vox.com/politics/2023/8/31/23854224/trump-new-york-net-worth-case-james"
  },
  {
    "text": "Mark Meadows Is a Warning About a Second Trump Term  —  On Monday, Mark Meadows, a former White House chief of staff, testified in an effort to move the Georgia racketeering case against his former boss Donald Trump and co-defendants to federal court.  On the stand, he said that he believed … ",
    "url": "https://www.nytimes.com/2023/08/31/opinion/mark-meadows-georgia-trump.html"
  },
  {
    "text": "Trump told NY officials he was too busy saving the world ‘from nuclear holocaust’ to commit business fraud  — In a sworn deposition, Trump told New York officials he was too busy “saving millions of lives” to commit business fraud.  — “I think you would have nuclear holocaust” … ",
    "url": "https://www.businessinsider.com/trump-busy-saving-world-from-nuclear-holocaust-commit-business-fraud-2023-8?op=1"
  },
  {
    "text": "Proud Boy leader Joseph Biggs sentenced to 17 years for Jan. 6 crimes  —  A former leader in the far-right Proud Boys group was sentenced Thursday to 17 years in prison, just shy of the longest punishment imposed on a participant in the Jan. 6, 2021, riot at the U.S. Capitol.",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/08/31/proud-boys-joseph-biggs-sentencing-jan6-seditious-conspiracy/"
  },
  {
    "text": "Proud Boy Joe Biggs Sentenced To 17 Years Over Jan. 6 Plot  —  Biggs, an Army veteran and former Infowars correspondent, is one of five Proud Boys leaders convicted in one of the Justice Department's highest-profile Jan. 6 cases.  —  Joseph Biggs, a leader and top propagandist … ",
    "url": "https://www.huffpost.com/entry/proud-boys-joe-biggs-sentenced_n_64ef3e5de4b0efecbcb97d74"
  },
  {
    "text": "Proud Boy Joe Biggs receives 17 years in Jan. 6 seditious conspiracy case  —  The former Infowars correspondent, who was convicted of seditious conspiracy, “served as an instigator and leader” during the Capitol attack, federal prosecutors said.  —  Proud Boy Joe Biggs sentenced to 17 years in prison in Jan. 6 case",
    "url": "https://www.nbcnews.com/politics/justice-department/proud-boy-joe-biggs-faces-decades-prison-jan-6-seditious-conspiracy-ca-rcna102597"
  },
  {
    "text": "GOP senators weigh ‘special’ meeting on their leadership after McConnell's freeze  —  It takes just five Republicans to force such a sitdown, the most direct way to specifically discuss their future amid revived questions about the leader's health.  —  A handful of GOP senators is weighing whether … ",
    "url": "https://www.politico.com/news/2023/08/31/gop-senators-mcconnell-freeze-up-00113610"
  },
  {
    "text": "Trump enters not guilty plea in Fulton County, won't appear for arraignment  —  Former President Donald Trump has entered a not guilty plea to 13 Georgia felony counts related to an alleged scheme to overturn the state's 2020 presidential election results.  —  An attorney for Trump filed … ",
    "url": "https://www.cbsnews.com/news/trump-not-guilty-plea-fulton-county-wont-appear-for-arraignment/"
  },
  {
    "text": "Justice Thomas says he used private jet for security reasons after Dobbs leak  —  In required financial disclosure, Justice Clarence Thomas reports three 2022 trips on private jet of Harlan Crow  —  Supreme Court Justice Clarence Thomas reported three 2022 trips on the private jet … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/31/clarence-thomas-alito-financial-disclosures/"
  },
  {
    "text": "Giuliani loses support of billionaires Langone, Cooperman: 'I wouldn't give him a nickel'  — Former New York City Mayor Rudy Giuliani will not be getting help with his legal bills from many of the big-money donors who financed his 2008 campaign for president.",
    "url": "https://www.cnbc.com/2023/08/31/giuliani-loses-financial-support-of-billionaires-langone-cooperman.html"
  },
  {
    "text": "45 New Victims Allegedly ID'd in Leaked Chats From Andrew Tate's ‘War Room’  —  Paying members allegedly discussed chilling techniques to abuse and groom women into sex work.  —  Members of influencer Andrew Tate's “War Room” group discussed techniques for how to groom women … ",
    "url": "https://www.thedailybeast.com/45-new-victims-allegedly-idd-in-leaked-chats-from-andrew-tates-war-room"
  },
  {
    "text": "Kemp rejects talk of special session, says punishing Fani Willis carries risks  —  X  —  During a remarkable press conference, Gov. Brian Kemp quashed the idea of a special legislative session pushed by former President Donald Trump and his allies to oust Fulton County District Attorney Fani Willis … ",
    "url": "https://www.ajc.com/politics/kemp-rejects-talk-of-special-session-warns-of-risks-of-punishing-fani-willis/I4JZYJIORNACFKY2COSFE3VCSI/"
  },
  {
    "text": "Alabama attorney general says he has right to prosecute people who facilitate travel for out-of-state abortions  —  Alabama's Republican attorney general said in a court filing that he has the right to prosecute people who make travel arrangements for pregnant women to have out-of-state abortions.",
    "url": "https://www.cnn.com/2023/08/31/politics/alabama-attorney-general-abortion-prosecute/"
  },
  {
    "text": "Governor Pillen Establishes Women's Bill of Rights by Executive Order  —  CONTACT:  —  LINCOLN, NE - Today, Nebraska Governor Jim Pillen signed an Executive Order establishing the Women's Bill of Rights.  Gov. Pillen is the second U.S. Governor to sign such an order, declaring the biological definition of male and female.",
    "url": "https://governor.nebraska.gov/press/governor-pillen-establishes-women%E2%80%99s-bill-rights-executive-order"
  },
  {
    "text": "Rudy Giuliani Literally Can't Afford to Be Defaming People  —  Rudy Giuliani can't even afford to lie about random people anymore.  —  A federal judge in Georgia ordered Giuliani on Wednesday to forfeit a defamation suit filed by two poll workers, whom he falsely claimed had tampered with ballots after the 2020 election.",
    "url": "https://nymag.com/intelligencer/2023/08/rudy-giuliani-forfeits-ruby-freeman-defamation-in-georgia.html"
  },
  {
    "text": "Mitch McConnell is ‘medically clear’ to continue work, U.S. Capitol doctor says  —  The Capitol's attending physician said he “conferred” with the Republican leader's neurology team and that “occasional lightheadedness is not uncommon in concussion recovery.”",
    "url": "https://www.nbcnews.com/politics/congress/mitch-mcconnell-medically-clear-continue-work-us-capitol-doctor-says-rcna102826"
  },
  {
    "text": "For George Santos, a life in Brazil at odds with his GOP politics  —  NITERÓI, Brazil — The sight of the newcomer took Gino Fonseca by surprise.  As one of the city's most prominent drag queens, Fonseca thought he knew most everyone who worked the nightclubs and LGBTQ events.",
    "url": "https://www.washingtonpost.com/world/2023/08/31/george-santos-brazil/"
  },
  {
    "text": "RNC Members Acknowledge Their Fundraising Is ‘in the Toilet’  —  The Republican National Committee is having some serious money problems. … Pay Dirt is a weekly foray into the pigpen of political funding.  Subscribe here to get it in your inbox every Thursday.",
    "url": "https://www.thedailybeast.com/rnc-members-acknowledge-their-fundraising-is-in-the-toilet"
  },
  {
    "text": "Biden administration proposes to close loophole on background checks  —  The DOJ proposal comes days after the latest series of mass shootings.  —  The Biden administration on Thursday moved to expand background checks for gun purchases, a step toward fulfilling a key ask from gun safety groups.",
    "url": "https://www.politico.com/news/2023/08/31/biden-close-loophole-background-checks-00113642"
  },
  {
    "text": "Hunter Biden's firm, Joe's VP office exchanged more than 1,000 emails: records  —  Hunter Biden's Rosemont Seneca Partners investment firm traded more than 1,000 emails with Joe Biden's office during his time as vice president — and hundreds remain hidden because of executive privilege asserted … ",
    "url": "https://nypost.com/2023/08/30/1000-emails-exchanged-between-hunter-bidens-firm-and-vp-office/"
  }
]