[
  {
    "text": "Texas Officials Slam Trump's National Weather Service for Bad Forecast  —  BLAME GAME  —  The government weather forecaster has been hit with huge cuts by the president's administration.  —  Officials in Texas are casting blame on the National Weather Service (NWS) for failing … ",
    "url": "https://www.thedailybeast.com/texas-officials-slam-donald-trumps-national-weather-service-for-bad-forecast/"
  },
  {
    "text": "Texas Officials Blame Agency Gutted by Trump for Results of Deadly Storm  —  As the best and the brightest were being fired at the National Weather Service and the National Oceanic and Atmospheric Administration by senseless and draconian ‘DOGE’ cuts earlier this year under Trump … ",
    "url": "https://www.meidasplus.com/p/texas-officials-blame-agency-gutted"
  },
  {
    "text": "Joe Rogan Feels Trump Betrayed Him on Immigration  —  The podcast king, once a prominent supporter of Donald Trump, denounced the president's aggressive deportation tactics on his wildly popular podcast. … Joe Rogan, one of the most influential voices in American media, is turning on Donald Trump.",
    "url": "https://gizmodo.com/joe-rogan-feels-trump-betrayed-him-on-immigration-2000624426"
  },
  {
    "text": "Trump ramps up deportation spectacle with new stunts and ICE funding … - It's an extraordinary shift from Trump's first term, when nationwide backlash and the appearance of cruelty forced the administration to abandon its family separation policy for unauthorized immigrants.",
    "url": "https://www.axios.com/2025/07/05/trump-migrants-alligator-alcatraz-denaturalize"
  },
  {
    "text": "The next megabill Congress needs to worry about … It's not escaping the notice of Democrats.  House Minority Leader Hakeem Jeffries spent much of his marathon floor speech before the vote Thursday calling out GOP moderates in battleground seats, many of whom had swallowed their misgivings … ",
    "url": "https://www.politico.com/news/2025/07/05/gop-megabill-cliffs-tax-cuts-medicaid-00439973"
  },
  {
    "text": "Don't call it ‘Alligator Alcatraz.’ Call it a concentration camp.  —  This facility's purpose fits the classic model, and its existence points to serious dangers ahead for the country.  —  By Andrea Pitzer, author of “One Long Night: A Global History of Concentration Camps”",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/immigration-alligator-alcatraz-concentration-camp-rcna216874"
  },
  {
    "text": "Critical Read About the BBB, Federalism and the Future of American Democracy … TPM Reader TS (Harvard sociologist/political scientist Theda Skocpol) and I often compared notes on the news of the day and I am always particularly attentive to her thoughts on state structure and power.",
    "url": "https://talkingpointsmemo.com/edblog/critical-read-about-the-bbb-federalism-and-the-future-of-american-democracy"
  },
  {
    "text": "Trump's Politicized F.B.I. Has Made Americans Less Safe  —  Only 11 days after President Trump was inaugurated for a second term, his administration began a purge of the F.B.I. that now threatens some of the bureau's most important missions.  His appointees ousted eight of its most experienced managers … ",
    "url": "https://www.nytimes.com/2025/07/05/opinion/trump-fbi-politics-safety.html?unlocked_article_code=1.UE8.Yfuj.CKxvuUSBwEgg&smid=url-share"
  },
  {
    "text": "Justice Ketanji Brown Jackson Makes Herself Heard, Prompting a Rebuke  —  In solo dissents this term, the justice accused the conservative majority of lawless bias.  On the term's last day, Justice Amy Coney Barrett fired back.  —  Justice Ketanji Brown Jackson wrote just five majority opinions … ",
    "url": "https://www.nytimes.com/2025/07/05/us/supreme-court-ketanji-brown-jackson.html"
  },
  {
    "text": "Social Security Administration sends misleading email lauding Trump's new tax cuts law  —  The emails say nearly nine in 10 Social Security beneficiaries won't pay income taxes on their benefits in the future.  But the Trump tax law did not directly address Social Security.",
    "url": "https://www.nbcnews.com/politics/trump-administration/social-security-administration-sends-misleading-email-lauding-trumps-n-rcna216990"
  },
  {
    "text": "What Trump—And the U.S.—Can't Understand About Air Strikes  —  American leaders refuse to learn from allies and overestimate the benefits of showy tactical attacks.  —  When Donald Trump ordered air strikes on key Iranian nuclear-enrichment sites last month and immediately declared … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/07/trump-iran-air-strikes/683428/?gift=BQHDq1p24LRO8cUUEyLQ6xjgX9LTp4pLeixFVIVpsTo"
  },
  {
    "text": "‘The vehicle suddenly accelerated with our baby in it’: the terrifying truth about why Tesla's cars keep crashing  —  Elon Musk is obsessive about the design of his supercars, right down to the disappearing door handles.  But a series of shocking incidents - from drivers trapped in burning vehicles … ",
    "url": "https://www.theguardian.com/technology/2025/jul/05/the-vehicle-suddenly-accelerated-with-our-baby-in-it-the-terrifying-truth-about-why-teslas-cars-keep-crashing"
  },
  {
    "text": "Trump administration deports 8 migrants to South Sudan  —  The migrants were the subject of a lawsuit that halted their deportation.  —  In this Dec. 21, 2024, file photo, an aerial view of Djibouti, East Africa is shown.  —  The Trump administration deported eight migrants to South Sudan … ",
    "url": "https://abcnews.go.com/US/trump-administration-deports-8-migrants-south-sudan/story?id=123499255"
  },
  {
    "text": "Trump tariff letters going to a dozen countries Monday  —  President Trump said the U.S. will begin sending letters Monday to other countries setting a tariff rate on their imports. … - For businesses craving certainty, who've had a period of relative calm of late, the move could once again upset that balance.",
    "url": "https://www.axios.com/2025/07/05/trump-tariffs-letters"
  },
  {
    "text": "Trump on if he can end fighting in Ukraine: 'I don't know' … Throughout the campaign, Trump pledged to end the fighting between the two countries on day one of entering office.  He later backtracked in an interview with TIME Magazine, calling the pledge “an exaggeration.”",
    "url": "https://www.politico.com/news/2025/07/05/trump-russia-ukraine-war-00440027"
  },
  {
    "text": "RFK's proposal to let bird flu spread through poultry could set us up for a pandemic, experts warn  —  HHS Secretary Robert F. Kennedy Jr. and Secretary of Agriculture Brooke Rollins have expressed interest in letting H5N1 outbreaks spread unchecked through U.S. poultry farms.",
    "url": "https://www.livescience.com/health/flu/rfks-proposal-to-let-bird-flu-spread-through-poultry-could-set-us-up-for-a-pandemic-experts-warn"
  },
  {
    "text": "Kamala Harris Sparks MAGA Meltdown With Fourth of July Post  —  FIREWORKS  —  President Donald Trump's supporters took the former vice president's holiday sentiments as a sign she'd be looking to run for office again.  —  Former Vice President Kamala Harris sent MAGA into a frenzy with her simple Fourth of July message.",
    "url": "https://www.thedailybeast.com/kamala-harris-sparks-maga-meltdown-with-fourth-of-july-post/"
  },
  {
    "text": "Trump Says He Will Start Talks With China on TikTok Deal  —  President Trump has declined to enforce a statutory ban of the popular social media app while his administration negotiates a deal for an American company to acquire it.  —  President Trump late Friday said that the U.S. … ",
    "url": "https://www.nytimes.com/2025/07/05/us/politics/trump-says-he-will-start-talks-with-china-on-tiktok-deal.html?unlocked_article_code=1.UE8.ntUm.vMir4mRmfnrN&smid=url-share"
  }
]