[
  {
    "text": "Live updates: Biden signs funding bill to prevent shutdown; Senate approves Social Security bill  —  Just as the government funding deadline arrived early Saturday, Congress passed an interim plan to prevent a shutdown after a chaotic few days and nights in Washington.",
    "url": "https://thehill.com/homenews/house/5051942-live-updates-government-shutdown-congress-trump/"
  },
  {
    "text": "Senate approves bill to expand Social Security to millions of Americans  —  Legislation to expand Social Security benefits to millions of Americans passed the U.S. Senate early Saturday and is now headed to the desk of President Biden, who is expected to sign the measure into law.",
    "url": "https://www.cbsnews.com/news/social-security-fairness-act-senate-vote-passed/"
  },
  {
    "text": "Playbook: Shutdown?  Averted.  Crisis?  Delayed.  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  FOOD FOR THOUGHT — “The ABC Settlement Doesn't Mean the Press Is Caving to Trump,” by Ankush Khardori: “There were good legal reasons for the network to avoid a trial.”",
    "url": "https://www.politico.com/newsletters/playbook/2024/12/21/shutdown-averted-crisis-delayed-00195800"
  },
  {
    "text": "Transition Live Updates: House Approves Stopgap Funding Bill Hours Ahead of Shutdown Deadline  —  The new legislation would keep the government open but did not include the debt ceiling increase that President-elect Donald J. Trump had demanded.  It now goes to the Senate.  —  Here are the latest developments.",
    "url": "https://www.nytimes.com/live/2024/12/20/us/government-shutdown-trump-news"
  },
  {
    "text": "Justice Thomas Did Not Disclose Additional Trips, Democrats Say  —  The revelation was included in a report by Democratic staff members on the Senate Judiciary Committee who had conducted a 20-month investigation into ethics practices at the Supreme Court.  —  Justice Clarence Thomas failed … ",
    "url": "https://www.nytimes.com/2024/12/21/us/politics/clarence-thomas-trips-disclosure-investigation.html?unlocked_article_code=1.jE4.NCNP.unHbe2UnoEuT&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "New ethics inquiry details more trips by Clarence Thomas paid for by wealthy benefactors  —  Investigation by Senate Democrats found that Thomas accepted gifts and travel worth more than $4.75m since 1991  —  A nearly two-year investigation by Democratic senators of supreme court ethics details … ",
    "url": "https://www.theguardian.com/us-news/2024/dec/21/ethics-inquiry-supreme-court"
  },
  {
    "text": "Breaking: Senate Dems' report on SCOTUS ethics inquiry decries “culture of misconduct”  —  Judiciary Dems' majority staff report calls for Congress to act given that “the justices have allowed ethical misconduct to persist for decades.”  —  For the past 20 months, the Senate Judiciary Committee's Democrats … ",
    "url": "https://www.lawdork.com/p/senate-judiciary-dems-scotus-ethics-report"
  },
  {
    "text": "Senate Democrats blast Supreme Court's ‘ethical crisis’ as investigation concludes  —  With Republicans about to take control of the Senate, Democrats on the Judiciary Committee issued a report detailing alleged ethical lapses by justices.  —  WASHINGTON — A lengthy investigation … ",
    "url": "https://www.nbcnews.com/politics/congress/senate-democrats-blast-supreme-courts-ethical-crisis-investigation-rcna184987"
  },
  {
    "text": "Biden secures 235th confirmed judicial appointee, one more than Trump  —  Democratic U.S. President Joe Biden secured his 235th appointment to the federal judiciary on Friday, narrowly surpassing President-elect Donald Trump's first-term tally by one with a record number of women and people of color named to the bench.",
    "url": "https://www.reuters.com/world/us/biden-secures-235th-confirmed-judicial-appointee-one-more-than-trump-2024-12-21/"
  },
  {
    "text": "Outrage as Elon Musk claims ‘only AfD can save Germany’  —  German health minister calls US billionaire's intervention weeks before election ‘undignified and problematic’  —  Elon Musk has caused outrage in Berlin after appearing to endorse the far-right, anti-immigrant Alternative für Deutschland.",
    "url": "https://www.theguardian.com/world/2024/dec/20/elon-musk-claims-only-afd-can-save-germany"
  },
  {
    "text": "Private messages detail an alleged campaign to tarnish Blake Lively after she accused Justin Baldoni of misconduct on the set of “It Ends With Us.”  —  Last summer, as the release of “It Ends With Us” approached, Justin Baldoni, the director and a star of the film, and Jamey Heath … ",
    "url": "https://www.nytimes.com/2024/12/21/business/media/blake-lively-justin-baldoni-it-ends-with-us.html?unlocked_article_code=1.jE4.yE_4._RPuitPEWM2c&smid=nytcore-ios-share&referringSource=articleShare&tgrp=ctr"
  },
  {
    "text": "He's anti-democracy and pro-Trump: the obscure ‘dark enlightenment’ blogger influencing the next US administration  —  Key figures in the incoming administration follow Curtis Yarvin, who's pushing for an autocratic takeover of the US  —  Curtis Yarvin is hardly a household name in US politics.",
    "url": "https://www.theguardian.com/us-news/2024/dec/21/curtis-yarvin-trump"
  },
  {
    "text": "Trump's ‘stunningly unqualified’ diplomatic team shapes up at breakneck speed  —  Trump is hardly the first US president to introduce miscast nominees, but he has nominated ambassadors at a rate not recalled in recent memory  —  They seem an unlikely, almost motley, crew of emissaries.",
    "url": "https://www.theguardian.com/us-news/2024/dec/21/trump-team-cabinet"
  },
  {
    "text": "Biden Weighs Commuting Sentences of Death Row Inmates  —  Amid pleas from religious and civil-rights groups, president is considering whether to convert death sentences to life without parole  —  WASHINGTON—President Biden is considering commuting the sentences of most, if not all … ",
    "url": "https://www.wsj.com/us-news/law/biden-weighs-commuting-sentences-of-death-row-inmates-d24fcc15?st=8q8Jmn"
  },
  {
    "text": "Iceland's Social Democrats Reach Deal for New Government  — Three-party coalition vows prudent budgets, war on inflation  — Referendum on resuming EU entry talks seen before 2027  —  Iceland's new ruling coalition agreed on a platform of budget restraint to fight inflation … ",
    "url": "https://www.bloomberg.com/news/articles/2024-12-21/iceland-s-social-democrats-reach-deal-for-coalition-government"
  },
  {
    "text": "Trump's claims of a mandate run into reality of narrow majorities  —  Donald Trump's last-minute demands for a congressional funding package were rejected by Republicans, foreshadowing the challenges he could face next year.  —  President-elect Donald Trump's last-minute demands … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/20/trump-presidential-power-congress-legislature/"
  }
]