[
  {
    "text": "Poll: Newly popular Harris builds momentum, challenging Trump for the mantle of change  —  The latest NBC News national poll shows Harris leading Trump 49%-44%, within the margin of error, while Trump holds advantages on the economy, inflation and the border.",
    "url": "https://www.nbcnews.com/politics/2024-election/poll-newly-popular-harris-challenging-trump-change-rcna171308"
  },
  {
    "text": "Harris shows some gains and economic views brighten a bit — CBS News poll  —  The 2024 presidential race clearly remains a contest either Donald Trump or Kamala Harris can win, CBS News' latest polling finds.  —  But with interest rates and gas prices coming down, the number of voters saying the economy is good has ticked up.",
    "url": "https://www.cbsnews.com/news/trump-harris-poll-debate-economy-09-22-2024/"
  },
  {
    "text": "Kamala Harris Has Biggest Favorability Jump Since George W. Bush After 9/11  —  ‘A VERY DIFFERENT STORY’  —  The results come as a part of a very positive poll from NBC News on Sunday.  —  Vice President Kamala Harris got some very welcome news on Sunday in the form of a new NBC News poll … ",
    "url": "https://www.thedailybeast.com/kamala-harris-has-biggest-favorability-jump-since-george-w-bush-after-911"
  },
  {
    "text": "Trump Will Stage an Emergency to Ban Jack Smith's Book Report  —  I expect, on top of everything else this week, Trump's lawyers are going to claim an emergency to try to ban Jack Smith's book report, currently due Thursday.  —  As you'll recall, after Judge Tanya Chutkan finally got … ",
    "url": "https://www.emptywheel.net/2024/09/22/trump-will-stage-an-emergency-to-ban-jack-smiths-book-report/"
  },
  {
    "text": "North Carolina Democrat on his opponent: ‘Robinson exists because Donald Trump has lifted him up’  —  North Carolina Attorney General Josh Stein (D), the state's Democratic candidate for governor, said in a Sunday interview that candidates should be held accountable for continuing to support his opponent … ",
    "url": "https://thehill.com/homenews/campaign/4892916-josh-stein-mark-robinson-donald-trump/"
  },
  {
    "text": "Vance says allegations against Mark Robinson 'aren't necessarily reality'  —  Vance told NBC Philadelphia that it's “ultimately up to Mark Robinson and North Carolina whether he's going to be their governor and whether he wants to stay in the race.”  —  LEESPORT, Pa. — Sen. JD Vance … ",
    "url": "https://www.nbcnews.com/politics/2024-election/jd-vance-says-allegations-mark-robinson-arent-necessarily-reality-rcna172122"
  },
  {
    "text": "Trump Calls MSNBC Host A ‘Bimbo’ After She Makes Case For Voting Against Him  —  Donald Trump flipped out on Truth Social over Stephanie Ruhle's appearance on “Real Time with Bill Maher.”  —  LOADING  —  Republican presidential candidate Donald Trump lashed out Saturday on his social media site … ",
    "url": "https://www.huffpost.com/entry/donald-trump-stephanie-ruhle-bill-maher-bimbo_n_66e5b40fe4b0e9e4c582b6a6"
  },
  {
    "text": "Over 700 high-ranking national security officials endorse Harris  —  Over 700 high-ranking national security officials have endorsed Democratic candidate Vice President Harris in her run for the White House, with some leaders expressing concerns about former President Trump's “scary authoritarian streak.”",
    "url": "https://thehill.com/homenews/4892381-national-security-officials-endorse-harris/"
  },
  {
    "text": "Scoop: Harris, Trump in talks with “60 Minutes” … The Harris campaign is in active talks with “60 Minutes.”  Trump sources say an interview is TBD.  — But a source familiar with the Trump negotiations teased: “Nobody gets ratings like President Donald J. Trump.”",
    "url": "https://www.axios.com/2024/09/22/harris-trump-60-minutes-interview"
  },
  {
    "text": "Feds execute search warrant on new NYPD commissioner just over a week after he was appointed  —  Federal authorities executed a search warrant at the home of NYPD interim commissioner Thomas Donlon just over a week after he took on the position, he said in a statement Saturday night.",
    "url": "https://www.cnn.com/2024/09/22/us/nypd-police-commissioner-thomas-donlon-new-york/"
  },
  {
    "text": "Kamala Harris plans to skip historic Al Smith dinner despite long-standing tradition  —  Vice President Kamala Harris will skip the historic Al Smith dinner, eschewing a decades-old campaign tradition in which presidential candidates roast each other.  —  Harris' campaign told event organizers Harris … ",
    "url": "https://www.foxnews.com/politics/kamala-harris-plans-skip-historic-al-smith-dinner-despite-long-standing-tradition-report"
  },
  {
    "text": "Mass shooting in Birmingham's 5 Points South leaves 4 dead, dozens injured by gunfire  —  Gunfire erupted in Birmingham's Five Points South entertainment area Saturday night, leaving four people dead and at least 21 others injured.  —  Officer Truman Fitzgerald said the shooting happened … ",
    "url": "https://www.al.com/news/2024/09/shooting-in-birminghams-5-points-south-may-have-mass-casualties-police-say.html"
  },
  {
    "text": "Harris is changing the way Democrats target Latino voters.  It's a risk.  —  The vice president is attempting to chart a path away from identity politics.  —  Kamala Harris doesn't talk often about her Black and South Asian American identity.  She's not talking to Latino voters about theirs either.",
    "url": "https://www.politico.com/news/2024/09/22/harris-latino-voters-00180365"
  },
  {
    "text": "Lobbyists exploit massive loophole to wine and dine lawmakers, aides at fancy getaways  —  Leading the way is the nonprofit Congressional Institute, which is run by veteran Republican staffers and funded by $3 million in annual dues from private interest groups.",
    "url": "https://www.politico.com/news/2024/09/22/lobbyists-flout-ethics-rules-free-trips-00176749"
  }
]