[
  {
    "text": "Who Is Vance Boelter?  The Minnesota Lawmaker Shooting Suspect  —  The 57-year-old worked in security and as a pastor.  A list found in his car included prominent abortion-rights supporters in Minnesota, according to an official.  —  MINNEAPOLIS—The suspect in the shooting of Minnesota lawmakers … ",
    "url": "https://www.wsj.com/us-news/vance-boelter-minnesota-lawmaker-shooting-6dc7b72a?st=Gdq5Cq&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Minnesota killings spread fear in country riven by violence against politicians  —  The shootings revealed that America's political fractures have penetrated even into the homes where elected officials sleep.  —  Summary209  —  Daniel Hernandez, whose life has been shaped by violence directed … ",
    "url": "https://www.washingtonpost.com/politics/2025/06/15/minnesota-political-violence/"
  },
  {
    "text": "“No Kings Day” protests turn out millions, rebuking Trump  —  The “No Kings Day” nationwide rallies against Donald Trump/for democracy on Saturday turned out millions of people.  —  That's per a collective crowdsourcing effort led by Strength In Numbers, and involving many members of the independent data journalism community.",
    "url": "https://www.gelliottmorris.com/p/no-kings-day-protests-turn-out-millions"
  },
  {
    "text": "At ‘No Kings,’ millions of Americans show the flag is mightier than the tank  —  It would be a gross understatement to say it rained on Donald Trump's birthday parade Saturday night.  Man, it poured.The 47th president had hoped to rule over Flag Day by deploying the artillery of a strutting strongman … ",
    "url": "https://www.inquirer.com/opinion/commentary/no-kings-philadelphia-trump-parade-20250615.html"
  },
  {
    "text": "Trump vetoed an Israeli plan to kill Iran's supreme leader, US officials say  —  President Donald Trump vetoed an Israeli plan in recent days to kill the Iran's Supreme Leader Ayatollah Ali Khamenei, two U.S. officials told Reuters on Sunday.  —  “Have the Iranians killed an American yet?",
    "url": "https://www.reuters.com/world/middle-east/trump-vetoed-an-israeli-plan-kill-irans-supreme-leader-us-officials-say-2025-06-15/"
  },
  {
    "text": "Inside Trump's backtrack on immigration  —  For months, Trump administration officials have been adamant about targeting all the millions of immigrants who are in the U.S. illegally, regardless of their work or taxpaying status.  — But now Trump is making a huge exception … ",
    "url": "https://www.axios.com/2025/06/15/trump-backtrack-immigration-raids-business-agriculture"
  },
  {
    "text": "Inside Trump's Extraordinary Turnaround on Immigration Raids  —  President Trump's decision to pause most raids targeting farms and hospitality workers took many inside the White House by surprise.  It came after intensive lobbying by his agriculture secretary.",
    "url": "https://www.nytimes.com/2025/06/14/us/politics/trump-immigration-raids-workers.html?unlocked_article_code=1.PE8.rsrr.8MI9w66BUTOm&smid=url-share"
  },
  {
    "text": "Trump's FAA pick has claimed ‘commercial’ pilot license he doesn't have  —  Bryan Bedford, the nominee to head the Federal Aviation Administration, for years erroneously stated in his Republic Airways bio that he is a pilot with a “commercial” rating.  —  President Donald Trump's nominee … ",
    "url": "https://www.politico.com/news/2025/06/15/trumps-faa-pick-has-claimed-commercial-pilot-license-he-doesnt-have-00406090"
  },
  {
    "text": "Sources: Vance Boelter's wife detained for questioning after traffic stop near Onamia  —  Vance Boelter's wife detained for questioning after traffic stop near Onamia  —  A manhunt is underway for Vance Boelter, who is suspected of shooting two Minnesota state lawmakers - one of them fatally - as well as their spouses.",
    "url": "https://kstp.com/kstp-news/top-news/sources-vance-boelters-wife-detained-for-questioning-after-traffic-stop-near-onamia/"
  },
  {
    "text": "Syrian General Questioned in Case of Missing American  —  The general, Bassam Hassan, is said to have shared grim news about the fate of Austin Tice, an American journalist and former Marine who went missing in 2012.  —  A top Syrian general under President Bashar al-Assad before his ouster … ",
    "url": "https://www.nytimes.com/2025/06/15/us/politics/syria-austin-tice-journalist.html"
  },
  {
    "text": "Australian deported from US says he was ‘targeted’ due to writing on pro-Palestine student protests  —  Alistair Kitchen says he was detained and questioned about views on Israel and Palestine before being deported from LA to Melbourne  —  An Australian man who was detained upon arrival … ",
    "url": "https://www.theguardian.com/australia-news/2025/jun/15/australian-deported-from-us-says-he-was-targeted-due-to-writing-on-pro-palestine-student-protests"
  },
  {
    "text": "Yes, They're Going After Medicare Too  —  REPUBLICANS SAY THE HEALTH CARE CUTS in their One Big Beautiful Bill wouldn't touch Medicare.  —  That is not true.  —  One reason is the bill's projected fiscal effects.  Thanks to all the tax cuts, the legislation would likely increase deficits enough … ",
    "url": "https://www.thebulwark.com/p/yes-they-are-going-after-medicare-too-republicans-big-beautiful-bill-health-care-vulnerable"
  },
  {
    "text": "How Amy Coney Barrett Is Confounding the Right and the Left  —  President Trump appointed her to clinch a conservative legal revolution.  But soon after arriving at the Supreme Court, she began surprising her colleagues.  —  As President Trump was leaning toward appointing Amy Coney Barrett … ",
    "url": "https://www.nytimes.com/2025/06/15/us/amy-coney-barrett-supreme-court.html?unlocked_article_code=1.PE8.kdNM.WoYABTX26wmc&smid=url-share"
  },
  {
    "text": "How Trump's Imposition of Massive Tariffs is Repeating the “Ship Money” Abuses of King Charles I  —  Yesterday, there were massive nationwide “No Kings” protests against Donald Trump and his authoritarian tendencies.  Like most political slogans, “No Kings” is an oversimplification.",
    "url": "https://reason.com/volokh/2025/06/15/how-trumps-imposition-of-massive-tariffs-is-repeating-the-ship-money-abuses-of-king-charles-i/"
  },
  {
    "text": "Security Alert for U.S. Citizens: U.S. Embassy Iraq (June 15, 2025)  —  Event: The U.S. Embassy in Baghdad is aware of the increased potential for foreign terrorist organization-inspired violence or attacks against U.S. businesses and locations frequented by U.S. citizens.",
    "url": "https://iq.usembassy.gov/security-alert-for-u-s-citizens-u-s-embassy-iraq-june-15-2025/"
  },
  {
    "text": "NBC's Jacob Soboroff reports from the Los Angeles protests as law enforcement fires flash bangs  —  NBC News correspondent Jacob Soboroff was reporting on the ground in Los Angeles when law enforcement started using crowd control tactics against protesters, including firing flash bangs.",
    "url": "https://www.msnbc.com/msnbc/amp-video/mmvo241608261886"
  },
  {
    "text": "Padilla says FBI agent, Guard member escorted him to Noem's briefing before removal  —  Sen. Alex Padilla (D-Calif.) said Sunday that a member of the National Guard and an FBI agent escorted him into Homeland Security Secretary Kristi Noem's press conference last week before he was forcefully removed.",
    "url": "https://www.axios.com/2025/06/15/alex-padilla-kristi-noem-dhs-removal"
  }
]