[
  {
    "text": "Trump speaks with Justice Alito amid push to halt criminal sentencing  —  Alito spoke to Trump to recommend an ex-clerk for a job in his administration.  —  President-elect Donald Trump speaks during a news conference at Mar-a-Lago, Jan. 7, 2024, in Palm Beach, Fla.",
    "url": "https://abcnews.go.com/US/trump-speaks-justice-alito-amid-push-halt-criminal/story?id=117386419"
  },
  {
    "text": "Alito Spoke With Trump Shortly Before Supreme Court Filing  —  The justice said that the call was a routine job reference for one of his former clerks and that the request to stay the president-elect's sentencing did not come up.  —  Justice Samuel A. Alito Jr. spoke with President-elect Donald J. Trump … ",
    "url": "https://www.nytimes.com/2025/01/08/us/justice-alito-trump.html"
  },
  {
    "text": "Biden postpones Italy trip amid raging Los Angeles fires  —  President Biden will no longer travel to Italy this weekend as fires rage in Los Angeles County, the White House said Wednesday.  —  “After returning this evening from Los Angeles, where earlier today he had met with police … ",
    "url": "https://thehill.com/homenews/administration/5075775-biden-cancels-italy-trip-california-fires/"
  },
  {
    "text": "Statement from Press Secretary Karine Jean-Pierre  —  After returning this evening from Los Angeles, where earlier today he had met with police, fire and emergency personnel fighting the historic fires raging in the area and approved a Major Disaster declaration for California … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/08/statement-from-press-secretary-karine-jean-pierre-5/"
  },
  {
    "text": "Ozempic, Legos and Hearing Aids: What Trump's Greenland Plan Could Hit  —  Putting tariffs on Denmark unless it cedes the island of Greenland could hurt access to a few key products, including popular medicines.  —  President-elect Donald J. Trump has threatened tariffs on many countries for many different reasons.",
    "url": "https://www.nytimes.com/2025/01/08/us/politics/trump-greenland-denmark-ozempic.html"
  },
  {
    "text": "Taking Trump's imperialist trolling seriously (for a moment)  —  We've come a long way from bringing down egg prices.  —  ∙ Paid  —  Speaking as someone who's been covering Trump for nine years now, paying attention to what he's doing instead of obsessing over what he's saying is generally a good rule of thumb.",
    "url": "https://www.publicnotice.co/p/trump-greenland-canada-paul-frymer-interview"
  },
  {
    "text": "Mayor's Absence Is Considered a Sign L.A. Underestimated Fire Risks  —  Some residents said Mayor Karen Bass should have canceled her trip to Ghana when weather warnings in Los Angeles grew increasingly dire.  —  When a series of dangerous, wind-driven fires broke out on Tuesday in the Los Angeles area … ",
    "url": "https://www.nytimes.com/2025/01/09/us/los-angeles-mayor-fire-response.html?unlocked_article_code=1.n04.5t0A.WyWaW0sxz7OM&smid=url-share"
  },
  {
    "text": "With Bass abroad, even Democrats are slamming LA mayor over wildfires  —  Los Angeles Times owner Patrick Soon-Shiong and developer Rick Caurso led the chorus of criticism against the mayor.  Tommy Vietor, a former Obama staffer and Pod Save America host, piled on.",
    "url": "https://www.politico.com/news/2025/01/08/los-angeles-fires-mayor-karen-bass-handling-criticized-00197137"
  },
  {
    "text": "Are North Carolina Republicans trying to steal a state Supreme Court seat?  —  North Carolina's Supreme Court has temporarily prohibited the state's Board of Elections from certifying the election of sitting Democratic Justice Allison Riggs to the bench on Tuesday, despite her 734-vote victory … ",
    "url": "https://www.vox.com/politics/394114/north-carolina-republican-supreme-court-riggs-griffin"
  },
  {
    "text": "Republicans on North Carolina Supreme Court block certification of Democratic justice's election victory  —  On Monday, Congress certified the results of the 2024 presidential election in routine fashion.  Some concluded that, due to Trump's victory, there would be no attacks on the democratic process this year.",
    "url": "https://popular.info/p/update-republicans-on-north-carolina"
  },
  {
    "text": "Nation's Leaders Will Gather to Honor Carter at Washington Cathedral  —  A state funeral for the 39th president on Thursday will bring together all five living presidents and feature a eulogy from President Biden.  —  A weeklong series of tributes to former President Jimmy Carter culminates … ",
    "url": "https://www.nytimes.com/2025/01/09/us/politics/jimmy-carter-funeral.html"
  },
  {
    "text": "Poking Fun at Trump, Mexico's President Suggests Renaming the U.S.  —  President Claudia Sheinbaum of Mexico also said Donald Trump was ill-informed when he said Mexico was “essentially run by the cartels.”  —  Mexico's president rejected several of President-elect Donald J. Trump's assertions … ",
    "url": "https://www.nytimes.com/2025/01/08/us/politics/mexico-president-mexican-america-trump.html?unlocked_article_code=1.nk4._okz.NQR-QhN5oSkY&smid=url-share"
  },
  {
    "text": "House Republican bill would pave way for Trump to acquire Panama Canal for US  —  Rep. Dusty Johnson (R-S.D.) will introduce a bill that would authorize the president to purchase the Panama Canal and put it under U.S. control, an acquisition that President-elect Trump has been pushing over the last several weeks.",
    "url": "https://thehill.com/homenews/house/5074775-republican-bill-panama-canal-trump-purchase/"
  },
  {
    "text": "Prepare to Be Shocked: Los Angeles' Fire Chief Is a DEI-Obsessed ‘LGBTQ’ Woman Who Wasted Millions  —  In perhaps the most unexpected, shocking revelation to come out of the devastating Los Angeles wildfires, it turns out their Fire Chief is an “LGBTQ+” woman who is obsessed with DEI.",
    "url": "https://redstate.com/bonchie/2025/01/08/in-a-shocking-turn-of-events-las-fire-chief-is-a-dei-obsessed-lgbtq-woman-n2184093"
  },
  {
    "text": "AG Merrick Garland intends to release special counsel report on Trump's Jan. 6 case, DOJ says  —  The portion of the report about the classified documents case is being withheld pending litigation in Florida federal courts.  —  WASHINGTON — Special counsel Jack Smith has turned … ",
    "url": "https://www.nbcnews.com/politics/justice-department/merrick-garland-intends-release-special-counsel-report-trumps-jan-6-ca-rcna186777"
  },
  {
    "text": "Elon Musk says DOGE probably won't find $2 trillion in federal budget cuts  —  Musk previously said his Department of Government Efficiency would be able to recommend cuts to the federal budget of “at least $2 trillion.”  —  Tech billionaire Elon Musk said Wednesday that his budget-cutting effort … ",
    "url": "https://www.nbcnews.com/politics/politics-news/elon-musk-says-doge-probably-wont-find-2-trillion-federal-budget-cuts-rcna186924"
  },
  {
    "text": "Trump transition considering D.C.-area showcase immigration raid in first days of administration  —  The raid under consideration would target immigrants allegedly living in the U.S. illegally at a workplace in the Washington, D.C., metropolitan area.  —  The incoming Trump administration … ",
    "url": "https://www.nbcnews.com/investigations/trump-raid-undocumented-immigrants-washington-dc-high-profile-rcna186780"
  },
  {
    "text": "Hawaii Gov: RFK Jr.'s Anti-Vax Misinformation Left Dozens Of Kids Dead In Samoa  —  The Senate is poised to make “an absolute life-or-death decision” in confirming Kennedy as HHS secretary, warned Gov. Josh Green, who is also a physician.  —  LOADING  —  WASHINGTON — Hawaii Gov. Josh Green … ",
    "url": "https://www.huffpost.com/entry/hawaii-governor-josh-green-rfk-jr-vaccines-hhs_n_677ebc3ce4b0f751b99402ae"
  },
  {
    "text": "Disgraced former US Rep. George Santos granted 3-month delay in sentencing for fraud and ID theft  —  Disgraced former congressman George Santos, facing a federal prison sentence, has won a few months' freedom to come up with more than half a million dollars in court fines — including from work on his new podcast.",
    "url": "https://apnews.com/article/george-santos-fraud-sentencing-delayed-podcast-c24d7679a4b99c4bfb7b141fd2eb8660"
  },
  {
    "text": "As L.A. burns, Trump blames Newsom — and California governor pushes back  —  The president-elect sought to blame the climate-change-exacerbated crisis in Southern California on the state's water management.  Experts disputed his claims.",
    "url": "https://www.washingtonpost.com/politics/2025/01/08/california-fires-trump-newsom-biden-politicians/"
  },
  {
    "text": "Capitol Police arrest man with machete at entrance for Jimmy Carter viewing  —  Police said the man was arrested at a security checkpoint for people waiting to offer their respects to former President Jimmy Carter as he lies in state in the Capitol Rotunda.  —  Capitol Police said a man … ",
    "url": "https://www.nbcnews.com/politics/politics-news/capitol-police-arrest-man-machete-entrance-jimmy-carter-viewing-rcna186882"
  }
]