[
  {
    "text": "Trump Plots to Pull Out of NATO — If He Doesn't Get His Way  —  At the very least, the former president wants to put the U.S. on “standby” mode — and undermine NATO's principle of collective defense  —  Donald Trump wanted to pull the United States out of NATO during his first term … ",
    "url": "https://www.rollingstone.com/politics/politics-features/donald-trump-u-s-leave-nato-1234860016/"
  },
  {
    "text": "Trump is ‘Very Likely’ to Attend His New York Fraud Trial for Michael Cohen's Testimony: Source  —  Asked about Trump's likelihood of attending his testimony, Cohen said that the former president's ‘presence in the courtroom does not intimidate me’  —  JWPlayer",
    "url": "https://themessenger.com/politics/trump-new-york-michael-cohen-fraud-trial-testimony"
  },
  {
    "text": "Republicans Grapple With Being Speakerless, but Effectively Leaderless, Too  —  With a speaker fight in the House, concerns about an aging Senate leader and a 2024 front-runner who has the party in a vise grip, some G.O.P. members worry the turmoil could have long-term effects.",
    "url": "https://www.nytimes.com/2023/10/23/us/politics/republicans-speaker-2024-elections.html"
  },
  {
    "text": "U.S. Advises Israel to Delay Gaza Invasion, Officials Say  —  The Biden administration has suggested that more time is needed for hostage negotiations, the delivery of aid to Palestinians and mapping out ways to avoid more civilian casualties.  —  The Biden administration has advised Israel … ",
    "url": "https://www.nytimes.com/2023/10/22/us/politics/us-hostages-israel-gaza.html"
  },
  {
    "text": "Exclusive poll: Nikki Haley surges, nearly ties Ron DeSantis as the alternative to Trump  —  Haley's support has surged to 11% and DeSantis' plunged to 12%, the USA TODAY/Suffolk Poll finds.  But Trump still dominates.  —  Former UN ambassador Nikki Haley has surged nationally … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2023/10/23/2024-poll-haley-desantis-trump/71286643007/"
  },
  {
    "text": "Exclusive poll: Biden and Trump tie at 37% as RFK Jr. costs Trump a narrow lead  —  The arithmetic gets complicated and the politics unsettled in a 2020 rematch with at least one significant independent candidate, and perhaps more.  —  Susan Page Sudiksha Kochi Savannah Kuchar",
    "url": "https://www.usatoday.com/story/news/politics/elections/2023/10/23/biden-trump-rfk-jr-poll/71281814007/"
  },
  {
    "text": "Editors' Note: Gaza Hospital Coverage  —  On Oct. 17, The New York Times published news of an explosion at a hospital in Gaza City, leading its coverage with claims by Hamas government officials that an Israeli airstrike was the cause and that hundreds of people were dead or injured.",
    "url": "https://www.nytimes.com/2023/10/23/pageoneplus/editors-note-gaza-hospital-coverage.html"
  },
  {
    "text": "Scoop: Marine Corp 3-star general advising Israeli military on Gaza ground operation  —  The Biden administration recently sent a Marine three-star general and several other U.S. military officers to Israel to help advise the Israeli military's leadership in its operation in Gaza … ",
    "url": "https://www.axios.com/2023/10/23/israel-gaza-war-marine-general-ground-operation"
  },
  {
    "text": "Ukrainian spies with deep ties to CIA wage shadow war against Russia  —  KYIV — The cluttered car carrying a mother and her 12-year-old daughter seemed barely worth the attention of Russian security officials as it approached a border checkpoint.  But the least conspicuous piece of luggage … ",
    "url": "https://www.washingtonpost.com/world/2023/10/23/ukraine-cia-shadow-war-russia/"
  },
  {
    "text": "Federal Investigators Widen Tesla Inquiry, Company Says  —  The Department of Justice has sought documents related to vehicle range and “personal benefits,” Tesla said.  —  The Department of Justice has expanded its inquiry into Tesla's business practices to include how far its vehicles … ",
    "url": "https://www.nytimes.com/2023/10/23/business/tesla-justice-department-investigations.html"
  },
  {
    "text": "Alaska Air off-duty pilot tries to shut off engines on flight from Everett  —  An off-duty Alaska Airlines pilot taking a ride Sunday in the jump seat of a flight out of Everett attempted to shut down the engines inflight and had to be subdued, the pilot in charge is heard saying in a recording … ",
    "url": "https://www.seattletimes.com/business/boeing-aerospace/alaska-air-off-duty-pilot-tries-to-shut-off-engines-on-flight-from-everett/"
  },
  {
    "text": "US renews warning it will defend Philippines after incidents with Chinese vessels in South China Sea  —  The United States renewed a warning Monday that it would defend the Philippines in case of an armed attack under a 1951 treaty, after Chinese ships blocked and collided with two Filipino vessels off … ",
    "url": "https://apnews.com/article/south-china-sea-philippines-collision-67aa7e2ca5df4f4e3a7c3bceff46c26f"
  },
  {
    "text": "New SAT Data Highlights the Deep Inequality at the Heart of American Education  —  New data shows, for the first time at this level of detail, how much students' standardized test scores rise with their parents' incomes — and how disparities start years before students sit for tests.",
    "url": "https://www.nytimes.com/interactive/2023/10/23/upshot/sat-inequality.html"
  },
  {
    "text": "Yes, Byron Donalds should be the next speaker of the House  —  Rep. Byron Donalds (R-FL) declared his candidacy for speaker of the House Friday evening, the Washington Examiner reported.  —  It was a bold declaration after Rep. Jim Jordan (R-OH) could not secure enough votes to proceed with his candidacy.",
    "url": "https://www.washingtonexaminer.com/opinion/yes-byron-donalds-should-be-the-next-speaker-of-the-house"
  }
]