[
  {
    "text": "Donald Trump: UAW negotiations 'don't mean as much as you think'  —  Clinton Township — Republican Donald Trump railed against electric vehicles during a campaign stop in suburban Detroit Wednesday night, saying they're too expensive, aren't capable of traveling far enough and would spur job losses for Americans.",
    "url": "https://www.detroitnews.com/story/news/politics/2023/09/27/donald-trump-returns-auto-industry-strike-uaw-ev-taking-center-stage-presidential-election-joe-biden/70960155007/"
  },
  {
    "text": "‘Let me be blunt’: UAW VP for GM has strong words about Trump's visit to Michigan  —  The UAW's lead negotiator in contract talks with General Motors on Wednesday issued a scathing assessment of former President Donald Trump hours before Trump was due to speak in Detroit.",
    "url": "https://www.freep.com/story/money/cars/general-motors/2023/09/27/mike-booth-gm-trump-uaw-strike/70981329007/"
  },
  {
    "text": "Judge Chutkan denies Trump's request to recuse herself in federal election subversion case  —  U.S. District Judge Tanya Chutkan said Wednesday she won't recuse herself from Donald Trump's 2020 election interference case in Washington, rejecting the former president's claims … ",
    "url": "https://apnews.com/article/donald-trump-justice-department-special-counsel-jan-6-8439ca0fcae8e7cf2a15663f9888e75a"
  },
  {
    "text": "Trump demands union support for nationalist vision, warns of doom otherwise  —  Trump's speech in Michigan opposite the GOP debate marked the unofficial kickoff of a general election rematch with President Biden  —  CLINTON TOWNSHIP, Mich. — Former president Donald Trump sharpened … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/trump-detroit-strike-autoworkers/"
  },
  {
    "text": "Republican congressman struggles to answer questions about allegations Biden has influenced the DOJ  —  The House Ways and Means Committee chairman was asked to explain how documents provided by his panel showed evidence of wrongdoing or a two-tiered justice system.",
    "url": "https://www.nbcnews.com/politics/congress/republican-congressman-struggles-answer-questions-biden-allegations-bi-rcna117742"
  },
  {
    "text": "Bombshell: Ways and Means Releases New Documents Revealing Hunter Biden Selling Access to White House, Investigators Blocked from Pursuing Evidence Related to President Biden  —  WASHINGTON, D.C. - New documents released by the Ways and Means Committee today reveal Joe Biden's connections to his son Hunter Biden's business dealings.",
    "url": "https://waysandmeans.house.gov/bombshell-ways-and-means-releases-new-documents-revealing-hunter-biden-selling-access-to-white-house-investigators-blocked-from-pursuing-evidence-related-to-president-biden/"
  },
  {
    "text": "My expectations for the debate were low, but holy crap  —  Republican also-rans put their unreadiness for prime time on full display. … The first thing to understand about the Republican primary is that it's not really a contest.  It's over.  It's been over for months now.  It was never even really in doubt.",
    "url": "https://www.publicnotice.co/p/gop-debate-fox-business-simi-valley-yikes"
  },
  {
    "text": "House Votes to Strip Defense Secretary of Salary as Right Wing Flexes Muscles  —  Little more than three days before a government shutdown, the Republican-led House spent the day adding hard-right proposals to a series of doomed spending bills.  —  The Republican-led House voted on Wednesday … ",
    "url": "https://www.nytimes.com/2023/09/27/us/politics/house-republicans-lloyd-austin-salary.html"
  },
  {
    "text": "Why not Nikki Haley?  —  Of the Republican 2024 contenders, Nikki Haley, former ambassador to the United Nations and former governor of South Carolina, sticks out for all the right reasons.  Haley carries with her the kind of experience that is invaluable and not easily replicated.",
    "url": "https://www.washingtonexaminer.com/opinion/why-not-nikki-haley"
  },
  {
    "text": "Kari Lake to Announce Senate Run, Setting Up High-Stakes Arizona Race  —  Republican will launch her campaign at Oct. 10 rally; three-way race with independent Kyrsten Sinema and Democrat Ruben Gallego is likely  —  PHOENIX—Kari Lake will announce a run for Kyrsten Sinema's Senate seat next month … ",
    "url": "https://www.wsj.com/politics/elections/kari-lake-to-announce-senate-run-setting-up-high-stakes-arizona-race-30ff1594?mod=followamazon"
  },
  {
    "text": "Kari Lake launching Arizona Senate campaign Oct. 10  —  Former Arizona gubernatorial candidate Kari Lake will officially launch a Senate campaign next month, her campaign confirmed on Thursday.  —  The much-anticipated announcement — expected on Oct. 10 — will make Lake the most significant Republican … ",
    "url": "https://thehill.com/homenews/campaign/4227665-kari-lake-launching-arizona-senate-campaign-in-october/"
  },
  {
    "text": "Gen. Milley says he has “appropriate” safety measures after Trump social media threat  —  Outgoing Chairman of the Joint Chiefs of Staff Gen. Mark Milley has “appropriate measures” to ensure his safety, he said this week in his first public response to shocking comments made by former President … ",
    "url": "https://www.cbsnews.com/news/general-milley-responds-to-trump-social-media-post-60-minutes/"
  },
  {
    "text": "Senate adopts resolution requiring men to wear business attire on chamber floor  —  The Senate on Wednesday adopted a resolution requiring male senators to wear a coat, tie and slacks or other long pants on the chamber's floor following days of upheaval sparked by Senate Majority Leader Charles … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/senate-dress-code-change/"
  },
  {
    "text": "Majority of voters oppose Biden impeachment hearings as GOP inquiry begins  —  A new national NBC News survey finds 56% of registered voters believe Congress should not move forward with impeachment hearings.  —  House Republicans kick off their impeachment inquiry against President Joe Biden on Thursday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/majority-voters-oppose-biden-impeachment-hearings-gop-inquiry-begins-rcna117668"
  },
  {
    "text": "Christie defends attack on Jill Biden: 'That's the truth'  —  “I am standing by the wording,” Chrstie said.  —  Chris Christie stood by his attack on first lady Jill Biden the morning after the second GOP debate, saying that his remarks were “the truth.”  —  On Wednesday night … ",
    "url": "https://www.politico.com/news/2023/09/28/republican-debate-christie-jill-biden-00118712"
  },
  {
    "text": "U.S. Secretary of State Antony J. Blinken Launches Global Music Diplomacy Initiative, Music Icon and Former U.S. Jazz Ambassador Music Director Quincy Jones Receives Inaugural Peace Through Music Award  —  U.S. Secretary of State Antony J. Blinken launched the Global Music Diplomacy Initiative … ",
    "url": "https://www.state.gov/u-s-secretary-of-state-antony-j-blinken-launches-global-music-diplomacy-initiative-music-icon-and-former-u-s-jazz-ambassador-music-director-quincy-jones-receives-inaugural-peace-through-music-awar/"
  },
  {
    "text": "Trump Attorneys Ask For More Time To Debate Classified Information in D.C. Jan. 6 case  —  Former President Donald Trump's attorneys on Wednesday chimed in on a matter tied to reviewing the small amount of classified information in Special Counsel Jack Smith's case",
    "url": "https://themessenger.com/politics/trump-classified-court-filing-washington-jan-6-jack-smith"
  }
]