[
  {
    "text": "Middle East conflict live updates  —  Israel recovers bodies of 3 hostages; ICJ to rule on Israel's Rafah assault  —  The Israeli military said its forces recovered the bodies of three hostages overnight in northern Gaza.  It said they were killed and abducted during the Oct. 7 attack by Hamas … ",
    "url": "https://www.washingtonpost.com/world/2024/05/24/israel-hamas-war-news-gaza-palestine-rafah/"
  },
  {
    "text": "Israel ordered to immediately halt Rafah offensive by top U.N. court  —  Israel is unlikely to comply with the order, which the International Court of Justice has no power to enforce, but the landmark ruling will pile pressure on the increasingly isolated U.S. ally.",
    "url": "https://www.nbcnews.com/news/world/israel-halt-rafah-offensive-international-court-of-justice-ruling-rcna153867"
  },
  {
    "text": "IDF recovers bodies of three hostages from north Gaza, who were killed on October 7  —  Military says it recently got intel confirming Orión Hernández Radoux, Hanan Yablonka, Michel Nisenbaum were kidnapped near Mefalsim, murdered there or en route to Gaza in Hamas onslaught",
    "url": "https://www.timesofisrael.com/idf-recovers-bodies-of-three-hostages-from-north-gaza-who-were-killed-on-october-7/"
  },
  {
    "text": "The Shaky Foundation of Trump's Lead: Disengaged Voters  —  The Biden team faces questions of its own: Why have these voters backed away from him, and can his campaign find a way to reach them?  —  The polls have shown Donald J. Trump with an edge for eight straight months … ",
    "url": "https://www.nytimes.com/2024/05/24/upshot/trump-biden-polls-voters.html"
  },
  {
    "text": "Exclusive: Putin wants Ukraine ceasefire on current frontlines  —  Russian President Vladimir Putin is ready to halt the war in Ukraine with a negotiated ceasefire that recognises the current battlefield lines, four Russian sources told Reuters, saying he is prepared to fight on if Kyiv and the West do not respond.",
    "url": "https://www.reuters.com/world/europe/putin-wants-ukraine-ceasefire-current-frontlines-sources-say-2024-05-24/"
  },
  {
    "text": "At least 66 members of far-right group in rural Oregon standing for office  —  Revealed: anti-government People's Rights Network, founded by Ammon Bundy, appearing to follow ‘entryism’ strategy  —  At least 66 members of an anti-government group founded by far-right militia figure Ammon Bundy … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/24/people-rights-network-oregon-elections"
  },
  {
    "text": "Trump Has Already Sown Doubts About the 2024 Election Results  —  Former President Donald J. Trump has baselessly and publicly cast doubt about the fairness of the 2024 election about once a day, on average, since he announced his candidacy for president, according to an analysis by The New York Times.",
    "url": "https://www.nytimes.com/interactive/2024/05/24/us/politics/trump-election-results-doubt.html"
  },
  {
    "text": "Are Russia and North Korea planning an ‘October surprise’ that aids Trump?  —  U.S. officials are bracing for Pyongyang to take military actions close to the U.S. presidential election, possibly at the urging of Vladimir Putin.  —  WASHINGTON — The Biden administration is increasingly concerned … ",
    "url": "https://www.nbcnews.com/news/investigations/are-russia-north-korea-planning-october-surprise-aids-trump-rcna153828"
  },
  {
    "text": "Trump isn't joking about serving 3 or more terms  —  He wouldn't leave power willingly the first time.  He won't if he returns to power. … During Donald Trump's first term, Republicans dismissed well-founded concerns that he wouldn't leave office willingly as “silly.”  And then January 6 happened.",
    "url": "https://www.publicnotice.co/p/trump-third-term-nra-speech-dallas"
  },
  {
    "text": "Even Donald Trump has trouble getting New York's attention  —  The former president came to the Bronx on Thursday night for an unusual campaign rally.  The Bronx didn't take much notice.  —  NEW YORK — You could hear Donald Trump sporadically through the trees.",
    "url": "https://www.washingtonpost.com/politics/2024/05/24/even-donald-trump-has-trouble-getting-new-yorks-attention/"
  },
  {
    "text": "‘Repeal the 20th century’: Gerrymandering ruling shows Supreme Court conservatives' long term goal  —  With their ruling today not only allowing South Carolina's racially gerrymandered voting districts but making it harder to challenge racial gerrymandering in the future … ",
    "url": "https://www.msnbc.com/alex-wagner-tonight/watch/-repeal-the-20th-century-gerrymandering-ruling-shows-supreme-court-conservatives-long-term-goal-211551813881"
  },
  {
    "text": "Jailed Trump Adviser Peter Navarro Says He Doesn't Want a Pardon: ‘I Have No Regrets’  —  From a federal prison, former aide plots new MAGA agenda  —  Peter Navarro, a former top White House adviser to Donald Trump, isn't interested in a pardon should “the boss” return to power.",
    "url": "https://www.wsj.com/politics/policy/peter-navarro-pardon-donald-trump-presidency-2024-56ec0426"
  },
  {
    "text": "Texas's pardon of the killer of a Black Lives Matter protester sends a chilling message  —  Governor Greg Abbott would have us believe this was a case of self-defense.  Would he say that if the situation were reversed?  —  This month, the Texas state parole board unanimously recommended … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/may/24/daniel-perry-pardon-texas"
  },
  {
    "text": "The odds, the stakes and the scariest media news I saw all week  —  On the great divide in how Americans get their news and how it affects their political views  —  First off, thanks so much to quite a few new subscribers, who made it clear that they care — a lot — about how the news media is dealing with threats to democracy.",
    "url": "https://margaretsullivan.substack.com/p/the-odds-the-stakes-and-the-scariest"
  },
  {
    "text": "Why Jared Polis criticized Biden's China tariffs … Good morning, Early Birds.  Memorial Day is a holiday for the Early Brief.  Have a wonderful weekend.  We'll be back in your inboxes Tuesday.  Tips: earlytips@washpost.com.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2024/05/24/why-jared-polis-criticized-bidens-china-tariffs/"
  },
  {
    "text": "Trump's V.P. Pageant Has an Unexpectedly Strong Contender: Tom Cotton  —  Donald Trump's interest in the Arkansas senator reflects a desire to choose a running mate with experience and the ability to run a disciplined campaign.  —  Senator Tom Cotton of Arkansas has unexpectedly emerged … ",
    "url": "https://www.nytimes.com/2024/05/24/us/politics/tom-cotton-trump-vp.html"
  },
  {
    "text": "Ex-Labour Leader Corbyn to Stand as Independent in UK Election  —  Former Labour Party leader Jeremy Corbyn will stand as an independent candidate in the general election, a potentially awkward moment for his old party and Keir Starmer's campaign to become UK prime minister.",
    "url": "https://www.bloomberg.com/news/articles/2024-05-24/ex-labour-leader-corbyn-to-stand-as-independent-in-uk-election"
  },
  {
    "text": "Pentagon: Over 1 million pounds of aid reaches Gaza via U.S. pier … - The effort “is being carried out as part of the United States' broader efforts alongside international partners to surge assistance to Palestinians in need,” the Pentagon said in a blog post.",
    "url": "https://www.axios.com/2024/05/24/gaza-aid-us-pier-pentagon"
  },
  {
    "text": "GOP Senate Candidate Spent Thousands in Donor Funds on Strip Clubs, Luxury, and Mysterious Wire Transfers  —  ROLLS ROYCE  —  Star athlete and conspiracy theorist Royce White just landed the Minnesota GOP's endorsement for Senate.  They must not have seen his previous campaign expenses.",
    "url": "https://www.thedailybeast.com/gop-sen-candidate-royce-white-spent-big-on-strip-clubs-limos-luxury"
  },
  {
    "text": "Most believe Trump probably guilty of crime as his NYC trial comes to an end, CBS News poll finds  —  As Donald Trump's trial in New York City nears closing arguments, most Americans believe he is guilty of a crime in this case.  But they are less sure what the jury will do after it deliberates next week.",
    "url": "https://www.cbsnews.com/news/trump-trial-poll-most-believe-guilty-new-york/"
  },
  {
    "text": "New York Gov. Kathy Hochul calls Trump supporters ‘clowns’ in her own ‘basket of deplorables’ moment  —  Two years ago, Hochul also raised the ire of Republicans when she told GOP candidates in the state to ‘get out of town’  —  New York Gov. Kathy Hochul appeared to call Trump supporters … ",
    "url": "https://www.foxnews.com/politics/new-york-gov-kathy-hochul-calls-trump-supporters-clowns-holds-nyc-rally-bronx"
  },
  {
    "text": "Russia denies Trump's claim he can free US journalist if he wins election  —  Spokesman says 'there aren't any contacts' with former president regarding Evan Gershkovich's release from Russia  —  Donald Trump boasted on Thursday he would quickly free the jailed US journalist Evan Gershkovich … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/23/russia-denies-trump-claim-us-journalist"
  }
]