[
  {
    "text": "Where the race between Trump and Harris stands on Labor Day, according to our polling expert  —  A race that Kamala Harris leads nationally is the equivalent of a knife fight in a phone booth, and it's set to be decided in a smaller-than-usual number of states.",
    "url": "https://www.politico.com/news/2024/09/02/trump-harris-polls-2024-00176981"
  },
  {
    "text": "Trump aims to drag down Harris as he scrambles to keep up in tight race  —  The Republican nominee's advisers and allies are clear-eyed about the unlikelihood of improving his standing.  That leaves one option: damaging hers.  —  Donald Trump's team is approaching the final nine weeks … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/02/trump-strategy-campaign-harris/"
  },
  {
    "text": "The Soft Bigotry of No Expectations on Trump  —  WaPo has an editorial out, purporting to compare the policy platforms of Donald Trump and Kamala Harris.  Its punchline is that Kamala can lift up politics by going deep on policy, something it admits Trump has not done.",
    "url": "https://www.emptywheel.net/2024/09/02/the-soft-bigotry-of-no-expectations-on-trump/"
  },
  {
    "text": "Donald Trump Saying Kamala Harris Was ‘Horrible’ to Mike Pence Mocked  —  has been widely mocked on social media after saying the way his Democratic rival  —  was “horrible.”  —  On Sunday, a clip was circulated online from an interview of the former president with  —  on Saturday.",
    "url": "https://www.newsweek.com/donald-trump-saying-kamala-harris-was-horrible-mike-pence-mocked-1947392"
  },
  {
    "text": "Former Aurora cop charged with raping daughter remains free as mom is sent to jail  —  Colorado mother objects to court-ordered reunification therapy, claims it is harmful and abusive  —  A retired Aurora police sergeant faces criminal charges for raping his daughter and continually sexually assaulting … ",
    "url": "https://denvergazette.com/colorado-watch/reunification-therapy-colorado-child-abuse/article_96e08e26-66f4-11ef-b15c-ab5c4905bfc1.html"
  },
  {
    "text": "The right's obsession with childless women isn't just about ideology: it's essential to the capitalist machine  —  JD Vance's comments on Kamala Harris reflect a stubborn debate in supposedly progressive societies  —  A woman without biological children is running for high political office … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/sep/02/jd-vance-childless-women-kamala-harris"
  },
  {
    "text": "Biden: Netanyahu isn't doing enough to get a Gaza hostage and ceasefire deal … - White House national security adviser Jake Sullivan on Sunday told families of U.S. hostages held in Gaza that Biden is considering presenting Israel and Hamas a final proposal for a hostage-release and ceasefire … ",
    "url": "https://www.axios.com/2024/09/02/biden-netanyahu-israel-gaza-hostage-ceasefire-deal"
  },
  {
    "text": "Exclusive: US seizes Venezuela President Nicolas Maduro's airplane in the Dominican Republic  —  The United States has seized Venezuela President Nicolas Maduro's airplane after determining that its acquisition was in violation of US sanctions, among other criminal issues.",
    "url": "https://www.cnn.com/2024/09/02/politics/us-seizes-venezuela-president-maduros-airplane"
  },
  {
    "text": "Trump eyes plan that may give Elon Musk role in auditing U.S. agencies  —  The GOP presidential nominee has discussed asking executives to comb through federal books.  For Musk, the task could bring conflicts of interest.  —  Behind closed doors, former president Donald Trump and his advisers … ",
    "url": "https://www.washingtonpost.com/business/2024/09/02/trump-elon-musk-commission-doge/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI1MjQ5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI2NjMxOTk5LCJpYXQiOjE3MjUyNDk2MDAsImp0aSI6IjRlOTIwNDdkLTRiOGEtNDg5OS04ZTI1LTQyOWE2ODM4OTI4YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI0LzA5LzAyL3RydW1wLWVsb24tbXVzay1jb21taXNzaW9uLWRvZ2UvIn0.GbWTqXoffVRHKHKaBg99NLagts4IAE_6Y-4dcG2twKQ&itid=gfta"
  },
  {
    "text": "‘Ticking time bomb’: Plunging office values alarm Washington  —  Fed Chair Jerome Powell has voiced concern, saying that commercial real estate risk “will be with us for some time, probably for years.”  —  Four and a half years after the pandemic sent workers home, the office property bill is finally coming due.",
    "url": "https://www.politico.com/news/2024/09/02/office-property-values-fed-00174697"
  },
  {
    "text": "Convicted fraudsters launch AI lobbying firm using fake names  —  Jacob Wohl and Jack Burkman are operating under the pseudonyms Jay Klein and Bill Sanders.  —  A Washington startup pitched as a service to integrate AI into lobbying is covertly run by a pair of well-known … ",
    "url": "https://www.politico.com/news/2024/09/02/jacob-wohl-jack-burkman-ai-lobbying-pseudonyms-00176917"
  },
  {
    "text": "Fraternity Brothers Balk at a $515,000 Party for Defending the Flag  —  After students at the University of North Carolina shielded a U.S. flag from protesters, admirers raised money to throw a ‘rager’ in their honor.  Some don't want it.  —  The image went viral as protests … ",
    "url": "https://www.nytimes.com/2024/09/02/us/unc-israel-gaza-protests-party-alpha-epsilon-pi.html"
  },
  {
    "text": "9/2/24 ☀️ AM:  —  Johnson is eyeing CR with SAVE Act next week  —  House Dems continue to chip in to the DCCC … Happy Labor Day, happy September and welcome back.  We missed you too.  —  There are 64 days until Election Day.  —  The House and Senate return next week.",
    "url": "https://punchbowl.news/archive/9224-am/"
  },
  {
    "text": "Donald Trump Can't Stop Talking About Kamala Harris' McDonald's Job  —  MCSPIRACY THEORY  —  Right-wing commentators are freaking out about the fact that the vice president didn't mention her summer serving fries and ice cream on an application to work for a prosecutor.",
    "url": "https://www.thedailybeast.com/donald-trump-cant-stop-talking-about-kamala-harris-mcdonalds-job"
  }
]