[
  {
    "text": "Major national outlets adopt House GOP spin to protect rich tax cheats  —  Several major national news outlets are promoting House Republicans' deceptive spin as the party seeks to leverage emergency funding for Israel to enact its top priority of protecting wealthy tax cheats.",
    "url": "https://www.mediamatters.org/joe-biden/major-national-outlets-adopt-house-gop-spin-protect-rich-tax-cheats"
  },
  {
    "text": "Israel strikes Gaza's Jabalya refugee camp  —  An Israeli strike targeting a Hamas commander in the densely populated Jabalya refugee camp in northern Gaza has left catastrophic damage and killed a large number of people, according to eyewitnesses and medics in the enclave.",
    "url": "https://www.cnn.com/2023/10/31/middleeast/jabalya-blast-gaza-intl/"
  },
  {
    "text": "Bolivia severs diplomatic ties with Israel, citing ‘crimes against humanity’  —  Bolivia's government said it had broken diplomatic ties with Israel on Tuesday, accusing Israel of committing crimes against humanity in its attacks on the Gaza Strip.  —  Bolivia “has decided to break diplomatic relations … ",
    "url": "https://www.reuters.com/world/americas/bolivia-severs-diplomatic-ties-with-israel-citing-crimes-against-humanity-2023-10-31/"
  },
  {
    "text": "Colleges braced for antisemitism and violence.  It's happening.  —  ‘I had Jewish blood on my hands,’ a Tulane student said after aiding a classmate who was assaulted at a pro-Palestinian rally  —  Recent days have witnessed what Jewish students and watchdog groups describe as a raft of antisemitic incidents on college campuses.",
    "url": "https://www.washingtonpost.com/education/2023/10/31/antisemitism-college-campuses-jewish-hamas-gaza/"
  },
  {
    "text": "Muslim Democrats give Biden ultimatum: Israel ceasefire by 5 or battleground states turn ‘red’  —  The National Muslim Democratic Council, a nationwide group of Democratic leaders and activists, threatened President Joe Biden that if he does not force Israel to reach a ceasefire with Hamas … ",
    "url": "https://justthenews.com/politics-policy/elections/muslim-democrats-give-biden-ultimatum-israel-ceasefire-5-or-battleground"
  },
  {
    "text": "Home schooling's rise from fringe to fastest-growing form of education  —  A district-by-district look at home schooling's explosive growth, which a Post analysis finds has far outpaced the rate at private and public schools  —  Home schooling has become — by a wide margin … ",
    "url": "https://www.washingtonpost.com/education/interactive/2023/homeschooling-growth-data-by-district/"
  },
  {
    "text": "Home Sellers Win $1.8 Billion as Jury Finds Realtors Inflated Commissions  —  Future homebuyers could be paying smaller commissions following the decision by a federal jury in Missouri  —  In a verdict that's roiling the real estate world, an eight-person jury in a federal Missouri court found … ",
    "url": "https://themessenger.com/business/realtors-found-liable-for-1-8-billion-for-keeping-commissions-artificially-high"
  },
  {
    "text": "‘Wake Up, It Is a Time to Be Concerned’: FBI Director Wray Issues Stark Warning at Committee Hearing  —  In a Senate Homeland Security Committee hearing on Tuesday, FBI Director Christopher Wray provided some worrying — if not outright alarming — answers to questions from U.S. Senator Rick Scott … ",
    "url": "https://townhall.com/tipsheet/spencerbrown/2023/10/31/fbi-director-wray-it-is-a-time-to-be-concerned-about-terrorism-in-the-us-n2630588"
  },
  {
    "text": "3 Expert Shoemakers Say Ron DeSantis Is Probably Wearing Height Boosters  —  The internet has questions about the governor's boots.  So I asked the experts.  —  In the last few weeks, posts mocking Florida Gov. Ron DeSantis' strangely shaped cowboy boots have racked up millions of views … ",
    "url": "https://www.politico.com/news/magazine/2023/10/31/desantis-boots-shoemakers-00121044"
  },
  {
    "text": "Speaker Johnson taps veteran GOP operative as chief spokesperson  —  Raj Shah previously spent four years as senior vice president for public affairs at Fox Corporation.",
    "url": "https://www.politico.com/live-updates/2023/10/31/congress/johnsons-comms-hire-00124592"
  },
  {
    "text": "Kinzinger says family disowned him over loss of Hannity's trust  —  Former Rep. Adam Kinzinger (R-Ill.) said he was disowned by his family after he left Congress and “lost the trust” of Fox News host Sean Hannity.  —  “So, I had family that sent a certified letter disowning me,” Kinzinger said in a CNN interview Monday.",
    "url": "https://thehill.com/homenews/4285023-adam-kinzinger-family-disowned-sean-hannity/"
  },
  {
    "text": "Israeli forces battle Hamas around Gaza City, as military says 800,000 have fled south  —  Israel advances in Gaza as Netanyahu rejects cease-fire  —  Israel rescues soldier held hostage by Hamas  —  A flurry of Israeli airstrikes Tuesday on a refugee camp near Gaza City leveled apartment buildings … ",
    "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-news-10-31-2023-54ab6bd7f6861be86266770c245827e1"
  },
  {
    "text": "Romney steps in as Halloween dog parade emcee  —  Sen. Mitt Romney (R-Utah) stepped in as the emcee for the annual bipartisan Halloween dog parade after host Sen. Thom Tillis (R-N.C.) said Tuesday that he tested positive for COVID-19.  —  “Glad to host some furry friends in the Senate today … ",
    "url": "https://thehill.com/homenews/4286316-romney-steps-in-as-halloween-dog-parade-emcee/"
  },
  {
    "text": "Mike Johnson Has a Dangerous Victim Complex  —  “Christ calls us to be ‘wise as serpents and harmless as doves,’” wrote Mike Johnson on a Creationist website in 2015.  Johnson, who became speaker of the House last week, was counseling his fellow Christians on how to live in a new and … ",
    "url": "https://newrepublic.com/article/176509/mike-johnson-dangerous-victim-complex"
  },
  {
    "text": "Mesa high school teacher on administrative leave after students say he dressed up as devil, said ‘hail Satan’ to students  —  Mesa Public Schools said it is investigating the alleged incident.  —  MESA, Ariz. — A Mesa High School teacher is being investigated after reportedly dressing … ",
    "url": "https://www.12news.com/article/news/local/valley/mesa-teacher-on-administrative-leave-after-students-say-he-dressed-up-as-devil-said-hail-satan-to-students/75-e5d398be-5171-4a2c-bb27-dc6909c73bd0"
  },
  {
    "text": "Trump grouses that his indictments took years.  Here's why that is.  —  The former president has zeroed in on the idea that the prosecutions are politically timed, neglecting some important details  —  No fewer than five times this week, Donald Trump has wondered aloud why he wasn't indicted … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/31/trump-grouses-that-his-indictments-took-years-heres-why-that-is/"
  },
  {
    "text": "White House: Saudi Arabia is still interested in pursuing mega-deal  —  Saudi Arabia assured the Biden administration that the kingdom is still interested in pursuing an agreement that would normalize relations with Israel after the war in Gaza ends, White House National Security Council spokesperson John Kirby told reporters Tuesday.",
    "url": "https://www.axios.com/2023/10/31/saudi-megadeal-normalization-israel-biden"
  },
  {
    "text": "Could Israel dump Netanyahu in the middle of a war?  —  Israelis aren't rallying around their prime minister.  They're rallying against him.  —  Israeli Prime Minister Benjamin Netanyahu is in trouble.  As in, facing a non-zero risk of losing his job trouble.",
    "url": "https://www.vox.com/world-politics/2023/10/31/23938474/netanyahu-benjamin-israel-palestine-gaza-hamas-war-remove-prime-minister-hostage-crisis"
  }
]