[
  {
    "text": "Rep. George Santos won't seek reelection after scathing ethics report cites evidence of lawbreaking  —  The House Ethics committee in a scathing report Thursday said it has amassed “overwhelming evidence” of lawbreaking by Republican Rep. George Santos of New York that has been sent to the Justice Department … ",
    "url": "https://apnews.com/article/ethics-congress-santos-5ebffe514d8779fbc16a77fa1ab5e0df"
  },
  {
    "text": "Statement of the Chairman and Ranking Member of the Committee on Ethics Regarding Representative George Santos  —  Pursuant to House Rule XI Clause 3(q)(1), today the Chairman of the Committee on Ethics, Representative Michael Guest, and the Ranking Member, Representative Susan Wild … ",
    "url": "https://ethics.house.gov/press-releases/statement-chairman-and-ranking-member-committee-ethics-regarding-representative-76"
  },
  {
    "text": "Ethics panel finds ‘substantial evidence’ that Rep. Santos violated federal laws  —  House investigators found “substantial evidence” that Rep. George Santos (R-N.Y.) knowingly violated a litany of ethics and criminal laws, according a House Ethics Committee report released Thursday.",
    "url": "https://www.washingtonpost.com/politics/2023/11/16/george-santos-ethics-committee-report/"
  },
  {
    "text": "There's ‘substantial evidence’ that Rep. George Santos broke the law, House panel finds  —  The House Ethics Committee said it will refer its findings, including new “uncharged” conduct, to the Justice Department.  —  WASHINGTON — The House Ethics Committee on Thursday released … ",
    "url": "https://www.nbcnews.com/politics/congress/substantial-evidence-rep-george-santos-broke-law-ethics-panel-finds-rcna125335"
  },
  {
    "text": "Elon Musk's Disturbing ‘Truth’  —  The billionaire affirmed the deadliest anti-Semitic conspiracy theory in recent American history.  —  The Hebrew Immigrant Aid Society “likes to bring invaders in that kill our people ... Screw your optics, I'm going in.”",
    "url": "https://www.theatlantic.com/ideas/archive/2023/11/elon-musks-disturbing-truth/676019/"
  },
  {
    "text": "Elon Musk faces scrutiny after calling antisemitic X post the ‘absolute truth’  —  Tech billionaire Elon Musk is facing a wave of backlash after engaging with an antisemitic social media post on Wednesday, calling it the “absolute truth.”  —  The antisemitic post that Musk seemed to endorse came … ",
    "url": "https://thehill.com/homenews/media/4312813-elon-musk-facing-scrutiny-antisemitic-post/"
  },
  {
    "text": "CNN Poll: Trump holds significant lead in New Hampshire GOP primary, while Haley moves into second place  —  Former President Donald Trump maintains a significant lead among likely voters in New Hampshire's Republican presidential primary, but former South Carolina Gov. Nikki Haley has moved ahead … ",
    "url": "https://www.cnn.com/2023/11/16/politics/cnn-poll-new-hampshire-republican-primary/"
  },
  {
    "text": "The Biden campaign wants to remind voters why they turned on MAGA  —  The News  —  President Biden is returning to a message that's worked for Democrats in races around the country since his election, portraying Donald Trump as a threat to American democracy who would use his perch … ",
    "url": "https://www.semafor.com/article/11/16/2023/the-biden-campaign-wants-to-remind-voters-why-they-turned-on-maga"
  },
  {
    "text": "More pandas will be coming to the U.S., China's president signals  —  SAN FRANCISCO — Chinese President Xi Jinping signaled that China will send new pandas to the United States, calling them “envoys of friendship between the Chinese and American peoples.”  —  “We are ready to continue … ",
    "url": "https://www.npr.org/2023/11/16/1213443655/pandas-us-china-xi"
  },
  {
    "text": "A rare look at the devastation caused by AR-15 shootings  —  Editor's note: The photos, videos and personal accounts below are extremely disturbing and may be too upsetting for some people.  Read why The Post is publishing this story.  —  When a gunman fires an AR-15 ...",
    "url": "https://www.washingtonpost.com/nation/interactive/2023/ar-15-force-mass-shootings/"
  },
  {
    "text": "House offices locked down as lawmakers are evacuated from DNC protest … - The DNC was hosting a Democratic Congressional Campaign Committee candidate event at the time, with multiple Democratic leaders present including Minority Leader Hakeem Jeffries (D-N.Y.), two House Democrats told Axios.",
    "url": "https://www.axios.com/2023/11/16/dnc-lawmakers-evacuated-house-offices-lockdown-israel-hamas-war-protest"
  },
  {
    "text": "USCP Statement on the Unlawful Demonstration outside the DNC  —  Last night approximately 200 people gathered in front of the Democratic National Committee (DNC) headquarters to protest the conflict in the Middle East.  —  We have handled hundreds of peaceful protests, but last night's group was not peaceful.",
    "url": "https://www.uscp.gov/media-center/press-releases/uscp-statement-unlawful-demonstration-outside-dnc"
  },
  {
    "text": "Rudy's Ukraine caper looks even worse now  —  This free edition of Public Notice is made possible by paid subscribers.  If you aren't one already, please consider signing up.  Just click the button below.  —  Click for Public Notice free trial  —  There's something so utterly predictable … ",
    "url": "https://www.publicnotice.co/p/giuliani-ukraine-kulyk-derkach-dubinsky-treason"
  },
  {
    "text": "‘Signs of life’ on longshot Senate border deal  —  Good morning, Early Birds.  Dwayne Johnson, a.k.a. The Rock, was on Capitol Hill on Wednesday.  We wonder if he and Sen. Joe Manchin III (D-W.Va.) met up to discuss a potential presidential unity ticket.  Tips: earlytips@washpost.com.",
    "url": "https://www.washingtonpost.com/politics/2023/11/16/signs-life-longshot-senate-border-deal/"
  },
  {
    "text": "Trump Secures Change in Key Hearing Dates From Judge Cannon Amid Conflict With New York Hush-Money Case  —  The scheduling issue that got resolved Thursday is the latest example of the former president's defense team juggling myriad competing cases requiring their split attention",
    "url": "https://themessenger.com/news/trump-cannon-court-schedule-florida-new-york-scheduling-conflict"
  },
  {
    "text": "Pressure mounts on CPAC chief Matt Schlapp as legal costs spiral  —  Another board member resigned amid concerns over the cost of defending Schlapp from a sexual battery claim  —  The parent organization of the Conservative Political Action Conference lost another high-profile board member … ",
    "url": "https://www.washingtonpost.com/nation/2023/11/15/matt-schlapp-cpac-legal-fees/"
  },
  {
    "text": "Arizona Poll: Democrat Ruben Gallego Holds Lead In Hypothetical Three-Way Race  —  Incumbent Sen. Kyrsten Sinema trails both Gallego and Republican Kari Lake in a potential 2024 showdown  —  A new survey from an Arizona-based pollster found Independent Sen. Kyrsten Sinema trailing her potential general election opponents.",
    "url": "https://themessenger.com/politics/arizona-poll-democrat-ruben-gallego-holds-lead-in-hypothetical-three-way-race"
  },
  {
    "text": "Payback Scheme: Trump Tries to Get Michael Cohen's Phone  —  Last month, Donald Trump's lawyers demanded that Michael Cohen turn over all his personal devices—something prosecutors say is an attempt at witness intimidation.  —  Donald Trump's obsession with seeking vengeance … ",
    "url": "https://www.thedailybeast.com/payback-scheme-trump-tries-to-get-michael-cohens-phone"
  },
  {
    "text": "The U.S. undocumented population is growing more diverse, less Mexican  —  The population of undocumented immigrants in the U.S. is becoming more diverse, and Mexicans now have the smallest share they've ever had, according to a new study by the Pew Research Center.",
    "url": "https://www.axios.com/2023/11/16/us-immigrants-undocumented-mexican-diverse-pew-research"
  },
  {
    "text": "Starbucks Workers Walk Out on Red Cup Giveaway Day  —  Unionized employees say promotional events like the one on Thursday exacerbate staffing and scheduling problems at the chain's stores.  —  Thousands of unionized Starbucks workers walked off the job on Thursday to press their demands … ",
    "url": "https://www.nytimes.com/2023/11/16/business/starbucks-strike-red-cup-day.html"
  },
  {
    "text": "Dexter Wade, buried without his family's knowledge, had ID on him with his home address, lawyer says  —  Dexter Wade, 37, was run over by a police cruiser in March, and buried in a pauper's grave.  His mother searched for him for months before learning what happened.",
    "url": "https://www.nbcnews.com/news/us-news/dexter-wade-buried-mississippi-id-home-address-lawyer-says-rcna125511"
  }
]