[
  {
    "text": "Trump's latest about-face: He now says 2020 election was ‘long over’  —  It's a new piece of rhetoric that Trump hopes will help him win immunity from his criminal charges.  —  In the months after the 2020 election, Donald Trump leaned on his campaign to launch ad blitzes and legal challenges … ",
    "url": "https://www.politico.com/news/2024/01/12/trump-2020-election-legal-00135230"
  },
  {
    "text": "Dean Phillips: I'm Being Blackballed — and It's Joe Biden's Fault  —  What the Minnesota Rep's unsurprising media struggles say about our news ecosystem.  —  “I'm appalled,” fumes U.S. Rep. and presidential hopeful Dean Phillips.  “I'm disappointed.  I'm disgusted that professionals … ",
    "url": "https://www.politico.com/news/magazine/2024/01/12/dean-phillips-msnbc-joe-biden-00135134"
  },
  {
    "text": "Americans divided on how SCOTUS should handle Trump ballot access: POLL  —  The U.S. Supreme Court will hear ballot access arguments on Feb. 8.  —  Former President and Republican presidential candidate Donald Trump campaigns, in Clinton, Iowa, Jan 6, 2024.",
    "url": "https://abcnews.go.com/US/americans-divided-scotus-handle-trump-ballot-access-poll/story?id=106300304"
  },
  {
    "text": "Oregon Supreme Court won't remove Trump from ballot for now, says it's waiting on SCOTUS  —  The Oregon Supreme Court on Friday declined to hear a bid to remove former President Donald Trump from the 2024 ballot based on the 14th Amendment's “insurrectionist ban,” saying it's waiting for the US Supreme Court to rule on the issue.",
    "url": "https://www.cnn.com/2024/01/12/politics/oregon-supreme-court-trump-ballot-2024"
  },
  {
    "text": "US and UK carry out strikes against Iran-backed Houthis in Yemen  —  The US and UK militaries launched strikes against Houthi targets in Houthi-controlled areas of Yemen on Thursday, marking a significant response after the Biden administration and its allies warned that the Iran-backed militant group … ",
    "url": "https://www.cnn.com/2024/01/11/politics/us-strikes-houthis-yemen/"
  },
  {
    "text": "Greene denounces Yemen strikes, pointing to Biden's past criticism of Trump  —  Rep. Marjorie Taylor Greene (R-Ga.) denounced U.S. airstrikes on Houthi rebels in Yemen on Thursday, calling the Biden administration “insanely out of control.”  —  The joint U.S.-U.K. airstrikes hit … ",
    "url": "https://thehill.com/policy/defense/4404869-greene-yemen-strikes-biden-trump/"
  },
  {
    "text": "Elise Stefanik's Ugly “Hostages” Barb Points to Serious GOP Mayhem Ahead  —  GOP Representative Elise Stefanik no doubt thought it was shrewd to describe the rioters who attacked the Capitol as “January 6 hostages.”  This sort of talk hits a sweet trifecta for a GOP leader with seemingly limitless ambition.",
    "url": "https://newrepublic.com/article/178044/elise-stefanik-jan-6-hostages-gop-mayhem"
  },
  {
    "text": "‘This to Him Is the Grand Finale’: Donald Trump's 50-Year Mission to Discredit the Justice System  —  The former president is in unparalleled legal peril, but he has mastered the ability to grind down the legal system to his advantage.  It's already changing our democracy.",
    "url": "https://www.politico.com/news/magazine/2024/01/12/donald-trump-indictments-legal-system-00135151"
  },
  {
    "text": "Iowa blizzard cancels GOP events, threatens caucus turnout  —  Candidates are canceling events, as extreme weather shuts campaigning down.  —  WEST DES MOINES, Iowa — Every campaign takes a certain number of precautions heading into the critical stretch run of a primary.",
    "url": "https://www.politico.com/news/2024/01/12/iowa-blizzard-cancels-gop-events-threatens-caucus-turnout-00135322"
  },
  {
    "text": "The real Senate battleground  —  PROGRAMMING NOTE: We'll be off this Monday for Martin Luther King Jr. Day but will be back in your inboxes on Tuesday.  —  THE BUZZ: BANKING ON THE BAY — Reps. Katie Porter and Adam Schiff launched their first TV ads of the Senate campaign this week … ",
    "url": "https://www.politico.com/newsletters/california-playbook/2024/01/12/the-real-senate-battleground-00135240"
  },
  {
    "text": "Statement from President Joe Biden on Early Student Debt Cancellation for Borrowers Enrolled in SAVE  —  From Day One of my Administration, I vowed to fix the student loan system and make sure higher education is a pathway to the middle class - not a barrier to opportunity.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/12/statement-from-president-joe-biden-on-early-student-debt-cancellation-for-borrowers-enrolled-in-save/"
  },
  {
    "text": "EXCLUSIVE: Here's The Tape of Roger Stone Discussing Assassination of Democrats — Which He Denied Ever Doing  —  Roger Stone has contested Mediaite's reporting this week regarding comments he made on tape floating the assassination of two members of Congress.",
    "url": "https://www.mediaite.com/politics/exclusive-heres-the-tape-of-roger-stone-discussing-assassination-of-democrats-which-he-denied-ever-doing/"
  },
  {
    "text": "Hunter Biden reverses course, would sit for closed-door deposition with new subpoena  —  Hunter Biden on Friday reversed course and said he would agree to give closed-door testimony to Congress if the House Oversight and Judiciary committees issue new subpoenas.",
    "url": "https://thehill.com/homenews/house/4405382-hunter-biden-deposition-subpoena/"
  },
  {
    "text": "DOJ to seek death penalty against Buffalo Tops shooter  —  The DOJ said in a court filing on Friday that it believes the death penalty is justified.  —  The Justice Department plans to seek the death penalty for the white gunman who killed 10 people and injured three others in a racist shooting at a Buffalo, New York, grocery store.",
    "url": "https://www.nbcnews.com/news/us-news/doj-seek-death-penalty-buffalo-tops-shooter-rcna133698"
  },
  {
    "text": "Johnson Says He'll Stand by Deal to Avert Shutdown, Spurning Hard-Right Demands  —  The House speaker is facing intense pressure from far-right Republicans to abandon the agreement he struck with Democrats to keep the government from partially shutting down next week.",
    "url": "https://www.nytimes.com/2024/01/12/us/politics/spending-deal-johnson-shutdown.html"
  },
  {
    "text": "Marjorie Taylor Greene Threatens to Vacate Johnson If Ukraine Spending Approved  —  The Georgia Republican previously bashed notions to vacate the speaker, calling it ‘the dumbest thing that could happen’  —  Rep. Marjorie Taylor Greene, R-Ga., on Friday said she will fight pairing supplemental aid … ",
    "url": "https://themessenger.com/politics/marjorie-taylor-greene-threatens-to-vacate-johnson-if-ukraine-spending-approved"
  }
]