[
  {
    "text": "Hacker Is Said to Have Gained Access to File With Damaging Testimony About Gaetz  —  The computer file is said to contain testimony from the woman who said she had sex with Matt Gaetz, President-elect Donald Trump's choice to be attorney general, when she was 17.",
    "url": "https://www.nytimes.com/2024/11/19/us/politics/matt-gaetz-hack-testimony.html?unlocked_article_code=1.bE4.f2SX.A-EoaFu8nQma&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "President-elect Donald Trump is now receiving intelligence briefings  —  Trump took regular intelligence briefings during his first term but has a history of being cavalier with classified information.  —  President-elect Donald Trump, the only former president to have been charged … ",
    "url": "https://www.washingtonpost.com/national-security/2024/11/19/trump-intelligence-cia-odni-secret/"
  },
  {
    "text": "Trump to Pick Howard Lutnick as Commerce Secretary  —  Cantor Fitzgerald chief executive has been a key transition adviser to president-elect  —  WASHINGTON—Donald Trump is expected to nominate veteran Wall Street financier Howard Lutnick to lead the Commerce Department … ",
    "url": "https://www.wsj.com/politics/trump-commerce-secretary-howard-lutnick-cabinet-77c86b81?st=WoXYDH&reflink=article_copyURL_share"
  },
  {
    "text": "Trump Transition Live Updates: Hacker Is Said to Have Obtained Damaging Testimony About Gaetz  —  President-elect Donald J. Trump's attorney general candidate, Matt Gaetz, was investigated, but not charged, with having sex with a 17-year-old girl.  The computer file included testimony from the girl … ",
    "url": "https://www.nytimes.com/live/2024/11/19/us/trump-news-live-updates"
  },
  {
    "text": "Republican bathroom bill targets Congress's first transgender member  —  South Carolina Republican Nancy Mace introduces bill two months before Sarah McBride is to be sworn in  —  After Delaware elected the first ever openly transgender member of Congress earlier this month … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/19/sarah-mcbride-congress-bathroom-bill-transgender"
  },
  {
    "text": "Nancy Mace defends anti-trans bathroom bill, says it ‘absolutely’ targets Sarah McBride  —  McBride, the first out transgender person elected to Congress, will be serving in the House starting next year and Mace doesn't want her using women's bathrooms at the Capitol.",
    "url": "https://www.nbcnews.com/politics/congress/nancy-mace-defends-anti-trans-bathroom-bill-says-absolutely-targets-sa-rcna180805"
  },
  {
    "text": "MTG threatens to fight transgender woman  —  Rep. Marjorie Taylor Greene in a private House GOP conference meeting indicated she'd fight a transgender woman if she tried to use a woman's bathroom on the House side of the Capitol, according to two people in the room, as Congress … ",
    "url": "https://www.politico.com/live-updates/2024/11/19/congress/mtg-threatens-to-fight-transgender-woman-00190344"
  },
  {
    "text": "Senate Republicans deliver a message to Trump: Gaetz's confirmation is in jeopardy  —  They're privately hoping Trump doesn't make them walk the plank.  —  Numerous Republican lawmakers told Donald Trump and his team that they believe his pick to be attorney general, controversial Rep. Matt Gaetz … ",
    "url": "https://www.politico.com/news/2024/11/19/senate-republicans-matt-gaetz-attorney-general-00190332"
  },
  {
    "text": "‘Morning Joe’ meeting with Trump was driven by fears of retribution from incoming administration, sources say  —  New York CNN  —  “Morning Joe” co-hosts Joe Scarborough and Mika Brzezinski announced Monday, in dramatic fashion, that they went to Mar-a-Lago last week for a fence-mending meeting with President-elect Donald Trump.",
    "url": "https://www.cnn.com/2024/11/19/media/morning-joe-trump-mar-a-lago-meeting-fears/"
  },
  {
    "text": "Behind the Mar-a-Lago meeting  —  Joe Scarborough and Mika Brzezinski's fence-mending meeting with President-elect Donald Trump has the media world buzzing.  Now I have some new reporting to share about why it happened.  —  Yesterday, as outraged “Morning Joe” fans registered their objections … ",
    "url": "https://view.newsletters.cnn.com/messages/17320243327424fa19cf3ca3d/raw"
  },
  {
    "text": "The stunning success of vaccines in America, in one chart  —  Measles, mumps, and polio are supposed to be diseases of the past.  In the early to mid-20th century, scientists developed vaccines that effectively eliminated the risk of anyone getting sick or dying from illnesses that had killed millions over millennia of human history.",
    "url": "https://www.vox.com/future-perfect/386215/trump-rfk-jr-vaccines-health-measles-chart"
  },
  {
    "text": "RFK Jr. is a massive public health threat  —  Dems like Jared Polis shouldn't pretend pretend otherwise.  —  ∙ Paid … Donald Trump, in his vacuous orange wisdom, has nominated vaccine denier, crank, and champion of disease Robert F. Kennedy Jr. to be the Secretary of Health and Human Services (HHS).",
    "url": "https://www.publicnotice.co/p/rfk-jr-public-health-threat-vaccines"
  },
  {
    "text": "Prosecutors say sentencing in Trump hush money case can be postponed  —  The president-elect had been scheduled to be sentenced later this month after being convicted of 34 felony counts of falsifying business records.  —  New York prosecutors told the judge who presided … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/prosecutors-say-sentencing-trump-hush-money-case-can-postponed-rcna179238"
  },
  {
    "text": "In reversal, Thune seeks to slow down Biden's judicial nominees  —  In 2020, Thune touted the importance of confirming judges to the bench.  —  Senator John newly elected Senate Majority Leader for the upcoming 119th Congress, speaks to reporters at the U.S. Capitol, Nov. 13, 2024, in Washington.",
    "url": "https://abcnews.go.com/Politics/reversal-thune-seeks-slow-bidens-judicial-nominees/story?id=116010653"
  },
  {
    "text": "The law is clear on birthright citizenship.  Can Trump end it anyway?  —  Ending birthright citizenship has been on President-elect Donald Trump's wish list for years, and he's pledged to kill it once and for all in his next term.  But ending it may not be as easy as he's promised.",
    "url": "https://www.vox.com/policy/386094/birthright-citizenship-trump-2024-immigration"
  },
  {
    "text": "Bucks County board chair says comment about violating election law has been misinterpreted  —  Bucks County Board of Commissioners Chair Diane Ellis-Marseglia said Monday that her comments about violating the Pennsylvania Supreme Court were taken out of context after they set off a national backlash … ",
    "url": "https://www.inquirer.com/politics/election/bucks-county-commissioner-diane-ellis-marseglia-20241118.html"
  },
  {
    "text": "Marjorie Taylor Greene: GOP Covered Up ‘Sexual Harassment and Assault’ Claims  —  THROWING DOWN  —  Rep. Marjorie Taylor Greene (R-GA) made a sensational allegation that her Republican colleagues in Congress have covered up “sexual harassment and assault claims” by paying off victims with taxpayer money.",
    "url": "https://www.thedailybeast.com/marjorie-taylor-greene-gop-covered-up-sexual-harassment-and-assault-claims/"
  },
  {
    "text": "Donald Trump Has NOT Won a Majority of the Votes Cast for President  —  Donald Trump's popular vote total has fallen below 50 percent, and his margin over Kamala Harris has narrowed considerably as all the votes are counted.  —  Pocket  —  “America has given us an unprecedented and powerful mandate … ",
    "url": "https://www.thenation.com/article/politics/donald-trump-vote-margin-narrowed/"
  },
  {
    "text": "Trump's Treasury Challenge: A Pick Who Loves Tariffs Yet Calms Markets  —  The president-elect is considering a conflicting mix of qualities as he decides who will steer his economic agenda.  —  The conflicting goals of President-elect Donald J. Trump's economic agenda have been playing … ",
    "url": "https://www.nytimes.com/2024/11/19/us/politics/trump-treasury-secretary-tariffs.html"
  },
  {
    "text": "Bill Clinton says he wishes he ‘never met’ Jeffrey Epstein in new book  —  Former President Bill Clinton says in his new book that he wishes he “had never met” Jeffrey Epstein, the late convicted sexual offender.  —  In his latest memoir, Citizen: My Life After the White House … ",
    "url": "https://www.washingtonexaminer.com/news/3234712/bill-clinton-wishes-never-met-jeffrey-epstein-new-book/"
  },
  {
    "text": "Texas Education Board Backs Curriculum With Lessons Drawn From Bible  —  School districts serving more than two million elementary school children would be able to adopt a curriculum that draws on the Bible.  —  Texas education officials approved in an initial vote on Tuesday … ",
    "url": "https://www.nytimes.com/2024/11/19/us/texas-bible-curriculum-public-schools.html"
  }
]