[
  {
    "text": "Donald Trump Just Got Served In Federal Isaac Hayes Estate Lawsuit  —  Isaac Hayes III posted on Sunday that Donald Trump and his campaign have been served in their federal lawsuit alleging 134 instances of copyright infringement.  —  The civil lawsuit alleges that Trump and his campaign used … ",
    "url": "https://www.politicususa.com/2024/08/25/trump-served-isaac-hayes-estate.html"
  },
  {
    "text": "Isaac Hayes Estate Marks Victory in Suit Against Trump  —  ‘SEE YOU IN COURT’  —  Isaac Hayes' estate filed a lawsuit this month over Donald Trump's unauthorized use of “Hold On, I'm Coming.”  —  ‘ON THE MEND’  —  According to a statement from the venue, T-Boz suffered “severe nausea, vomiting, and intense abdominal cramps.”",
    "url": "https://www.thedailybeast.com/isaac-hayes-estate-marks-victory-in-suit-against-trump"
  },
  {
    "text": "Kennedy Family Comes Out Swinging Against ‘Obscene’ RFK Jr.  —  ‘WORSE THAN DISAPPOINTMENT’  —  Several prominent Kennedy siblings, including Kerry Kennedy and Max Kennedy, condemned their brother's decision to endorse the Republican nominee for president.",
    "url": "https://www.thedailybeast.com/kennedy-family-comes-out-swinging-against-obscene-rfk-jr"
  },
  {
    "text": "Sunday Snapshot: Trump's ambiguous abortion messaging … 1. GOP lawmakers struggle with Trump's abortion policies … - Philip Klein, the editor of the conservative National Review Online, wrote Friday in a piece titled “Trump's Abandonment of Pro-Lifers Is Complete,” that with his Truth Social post … ",
    "url": "https://www.axios.com/2024/08/25/trump-reproductive-rights-sunday-snapshot"
  },
  {
    "text": "Trump Whines About Fox News as Poll Numbers Keep Dropping  —  ‘WRONG!!’  —  “I don't have to make calls to go on TV, or anything else — They call me!” the former president posted on Sunday.  —  Journalist  —  With 71 days until the election, Donald Trump spent Sunday morning ranting … ",
    "url": "https://www.thedailybeast.com/trump-whines-about-fox-news-as-poll-numbers-keep-dropping"
  },
  {
    "text": "Watch: Scott Jennings laughed at on CNN for claiming 'People don't want to feel joy'  —  It did not take long on Sunday morning for conservative CNN political commentator Scott Jennings to realize he had stepped in it when he claimed, “People don't want to feel joy” during his appearance on “State of the Union.”",
    "url": "https://www.rawstory.com/scott-jennings-cnn-joy/"
  },
  {
    "text": "Scoop: Harris builds an army of House surrogates … - To many House members, the shift is evidence of their new importance under the leadership of Vice President Kamala Harris and Minnesota Gov. Tim Walz, a former House member. … - The center-left New Democrat Coalition polled … ",
    "url": "https://www.axios.com/2024/08/25/kamala-harris-campaign-biden-house-surrogates"
  },
  {
    "text": "House GOP shifts firepower from Biden to Harris and Walz  —  As Democrats enthusiastically turn their attention to the Democratic Party's new presidential ticket, so have House Republicans, who in recent weeks have launched a series of investigations into Vice President Harris and her running mate, Minnesota Gov. Tim Walz.",
    "url": "https://thehill.com/homenews/house/4844771-house-republicans-harris-walz-investigate/"
  },
  {
    "text": "Gen. McMaster's blistering account of the Trump White House  —  Until now, Lt. Gen. H.R. McMaster has held his fire about his stint in the Trump White House.  McMaster served with distinction in key American conflicts of the past decades: the Gulf War, the Iraq War and the war in Afghanistan … ",
    "url": "https://www.cnn.com/2024/08/25/politics/mcmaster-trump-book-account/"
  },
  {
    "text": "Be Careful What Trump's Lawyers Wish For, Superseding Indictment Edition  —  On Friday, first Bloomberg (Yahoo version), then NYT reported that Jack Smith “has decided against seeking a major hearing” to address which of the allegations charged against Donald Trump were official versus unofficial acts.",
    "url": "https://www.emptywheel.net/2024/08/25/be-careful-what-trumps-lawyers-wish-for-superseding-indictment-edition/"
  },
  {
    "text": "The DNC Gave Kamala Harris a Major Boost  —  The campaign raised over $80 million while attracting an army of volunteers.  —  The Democratic National Convention wasn't just four days of good vibes: It was also the cause of a major fundraising and volunteer boom for the Harris-Walz ticket.",
    "url": "https://www.motherjones.com/politics/2024/08/kamala-harris-post-dnc/"
  },
  {
    "text": "McConnell's big fear on the next budget fight … - In a recent meeting with other GOP offices about a short-term spending bill strategy, top McConnell staffers argued that adding a non-citizen voting bill would backfire.  — One fear is such a move would open the door for Democrats to tack … ",
    "url": "https://www.axios.com/2024/08/25/mcconnell-republicans-save-act-immigrant-voting"
  },
  {
    "text": "RFK Jr.'s Secret Service protection ends after suspended campaign  —  Washington —  Robert F. Kennedy Jr., who suspended his third-party presidential bid last week and endorsed former President Donald Trump, has lost his Secret Service protection following the decision to leave the race, his campaign said.",
    "url": "https://www.cbsnews.com/news/rfk-jr-secret-service-protection-over-campaign/"
  },
  {
    "text": "They Served With Trump and Saw the Crazy.  They Should Endorse Harris.  —  Doing the right thing is never the wrong thing.  —  THE MOMENT FROM THE DEMOCRATIC CONVENTION I kept coming back to this weekend wasn't from Oprah or the Obamas, Steph or Steve, Kamala or Doug—not even Gus Walz, America's proudest son.",
    "url": "https://www.thebulwark.com/p/republicans-who-served-with-trump-and-saw-the-crazy-should-endorse-kamala-harris"
  },
  {
    "text": "Trump says Musk wouldn't have time to be in his White House cabinet, but could ‘consult’ … Former President Donald Trump said that Tesla and SpaceX CEO Elon Musk likely couldn't serve in his hypothetical White House cabinet due to the demanding schedule of running his various companies.",
    "url": "https://www.cnbc.com/2024/08/25/trump-elon-musk-white-house-cabinet-election-republicans.html"
  }
]