[
  {
    "text": "Biden's Age, Economic Worries Endanger Re-Election in 2024, WSJ Poll Finds  —  Nearly three-quarters of voters say the president is too old to run again  —  Voters overwhelmingly think President Biden is too old to run for re-election and give him low marks for handling the economy … ",
    "url": "https://www.wsj.com/politics/elections/bidens-age-economic-worries-endanger-re-election-in-2024-wsj-poll-finds-67a7bba8?mod=followamazon"
  },
  {
    "text": "Biden gets low marks on economy and major concerns about his age as he looks to Trump rematch, new poll shows  — Most respondents in a new poll said they think Joe Biden is too old to run for president, while a smaller majority said the same about former President Donald Trump, a new poll showed.",
    "url": "https://www.cnbc.com/2023/09/04/biden-2024-election-poll-trump-economy-old-age-concerns-inflation.html"
  },
  {
    "text": "Chris Christie is actually gaining support for president.  From Democrats.  —  They can't get enough of his new Trump-bashing persona.  —  SALEM, N.H. — Chris Christie is running away with support from at least one major voting bloc in his presidential bid.",
    "url": "https://www.politico.com/news/2023/09/04/new-hampshire-democrats-chris-christie-00111379"
  },
  {
    "text": "From ‘Sleepy Joe’ to ‘Crooked Joe’: Trump tries to redraw his portrait of Biden  —  In 2020, Trump depicted Biden as a feeble old man.  Now, facing criminal charges and eyeing a rematch, he's recasting Biden as a nefarious mastermind manipulating the justice system.  —  WASHINGTON — In 2020, the moniker was “Sleepy Joe.”",
    "url": "https://www.nbcnews.com/politics/2024-election/sleepy-joe-crooked-joe-trump-tries-redraw-portrait-biden-rcna102383"
  },
  {
    "text": "Chinese Gate-Crashers at U.S. Bases Spark Espionage Concerns  —  Washington has tracked about 100 incidents involving Chinese nationals trying to access American military and other installations  —  WASHINGTON—Chinese nationals, sometimes posing as tourists, have accessed military bases … ",
    "url": "https://www.wsj.com/politics/national-security/chinese-gate-crashers-at-u-s-bases-spark-espionage-concerns-cdef8187?mod=followamazon"
  },
  {
    "text": "Why the White House thinks impeachment may prove risky for Republicans  —  And that's not the only political hot spot Biden aides are gearing up to confront.  —  The White House has been gradually preparing for a GOP impeachment inquiry into President Joe Biden and increasingly feels … ",
    "url": "https://www.politico.com/news/2023/09/04/white-house-biden-impeachment-00113824"
  },
  {
    "text": "Mother of trafficked Virginia girl sues school district over secret gender transition  —  EXCLUSIVE — A Virginia mother is suing her local school district in federal court, saying staff there secretly transitioned her daughter, putting her in such dangerous situations that she ran away only to be kidnapped and sex-trafficked.",
    "url": "https://www.washingtonexaminer.com/news/mother-trafficked-virginia-girl-sues-school-gender-transition"
  },
  {
    "text": "An effort to ban caste discrimination in California has touched a nerve  —  California would be the first state to explicitly ban the practice, but the process has been divisive.  —  SACRAMENTO, Calif. — Caste discrimination wasn't on the radar of many lawmakers in California.",
    "url": "https://www.politico.com/news/2023/09/04/ban-caste-discrimination-california-bill-00113817"
  },
  {
    "text": "Twitter accused of helping Saudi Arabia commit human rights abuses  —  Lawsuit says network discloses user data at request of Saudi authorities at much higher rate than for US, UK and Canada  —  The social media company formerly known as Twitter has been accused in a revised civil US lawsuit … ",
    "url": "https://www.theguardian.com/world/2023/sep/04/twitter-saudi-arabia-human-rights-abuses"
  },
  {
    "text": "The California Megachurch Pushing Public Schools to the Far Right  —  From fights over LGBT rights to prayer at school board meetings, Chino Valley public schools have become ground zero for the culture wars.  —  Outside the California State Capitol last month, a fitness trainer turned … ",
    "url": "https://www.thedailybeast.com/california-megachurch-pastor-jack-hibbs-and-his-acolytes-are-pushing-public-schools-to-the-far-right"
  },
  {
    "text": "Wisconsin GOP weighs moves to sideline elections chief and liberal Supreme Court majority  —  Wisconsin Republicans, after a string of losses in hotly contested statewide races, are taking steps toward sidelining the state's nonpartisan elections chief and undercutting the new liberal majority on the state Supreme Court.",
    "url": "https://www.cnn.com/2023/09/04/politics/wisconsin-republicans-election-fight/"
  },
  {
    "text": "Sheep's Trail Incident - Technical Rescue  —  INCIDENT NUMBER INCIDENT TYPE  —  LOCATION: COMMANCHE POINT ROAD BETWEEN EAST ARVIN AND STALLION SPRINGS  —  CLOSEST COMMUNITY: COMMANCHE POINT ROAD BETWEEN EAST ARVIN AND STALLION SPRINGS  —  INCIDENT NARRATIVE",
    "url": "https://kerncountyfire.org/incident-info/sheeps-trail-incident-technical-rescue/?fbcli[%E2%80%A6]AR2BLE7AnG2LTgLTkVZzAqOusSzJy-2UUfL896heXboTeniMLBbrXf2xF5A"
  },
  {
    "text": "What Really Happens When Americans Stop Going to Church  —  People hold on to their politics when they stop attending church.  —  Millions of Americans are leaving church, never to return, and it would be easy to think that this will make the country more secular and possibly more liberal.",
    "url": "https://www.theatlantic.com/ideas/archive/2023/09/christianity-religion-america-church-polarization/675215/"
  },
  {
    "text": "Why Illinois eliminating cash bail is a big deal  —  While red states restrict rights, the Land of Lincoln blazes a more hopeful trail.  —  ∙ Paid … The GOP have turned the states into laboratories of tyranny, innovating a slew of bold, brutal assaults on voting rights … ",
    "url": "https://www.publicnotice.co/p/illinois-eliminates-cash-bail-explained"
  },
  {
    "text": "Iran expands stock of near-weapons grade uranium, IAEA reports no progress  —  Iran's stock of uranium enriched to up to 60% purity, close to weapons grade, continues to grow and there has been no progress in talks with Tehran on sensitive issues such as explaining uranium traces at undeclared sites … ",
    "url": "https://www.reuters.com/world/middle-east/iaea-reports-no-progress-iran-uranium-stock-enriched-60-grows-2023-09-04/"
  }
]