[
  {
    "text": "Judge Threatens to Kick Trump Out of E. Jean Carroll Defamation Trial if He Disrupts Court  —  Trump told the judge he would ‘love it’ if he threw him out of the courtroom  —  The federal judge presiding over Donald Trump's defamation trial on Wednesday warned the former president … ",
    "url": "https://themessenger.com/politics/trump-e-jean-carroll-judge-kaplan-defamation-trial"
  },
  {
    "text": "Trump Recycles Tired 2020 Election Allegations  —  The former president just won't let his loss go, even if that means returning to long-disproven allegations about the outcome.  —  As originally conceived by its inventors, the concept of the “big lie” is supposed to be a tale so audacious and captivating that people can't doubt it.",
    "url": "https://www.nationalreview.com/2024/01/trump-recycles-tired-2020-election-allegations/"
  },
  {
    "text": "New Hampshire Republicans ‘disappointed’ Nikki Haley isn't fighting harder in the state  —  After a third-place showing in Iowa, Haley has kept a light schedule in New Hampshire — baffling Republicans in the state who say she should be doing more.  —  MANCHESTER, N.H. … ",
    "url": "https://www.nbcnews.com/politics/2024-election/new-hampshire-republicans-disappointed-nikki-haley-fighting-trump-rcna134328"
  },
  {
    "text": "Democrat Keen wins state House 35 special election over GOP's Booth  —  In a race seen as a bellwether for Democratic chances in November, Democrat Tom Keen flipped what had been a Republican state House seat in Central Florida in a special election held Tuesday.",
    "url": "https://www.orlandosentinel.com/2024/01/16/democrat-keen-wins-state-house-35-special-election-over-gops-booth/"
  },
  {
    "text": "The ‘Sleeping Giant’ Case that Could Upend Jack Smith's Prosecution of Trump  —  The Supreme Court has agreed to consider a case that doesn't mention the former president, but that could invalidate half of the Jan. 6 charges against him.  —  There's been a lot of attention paid … ",
    "url": "https://www.politico.com/news/magazine/2024/01/17/supreme-court-case-trump-prosecution-00135852"
  },
  {
    "text": "David Weiss Buries Bill Barr Right Alongside Tony Bobulinski  —  For a second time, David Weiss' Special Counsel team has buried an inconvenient (some)body to avoid accounting for the politicization of the investigation they claim is not political.  —  This time, it's Bill Barr.",
    "url": "https://www.emptywheel.net/2024/01/17/david-weiss-buries-bill-barr-right-alongside-tony-bobulinski/"
  },
  {
    "text": "Johnson Digs In Against Border Deal to Unlock Ukraine Aid, Defying Biden  —  Hours before a scheduled meeting at the White House about how to break the stalemate in Congress over aid to Ukraine, the Republican speaker signaled a compromise was not possible.  —  Speaker Mike Johnson … ",
    "url": "https://www.nytimes.com/2024/01/17/us/politics/johnson-biden-border-ukraine.html"
  },
  {
    "text": "‘Survivor’ Champ Kentucky Pol Whose Incest Bill Would Let Cousins Have Sex: ‘I Made a Mistake’ (Exclusive)  —  ‘I was thinking like a lawyer, not like a legislator,’ state Rep. Nick Wilson tells The Messenger  —  A Kentucky Republican introduced a bill on Tuesday that was intended to broaden … ",
    "url": "https://themessenger.com/news/incest-kentucky-cousins-lawmaker-bill-decriminalize-sex-nick-wilson-mistake-republican"
  },
  {
    "text": "Do You Remember the Ecstasy of Electing Joe Biden?  —  How the coalition that defeated Donald Trump crumbled.  —  We danced in the streets when Joe Biden was elected.  Do you remember?  American cities staged the greatest spontaneous outpouring of joy since V-J Day with cars honking … ",
    "url": "https://nymag.com/intelligencer/article/can-joe-biden-win-2024-presidential-election-anti-trump-coalition.html"
  },
  {
    "text": "DeSantis Super PAC Begins Layoffs, Even as He Projects Confidence  —  The number of layoffs at the super PAC, Never Back Down, was unclear on Wednesday morning, but an official said that those being laid off were being paid through the end of January.  —  The super PAC supporting Gov. Ron DeSantis … ",
    "url": "https://www.nytimes.com/2024/01/17/us/politics/desantis-layoffs-super-pac.html"
  },
  {
    "text": "E&C Investigation Uncovers Earliest Known SARS-CoV-2 Sequence Released Outside of China  —  Discovery that shows virus sequence existed two weeks earlier than previously known undercuts China's timeline of events  —  Washington, D.C. — The House Energy and Commerce Committee's investigation … ",
    "url": "https://energycommerce.house.gov/posts/e-and-c-investigation-uncovers-earliest-known-sars-co-v-2-sequence-released-outside-of-china"
  },
  {
    "text": "Right-wing media mogul buys the Baltimore Sun  —  David D. Smith, the executive chairman of Sinclair Broadcast Group (Sinclair), purchased the Baltimore Sun — the largest newspaper in Maryland — for an undisclosed sum.  The acquisition means another powerful media outlet will be under … ",
    "url": "https://popular.info/p/right-wing-media-mogul-buys-the-baltimore"
  },
  {
    "text": "Blinken Stranded After Boeing 737 Breaks Down on Davos Trip  —  US Secretary of State Antony Blinken was unable to fly home from Davos as scheduled on Wednesday due to a critical error with his aircraft. … An oxygen leak detected previously could not be remedied.",
    "url": "https://www.bloomberg.com/news/articles/2024-01-17/blinken-stranded-after-boeing-plane-breaks-down-on-davos-trip"
  },
  {
    "text": "House Hearing Turns Chaotic as GOP Rep, Witness Clash on ‘Family Separation’: ‘Why Are You Laughing!?’  —  ‘Are you psychic?  Have you won the lotto, Mr. Bier?’  Rep. Anna Paulina Luna exclaimed  —  Rep. Anna Paulina Luna, R-Fla., was shocked to find a congressional witness laughing … ",
    "url": "https://themessenger.com/politics/house-hearing-migrants-family-separation-rep-luna-david-bier-clash"
  },
  {
    "text": "Arnold Schwarzenegger detained at German airport over his watch  —  Former Hollywood superstar and politician Arnold Schwarzenegger was detained at an airport in Germany on Wednesday over a watch he was traveling with.  —  Schwarzenegger, best known for his role in The Terminator franchise … ",
    "url": "https://www.washingtonexaminer.com/news/2801952/arnold-schwarzenegger-detained-germany-airport-watch/"
  },
  {
    "text": "The Suicide of an Alabama Mayor Shows That Pre-Stonewall Horrors Aren't Just Coming Back.  They're Here.  — Many Queers Can't Bring Themselves to Face the Emotion They're Really Feeling Right Now.  We Must.  —  The practice of press outlets terrorizing gender-nonconforming people … ",
    "url": "https://slate.com/human-interest/2024/01/bubba-copeland-lgbtq-trans-outing-stonewall-history.html"
  },
  {
    "text": "Phillips takes intra-party heat for scrubbing campaign website's reference to DEI  —  The Minnesota Democrat has already angered others in the caucus with his longshot primary challenge to the president.",
    "url": "https://www.politico.com/live-updates/2024/01/17/congress/phillips-takes-heat-00136071"
  },
  {
    "text": "New Biden rule cracks down on insurers' use of prior authorization  —  A new Biden administration rule released Wednesday aims to streamline the prior authorization process used by insurers to approve medical procedures and treatments.  —  Prior authorization is a common tool used by insurers … ",
    "url": "https://thehill.com/policy/healthcare/4413508-biden-rule-health-insurer-prior-authorization/"
  }
]