[
  {
    "text": "Appeals Court Lets Trump Keep Control of California National Guard in L.A.  —  A panel rejected a lower court's finding that it was likely illegal for President Trump to use state troops to protect immigration agents from protests.  —  A federal appeals court on Thursday cleared … ",
    "url": "https://www.nytimes.com/2025/06/19/us/california-national-guard-trump.html"
  },
  {
    "text": "Trump Buys Himself Time, and Opens Up Some New Options  —  While President Trump appears to be offering one more off ramp to the Iranians, he also is bolstering his own military options.  —  President Trump's sudden announcement that he could take up to two weeks to decide whether to plunge … ",
    "url": "https://www.nytimes.com/2025/06/19/us/politics/trump-buys-time-iran-decision.html"
  },
  {
    "text": "U.S. Spy Agencies Assess Iran Remains Undecided on Building a Bomb  —  U.S. intelligence officials said Iran was likely to pivot toward producing a nuclear weapon if the U.S. attacked a main uranium enrichment site, or if Israel killed its supreme leader.  —  U.S. intelligence agencies continue … ",
    "url": "https://www.nytimes.com/2025/06/19/us/politics/iran-nuclear-weapons-assessment.html"
  },
  {
    "text": "Schumer and Jeffries Need to Step Up and Challenge Trump on War Powers  —  On many issues, Americans are deeply polarized.  War with Iran isn't one of them.  An Economist/YouGov poll of U.S. adults taken in the days after Israel's attack last Friday found that Democrats opposed entering … ",
    "url": "https://www.nytimes.com/2025/06/20/opinion/trump-iran-war-schumer-jeffries.html?unlocked_article_code=1.QU8.zx-S.t1o87IXXAKMe&smid=url-share"
  },
  {
    "text": "Parliamentarian nixes key pieces of Tim Scott's megabill proposal  —  The Senate parliamentarian ruled Thursday that several key provisions in Banking Chair Tim Scott's proposed contribution to the GOP's “big beautiful bill” violate the upper chamber's rules for the budget reconciliation process … ",
    "url": "https://www.politico.com/live-updates/2025/06/20/congress/parliamentarian-banking-republican-megabill-cfpb-00414830"
  },
  {
    "text": "Clyburn Endorses Cuomo, Helping Him Broaden His Appeal to Black Voters  —  Representative James E. Clyburn of South Carolina is endorsing former Gov. Andrew M. Cuomo in the New York City mayor's race as the June 24 primary nears.  —  Representative James E. Clyburn of South Carolina … ",
    "url": "https://www.nytimes.com/2025/06/20/nyregion/clyburn-endorses-cuomo-mayor.html"
  },
  {
    "text": "‘Two Weeks’ Is Trump's Favorite Unit of Time  —  “Two weeks” is one of President Trump's favorite units of time.  It can mean something, or nothing at all.  —  “Within the next two weeks.”  —  That is when President Trump now says he will be ready to make his decision about bombing Iran or not.",
    "url": "https://www.nytimes.com/2025/06/19/world/middleeast/trump-iran-two-weeks.html"
  },
  {
    "text": "Trump says U.S. has ‘too many non-working holidays’ on Juneteenth  —  Meanwhile, former President Joe Biden celebrated the federal holiday he signed into law at a celebration at a historic Black church in Galveston, Texas.  —  President Donald Trump did not formally mark Juneteenth on Thursday … ",
    "url": "https://www.nbcnews.com/politics/politics-news/trump-says-us-many-non-working-holidays-juneteenth-rcna214019"
  },
  {
    "text": "The top priority of progressive politics may be slipping out of reach forever  —  Four years ago, America was on the cusp of the largest expansion of its welfare state since the 1960s.  —  Under Joe Biden in 2021, House Democrats passed legislation that would have established a monthly child allowance … ",
    "url": "https://www.vox.com/politics/417108/trumps-tax-cuts-medicaid-food-stamps-democrats-welfare-state"
  },
  {
    "text": "French Lawmaker Says He Was Denied Entry Into the United States  —  Pouria Amirshahi, a leftist member of Parliament, hopes that the decision will be reversed so that he can travel to meet lawmakers to understand life under President Trump.  —  A French member of Parliament … ",
    "url": "https://www.nytimes.com/2025/06/19/world/europe/france-lawmaker-denied-visa-us-trump-amirshahi.html"
  },
  {
    "text": "Where is the outrage over Skrmetti?  —  The response to Wednesday's U.S. Supreme Court decision upholding Tennessee's law barring transgender minors from obtaining gender-affirming medical care has been muted at best.  —  In its U.S. v. Skrmetti ruling, the Supreme Court's Republican appointees shaved off … ",
    "url": "https://www.lawdork.com/p/where-is-the-outrage-over-skrmetti"
  },
  {
    "text": "Man charged with attempted kidnapping of Democratic Memphis mayor  —  A man was arrested and charged on Wednesday for stalking and attempted kidnapping of the mayor of Memphis, Tennessee.  —  The big picture: Recent political violence and threats against Democrats has unnerved lawmakers in a heightened partisan environment.",
    "url": "https://www.axios.com/2025/06/20/memphis-tennessee-mayor-kidnap-arrest"
  },
  {
    "text": "Mark Cuban: Harris Camp Asked For VP Vetting Papers  —  The former Dallas Mavericks owner declined, saying he wouldn't make a particularly good Number Two.  —  Transcript  —  Last summer, during the height of the presidential campaign—not the Biden v. Trump one, the Harris v. Trump one … ",
    "url": "https://www.thebulwark.com/p/mark-cuban-harris-camp-asked-for"
  },
  {
    "text": "Washington cherry growers struggle to find pickers  —  The threat of federal immigration agents raiding orchards in central Washington is causing a labor shortage that has compelled some Washington producers to leave cherries unpicked or delay their harvests until the fruit overripens and is worth less money.",
    "url": "https://www.spokesman.com/stories/2025/jun/18/washington-cherry-growers-struggle-to-find-pickers/"
  },
  {
    "text": "Six former CDC vaccine advisory committee chairs warn: U.S. risks losing access to life-saving immunizations  —  Vaccine development, licensure, recommendations, and monitoring are all under attack  —  As former chairs of the CDC's Advisory Committee on Immunization Practices (",
    "url": "https://www.statnews.com/2025/06/20/acip-cdc-vaccine-advisory-committee-chairs-warn-threats-immunization-science-licensure/"
  },
  {
    "text": "Trump's DOJ Goes ‘Judge Shopping’ in Texas  —  Prof. Stephen Vladeck replies to ‘A Legal Ambush Against Dreamers.’  —  Your otherwise fine editorial “A Legal Ambush Against Dreamers” (June 17) neglects to mention a key feature of the lawsuit the Justice Department filed against Texas to obtain … ",
    "url": "https://www.wsj.com/opinion/trumps-doj-goes-judge-shopping-in-texas-dreamers-district-court-ad5b5592?st=s1pLCN&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Cybercriminals breach Aflac as part of hacking spree against US insurance industry  —  Cybercriminals have breached insurance giant Aflac, potentially stealing Social Security numbers, insurance claims and health information, the company said Friday, the latest in a spree of hacks against the insurance industry.",
    "url": "https://cnn.com/2025/06/20/tech/aflac-cyberattack"
  },
  {
    "text": "Tuition Increases and Layoffs Are Coming to a Broad Set of Universities  —  Schools say the Trump administration's cuts to higher education are forcing them to consider extreme cost-cutting measures, even as more students than ever are heading to college this year.",
    "url": "https://www.nytimes.com/2025/06/20/us/tuition-hikes-layoffs-universities.html"
  },
  {
    "text": "Axios-Ipsos poll: Americans want to force presidents to share health records  —  Eight in 10 Americans want legally required and publicly released cognitive tests and disease screenings for U.S. presidents — and age limits on the presidency, according to the latest Axios-Ipsos American Health Index.",
    "url": "https://www.axios.com/2025/06/20/axios-ipsos-poll-president-elected-officials-health"
  },
  {
    "text": "GOP Senator Mike Lee Hit With Community Note Over Land Bill Claim  —  Fact-checkers warn the legislation gives broad discretion  —  Senator Mike Lee (R-UT) attempted to downplay the scope of a controversial Senate bill that allows for the disposal of certain federal lands, insisting on that the bill … ",
    "url": "https://meidasnews.com/news/gop-senator-mike-lee-hit-with-community-note-over-land-bill-claim"
  },
  {
    "text": "The myth of Republican isolationism  —  I'm driving back home today from a short vacation in the Smokies, so the Chart of the Week will be brief.  I could have taken the day off, but I didn't want to miss a week, and more importantly I had some thoughts on the politics of potential intervention in Iran to write down.",
    "url": "https://www.gelliottmorris.com/p/the-myth-of-republican-isolationism"
  },
  {
    "text": "What children in poverty could lose from the ‘Big Beautiful Bill’  —  Low-income children and families would be among the groups hit hardest by Republicans' One Big Beautiful Bill Act.  —  While the bill would be a boon to wealthy Americans, it would scale back resources for the nation's poorest households … ",
    "url": "https://www.npr.org/2025/06/20/nx-s1-5437851/children-poverty-republicans-big-beautiful-bill-reconciliation"
  }
]