[
  {
    "text": "Trump's invite to major donors prioritizes the committee paying his legal bills over the RNC  —  Donald Trump's new joint fundraising agreement with the Republican National Committee directs donations to his campaign and a political action committee that pays the former president's legal bills … ",
    "url": "https://apnews.com/article/trump-campaign-fundraising-rnc-c0e8f1e7b59f70c5237e13a3462e5790"
  },
  {
    "text": "New York Attorney General takes initial step to prepare to seize Trump assets  —  The New York attorney general's office has filed judgments in Westchester County, the first indication that the state is preparing to try to seize Donald Trump's golf course and private estate north of Manhattan, known as Seven Springs.",
    "url": "https://www.cnn.com/2024/03/21/politics/trump-calls-ny-attorney-generals-bond-suggestions-impractical-and-unjust/"
  },
  {
    "text": "NY Gears Up to Seize Trump Westchester Assets If Fraud Fine Is Unpaid  — State registered $454 million judgment in Westchester County  — Area is home to a Trump golf course and Seven Springs estate  —  New York state's $454 million judgment against Donald Trump in a civil fraud lawsuit … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-21/ny-poised-to-seize-trump-westchester-assets-if-fraud-fine-unpaid"
  },
  {
    "text": "Attorney General Prepares to Seize Trump's Massive New York Estate  —  Letitia James has effectively put a “blanket lien” on his sprawling, 212-acre property north of New York City.  —  Donald Trump, unable to front a half billion dollars to pay off his recent bank fraud judgment … ",
    "url": "https://www.thedailybeast.com/attorney-general-prepares-to-seize-trumps-massive-new-york-estate"
  },
  {
    "text": "Trump Is in Line for a $3.5 Billion Windfall From Stake in Truth Social  —  Supporters who have driven up share price are expected to vote Friday to take company public  —  Donald Trump's supporters are pushing to hand him a nearly $3.5 billion windfall by driving up the value … ",
    "url": "https://www.wsj.com/finance/stocks/trump-is-in-line-for-a-3-5-billion-windfall-from-his-stake-in-truth-social-eae58c9d"
  },
  {
    "text": "The ex-Democrat catching Trump's and Robert F. Kennedy Jr.'s eyes  —  Former Rep. Tulsi Gabbard has gone from running for president as a Democrat in 2020 to interest in the open VP slots for Trump and Kennedy in 2024.  —  Tulsi Gabbard wanted to be president.  Now she wants to be vice president.",
    "url": "https://www.nbcnews.com/politics/2024-election/ex-democrat-catching-trumps-robert-f-kennedy-jrs-eyes-rcna143941"
  },
  {
    "text": "Trump Told Pence Certifying Election Would Be ‘Career Killer,’ Valet Testified  —  President Donald J. Trump warned his vice president against failing to overturn the 2020 election results, according to an account by the White House valet by his side on Jan. 6.",
    "url": "https://www.nytimes.com/2024/03/21/us/trump-pence-jan-6-white-house-valet.html"
  },
  {
    "text": "Biden Leads in 6 New Polls, The Booming American Economy, The Republican Party Is Broke and Broken  —  Big Day Today - With Dems at 1pm ET, Ruben Gallego at 8pm - Join Us!  —  Happy Thursday all.  Got a few things for you today:  —  2 Events Today - Register, Join Us!",
    "url": "https://www.hopiumchronicles.com/p/biden-leads-in-6-new-polls-the-booming"
  },
  {
    "text": "Biden's Campaign Is In Trouble.  Will the Turnaround Plan Work?  —  Last June, Barack Obama slipped into the White House to deliver a warning to Joe Biden.  The state of Biden's re-election campaign was shaky, Obama told him over a private lunch, according to a Democrat briefed about the meeting.",
    "url": "https://time.com/6958784/biden-campaign-strategy-problems-2024/"
  },
  {
    "text": "House Republicans Want to Ban Universal Free School Lunches  —  On Wednesday, the Republican Study Committee, of which some three-quarters of House Republicans are members, released its 2025 budget entitled “Fiscal Sanity to Save America.”  Tucked away in the 180-page austerity manifesto … ",
    "url": "https://theintercept.com/2024/03/21/house-republicans-ban-universal-school-lunches/"
  },
  {
    "text": "Cannon Fodder: Law Clerks Quit On Judge Aileen Cannon  —  Welcome to Original Jurisdiction, the latest legal publication by me, David Lat.  You can learn more about Original Jurisdiction by reading its About page, and you can email me at davidlat@substack.com.",
    "url": "https://davidlat.substack.com/p/judge-aileen-cannon-law-clerks-quit-on-her"
  },
  {
    "text": "House Republicans Resurrect Plan to Gut Social Security and Medicare  —  While progressive politicians and unions are fighting to grant Americans four-day workweeks, Republicans are looking to achieve the complete opposite.  —  On Wednesday, the Republican Study Committee … ",
    "url": "https://newrepublic.com/post/180029/house-republicans-plan-raise-retirement-age-social-security"
  },
  {
    "text": "Sen. Menendez, who is facing corruption charges, won't seek reelection as a Democrat  —  Sen. Bob Menendez, D-N.J., who is fighting federal corruption charges, said Thursday that he will not file to run for reelection in the Democratic primary but added he hopes to be exonerated and run as an independent.",
    "url": "https://npr.org/2024/03/21/1240044252/robert-menendez-reelection"
  },
  {
    "text": "Dems flip script on GOP crime agenda, targeting RNC convention plans with surprising name  —  The DNC says reports Paul Manafort could help with RNC convention are evidence of Donald Trump's ‘soft-on-crime’ agenda  —  FIRST ON FOX: Democrats are launching a major attack on Republicans' plans … ",
    "url": "https://www.foxnews.com/politics/dems-flip-script-gop-crime-agenda-targeting-rnc-convention-plans?intcmp=tw_fnc"
  },
  {
    "text": "Leonard Leo, Koch networks pour millions into groups prepping for potential second Trump administration  —  A review by the progressive advocacy group Accountable.US shows $55 million flowing from Leo- and Koch-backed groups.  —  WASHINGTON — Huge funding from influential conservative donor networks … ",
    "url": "https://www.nbcnews.com/politics/2024-election/leonard-leo-koch-networks-pour-millions-prep-potential-second-trump-ad-rcna144360"
  },
  {
    "text": "Ken Buck becomes first Republican to sign Democrats' discharge petition for Ukraine aid  —  Rep. Ken Buck (Colo.) became the first GOP member to sign the House Democrats' aid discharge position on Thursday, just one day before he is set to retire from Congress.",
    "url": "https://thehill.com/homenews/house/4548713-ken-buck-becomes-first-republican-to-sign-democrats-discharge-petition-for-ukraine-aid/"
  },
  {
    "text": "Apple sued by Biden administration over alleged iPhone ‘monopoly power’  —  The Department of Justice and 16 state and district attorneys general launched a major lawsuit against the technology giant accusing it of harming consumers by limiting competition.  —  The U.S. Department … ",
    "url": "https://www.nbcnews.com/business/business-news/apple-sued-doj-antitrust-monopoly-biden-rcna144424"
  },
  {
    "text": "Tennessee Governor signs bill that protects musicians against artificial intelligence  —  Tennessee became the first state to protect its residents' voice rights on Thursday when Gov. Bill Lee (R) signed the ELVIS Act, designed to protest musicians from artificial intelligence replication.",
    "url": "https://thehill.com/homenews/state-watch/4548858-tennessee-governor-signs-bill-that-protects-musicians-against-artificial-intelligence/"
  },
  {
    "text": "78,000 more public workers are getting student loans canceled through Biden administration changes  —  Another 78,000 Americans are getting their federal student loans canceled through a program that helps teachers, nurses, firefighters and other public servants, the Biden administration announced Thursday.",
    "url": "https://apnews.com/article/student-loan-cancellation-debt-forgiveness-public-service-d711e00aa4655745bccdff8a5a2625e6"
  },
  {
    "text": "IMF board okays $880 million loan payment for Ukraine, sees war winding down in '24  —  The International Monetary Fund's executive board on Thursday approved a third review of Ukraine's $15.6 billion loan program, allowing the release of $880 million for budget support and bringing total disbursements to $5.4 billion, the IMF said.",
    "url": "https://www.reuters.com/world/imf-board-okays-880-million-loan-payment-ukraine-sees-war-winding-down-24-2024-03-21/"
  },
  {
    "text": "Over 100 migrants break through razor wire, knock down guards as they illegally cross El Paso border in wild scene  —  EL PASO, TEXAS — A group of over 100 migrants attempted to enter the US illegally by rushing a border wall Thursday, breaking through razor wire and knocking over guards in the process.",
    "url": "https://nypost.com/2024/03/21/us-news/migrants-break-barriers-and-rush-border-guards-in-el-paso/"
  },
  {
    "text": "Chris Christie not ruling out No Labels bid  —  Former New Jersey Gov. Chris Christie (R) is not ruling out running on a potential No Labels ticket in the 2024 presidential election.  —  The former GOP presidential candidate, who dropped his White House bid in January … ",
    "url": "https://thehill.com/homenews/campaign/4548220-chris-christie-not-ruling-out-no-labels-bid/"
  },
  {
    "text": "The Bobulinski Meltdowns Were Glorious  —  On this full episode of LARRY, we discuss the MANY temper tantrums thrown by Democrats in the Hunter Biden corruption hearing yesterday in the House Oversight Committee, a SERIOUS TAKEDOWN of a Biden nominee by Senator John Kennedy … ",
    "url": "https://hotair.com/videos/2024/03/21/the-bobulinski-meltdowns-were-glorious-n3785159"
  }
]