[
  {
    "text": "Defense pick Hegseth paid accuser but denies sexual assault, attorney says  —  Documents obtained by The Post provide extensive detail about allegation and the response by Trump's defense secretary pick.  —  Pete Hegseth, President-elect Donald Trump's pick for secretary of defense … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/16/pete-hegseth-sexual-assault-accuser-paid/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMxNzMzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMzMTE1NTk5LCJpYXQiOjE3MzE3MzMyMDAsImp0aSI6IjBhYTFkOWE3LWQ3YzAtNGJkZi1iODExLWFjZmE3MzMzYWQ4ZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzExLzE2L3BldGUtaGVnc2V0aC1zZXh1YWwtYXNzYXVsdC1hY2N1c2VyLXBhaWQvIn0.taA1whYLQ3FV4lj5EpmAipAymzU03UcBrTwLwnL2KI8&itid=gfta"
  },
  {
    "text": "Trump picks fracking firm CEO Chris Wright to be energy secretary  —  The executive has taken a defiant approach to fighting climate change by attacking policies that call for shifting away from fossil fuels.",
    "url": "https://www.washingtonpost.com/politics/2024/11/16/energy-secretary-trump-chris-wright/"
  },
  {
    "text": "Trump taps oil executive Chris Wright as Energy secretary  —  The oil executive and GOP fundraiser disputes the need to fight against climate change.  —  President-elect Donald Trump named Chris Wright, head of a Denver-based oil service company and a vocal opponent of government action … ",
    "url": "https://www.politico.com/news/2024/11/16/chris-wright-energy-secretary-trump-00189456"
  },
  {
    "text": "Tesla Has the Highest Fatal Accident Rate of All Auto Brands, Study Finds  —  Tesla vehicles suffer fatal accidents at a rate that's twice the industry average, according to a new report.  —  Tesla's vehicles have the highest fatal accident rate among all car brands in America … ",
    "url": "https://www.roadandtrack.com/news/a62919131/tesla-has-highest-fatal-accident-rate-of-all-auto-brands-study/"
  },
  {
    "text": "Trump transition team compiling list of current and former U.S. military officers for possible courts-martial  —  All of the officers were involved in the chaotic U.S. withdrawal from Afghanistan, which independent reviews have blamed on both the Trump and Biden administrations.",
    "url": "https://www.nbcnews.com/politics/politics-news/trump-transition-team-compiling-list-current-former-us-military-office-rcna180489"
  },
  {
    "text": "Trump won.  The celebrations started.  Then the trouble began.  —  The president-elect has been operating off his own script, making Cabinet picks that have posed immediate political challenges.",
    "url": "https://www.washingtonpost.com/politics/2024/11/16/trump-transition-cabinet-controversy/"
  },
  {
    "text": "Jay Bhattacharya, an NIH critic, emerges as a top candidate to lead the agency  —  The Stanford physician was excoriated by NIH's director in 2020 for his “fringe” ideas on covid.  Four years later, he's poised for power in Trump's Washington.",
    "url": "https://www.washingtonpost.com/health/2024/11/16/nih-director-jay-bhattacharya-covid-great-barrington-declaration/"
  },
  {
    "text": "Editor-in-chief of Scientific American steps down after anti-Trump comments  —  The magazine's top editor wrote several profanity-laced social media posts about the results of the election. … Scientific American editor-in-chief Laura Helmuth is leaving the publication less than two weeks … ",
    "url": "https://www.nbcnews.com/science/science-news/scientific-american-editor-chief-leaves-anti-trump-comments-rcna180400"
  },
  {
    "text": "Readout of President Joe Biden's Meeting with President Xi Jinping of the People's Republic of China  —  President Joseph R. Biden Jr. met with President Xi Jinping of the People's Republic of China (PRC) in Lima, Peru today.  This meeting is the third between the two Presidents and follows their April 2, 2024, telephone call.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/11/16/readout-of-president-joe-bidens-meeting-with-president-xi-jinping-of-the-peoples-republic-of-china-3/"
  },
  {
    "text": "When Will Democrats Learn to Say No?  —  When Donald Trump held a rally in the Bronx in May, critics scoffed that there was no way he could win New York State.  Yet as a strategic matter, asking the question “What would it take for a Republican to win New York?” leads to the answer … ",
    "url": "https://www.nytimes.com/2024/11/16/opinion/democrats-interest-groups-majority.html"
  },
  {
    "text": "Elon Musk pushes Lutnick for Treasury  —  The billionaire Trump confidant posted an endorsement on his social media network on Saturday.  —  Elon Musk is backing Donald Trump's transition co-chair Howard Lutnick to lead the Treasury Department, touting the billionaire CEO of Cantor Fitzgerald … ",
    "url": "https://www.politico.com/news/2024/11/16/elon-musk-backs-lutnick-for-treasury-00190015"
  },
  {
    "text": "A majority of Senate Republicans doubt Matt Gaetz will be confirmed as attorney general, sources say  —  More than half of Senate Republicans, including some in senior leadership positions, privately say they don't see a path for the former Florida representative, according to a number of Republican sources.",
    "url": "https://www.nbcnews.com/politics/justice-department/majority-senate-republicans-doubt-matt-gaetz-confirm-attorney-general-rcna180464"
  },
  {
    "text": "Trump Allies Were Told to Stop Saying They'll Put Migrants in ‘Camps’  —  “Apparently some people think it makes us look like Nazis,” says a close Trump ally … To be sure, Trump's migrant expulsion program, if he were to follow through with his plans to deport millions … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-allies-migrants-camps-miller-homan-1235168998/"
  },
  {
    "text": "Kamala Harris raised $1 billion-plus in defeat.  She's still sending persistent appeals to donors  —  Kamala Harris and the Democratic Party's prodigious fundraising operation raised more than $1 billion in her loss to Donald Trump, but the vice president is still pushing donors for more money after the election.",
    "url": "https://apnews.com/article/harris-postelection-fundraising-dnc-gaetz-trump-donors-806eeb3b92eced3242aeb29a964ca259"
  },
  {
    "text": "Harris' campaign blew $2.6M on private jets in final weeks of campaign  —  Vice President Kamala Harris' campaign shelled out $2.6 million on private jet travel in the final, dying gasps of her presidential run — bringing her failed campaign's total tally on the environmentally unfriendly mode … ",
    "url": "https://nypost.com/2024/11/16/us-news/harris-campaign-blew-2-6m-on-private-jets-in-final-weeks-of-campaign/"
  },
  {
    "text": "Under the Chandelier at Mar-a-Lago, Trump Makes Picks at Breakneck Speed  —  President-elect Donald J. Trump is more contemptuous than ever of Washington expertise and determined to hire people based on loyalty.  —  President-elect Donald J. Trump chose his attorney general almost on a whim … ",
    "url": "https://www.nytimes.com/2024/11/16/us/politics/trump-transition-picks.html"
  }
]