[
  {
    "text": "Operation Marg Bar Sarmachar  —  This morning Pakistan undertook a series of highly coordinated and specifically targeted precision military strikes against terrorist hideouts in Siestan-o-Baluchistan province of Iran.  A number of terrorists were killed during the Intelligence-based operation - codenamed *'Marg Bar Sarmachar'*.",
    "url": "https://mofa.gov.pk/press-releases/operation-marg-bar-sarmachar"
  },
  {
    "text": "Houthis Say They're Improving Military Might in Defiance of US  —  Yemen's Houthis vowed they would keep attacking ships in the Red Sea, even after the US launched a fourth round of missiles strikes against them.  —  “It is an honor for our people to be in such a confrontation with these evil forces … ",
    "url": "https://www.bloomberg.com/news/articles/2024-01-18/houthis-say-they-re-improving-military-might-in-defiance-of-us"
  },
  {
    "text": "The GOP Is Already Clashing Over Trump's VP Pick  —  While Trump tries to sew up the nomination, his camp is already feuding about his future running mate — and hoping it isn't Nikki Haley.  —  As the vice-presidential field continues to develop, many consider what a Nikki Haley vice presidency could mean for the GOP.",
    "url": "https://www.politico.com/news/magazine/2024/01/18/maga-nightmare-trump-loyalists-move-to-head-off-haley-vp-pick-00136282"
  },
  {
    "text": "Justice Department report finds ‘critical failures’ in response to Uvalde attack  —  Listen To Our Podcast  —  Every weekday, NPR's best political reporters are there to explain the big news coming out of Washington and the campaign trail.  They don't just tell you what happened.",
    "url": "https://www.npr.org/2024/01/18/1225340219/uvalde-report"
  },
  {
    "text": "Uvalde school massacre could have been stopped sooner, DOJ report finds  —  Officers had many opportunities as the 2022 school massacre in Uvalde, Texas, was still unfolding to reassess their flawed response to the shooting that left 19 children and two teachers dead, the US Justice Department concludes in a damning new report.",
    "url": "https://www.cnn.com/2024/01/18/us/attorney-general-garland-uvalde-victims-thursday?Date=20240118&Profile=cnnbrk"
  },
  {
    "text": "Florida bill could lead to ban on pride flags in schools, government buildings  —  Florida lawmakers are mulling legislation that would ban gay pride flags and flags representing other political movements from flying on public properties, including schools and college campuses.",
    "url": "https://thehill.com/homenews/state-watch/4415582-florida-bill-ban-pride-flags-schools-government-buildings/"
  },
  {
    "text": "'We've got to earn reelection': VP Kamala Harris talks about 2024 campaign, women's rights on ‘The View’  —  Harris says Americans are scared about the future of reproductive rights.  —  Vice President Kamala Harris speaks on “The View” on Jan. 17, 2024.  —  Vice President Kamala Harris stopped … ",
    "url": "https://abcnews.go.com/US/weve-earn-reelection-vp-kamala-harris-talks-2024/story?id=106411300"
  },
  {
    "text": "“Here's why that's bad news for Biden”: A chat with NYT Pitchbot  —  The legend himself speaks to Public Notice.  —  ∙ Paid … If you're active on twitter — or were before Elon Musk started making everyone more progressive than Steve Bannon think about deleting their account … ",
    "url": "https://www.publicnotice.co/p/doug-balloon-new-york-times-pitchbot-interview"
  },
  {
    "text": "Donald Trump Has Chosen to Pay Millions to Trash Rule of Law  —  I have a standing complaint that reporters serially fall into Donald Trump's trap of reporting on his courtroom tantrums rather than the evidence of his fraud and crime presented therein.  But I'm going to do just that … ",
    "url": "https://www.emptywheel.net/2024/01/18/donald-trump-has-chosen-to-pay-millions-to-trash-rule-of-law/"
  },
  {
    "text": "Texas refuses to comply with Biden administration's cease-and-desist letter on border access  —  The Department of Homeland Security had directed the state to stop blocking the U.S. Border Patrol's access to roughly 2½ miles of the U.S.-Mexico border.",
    "url": "https://www.nbcnews.com/politics/immigration/texas-refuses-comply-biden-administrations-cease-desist-letter-border-rcna134423"
  },
  {
    "text": "Loose bolts open door to racism  —  On January 5th, a Boeing 737 Max 9 aircraft operated by Alaska Airlines was forced to make an emergency landing after a door panel flew off mid-air.  No deaths were reported, but multiple passengers required medical attention, officials said.",
    "url": "https://popular.info/p/loose-bolts-open-door-to-racism"
  },
  {
    "text": "Introducing the New England DEI Patriots  —  If racism is America's original sin, then Democrats and others on the Left are the biblical Babylonians of the 21st century.  For a group of people who claim to want racism gone, they wickedly do everything possible to make sure it remains alive — or at least the insinuation of it.",
    "url": "https://www.washingtonexaminer.com/opinion/beltway-confidential/2803337/introducing-the-new-england-dei-patriots/"
  },
  {
    "text": "Conservative justices, lawyers ready a path for ending agency deference  —  In nearly four hours of arguments on Wednesday, the justices of the U.S. Supreme Court debated who should be deciding how are laws in our country are implemented.  By the end of the arguments, the six-justice … ",
    "url": "https://www.lawdork.com/p/scotus-chevron-deference-arguments"
  },
  {
    "text": "Trump warns campaigns: Do not hire ex-DeSantis operative Jeff Roe  —  The admonition is another example of the former president's penchant for punishing people perceived as disloyal.  —  Former President Donald Trump and people in his inner circle have told down-ballot Republican candidates … ",
    "url": "https://www.politico.com/news/2024/01/18/trump-jeff-roe-republican-strategist-00136240"
  },
  {
    "text": "This GOP Rep.'s Anti-Abortion Stances Keep Vanishing From Her Website  —  Rep. Monica De La Cruz (R-TX) initially ran for Congress with an unabashed anti-abortion stance.  Ever since then, abortion has quietly been disappearing from her campaign website.",
    "url": "https://www.thedailybeast.com/rep-monica-de-la-cruzs-anti-abortion-stances-keep-vanishing-from-her-website"
  },
  {
    "text": "United States of Ozempic: Where anti-obesity drugs are taking off  —  For every 1,000 people in Kentucky, roughly 21 were prescribed a drug that belongs to a buzzy class of diabetes and anti-obesity medications last year — the highest rate of any state, according to insurance claims data provided … ",
    "url": "https://www.axios.com/2024/01/18/ozempic-wegovy-weight-loss-drugs-states-map"
  },
  {
    "text": "Missouri Could Become the Latest State to Put Abortion on the Ballot in 2024  —  Abortion rights activists have scored a series of wins since the Supreme Court overturned Roe v. Wade, and voters in more states could weigh in on the issue this year  —  Missouri could become the latest state … ",
    "url": "https://themessenger.com/politics/missouri-could-become-the-latest-state-to-put-abortion-on-the-ballot-in-2024"
  },
  {
    "text": "John Fetterman Endorses Andy Kim in High-Stakes New Jersey Senate Primary  —  The Pennsylvania senator, the first among his colleagues to weigh in on the primary battle to oust the indicted Senator Robert Menendez, said he had concerns about Tammy Murphy's G.O.P. history.",
    "url": "https://www.nytimes.com/2024/01/18/us/politics/john-fetterman-andy-kim-new-jersey-senate.html"
  },
  {
    "text": "Jamie Dimon praises Trump, warns MAGA criticism could hurt Biden  — JPMorgan Chase CEO Jamie Dimon praised former President Donald Trump's positions on the economy, taxes and immigration.  — Dimon admonished Democrats to be “more respectful” toward Trump's supporters, or else risk hurting President Joe Biden's reelection bid.",
    "url": "https://www.cnbc.com/2024/01/17/jamie-dimon-praises-trump-warns-maga-criticism-could-hurt-biden.html"
  }
]