[
  {
    "text": "Johnson's spending holdouts  —  Presented by IN TODAY'S EDITION:  — Johnson, White House hammer holdouts  — Thune taps a debt-limit whisperer  — More tax complications on GOP agenda  —  EAT LIKE A LAWMAKER — POLITICO Magazine is out this morning with a rundown of where Republicans … ",
    "url": "https://www.politico.com/newsletters/inside-congress/2025/03/11/johnsons-spending-holdouts-00223195"
  },
  {
    "text": "House Democrats push to sink GOP spending bill but Senate Dems act coy  —  Hakeem Jeffries and House Democrats are ready to seize on the first big leverage point of President Donald Trump's second term, lining up against a bill to avert a government shutdown this week.",
    "url": "https://www.cnn.com/2025/03/11/politics/democrats-gop-government-funding-bill/"
  },
  {
    "text": "Transcript: Trump Is Sinking.  Here's Why Dems Shouldn't Save Him.  —  The following is a lightly edited transcript of the March 11 episode of the Daily Blast podcast.  Listen to it here.  —  Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network.",
    "url": "https://newrepublic.com/article/192575/transcript-trump-sinking-heres-dems-shouldnt-save-him"
  },
  {
    "text": "Vance gives hard sell for spending patch to House Republicans  —  Vice President JD Vance told House Republicans hours ahead of an expected vote on a seven-month funding patch on Tuesday that Republicans will take the blame for a government shutdown if they don't pass the legislation … ",
    "url": "https://www.politico.com/live-updates/2025/03/11/congress/jd-vance-house-gop-shutdown-stopgap-00223400"
  },
  {
    "text": "The Trump team's slippery justification for deporting Mahmoud Khalil  —  This could be a seminal free speech case, if only the administration would say precisely what it's about.  —  Just now  —  The Trump administration's apparent attempt to deport pro-Palestinian activist Mahmoud Khalil … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/11/trump-khalil-justification/"
  },
  {
    "text": "Marco Rubio Personally Signed Off to Detain Mahmoud Khalil on ‘Foreign Policy Grounds,’ Sources Confirm  —  Marco Rubio personally signed off on the arrest of Palestinian Columbia University student protest negotiator Mahmoud Khalil, using a narrow, little-used authority given to the secretary of state … ",
    "url": "https://zeteo.com/p/marco-rubio-personally-signed-off"
  },
  {
    "text": "What Really Happened With the DDoS Attacks That Took Down X  —  Elon Musk said a “massive cyberattack” disrupted X on Monday and pointed to “IP addresses originating in the Ukraine area” as the source of the attack.  Security experts say that's not how it works.",
    "url": "https://www.wired.com/story/x-ddos-attack-march-2025/"
  },
  {
    "text": "Ontario suspending 25% surcharge on provincially generated electricity purchased by U.S. states  —  Move comes after Trump threatened Ontario ‘will pay a financial price’ for levy  —  Ontario is suspending its promise to add a 25 per cent surcharge on exports of electricity to some U.S. states … ",
    "url": "https://www.cbc.ca/news/canada/toronto/trump-ford-ontario-electricity-tariffs-trade-war-1.7480234"
  },
  {
    "text": "Trump raises Canadian steel, aluminum tariffs to 50% in retaliation for Ontario energy duties … President Donald Trump said Tuesday he has ordered his administration to raise tariffs on Canadian steel and aluminum imports by an additional 25%, bringing the total duties to 50%.",
    "url": "https://www.cnbc.com/2025/03/11/trump-raises-canadian-steel-aluminum-tariffs-to-50percent-in-retaliation-for-ontario-energy-duties.html"
  },
  {
    "text": "US to Require Some Canadian Visitors to Register With DHS Agency  —  President Donald Trump's administration is preparing a new travel rule that could force Canadians planning to stay in the country for more than 30 days to register their information with the US government and submit to fingerprinting.",
    "url": "https://www.bloomberg.com/news/articles/2025-03-11/trump-moves-to-require-registration-of-some-canadian-visitors"
  },
  {
    "text": "His Daughter Was America's First Measles Death in a Decade  —  A visit with a family in mourning  —  Peter greeted me in the mostly empty gravel parking lot of a Mennonite church on the outskirts of Seminole, a small city in West Texas surrounded by cotton and peanut fields.",
    "url": "https://www.theatlantic.com/health/archive/2025/03/texas-measles-outbreak-death-family/681985/?gift=HoRfrgrF5SCKopc-hfobxEUvk03OSejCTaTqLCgRjL8&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "How the US economy went from booming to a recession scare in only 20 days  —  New York CNN  —  Just 20 days ago, the US stock market was sitting at all-time highs.  The US economy appeared to be growing at a solid pace.  And a recession was nowhere in sight.  —  Now, the R-word is seemingly everywhere.",
    "url": "https://www.cnn.com/2025/03/11/business/recession-economy-trump-dow-stocks/"
  },
  {
    "text": "Trump Cries for Elon, Blames ‘Illegal’ Liberal Boycott for Tanking Tesla  —  The president is feeling sorry for the world's richest man as the duo's actions wreak havoc on the stock market … The president's trade wars have been tanking the stock market, and Musk's signature company, Tesla, has been along for the ride.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-cries-elon-illegal-liberal-boycott-tesla-1235293465/"
  },
  {
    "text": "Ukraine willing to accept 30-day ceasefire with Russia as U.S. lifts freeze on aid and intelligence  —  Jeddah, Saudi Arabia — The U.S. and Ukraine said Kyiv would accept a 30-day ceasefire with Russia after talks in Saudi Arabia on Tuesday, with Washington pledging to immediately lift … ",
    "url": "https://www.cbsnews.com/news/ukraine-ceasefire-russia-us-talks-saudi-arabia/"
  },
  {
    "text": "USDA halts more than $100M in funding for University of Maine System programs  —  The move temporarily pauses USDA funding for Maine's university system after President Donald Trump threatened to cut off the state over Maine's decision to allow transgender athletes to compete in sports.",
    "url": "https://www.pressherald.com/2025/03/11/usda-halts-funding-for-all-university-of-maine-programs/?link-source=announcement-bar"
  },
  {
    "text": "National Poll: At 50 Days, Trump's Honeymoon Fades as Economy Becomes Key Vulnerability  —  Home Polls National Poll: At 50 Days, Trump's Honeymoon Fades as Economy Becomes Key Vulnerability  —  Voters Sour on Both Political Parties, With Democrats Facing Greater Backlash",
    "url": "https://emersoncollegepolling.com/national-poll-at-50-days-trumps-honeymoon-fades-as-economy-becomes-key-vulnerability/"
  },
  {
    "text": "131. Five Questions About the Khalil Case  —  The government's arrest and detention of a pro-Palestinian Columbia student (and green card holder) raises difficult questions about both technical immigration statutes and the First Amendment.  —  Welcome back to “One First,” an (increasingly frequent) … ",
    "url": "https://www.stevevladeck.com/p/131-five-questions-about-the-khalil"
  },
  {
    "text": "USAID employees told to burn or shred classified documents  —  An organization representing foreign service workers said it was “alarmed” by the directive because there could be documents “relevant to ongoing litigation.”  —  WASHINGTON — The U.S. Agency for International Development … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/usaid-employees-told-burn-shred-classified-documents-rcna195853"
  },
  {
    "text": "Ukraine Targets Moscow With Large-Scale Drone Attack  —  The mayor of the Russian capital called the attack the war's largest against the city.  It appeared to be a reminder of Ukraine's power to strike as its president proposes an air truce.  —  Russian officials said Ukraine attacked Moscow … ",
    "url": "https://www.nytimes.com/2025/03/11/world/europe/ukraine-russia-moscow-war-drones.html"
  },
  {
    "text": "‘Big one to eliminate’: Elon Musk spotlights cost of federal entitlements amid fear of cuts to programs  —  Elon Musk on Monday highlighted the cost of federal spending on entitlement programs, the latest sign of the tech billionaire and presidential adviser's focus to downsize … ",
    "url": "https://www.cnn.com/2025/03/11/politics/musk-federal-entitlements-costs/"
  },
  {
    "text": "Washington Post Columnist Resigns After Paper Spiked Criticism of Jeff Bezos  —  Ruth Marcus, a longtime columnist at The Post, said its publisher refused to run her critique of the new focus for the paper's opinion section.  —  Ruth Marcus, a columnist and editor for The Washington Post's opinion section … ",
    "url": "https://www.nytimes.com/2025/03/10/business/media/washington-post-ruth-marcus-resigns.html"
  },
  {
    "text": "Former President Rodrigo Duterte arrested in the Philippines on an ICC warrant over drug killings  —  Former Philippine President Rodrigo Duterte was arrested Tuesday on a warrant from the International Criminal Court accusing him of crimes against humanity over deadly anti-drugs crackdowns … ",
    "url": "https://apnews.com/article/rodrigo-duterte-manila-philippines-icc-9b9d08b8832b43282db53418535fb245"
  },
  {
    "text": "USDA cancels $1B in local food purchasing for schools, food banks  —  States have been notified that they will not receive 2025 funding for schools to buy food from nearby farms.  —  The Agriculture Department has axed two programs that gave schools and food banks money to buy food … ",
    "url": "https://www.politico.com/news/2025/03/10/usda-cancels-local-food-purchasing-for-schools-food-banks-00222796"
  },
  {
    "text": "The Economic Excuse Industry is Booming  —  First, we got big promises.  Now we're getting lame excuses.  However, one thing has been consistent about Donald Trump's economic rhetoric: rank dishonesty.  —  Trump made a lot of extravagant economic promises during the campaign … ",
    "url": "https://paulkrugman.substack.com/p/the-economic-excuse-industry-is-booming"
  }
]