[
  {
    "text": "Justice Department Sues Virginia for Violating Federal Law's Prohibition on Systematic Efforts to Remove Voters Within 90 Days of an Election  —  For Immediate Release  —  The Justice Department announced today that it has filed a lawsuit against the State of Virginia … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-sues-virginia-violating-federal-laws-prohibition-systematic-efforts"
  },
  {
    "text": "Justice Department Sues Virginia Officials Over State's Noncitizen Voter Roll Purge  —  The U.S. Department of Justice (DOJ) is suing Virginia over its voter roll maintenance program, alleging that the state is illegally removing voters from the rolls too close to the 2024 general election.",
    "url": "https://www.democracydocket.com/news-alerts/justice-department-sues-virginia-officials-over-states-noncitizen-voter-roll-purge/"
  },
  {
    "text": "Harris and Trump take divergent paths in a tied race  —  Trump says he's winning.  Harris says she could lose.  But polls show a dead heat.  —  Aspiring members of Donald Trump's potential second administration gathered Thursday at Washington's Royal Sands Social Club … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/12/harris-trump-strategy-tied/"
  },
  {
    "text": "Black Voters Drift From Democrats, Imperiling Harris's Bid, Poll Shows  —  Vice President Kamala Harris is on track to win a majority of Black voters, and has brought many back to her party since taking over for President Biden.  Still, a significant gap in support persists.",
    "url": "https://www.nytimes.com/2024/10/12/us/politics/poll-black-voters-harris-trump.html"
  },
  {
    "text": "A Frustrated Trump Lashes Out Behind Closed Doors Over Money  —  Donald J. Trump is feeling aggrieved, unappreciated by donors and fenced in by security concerns in the final stretch of the race.  —  Donald J. Trump took his seat at the dining table in his triplex penthouse apartment atop Trump Tower … ",
    "url": "https://www.nytimes.com/2024/10/12/us/politics/trump-gop-donors.html"
  },
  {
    "text": "Trump Leads in Arizona as Harris Holds an Edge in Pennsylvania, New Polls Show  —  The latest Times/Inquirer/Siena polls found Donald Trump with a six-point advantage in Arizona, and Kamala Harris with a four-point lead in Pennsylvania.  —  Two of the nation's most-contested battleground states … ",
    "url": "https://www.nytimes.com/2024/10/12/us/politics/times-siena-arizona-pennsylvania-polls.html"
  },
  {
    "text": "Trump's top general calls ex-president ‘fascist to the core’ and ‘most dangerous person to this country,’ new book says  —  Your support helps us to tell the story  —  This election is still a dead heat, according to most polls.  In a fight with such wafer-thin margins … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-fascist-general-woodward-book-b2627972.html"
  },
  {
    "text": "Trump's top general calls former president “fascist” and “dangerous” threat … - “I had suspicions when I talked to you about his mental decline and so forth, but now I realize he's a total fascist,” Milley, who served from 2019 to 2023, said to Woodward. … Milley has been criticized by the far right.",
    "url": "https://www.axios.com/2024/10/11/mark-milley-trump-fascist-bob-woodward-book"
  },
  {
    "text": "GOP senator touts ‘support’ of colleague — who didn't endorse her  —  Sen. Deb Fischer (R-NE) is facing a competitive election for the first time in years — and she's trying to whip out bipartisan credentials to stave off the threat.  —  The problem is, the senator whose “support” … ",
    "url": "https://www.rawstory.com/deb-fischer/"
  },
  {
    "text": "Six GOP congressmen sue to have Pa. military and overseas ballots set aside in November election  —  Six Republican members of Congress are suing the Pennsylvania Department of State, arguing that ballots from overseas voters — including members of the U.S. military — are susceptible to fraud … ",
    "url": "https://www.inquirer.com/politics/overseas-ballots-pennsylvania-20241010.html"
  },
  {
    "text": "Trump Is Said to Consider Brooke Rollins for White House Chief of Staff  —  Ms. Rollins, a conservative lawyer who ran domestic policy in the Trump administration, is said to be under consideration for the role should Donald J. Trump win the election.  —  Former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/10/11/us/politics/trump-brooke-rollins-chief-of-staff.html"
  },
  {
    "text": "Harris ad bashes Trump for criticizing Detroit  —  Vice President Harris's campaign released an ad titled “Like Detroit” on Friday, criticizing former President Trump for his unfavorable comments about the city.  —  “They said we were dead.  That our best days were behind us,” … ",
    "url": "https://thehill.com/homenews/state-watch/4929218-harris-campaign-trump-detroit-comments/"
  },
  {
    "text": "California officials reject more SpaceX rocket launches, with some citing Musk's X posts  —  SpaceX's plans to launch more rockets from the California coast were rejected by a state commission this week, with some officials citing Elon Musk's political posts on X and raising concerns … ",
    "url": "https://www.latimes.com/california/story/2024-10-11/la-me-spacex-coastal-commission"
  },
  {
    "text": "Trump requests military aircraft and vehicles amid Iran threat  —  There is no evidence tying Iran to either of the recent assassination attempts, but the FBI has not ruled out the possibility.  —  Donald Trump's campaign requested military aircraft for Trump to fly in during the final weeks … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/11/trump-security-threats-iran-election-2024-campaign/"
  },
  {
    "text": "Daring Trump, Harris's Campaign Says It Will Release Her Medical Information  —  Vice President Kamala Harris's campaign is trying to capitalize on a lack of health information shared by her rival.  Candidates are often selective about what they choose to share.",
    "url": "https://www.nytimes.com/2024/10/12/us/politics/harris-medical-records-trump.html"
  },
  {
    "text": "Trump Has Clear Edge on Handling Israel, Ukraine Wars, WSJ Poll Shows  —  By double-digit margins, swing-state voters prefer the former president over Harris when it comes to dealing with both conflicts",
    "url": "https://www.wsj.com/politics/elections/trump-harris-foreign-policy-poll-46540a9a"
  },
  {
    "text": "Damning Video Shows Roger Stone Is Plotting a Coup for November  —  A nine-minute, unedited, undercover interview with Roger Stone revealed some of the MAGA ally's more disturbing goals for a second Trump administration.  —  The covert recording of a discussion between Stone … ",
    "url": "https://newrepublic.com/post/187088/roger-stone-donald-trump-coup-november-video"
  },
  {
    "text": "Trump campaign connected with Elon Musk's X before it blocked links to hacked materials  —  New York CNN  —  Former President Donald Trump's campaign connected with Elon Musk's X last month to discuss hacked Trump campaign materials circulating on the social media platform before X blocked links … ",
    "url": "https://www.cnn.com/2024/10/11/media/trump-elon-musk-x-hack-materials/"
  },
  {
    "text": "Kremlin confirms Trump sent Russia Covid-19 tests, after former president denied Bob Woodward claim  —  Russia has confirmed that Donald Trump sent the Kremlin sample Covid-19 tests in the early days of the pandemic, after revelations in veteran journalist Bob Woodward's new book raised further questions … ",
    "url": "https://www.cnn.com/2024/10/11/europe/kremlin-confirms-trump-covid-tests-intl/"
  },
  {
    "text": "Rumors on X Are Becoming the Right's New Reality  —  The site formerly known as Twitter has become the center of a fantastical political culture.  —  A curious set of claims has recently emerged from the right-wing corners of the social-media platform X: FEMA is systematically abandoning … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/10/rumors-x-twitter-musk/680219/?gift=hVZeG3M9DnxL4CekrWGK3y-aDgCNw7R-gBYPDA5570Y&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Yes.  Political Journalism Remains Wired for the GOP.  —  I heard from a reader yesterday who saw one of the country's top political journalists give a public presentation about the race.  The run-down I got of that event crystallized something I've been giving a lot of thought … ",
    "url": "https://talkingpointsmemo.com/edblog/yes-political-journalism-remains-wired-for-the-gop"
  },
  {
    "text": "Ex-State Department official says Trump campaign is an influence Operation' — and experts agree  —  A prominent former U.S. State Department official who worked to fight Russian disinformation has labeled the Trump presidential campaign an “influence operation,” with several experts echoing his assessment.",
    "url": "https://www.alternet.org/richard-stengal-trump/"
  },
  {
    "text": "From the Storm to the Stormtroopers  —  The Fascist Logic of Climate Lying  —  Today, our American fascists blame the hurricanes on the meteorologists and disrupt the government response.  Tomorrow they will blame climate change on the climate scientists and deport their enemies of choice.",
    "url": "https://snyder.substack.com/p/from-the-storm-to-the-stormtroopers"
  }
]