[
  {
    "text": "Donald's Desperate Demand: Trump Files for Mistrial in New York Bank Fraud Case  —  Trump's lawyers made a 30-page court filing on Wednesday seeking a mistrial, a move they've telegraphed for a while but still marks a new low in the case. … Seeing no way out of his bank fraud trial … ",
    "url": "https://www.thedailybeast.com/donalds-desperate-demand-trump-files-for-mistrial-in-new-york-bank-fraud-case"
  },
  {
    "text": "Trump files motion for mistrial in NY fraud case  —  Former President Trump's legal team on Wednesday requested a mistrial in his New York fraud case, claiming that the trial judge and his principal law clerk's purported bias against Trump has “tainted” the case.",
    "url": "https://thehill.com/regulation/court-battles/4310913-trump-files-motion-for-mistrial-in-ny-fraud-case/"
  },
  {
    "text": "Sen. Joe Manchin says he ‘absolutely’ would consider a presidential run  —  In an interview with NBC's Kristen Welker, the West Virginia Democrat said he first has to explore whether there's an appetite among voters for a moderate candidate like him.  —  WASHINGTON — Sen. Joe Manchin … ",
    "url": "https://www.nbcnews.com/politics/2024-election/sen-joe-manchin-says-absolutely-consider-presidential-run-rcna125368"
  },
  {
    "text": "How the next Republican president could stop most abortions without Congress  —  The next Republican president could effectively ban most abortions through a simple policy change at the Department of Justice, experts and advocates on both sides of the abortion debate say.",
    "url": "https://www.axios.com/2023/11/15/us-abortion-ban-republican-president-2024-trump"
  },
  {
    "text": "New Hampshire 2024: Haley Surges to Second Place While Trump Maintains Lead  —  Haley Outperforms Trump and DeSantis Against Biden Among New Hampshire Voters  —  A new Emerson College Polling/WHDH poll of New Hampshire voters finds former President Donald Trump with 49% of voters' support … ",
    "url": "https://emersoncollegepolling.com/new-hampshire-2024-haley-surges-to-second-place-while-trump-maintains-lead/"
  },
  {
    "text": "House passes bill to avert government shutdown, sends to Senate  —  Senate leaders say they will take up the legislation ‘as soon as possible’ to beat the Saturday deadline when federal funds expire  —  The House on Tuesday passed stopgap legislation to keep the federal government operating past … ",
    "url": "https://www.washingtonpost.com/business/2023/11/14/government-shutdown-house-bill-vote/"
  },
  {
    "text": "Oklahoma Supreme Court blocks abortion restrictions  —  The Oklahoma Supreme Court placed temporary injunctions on three laws regulating abortion and abortion pills on Tuesday, signaling that the state's high court could soon weigh whether abortion rights are implied in the state constitution.",
    "url": "https://www.washingtonexaminer.com/policy/healthcare/oklahoma-supreme-court-blocks-abortion-restrictions"
  },
  {
    "text": "Speaker Mike Johnson calls separation of church and state a “misnomer” … Of course it comes from a phrase that was in a letter that [Thomas] Jefferson wrote, it's not in the Constitution,\" Johnson said.  — “What he was explaining is they did not want the government to encroach upon the church … ",
    "url": "https://www.axios.com/2023/11/15/mike-johnson-separation-church-state-misnomer"
  },
  {
    "text": "Rashida Tlaib member of secret Facebook group where Hamas terrorists glorified  —  ‘Squad’ member has been part of controversial group for 6 years  —  EXCLUSIVE: Rep. Rashida Tlaib is part of a secret social media group in which its members have glamorized Hamas in its war battle with Israel … ",
    "url": "https://www.foxnews.com/politics/rashida-tlaib-member-secret-facebook-group-where-hamas-terrorists-glorified"
  },
  {
    "text": "GOP Sen. Mullin Says His Offer to Brawl With Union Leader Was ‘Oklahoma Values’  —  WHOLESOME  —  Sen. Markwayne Mullin (R-OK) said he was nobly representing “Oklahoma values” when he challenged a union boss to a fight Tuesday.  A meeting of the Senate HELP Committee went off the rails … ",
    "url": "https://www.thedailybeast.com/gop-sen-mullin-says-his-offer-to-brawl-with-union-leader-was-oklahoma-values"
  },
  {
    "text": "False electors in Nevada who aided Trump in 2020 are under investigation  —  The state's attorney general is investigating the efforts of Republicans who falsely claimed to be Trump electors.  —  The attorney general of Nevada is quietly investigating Republican activists and operatives … ",
    "url": "https://www.politico.com/news/2023/11/15/nevada-false-electors-trump-investigation-00127369"
  },
  {
    "text": "Silicon Valley's worldview is not just an ideology; it's a personality disorder.  —  Silicon Valley's ideology is this: Libertarianism for me.  Feudalism for thee.  —  In more detail:  —  • Surveillance, manipulation and coercion; at first, just for profit, later by necessity, and ultimately for the hell of it",
    "url": "https://crookedtimber.org/2023/11/15/silicon-valleys-worldview-is-not-just-an-ideology-its-a-personality-disorder/"
  },
  {
    "text": "Hundreds of Jewish Marchers Left Stranded by ‘Malicious’ Bus Drivers  —  Three hundred Jewish marchers never made it to Tuesday's “March for Israel” in Washington, D.C., in what is being described as the “deliberate and malicious” actions of some bus drivers.",
    "url": "https://redstate.com/terichristoph/2023/11/15/deliberate-and-malicious-300-jewish-marchers-left-stranded-when-bus-drivers-refused-to-drive-them-n2166368"
  },
  {
    "text": "US public support for Israel drops; majority backs a ceasefire, Reuters/Ipsos shows  —  U.S. public support for Israel's war against Hamas militants in Gaza is eroding and most Americans think Israel should call a ceasefire to a conflict that has ballooned into a humanitarian crisis, according to a new Reuters/Ipsos poll.",
    "url": "https://www.reuters.com/world/us-public-support-israel-drops-majority-backs-ceasefire-reutersipsos-2023-11-15/"
  },
  {
    "text": "Biden compares Trump's ‘vermin’ remarks to Nazi rhetoric  —  Biden slammed former President Donald Trump's remarks last weekend that characterized his political opponents as “vermin” who pose threats within the country.  —  President Joe Biden on Tuesday decried former President Donald … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-compares-trumps-vermin-remarks-nazi-rhetoric-rcna125266"
  },
  {
    "text": "Meta Allows Ads Claiming Rigged 2020 Election on Facebook, Instagram  —  Company weighed free-speech considerations in changing its policy last year  —  Meta Platforms will let political ads on Facebook and Instagram question the legitimacy of the 2020 U.S. presidential election … ",
    "url": "https://www.wsj.com/tech/meta-allows-ads-claiming-rigged-2020-election-on-facebook-instagram-309b678d?mod=followamazon"
  },
  {
    "text": "GOP at Fault If Government Shuts Down, Say Nearly Half of Americans  —  If the federal government fails to reach a spending agreement and shuts down, nearly half of Americans will point a finger at congressional Republicans.  Most Americans also express displeasure with members of Congress using … ",
    "url": "https://maristpoll.marist.edu/polls/the-looming-government-shutdown/"
  },
  {
    "text": "Sunak Scrambles to Tame Tory Revolt After Immigration Defeat  — Says he's working on Rwanda treaty and prepared to change law  — UK Supreme Court ruled government's migration policy unlawful  —  Prime Minister Rishi Sunak said he is not giving up on deporting asylum seekers to Rwanda … ",
    "url": "https://www.bloomberg.com/news/articles/2023-11-15/sunak-scrambles-to-contain-tory-revolt-after-immigration-defeat"
  },
  {
    "text": "Sunnylands Statement on Enhancing Cooperation to Address the Climate Crisis  —  Recalling the meeting between President Xi Jinping and President Joseph R. Biden in Bali, Indonesia, the United States and China reaffirm their commitment to work jointly and together with other countries to address the climate crisis.",
    "url": "https://www.state.gov/sunnylands-statement-on-enhancing-cooperation-to-address-the-climate-crisis/"
  },
  {
    "text": "Haley calls for social media reforms targeting user accountability  —  Former South Carolina Gov. Nikki Haley (R) called for social media reforms targeting user accountability in a post Tuesday.  —  “When I get into office, the first thing we have to do, social media accounts … ",
    "url": "https://thehill.com/homenews/campaign/4309883-haley-urges-social-media-reforms-user-accountability/"
  },
  {
    "text": "Iran's nuclear enrichment advances as it stonewalls UN, IAEA reports show  —  Iran has enough uranium enriched to up to 60% purity, close to weapons-grade, for three atom bombs by the International Atomic Energy Agency's definition and is still stonewalling the agency on key issues, confidential IAEA reports showed on Wednesday.",
    "url": "https://www.reuters.com/world/middle-east/irans-nuclear-enrichment-advances-it-stonewalls-un-iaea-reports-show-2023-11-15/"
  },
  {
    "text": "Hunter Biden seeks to subpoena Trump, Barr in criminal case  —  Hunter Biden requested Wednesday to subpoena former President Trump and three senior officials who served in his administration's Justice Department, seeking evidence that Biden's criminal prosecution is politically motivated.",
    "url": "https://thehill.com/regulation/court-battles/4310911-hunter-biden-seeks-to-subpoena-trump-barr-in-criminal-case/"
  }
]