[
  {
    "text": "I was wrong about Biden  —  The worst feeling in the world  —  I really don't enjoy being wrong.1 But looking back on Biden's disastrous debate with the benefit of some time away, I have to admit that I was wrong.  —  I was, of course, aware that Joe Biden was old and showed signs of aging.",
    "url": "https://www.slowboring.com/p/i-was-wrong-about-biden"
  },
  {
    "text": "Biden's Survival Plan: Decry ‘Elite’ Critics, Appeal to His Base  —  Black voters and organized labor have been the president's key backers and they're going to have to carry him now.  —  NEW ORLEANS —  Sitting on a panel here at Essence Fest, an annual gathering of Black leaders … ",
    "url": "https://www.politico.com/news/magazine/2024/07/08/bidens-campaign-black-union-voters-00166761"
  },
  {
    "text": "Joe Biden Is Not A Decent Man  —  The refrain that Biden is a ‘good’ or ‘decent’ man falls flat when you consider the president's decades of recorded lies and slander.  —  Even as they attempt to force him out, Democrats are still praising the sterling character of the president, especially in contrast to Trump.",
    "url": "https://thefederalist.com/2024/07/08/joe-biden-is-not-a-decent-man/"
  },
  {
    "text": "Playbook: Crunch time for Jeffries and Schumer  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  THE ‘GOODEST’ WAR — From Maureen Dowd's latest in NYT: “In my Saturday column, I quoted [President JOE] BIDEN's line to ABC's George Stephanopoulos … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/08/crunch-time-for-jeffries-and-schumer-00166768"
  },
  {
    "text": "‘Blitz primary’ could open up Democratic race if Biden drops out  —  The Scoop  —  As the Democratic Party convulses over questions about President Joe Biden's mental fitness, a pair of well-connected Democrats is offering an optimistic plan that would involve the president stepping … ",
    "url": "https://www.semafor.com/article/07/07/2024/blitz-primary-could-open-up-democratic-race-if-biden-drops-out"
  },
  {
    "text": "What Trump doesn't want you to know about Project 2025  —  Project 2025 is a radical blueprint for a potential second Trump administration, spearheaded by the right-wing Heritage Foundation.  The plan calls for withdrawing approval for the abortion pill, banning pornography, slashing corporate taxes … ",
    "url": "https://popular.info/p/what-trump-doesnt-want-you-to-know"
  },
  {
    "text": "The destruction of the regulatory state is already happening  —  The post-Chevron world is here. … It's been barely a week since conservatives on the US Supreme Court radically upended the balance of power between the branches of government, giving the federal courts the exclusive power … ",
    "url": "https://www.publicnotice.co/p/chevron-ruling-fallout-regulatory-state-demise"
  },
  {
    "text": "Boeing accepts a plea deal to avoid a criminal trial over 737 Max crashes, Justice Department says  —  Boeing will plead guilty to a criminal fraud charge stemming from two crashes of 737 Max jetliners that killed 346 people after the government determined the company violated an agreement … ",
    "url": "https://apnews.com/article/boeing-guilty-plea-crashes-245a38dc6d3082f4ddff1f6f74f274f2"
  },
  {
    "text": "Radio Host Resigns After Asking Biden Questions His Campaign Had Provided  —  WURD said that the interview with President Biden was not up to its standards and that the host, Andrea Lawful-Sanders, had resigned in a mutual decision.  —  The Philadelphia radio station WURD has parted ways … ",
    "url": "https://www.nytimes.com/2024/07/07/us/politics/biden-interview-radio-host-resigns.html"
  },
  {
    "text": "Hungary's Orbán Has Taken Sides in America's Election.  Maybe Other Leaders Should, Too.  —  The prevailing wisdom that foreign leaders should stay neutral in U.S. politics could be out of date in an increasingly polarized setting.  —  As the leaders of NATO countries arrive in Washington this week … ",
    "url": "https://www.politico.com/news/magazine/2024/07/08/orban-nato-trump-biden-election-00166617"
  },
  {
    "text": "Temperatures 1.5C above pre-industrial era average for 12 months, data shows  —  Copernicus Climate Change Service says results a ‘large and continuing shift’ in the climate  —  The world has baked for 12 consecutive months in temperatures 1.5C (2.7F) greater than their average before the fossil fuel era, new data shows.",
    "url": "https://www.theguardian.com/environment/article/2024/jul/08/temperatures-1-point-5c-above-pre-industrial-era-average-for-12-months-data-shows"
  },
  {
    "text": "Imagine if Dana Bash Knew Trump Had Been President Before?  —  After letting Donald Trump lie non-stop in the debate, Dana Bash invited his aspiring running-mate, Marco Rubio, onto her show to tell the same lies.  —  Ostensibly, she was asking Rubio about whether the Supreme Court immunity … ",
    "url": "https://www.emptywheel.net/2024/07/08/imagine-if-dana-bash-knew-trump-had-been-president-before/"
  },
  {
    "text": "French left-wing coalition projected to beat the far right in surprise second-round result  —  A left-wing alliance is projected to win the most seats in the French parliament after tactical voting in Sunday's second round election thwarted Marine Le Pen's far-right party … ",
    "url": "https://www.cnn.com/2024/07/07/europe/france-election-second-round-result-intl/"
  },
  {
    "text": "Scoop: How Biden's event staffers guide him behind the scenes … - “I staffed a simple fundraiser at a private residence, but they treated it like it was a NATO summit with his movements,” according to a person who staffed a Biden event in the past 18 months.",
    "url": "https://www.axios.com/2024/07/07/biden-staff-events-prepare"
  },
  {
    "text": "Behind the Curtain: Trump's dream regime … - A strong president indifferent to pressure. … - A compliant, Republican-controlled Congress. … - A conservative Supreme Court. … - A weakened administrative state. … - Purge hostile federal employees.",
    "url": "https://www.axios.com/2024/07/08/trump-election-2024-dream-government"
  },
  {
    "text": "Calling Kamala Harris a ‘DEI hire’ is what bigotry looks like  —  Editor's Note: Dean Obeidallah, a former attorney, is the host of SiriusXM radio's daily program, “The Dean Obeidallah Show.”  Follow him on Threads.  The opinions expressed in this commentary are his own.  Read more opinion at CNN.",
    "url": "https://www.cnn.com/2024/07/07/opinions/kamala-harris-dei-hire-racism-2024-obeidallah/"
  }
]