[
  {
    "text": "Kamala Harris for President  —  The Vice-President has displayed the basic values and political skills that would enable her to help end, once and for all, a poisonous era defined by Donald Trump.  —  At the 1940 Republican National Convention, in Philadelphia, an uneasy affair marked by bomb scares … ",
    "url": "https://www.newyorker.com/magazine/2024/10/07/kamala-harris-for-president-endorsement?currentPage=all"
  },
  {
    "text": "Republican Senate Candidate Larry Hogan, Endorsed by Trump, Won't Endorse Him Back  —  NO THANKS  —  Larry Hogan condemned Donald Trump's hateful outburst—where he called Vice President Kamala Harris “mentally disabled”—as “outrageous and unacceptable.”  —  Former Maryland Governor Larry Hogan … ",
    "url": "https://www.thedailybeast.com/republican-senate-candidate-larry-hogan-endorsed-by-trump-wont-endorse-him-back"
  },
  {
    "text": "Republicans lay legal groundwork for election challenges  —  In Arizona, one of seven competitive U.S. states that are expected to decide the 2024 presidential election, an advocacy group founded by Donald Trump adviser Stephen Miller is advancing a bold legal theory: that judges can throw … ",
    "url": "https://www.reuters.com/world/us/legal-blitz-republicans-lay-groundwork-us-election-challenges-2024-09-29/"
  },
  {
    "text": "I help oversee federal elections.  Mike Johnson's words threaten our democracy.  —  It is disturbingly clear that the Republican Party is setting the stage to once again attempt to overturn a lawful American election.  —  It is disturbingly clear that the Republican Party … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/mike-johnson-election-denialism-congress-2024-results-rcna172657"
  },
  {
    "text": "Trump preps catalog of “cheating” claims for potential election loss … - Overseas voting: Trump falsely claimed Monday that Democrats are exploiting an overseas ballot program for expats and military members in order to circumvent “any citizenship check or verification of identity.”",
    "url": "https://www.axios.com/2024/09/29/trump-voter-fraud-2024-election"
  },
  {
    "text": "Kris Kristofferson, Country Music Legend and ‘A Star Is Born’ Leading Man, Dies at 88  —  Kris Kristofferson, who attained success as both a groundbreaking country music singer-songwriter and a Hollywood film and TV star, died Saturday at home in Maui, Hawaii.",
    "url": "https://variety.com/2024/film/obituaries-people-news/kris-kristofferson-dead-country-music-legend-actor-1236159472/"
  },
  {
    "text": "J. D. Vance's Thin Skin Makes Him Vulnerable  —  Kamala Harris used Donald Trump's psychic weaknesses against him in their televised debate on September 10.  Can Governor Tim Walz do the same to Senator J. D. Vance when they meet on Tuesday?  —  Watch what happens when Vance is asked … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/tim-walz-debate-jd-vance/680060/"
  },
  {
    "text": "The 128 paths to the White House  —  From the Sun Belt to the Rust Belt, which maps are most likely?  —  ∙ Paid  —  Let's try something a little different today: basically, a two-for-one.  First, I'll give you what's essentially a full newsletter with some big-picture thoughts … ",
    "url": "https://www.natesilver.net/p/the-128-paths-to-the-white-house"
  },
  {
    "text": "Kamala's Attempted Troll of Trump at Alabama Game Fails Miserably, While Trump Is Cheered Wildly  —  Kamala Harris told the media she was going to try to troll former President Donald Trump at the Alabama-Georgia game on Saturday.  —  But the effort failed miserably and just showed how desperate she was.",
    "url": "https://redstate.com/nick-arama/2024/09/29/kamalas-attempted-troll-of-trump-fails-miserably-shows-how-desperate-she-is-n2179911"
  },
  {
    "text": "California's Gavin Newsom Vetoes Controversial AI Safety Bill  —  Governor seeks more encompassing rules than the bill opposed by OpenAI, Meta and supported by research scientists  —  California Gov. Gavin Newsom has vetoed a controversial artificial-intelligence safety bill that pitted … ",
    "url": "https://www.wsj.com/tech/ai/californias-gavin-newsom-vetoes-controversial-ai-safety-bill-d526f621?st=dPWfzZ&reflink=article_copyURL_share"
  },
  {
    "text": "Russians who promote ‘child-free movement’ could soon face hefty fine  —  Vyacheslav Volodin, the speaker of the lower house of parliament and an ally of President Vladimir Putin, said a new bill would tackle the “ideology of childlessness.”  —  Russia's fight against the West and its values … ",
    "url": "https://www.nbcnews.com/news/world/russia-proposes-ban-child-free-lifestyle-rcna172616"
  },
  {
    "text": "“You've been a good friend”: Biden honors Jimmy Carter ahead of 100th birthday … - In a message endorsing Biden's 2020 presidential campaign, Carter called the president his “first and most effective supporter in the Senate” and “my loyal and dedicated friend.”",
    "url": "https://www.axios.com/2024/09/29/jimmy-carter-joe-biden-100th-birthday"
  },
  {
    "text": "SCROLL TO CONTINUE  —  The table was set.  The pastries arranged.  A white tablecloth dangled placidly in the early morning mist, surrounded by 12 golden-hued high-backed chairs.  —  Five decades ago, a dozen friends gathered here, on the National Mall, for breakfast.",
    "url": "https://www.washingtonpost.com/dc-md-va/interactive/2024/national-mall-breakfast-1974-photo-recreation/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3NTgyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI4OTY0Nzk5LCJpYXQiOjE3Mjc1ODI0MDAsImp0aSI6IjE1NGZiZWZjLWE4MzMtNGZjYy1iNzYwLWQ4NzAxN2Y4YWQwYyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS9pbnRlcmFjdGl2ZS8yMDI0L25hdGlvbmFsLW1hbGwtYnJlYWtmYXN0LTE5NzQtcGhvdG8tcmVjcmVhdGlvbi8ifQ.3jEvx739y3H1ME9IQH_sD4Gon-a2Qy-rzGPYX1tuzII&itid=gfta"
  },
  {
    "text": "We need a 21st Century Homesteading Act to help Americans displaced by climate change  —  As always, thank you for subscribing and amplifying Civic Texts, which will not be sustainable without you.  Many thanks to everyone who has supported my work, particularly folks who have subscribed to memberships since our soft launch in April.",
    "url": "https://civic-texts.ghost.io/we-need-a-21st-century-homesteading-act-to-help-americans-displaced-by-climate-change/"
  },
  {
    "text": "Scoop: Rep. Elissa Slotkin warns Harris is “underwater” in Michigan … - FiveThirtyEight's average of polls has Harris up by about 2.4 points in Michigan. … - Michigan is also a top pickup opportunity for Senate Republicans, with millions of dollars now flooding the race between Slotkin and former Rep. Mike Rogers (R-Mich.).",
    "url": "https://www.axios.com/2024/09/29/michigan-senate-race-slotkin-harris"
  },
  {
    "text": "Alabama senator says Democrats ‘use’ IVF as ‘scare tactic’  —  Sen. Katie Britt (R-Ala.) said that Democrats “use” in vitro fertilization (IVF) accessibility concerns “as a scare tactic” in an interview Sunday.  —  “Senator Ted Cruz and I led a letter with all 49 Republican senators signing … ",
    "url": "https://thehill.com/homenews/campaign/4906256-katie-britt-ivf-as-scare-tactic/"
  },
  {
    "text": "Meehan says Trump will ‘absolutely not’ win popular vote  —  Michael Meehan, the CEO of Squared Communications, said Sunday he believes former President Trump will “absolutely not” win the popular vote.  —  Meehan, a Democrat, was asked by host Chris Stirewalt about Trump's standing in the polls … ",
    "url": "https://thehill.com/homenews/campaign/4905890-michael-meehan-donald-trump-not-win-popular-vote/"
  },
  {
    "text": "How Project 2025 Became Toxic and Exposed the Right's Toxicity  —  On September 22, NBC News published its latest national poll.  The headline results: Kamala Harris's favorability has soared since July and she now also leads Trump head-to-head, a significant shift compared to two months ago … ",
    "url": "https://thomaszimmer.substack.com/p/how-project-2025-became-toxic-and"
  }
]