[
  {
    "text": "Trump makes false claims about federal response as he campaigns in area ravaged by Hurricane Helene  —  Donald Trump repeatedly spread falsehoods Monday about the federal response to Hurricane Helene despite claiming not to be politicizing the disaster as he toured hard-hit areas in south Georgia.",
    "url": "https://apnews.com/article/kamala-harris-donald-trump-hurricane-helene-3097f1706455929adf5a4eb67f9cdf0f"
  },
  {
    "text": "Trump: Nobody Could Have Predicted a Hurricane Would Hit Mid-Hurricane Season  —  OUT OF THE BLUE  —  The former president opined that nobody could have predicted Hurricane Helene making landfall “so late” in the hurricane season, which is set to last another two months.",
    "url": "https://www.thedailybeast.com/donald-trump-thinks-nobody-could-have-predicted-a-hurricane-would-hit-mid-hurricane-season"
  },
  {
    "text": "Supplies arrive by plane and mule to North Carolina as Helene death toll tops 100  —  Widespread devastation left behind by Hurricane Helene came into light Monday across the South, revealing a wasteland of splintered houses, crushed cargo containers and mud-covered highways in one of the worst storms in U.S. history.",
    "url": "https://apnews.com/article/hurricane-helene-north-carolina-asheville-f02869c7d01e68f2d7f0553abb82252f"
  },
  {
    "text": "Trump Accuses Biden Of What He Himself Did: Withholding Aid To Storm Victims  —  The coup-attempting criminal former president also accused Biden and Harris of having “left Americans to drown” in the South.  —  LOADING  —  WASHINGTON — Donald Trump, who as president withheld hurricane aid … ",
    "url": "https://www.huffpost.com/entry/trump-biden-helene-lies_n_66faf7d5e4b0a61d19bec29b"
  },
  {
    "text": "Here's how Helene and other storms dumped a whopping 40 trillion gallons of rain on the South  —  More than 40 trillion gallons of rain drenched the Southeast United States in the last week from Hurricane Helene and a run-of-the-mill rainstorm that sloshed in ahead of it — an unheard of amount of water that has stunned experts.",
    "url": "https://apnews.com/article/rainfall-helene-carolina-tennessee-georgia-climate-change-flood-fcba634e14a0ffa1a8e1fa85d7e2b390"
  },
  {
    "text": "Kemp praises Biden's Hurricane Helene response amid Trump criticism  —  Georgia Gov. Brian Kemp (R) expressed his appreciation for the role the federal government has played in responding to Hurricane Helene, contradicting comments from former President Trump, who claimed during a Monday visit … ",
    "url": "https://thehill.com/homenews/administration/4908016-georgia-kemp-biden-hurricane-helene/"
  },
  {
    "text": "Facts Need To Be Checked  —  So what's going on with CBS News?  —  Dan Rather and Team Steady  —  With our democracy being tested in unimagined ways, we are just over a month away from one of the most important presidential elections in U.S. history.  The only chance for voters … ",
    "url": "https://steady.substack.com/p/facts-need-to-be-checked"
  },
  {
    "text": "How CBS Will Fact Check the Walz-Vance VP Debate  —  CBS is experimenting with a novel way to offer real-time fact-checking of the vice-presidential debate on Tuesday.  Just don't expect the moderators to frequently jump in.  —  The journalistic dilemma of how to fact-check national candidates … ",
    "url": "https://www.nytimes.com/2024/09/30/business/media/cbs-vice-presidential-debate-fact-check-qr.html"
  },
  {
    "text": "DNC trolls Trump, Vance with digital projections on NYC's Trump Tower ahead of debate  —  In a move intended to troll former President Donald Trump and his running mate, Sen. JD Vance, ahead of the first and only vice presidential debate of 2024, the Democratic National Committee on Monday night … ",
    "url": "https://www.cbsnews.com/news/trump-tower-nyc-dnc-projections/"
  },
  {
    "text": "Rudy Giuliani's Daughter: Trump Took My Dad From Me.  Please Don't Let Him Take Our Country Too  —  “Nothing I have experienced prepared me for the very public and relentless implosion of my father's life,” writes Caroline Giuliani, announcing her support for Kamala Harris.",
    "url": "https://www.vanityfair.com/news/story/caroline-giuliani-trump-kamala-harris"
  },
  {
    "text": "Giant naked Trump effigy is ‘deplorable’, say Republicans  —  Sculpture of former US president has been erected near Las Vegas purely for ‘shock value’, say local politicians  —  Republicans have condemned as “deplorable” a 43-foot effigy of a naked Donald Trump that has been erected near Las Vegas.",
    "url": "https://www.telegraph.co.uk/us/news/2024/09/30/naked-donald-trump-effigy-deplorable-say-republicans/"
  },
  {
    "text": "Judge again strikes down Georgia abortion law, allowing abortions to resume … About the Author  —  Maya T. Prabhu is a government reporter for The Atlanta Journal-Constitution.  Born in Queens, New York, and raised in northern Virginia, Maya attended Spelman College and then the University of Maryland for a master's degree.",
    "url": "https://www.ajc.com/politics/judge-again-strikes-down-georgia-abortion-law-allowing-abortions-to-resume/4PWIUSQDMNAPRNRQ6HEA7LPQC4/"
  },
  {
    "text": "Oops, They Did It Again: The Mainstream Media Buries Trump's Outrage … It's a pretty sad commentary on the way our mainstream media cover Donald Trump that if you really want to know what Trump said at a given rally, you would be wasting your time going to The New York Times or The Washington Post … ",
    "url": "https://newrepublic.com/series/51/mainstream-media-sanewashing-trump-migrants"
  },
  {
    "text": "Crooked Cops, Stolen Laptops & the Ghost of UGNazi  —  A California man accused of failing to pay taxes on tens of millions of dollars allegedly earned from cybercrime also paid local police officers hundreds of thousands of dollars to help him extort, intimidate and silence rivals and former business partners, the government alleges.",
    "url": "https://krebsonsecurity.com/2024/09/crooked-cops-stolen-laptops-the-ghost-of-ugnazi/"
  },
  {
    "text": "Welcome Home, Hostages, and Pay Up  —  The IRS should stop targeting wrongfully detained Americans.  —  'Last month, I was in solitary confinement in Siberia.  Today, I'm here.  I can't believe it!  That's how Vladimir Kara-Murza began his remarks this month when he met with U.S. senators who fought for his release.",
    "url": "https://www.wsj.com/opinion/welcome-home-hostages-and-pay-up-credit-scores-fees-taxes-irs-fee92257"
  },
  {
    "text": "No, A Former Republican Congressman Now Backing Harris Did Not Author Project 2025  —  A right-wing conspiracy theory that the transition plan written by Trump alumni was actually a super secret sabotage effort has been disputed by those at the center of it.  —  LOADING",
    "url": "https://www.huffpost.com/entry/former-republican-congressman-backing-harris-did-not-write-project-2025_n_66fb20a4e4b06bc72dbc0991"
  },
  {
    "text": "Haley's endorsement of Trump doesn't mean her supporters will follow her  —  She drew voters from the former president during the primary even after she dropped out.  —  Nikki Haley has made clear she's on Team Trump.  Her supporters don't all feel the same.",
    "url": "https://www.politico.com/news/2024/09/30/nikki-haley-trump-supporters-00181772"
  },
  {
    "text": "Dockworkers at ports from Maine to Texas go on strike, a standoff risking new shortages  —  Dockworkers at ports from Maine to Texas began walking picket lines early Tuesday in a strike over wages and automation that could reignite inflation and cause shortages of goods if it goes on more than a few weeks.",
    "url": "https://apnews.com/article/port-strike-ila-dockworkers-begins-e5468e760f46a64e4322d1702beb1f72"
  },
  {
    "text": "UNRWA confirms Hamas leader in Lebanon was its employee  —  The United Nations agency for Palestinian refugees confirms that Fateh Sherif, named by Hamas as its leader in Lebanon, was employed by UNRWA, but notes that he was being probed over his political activities.",
    "url": "https://www.timesofisrael.com/liveblog_entry/unrwa-confirms-hamas-leader-in-lebanon-was-its-employee/"
  },
  {
    "text": "Schumer dumping $1M in surprisingly competitive Maryland Senate race … - The Democratic PAC WinSenate has already spent some ad money on the race, but the new bookings for the first two weeks of October are a significant jump, according to AdImpact data.  — “[I]f Hogan's Washington GOP friends … ",
    "url": "https://www.axios.com/2024/09/30/maryland-senate-schumer-hogan-alsobrooks"
  },
  {
    "text": "Arkansas Judge Mandates Early Voting in Majority Black City  —  Early voting will be held at Seventh Street Church of Christ in West Memphis, Arkansas after a judge granted part of a request from two voters.  The voters in the majority-Black city initially requested at least two early voting locations.",
    "url": "https://www.democracydocket.com/news-alerts/arkansas-voters-sue-board-for-refusing-to-hold-early-voting-in-majority-black-county/"
  },
  {
    "text": "‘Just Not Right’: A GOP Governor Confronts Trump's Lies  —  For Gov. Mike DeWine, the attacks on Haitians near his Ohio hometown are personal - and so is the cost of Trump's and J.D. Vance's vicious demonization of legal immigrants.  —  SPRINGFIELD, Ohio — On a rainy Sunday afternoon … ",
    "url": "https://www.politico.com/news/magazine/2024/09/30/dewine-ohio-gop-governor-confronts-trump-lies-00181595"
  },
  {
    "text": "Let's Break Down All the Lies in Elon Musk's False Tweet About Noncitizens Voting  —  The tech billionaire said the true threat to democracy is if Trump loses.  —  On Sunday, Elon Musk posted a lengthy diatribe about Democrats being the real “threat to democracy.”",
    "url": "https://www.motherjones.com/politics/2024/09/elon-musk-noncitizen-voting-tweet-lies-disinformation/"
  }
]