[
  {
    "text": "Democrats romp, Youngkin flops: 4 takeaways from Tuesday's election  —  Joe Biden's party has had a very strong year at the ballot box.  Whether it extends to the president in 2024 is another matter.  —  Joe Biden has had a very bad few days.  His party just had a banner year.",
    "url": "https://www.politico.com/news/2023/11/08/election-day-2023-results-takeaways-00126035"
  },
  {
    "text": "Cassidy Hutchinson: Why I Testified  —  Happy Wednesday.  —  This is what is known as a vibe shift.  —  The polls suggested that Democrats were entering another Dark Night of the Soul, but once again they overperformed when the actual votes were counted.",
    "url": "https://plus.thebulwark.com/p/cassidy-hutchinson-why-i-testified-b25"
  },
  {
    "text": "Sen. JD Vance says Republicans have to ‘recognize how much voters mistrust us’ on abortion  — Ohions just voted to enshrine abortion rights into the state's constitution.  — JD Vance, Ohio's GOP senator, says his party needs to recognize people don't trust them on abortion.",
    "url": "https://www.businessinsider.com/jd-vance-republicans-voters-mistrust-issue-one-abortion-2023-11?op=1"
  },
  {
    "text": "Fox & Friends Blast Governor Glenn Youngkin's ‘Epic Failure’ in Virginia Election One Day After Going ALL IN On Him  —  One day after featuring Governor Glenn Youngkin and co-hosting Tuesday's show from Manassas, Virginia, Fox & Friends piled on following Tuesday's election results.",
    "url": "https://www.mediaite.com/tv/fox-friends-blast-governor-glenn-youngkins-epic-failure-in-virginia-election-one-day-after-going-all-in-on-him/"
  },
  {
    "text": "The GOP is in a Trump trap  —  Trump hasn't been a consistent electoral success — but Republicans have had even fewer winning nights without him.  —  I've never been a huge off-year elections person.  There are different types of election nerds, and I've always been more of a macro guy … ",
    "url": "https://www.natesilver.net/p/the-gop-is-in-a-trump-trap"
  },
  {
    "text": "Virginia Democrats sweep legislative elections after campaigning on abortion rights  —  Virginia Democrats who campaigned on protecting abortion rights swept Tuesday's legislative elections, retaking full control of the General Assembly after two years of divided power.",
    "url": "https://apnews.com/article/virginia-legislature-election-2023-79f9337731c25decc83b83eeb4d3e00e"
  },
  {
    "text": "Moms for Liberty Falls Flat on Its Face in School Board Races  —  Iowa chapters of the far-right group Moms for Liberty endorsed 13 candidates in school board races across the state.  Only one was elected.  —  The Tuesday loss is a stinging rebuke of Moms for Liberty, a “parental rights” … ",
    "url": "https://newrepublic.com/post/176746/moms-liberty-falls-flat-face-school-board-races-iowa"
  },
  {
    "text": "Moms for Liberty Candidates Take a Beating in Some School Races  —  The far-right group's school board candidates did not fare well in several important ballots across the U.S.  —  Moms for Liberty, the right-wing “parental rights” group advocating a hardline anti-woke agenda in America's schools … ",
    "url": "https://www.thedailybeast.com/moms-for-liberty-candidates-taught-a-lesson-in-2023-elections"
  },
  {
    "text": "Behind Hamas's Bloody Gambit to Create a ‘Permanent’ State of War  —  Hamas leaders say they waged their Oct. 7 attack on Israel because they believed the Palestinian cause was slipping away, and that only violence could revive it.  —  Thousands have been killed in Gaza, with entire families wiped out.",
    "url": "https://www.nytimes.com/2023/11/08/world/middleeast/hamas-israel-gaza-war.html"
  },
  {
    "text": "Hamas to NYT: War of Annihilation Is Exactly What We Wanted  —  When terrorists tell you who they are, believe them.  —  Hamas' terror-symps and useful idiots have spent four weeks marching through college campuses and city centers demanding a cease-fire.  Meanwhile, Hamas tells … ",
    "url": "https://hotair.com/ed-morrissey/2023/11/08/hamas-to-nyt-war-of-annhilation-is-exactly-what-we-wanted-n590864"
  },
  {
    "text": "‘Is the fat lady warming up?  Yes’: Trump chokes off his rivals' last lines of attack  —  Donald Trump's opponents rested their case against him on the argument he can't beat Joe Biden.  Now polls suggest he can.  —  Publicly and privately, on the stump and in closed-door pitches to prospective donors … ",
    "url": "https://www.politico.com/news/2023/11/08/trump-biden-electability-argument-00125911"
  },
  {
    "text": "Ron DeSantis's biggest donor is considering backing Donald Trump  —  Space-exploring property baron Robert Bigelow says Florida governor is not the ‘commander’ US needs  —  Ron DeSantis's biggest donor is considering switching his support to Donald Trump, in a sharp rebuke of the Florida governor's White House aspirations.",
    "url": "https://www.ft.com/content/1c4d3643-dee7-4070-b74a-f2baf1a57dc8"
  },
  {
    "text": "House GOP subpoenas Hunter Biden alongside suite of Biden family members  —  Hunter Biden and his uncle James Biden have been subpoenaed Wednesday by the House Oversight Committee, which took the remarkable step of seeking depositions from family members of President Biden amid its impeachment inquiry.",
    "url": "https://thehill.com/homenews/house/4300041-house-gop-subpoenas-hunter-biden/"
  },
  {
    "text": "Jim Jordan Sniffs Dick Pics While Rome Burns  —  Yesterday, David Weiss, the US Attorney turned Special Counsel leading an investigation into Hunter Biden that has entered a sixth year, testified to the House Judiciary Committee.  —  His written statement debunked Gary Shapley's claims … ",
    "url": "https://www.emptywheel.net/2023/11/08/jim-jordan-sniffs-dick-pics-while-rome-burns/"
  },
  {
    "text": "'I'm calling from Israeli intelligence.  We have the order to bomb.  You have two hours'  —  The call to Mahmoud Shaheen came at dawn.  —  It was Thursday 19 October at about 06:30, and Israel had been bombing Gaza for 12 days straight.  —  He'd been in his third-floor … ",
    "url": "https://www.bbc.com/news/world-middle-east-67327079"
  },
  {
    "text": "House Democrat pulls resolution to censure GOP Rep. Mast  —  House Democrats have yanked a resolution to censure GOP Rep. Brian Mast (Fla.) for his comments appearing to compare Palestinian civilians with Nazis in the wake of Hamas's deadly attack on Israel last month.",
    "url": "https://thehill.com/homenews/house/4299605-house-democrat-pulls-resolution-to-censure-gop-rep-mast/"
  },
  {
    "text": "Three Arrested for Operating High-End Brothel Network  —  For Immediate Release  —  U.S. Attorney's Office, District of Massachusetts  —  Interested sex buyers were allegedly required to provide employer information and references before booking appointments",
    "url": "https://www.justice.gov/usao-ma/pr/three-arrested-operating-high-end-brothel-network"
  },
  {
    "text": "Buttigieg makes surprise visit to Ukraine  —  Transportation Secretary Pete Buttigieg made a surprise visit to Ukraine to meet with government leaders to discuss the county's economic recovery, the Department of Transportation announced Wednesday.  —  Buttigieg will discuss efforts to … ",
    "url": "https://thehill.com/homenews/administration/4299621-buttigieg-surprise-visit-to-ukraine/"
  }
]