[
  {
    "text": "Trump's Midnight In America  —  Three weeks and a day until election day, and this thing is tied, tied, tied.  Nate Silver's polling average has Kamala Harris up a tick under three points nationally—which might give Donald Trump the barest of edges at this moment in the Electoral College.",
    "url": "https://www.thebulwark.com/p/trumps-midnight-in-america"
  },
  {
    "text": "October 13, 2024  —  “He is the most dangerous person ever.  I had suspicions when I talked to you about his mental decline and so forth, but now I realize he's a total fascist.  He is now the most dangerous person to this country...a fascist to the core.”",
    "url": "https://heathercoxrichardson.substack.com/p/october-13-2024"
  },
  {
    "text": "Trump targets immigrants legally in US for deportation  —  Having protected status may not save you. … As the 2024 election heads into the home stretch, Donald Trump and JD Vance are doing what they do best: whipping up a racist campaign of hate against immigrants.",
    "url": "https://www.publicnotice.co/p/trump-deportation-tps-humanitarian-parole"
  },
  {
    "text": "Harris campaign targets Republicans in Arizona with new ad  —  The ad features GOP Mesa Mayor John Giles, who also spoke at the DNC.  —  Kamala Harris' campaign is out with a new ad targeting Republican voters in the battleground state of Arizona that features the GOP mayor of Mesa saying that he is a … ",
    "url": "https://www.politico.com/news/2024/10/14/kamala-harris-ad-trump-arizona-00183578"
  },
  {
    "text": "Hurricane recovery officials in N.C. relocated amid report of ‘armed militia,’ email shows  —  Safety fears are growing as misinformation collides with a large-scale federal recovery effort.  —  LAKE LURE, N.C. — Federal emergency response personnel on Saturday had employees operating … ",
    "url": "https://www.washingtonpost.com/weather/2024/10/13/federal-officials-nc-temporarily-relocated-amid-report-armed-militia-email-shows/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI4NzkyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwMTc0Mzk5LCJpYXQiOjE3Mjg3OTIwMDAsImp0aSI6ImVhZWZhZDUyLWFhY2EtNDc3Zi1iZDRlLWZkMzM1NmVjOTBjMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93ZWF0aGVyLzIwMjQvMTAvMTMvZmVkZXJhbC1vZmZpY2lhbHMtbmMtdGVtcG9yYXJpbHktcmVsb2NhdGVkLWFtaWQtcmVwb3J0LWFybWVkLW1pbGl0aWEtZW1haWwtc2hvd3MvIn0.BaGrTy9ZRxMPH9cxITvM1C18f2v862tZKRIZxsmtuSc&itid=gfta"
  },
  {
    "text": "Michigan GOP candidate's ad aimed at Black voters has wrong election date  —  The Michigan Legislative Black Caucus accused Republican Tom Barrett's campaign of misleading Black voters with an ad carrying the wrong election date.  —  Tom Barrett, a Republican vying for a Michigan congressional seat … ",
    "url": "https://www.washingtonpost.com/elections/2024/10/14/tom-barrett-michigan-election-misleading-ad/"
  },
  {
    "text": "Internal polling memo has warning signs for Senate Republicans  —  Some races are tightening but other key pickup opportunities are moving in the wrong direction, according to a new round of polling from the Senate Leadership Fund.  —  The top GOP super PAC charged with flipping the Senate … ",
    "url": "https://www.politico.com/news/2024/10/13/senate-republican-poll-memo-00183570"
  },
  {
    "text": "Swastika Flags Flown During Donald Trump Boat Parade in Florida  —  A boat bearing swastika symbols and Donald Trump  —  flags was hosed down after trying to join a Trump boat parade in Jupiter, Florida.  —  The boat was photographed attempting to take part in the parade on Sunday in the",
    "url": "https://www.newsweek.com/swastika-flags-flown-donald-trump-boat-parade-florida-us-presidential-2042-election-1968426"
  },
  {
    "text": "Trump Insists He's Not ‘Cognitively Impaired’ In Jumbled Rally Tangent  —  The former president also slid in a wildly exaggerated claim about the size of the crowd he drew a day earlier.  —  LOADING  —  Former President Donald Trump insisted he's not “cognitively impaired” during a wandering … ",
    "url": "https://www.huffpost.com/entry/trump-cognitively-impaired-rant_n_670ce592e4b04266ae85b4f7"
  },
  {
    "text": "Trump ground game undercut by slow internet that crashes app  —  Trump campaign wants to hit rural voters but slow internet limits the functionality of the Campaign Sidekick app  —  Donald Trump's campaign has limited ability to know whether their ground game operation is reaching target voters … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/14/trump-ground-game-smartphone-app"
  },
  {
    "text": "Exclusive: Suspect in Coachella Valley Trump assassination attempt denies accusation, supports ex-president  —  Suspect a registered Republican from Las Vegas and member of a right-leaning anti-government group, sheriff says  —  A third assassination attempt against former President Donald Trump … ",
    "url": "https://www.pressenterprise.com/2024/10/13/las-vegas-man-found-with-loaded-firearm-high-capacity-magazine-near-trump-rally-in-coachella-valley/"
  },
  {
    "text": "The Atlantic Editor-In-Chief Jeffrey Goldberg warns newsroom decay is how ‘democracy decomposes’  —  “We're sleepwalking into an absolute disaster,” Goldberg said.  —  In an industry beset by challenges, The Atlantic is a rare bright spot.  —  The 167-year-old magazine announced this week … ",
    "url": "https://www.status.news/p/atlantic-jeffrey-goldberg-2024-interview"
  },
  {
    "text": "Kamala Harris Sets an Interview with a Not-So-Friendly Outlet: Fox News.  —  The interview, to be conducted by the anchor Bret Baier in Pennsylvania, will air Wednesday at 6 p.m. Eastern.  —  Vice President Kamala Harris has agreed to an interview with Fox News, the network said on Monday.",
    "url": "https://www.nytimes.com/2024/10/14/business/media/fox-news-kamala-harris-interview.html"
  },
  {
    "text": "‘Inappropriate and unprofessional’: State Election Board chair wants his Republican peers to back down  —  In an exclusive interview, John Fervier says Georgia election board members shouldn't be activists  —  The chair of the State Election Board says his Republican colleagues have gone too far … ",
    "url": "https://www.ajc.com/politics/state-election-board-chair-john-fervier-says-his-gop-peers-abused-power/MXT2PYFGAZGCLLQ4B6KTPG5VBY/"
  },
  {
    "text": "Scoop: Karine Jean-Pierre blocks John Kirby at White House podium … - Kirby, President Biden's top spokesperson for foreign affairs, joined Jean-Pierre for most briefings after Israel was attacked on Oct. 7, 2023.  — But for the past two-plus months Kirby has been mostly absent in the briefing room … ",
    "url": "https://www.axios.com/2024/10/14/white-house-briefings-karine-jean-pierre-john-kirby"
  },
  {
    "text": "Texas county sidelines librarians, reclassifies book on abuse of Native Americans as “fiction”  —  A Texas county has mandated public libraries move a well-regarded children's book documenting the mistreatment of Native Americans in New England — Colonization and the Wampanoag Story — from the “non-fiction” section to “fiction.”",
    "url": "https://popular.info/p/texas-county-sidelines-librarians"
  },
  {
    "text": "Biden warned Iran that killing Trump would be an act of war: report  —  US spends millions to protect former Trump officials from Iran retaliation for Soleimani killing  —  President Biden reportedly instructed his National Security Council to make clear to Iran that any attempt … ",
    "url": "https://www.foxnews.com/politics/biden-warned-iran-killing-trump-would-act-war-report?intcmp=tw_fnc"
  }
]