[
  {
    "text": "Helicopter Carrying Iran's President Has Crashed, State Media Reports  —  Rescuers are trying to locate the helicopter on which President Ebrahim Raisi and Foreign Minister Hossein Amir Abdollahian were traveling, state media reported.  Their status is unknown.",
    "url": "https://www.nytimes.com/2024/05/19/world/middleeast/iran-president-helicopter-crash.html"
  },
  {
    "text": "Iranian President Is Missing After Helicopter Crash in Dense Fog  — Raisi was in Iran's East Azerbaijan province to inaugurate dam  — President's entourage includes foreign minister, also missing  —  Rescue teams are searching into the night to try to locate Iranian President Ebrahim Raisi … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-19/air-fleet-of-iran-s-raisi-involved-in-incident-iranian-state-tv"
  },
  {
    "text": "CNN political commentator Alice Stewart dies  —  Alice Stewart, a veteran political adviser and CNN political commentator who worked on several GOP presidential campaigns, has died.  She was 58.  —  Law enforcement officials told CNN that Stewart's body was found outdoors in the Bellevue neighborhood … ",
    "url": "https://www.cnn.com/2024/05/18/politics/alice-stewart-cnn-commentator-dies"
  },
  {
    "text": "Trump at NRA convention floats a 3-term presidency  —  The former president has more recently shut down the proposition of seeking a third term, which is barred by the Constitution.  —  Former President Donald Trump on Saturday floated the idea of a third term if he wins in November.",
    "url": "https://www.politico.com/news/2024/05/18/trump-at-nra-convention-floats-a-three-term-presidency-00158786"
  },
  {
    "text": "Sen. Marco Rubio won't commit to accepting 2024 election results  —  Rubio blamed Democrats for opposing “every Republican victory since 2000.  Every single one.”  —  Florida GOP Sen. Marco Rubio, widely seen as a potential vice presidential pick for former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/2024-election/marco-rubio-2024-election-results-rcna152954"
  },
  {
    "text": "Lawyer preparation suggests Trump won't testify in New York trial  —  Awaiting final word from the mercurial defendant, the judge is proceeding as if Trump will not take the stand.  —  After brashly declaring he wanted to testify in his criminal trial, it appears increasingly unlikely … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/18/trump-trial-testifying/"
  },
  {
    "text": "Bibi blocks Israeli intel chiefs' meetings with U.S. officials … - Rubio, vice chair of the Senate's intelligence committee, requested the meetings during his visit to Israel last month.  — Netanyahu himself met with Rubio. … - Instead, the U.S. officials and some Netanyahu critics … ",
    "url": "https://www.axios.com/2024/05/19/netanyahu-israel-agencies-ban-us-gaza-war"
  },
  {
    "text": "‘Politically calculated’: Trump confronts his RFK Jr. problem on vaccines  —  The former president is accusing Kennedy of being a “fake” anti-vaxxer.  —  Donald Trump's long-fraught relationship with the Covid vaccine is again becoming a political liability for the former president as he tries … ",
    "url": "https://www.politico.com/news/2024/05/19/trump-vaccine-rfk-jr-00158743"
  },
  {
    "text": "The Senate filibuster is a hurdle to any national abortion bill.  Democrats are campaigning on it  —  Sen. Tammy Baldwin, facing a tough reelection fight in one of the races that will determine control of Congress, has made protecting reproductive rights a cornerstone of her campaign … ",
    "url": "https://apnews.com/article/abortion-senate-filibuster-2024-democrats-republicans-cc02b78b1029233abe9911c14d285c7a"
  },
  {
    "text": "Rep. Elise Stefanik rebukes Biden and praises Trump in address to Israeli parliament  —  Rep. Elise Stefanik of New York, the highest-ranking Republican woman in the House, rebuked President Biden and praised former President Trump over U.S. military support for Israel in an address to its parliament on Sunday.",
    "url": "https://www.cbsnews.com/news/elise-stefanik-rebuke-biden-praise-trump-israeli-parliament/"
  },
  {
    "text": "After years of Democratic dominance, Nevada could be slipping from Biden's grasp  —  The Silver State hasn't supported a Republican presidential candidate since George W. Bush in 2004, but polls this year so far show Donald Trump with a lead.  —  LAS VEGAS — For nearly two decades … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/19/biden-nevada-voters-economy-election-2024/"
  },
  {
    "text": "Louisiana set to become 1st state requiring 10 Commandments be posted in schools  —  Louisiana is poised to become the first state requiring display of the Ten Commandments at all schools that receive public funding, including colleges and universities.",
    "url": "https://www.axios.com/local/new-orleans/2024/05/17/louisiana-10-commandments-classrooms"
  },
  {
    "text": "Gantz to Netanyahu: If you don't change course by June 8 we will withdraw from the government  —  Israeli Minister Gantz sets June 8 deadline for Gaza plan.  Threatens to exit government if demands unmet.  Netanyahu office responds with ultimatums.  —  In a move likely to aggravate political tension … ",
    "url": "https://www.jpost.com/breaking-news/article-801652"
  },
  {
    "text": "Biden and Trump Hunt for Breakthrough Moment in Stagnant Election  —  Up-for-grabs voters have tuned out the messengers, and their messages  —  WASHINGTON—Tens of millions of dollars in TV ads has failed to lift President Biden's historically weak approval ratings.",
    "url": "https://www.wsj.com/politics/elections/2024-election-biden-trump-breakthrough-moments-401aca2b"
  }
]