[
  {
    "text": "Biden's Call With Hispanic Lawmakers Goes Off the Rails  —  The call ended abruptly after Rep. Mike Levin asked Biden to withdraw from the race.  Soon after, Levin formally called on Biden to step down as the nominee.  — Copy  —  As President Joe Biden tries to talk with Democratic lawmakers … ",
    "url": "https://www.notus.org/biden-2024/biden-call-hispanic-lawmakers-off-the-rails"
  },
  {
    "text": "Biden blasts Project 2025 in Michigan and ties it to Trump in effort to regain footing  —  A more energetic Biden leaned into a line of attack that unifies Democrats and could appeal beyond his base as he seeks to move past the party infighting over his candidacy.",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-blasts-project-2025-michigan-ties-trump-effort-regain-footing-rcna161640"
  },
  {
    "text": "A Fiery Biden, Ignoring Critics, Attacks Trump to Chants of ‘Lock Him Up’  —  Facing rising frustration in his party, the president brushed it off in an energetic speech in Michigan.  Inside the room, at least, the Democratic mood was defiant, with cheers of “Don't go, Joe.”",
    "url": "https://www.nytimes.com/2024/07/12/us/politics/biden-speech-detroit.html"
  },
  {
    "text": "Biden's Path to Re-election Has All But Vanished  —  President Biden has spent much of 2024 with a more challenging path to winning a second presidential term in November than Donald Trump.  But for reasons that have become glaringly obvious, that path has all but vanished.",
    "url": "https://www.nytimes.com/interactive/2024/07/12/opinion/biden-trump-electoral-map-outlook.html"
  },
  {
    "text": "'It's over': Democrats remain in panic over Biden's reelection  —  They sum it up simply: It's bad.  —  As President Joe Biden's support continues to crumble, his party is reckoning with the possibility of a punishing defeat in November — a potential GOP wave that would not only elect … ",
    "url": "https://www.politico.com/news/2024/07/12/biden-gop-election-wave-00167944"
  },
  {
    "text": "UAW Chief Suggests Trump Is Headed for Victory Over Biden  — Shawn Fain warns that Democrats risk a repeat of 2016 debacle  — United Auto Workers endorsed Biden's reelection in January  —  United Auto Workers President Shawn Fain suggested Donald Trump is on track to defeat Joe Biden in November … ",
    "url": "https://www.bloomberg.com/news/articles/2024-07-12/uaw-chief-suggests-trump-is-headed-for-victory-over-biden"
  },
  {
    "text": "Musk Donates to Trump, Tapping Fortune to Swing 2024 Race  — Tech mogul contributed to group backing Trump in swing states  — Move demonstrates Musk's growing influence in Washington  —  Billionaire Elon Musk has donated to a super political action committee working to elect Donald Trump … ",
    "url": "https://www.bloomberg.com/news/articles/2024-07-12/elon-musk-donates-to-trump-tapping-vast-fortune-to-swing-2024-race"
  },
  {
    "text": "Judge throws out Rudy Giuliani's bankruptcy case, says he flouted process with lack of transparency  —  NEW YORK (AP) — A judge threw out Rudy Giuliani 's bankruptcy case on Friday, finding that the former New York City mayor had flouted process with a lack of transparency.",
    "url": "https://apnews.com/article/giuliani-bankruptcy-freeman-moss-2020-election-3cf8d70d1dc2608705c9f938bbb8941d"
  },
  {
    "text": "Shocker Poll Suggests Trump's Lying May Be Huge Weakness for Him  —  A new Marist poll takes the novel step of asking registered voters which is more off-putting in an occupant of the Oval Office: dishonesty or excessive age.  The results are surprising, and along with other polling along these lines … ",
    "url": "https://newrepublic.com/article/183784/poll-trump-lying-huge-weakness"
  },
  {
    "text": "Exclusive: Meta removes Trump account restrictions ahead of 2024 election … - While those penalties were designed to limit any public figure's accounts during civil unrest, Donald Trump's accounts were the only ones that have so far been subject to those restrictions, a spokesperson confirmed.",
    "url": "https://www.axios.com/2024/07/12/trump-meta-facebook-instagram-account-restrictions-election"
  },
  {
    "text": "Rightwing claim of ‘0% chance’ of fair US election previews effort to undo 2024 result  —  Mike Howell makes comment at Heritage Foundation event where implausible post-election scenarios were shared  —  The fight for democracy is supported by  —  A major conservative thinktank previewed rightwing efforts … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/12/heritage-foundation-mike-howell-election"
  },
  {
    "text": "BREAKING: People Are Voting “Kari Lake” for Senate; Today, She Is Asking the AZ Supreme Court To Declare Her Governor  —  Thousands of people have already voted in the July 30 primary, and presumably, many have voted for Kari Lake to be the Republican nominee for U.S. Senate.",
    "url": "https://arizonaslaw.blogspot.com/2024/07/breaking-people-are-voting-kari-lake.html"
  },
  {
    "text": "Moms for Liberty seeks order blocking federal LGBTQ school protections nationwide  —  A Friday filing from the extremist organization seeks a ruling that would block the Biden administration's Title IX rule in more than 850 counties across the U.S.  —  The far-right extremist group Moms … ",
    "url": "https://www.lawdork.com/p/moms-for-liberty-seeks-order-blocking"
  },
  {
    "text": "Rupert Murdoch Lobbies Trump to Pick Doug Burgum for VP — and Not J.D. Vance  —  The retired media mogul has been calling Trump multiple times a day, a source close to the former president told NOTUS.  — Copy  —  Rupert Murdoch has launched a full-scale lobbying effort to get Donald Trump … ",
    "url": "https://www.notus.org/trump-2024/rupert-murdoch-trump-doug-burgum-vp-j-d-vance"
  },
  {
    "text": "Jill Biden's grudge against Kamala Harris REVEALED: Power-hungry first lady's grudge is so deep that the only thing worse than Joe stepping down is the VP replacing him  —  By LAURA COLLINS CHIEF INVESTIGATIVE REPORTER FOR DAILYMAIL.COM and JOSH BOSWELL FOR DAILYMAIL.COM and KEN SILVERSTEIN FOR DAILYMAIL.COM",
    "url": "https://www.dailymail.co.uk/news/article-13625323/Jill-Biden-grudge-against-Kamala-Harris-deep.html"
  },
  {
    "text": "Scoop: Inside Biden's shrinking inner circle … - Democrats inside and outside the White House tell Axios they're worried that Biden isn't receiving a 360-degree view of his — and his party's — perilous political situation.  — In the two weeks since Biden's disastrous debate … ",
    "url": "https://www.axios.com/2024/07/12/biden-election-inner-circle-withdrawal-criticism"
  },
  {
    "text": "A presidential nominee drops out.  What happens to states' ballots?  —  Experts say it's likely the Supreme Court would settle the resulting mess  —  This special report was written with contributions from States Newsroom's 39 state news bureaus.  —  WASHINGTON — The Electoral College … ",
    "url": "https://michiganadvance.com/2024/07/12/a-presidential-nominee-drops-out-what-happens-to-states-ballots/"
  }
]