[
  {
    "text": "Inside the Explosive Meeting Where Trump Officials Clashed With Elon Musk  —  Simmering anger at the billionaire's unchecked power spilled out in a remarkable Cabinet Room meeting.  The president quickly moved to rein in Mr. Musk.  — 3.5k  —  Marco Rubio was incensed.",
    "url": "https://www.nytimes.com/2025/03/07/us/politics/trump-musk-doge-power.html?unlocked_article_code=1.2E4.f8eL.HfFykWbEEPJx&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Marco Rubio Melts Down at Musk in Furious Cabinet Shouting Match  —  Marco Rubio blew up at Elon Musk at a closed-door Cabinet meeting after the DOGE head accused the secretary of state of failing to slash his staff, according to a report.Musk, the world's richest man, told the secretary of state … ",
    "url": "https://www.thedailybeast.com/marco-rubio-clashes-with-elon-musk-in-furious-cabinet-meeting-meltdown/"
  },
  {
    "text": "Is DOGE Losing Steam?  —  President Donald Trump's shift on the Department of Government Efficiency began with a warning from an unlikely source.  —  Jesse Watters, a co-host of the Fox News hit show The Five, is usually a slick deliverer of MAGA talking points.",
    "url": "https://www.theatlantic.com/politics/archive/2025/03/trump-musk-power-restraints/681974/"
  },
  {
    "text": "EXCLUSIVE: Trump Makes Aggressive New Claim of Executive Power To Circumvent The Senate  —  In email obtained by TPM, White House claims that Trump can appoint whoever he wants - absent Congress.  —  The Trump White House has taken its attempt to seize direct control over the entire executive branch … ",
    "url": "https://talkingpointsmemo.com/news/exclusive-trump-makes-aggressive-new-claim-of-executive-power-to-circumvent-the-senate"
  },
  {
    "text": "Trump administration cancels $400 million in grants for Columbia University  —  The move comes shortly after the administration notified Columbia University that it was conducting a “comprehensive review” of its federal grants and contracts.  —  The Trump administration on Friday announced … ",
    "url": "https://www.nbcnews.com/politics/politics-news/trump-administration-cancels-400-million-grants-columbia-university-rcna195373"
  },
  {
    "text": "Army Corps knew Trump order would waste California water, memo shows  —  The Army Corps colonel responsible for releasing reservoir water at Trump's direction knew it wouldn't reach Southern California as he promised, a memo obtained by The Post shows.  —  Just now",
    "url": "https://www.washingtonpost.com/climate-environment/2025/03/07/trump-water-release-california-fires/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxMzIzNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyNzAyMzk5LCJpYXQiOjE3NDEzMjM2MDAsImp0aSI6ImFkODVkOWU5LWY1OWUtNDUzMi1iZWYxLWZhNWRiNjdkYjZiZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9jbGltYXRlLWVudmlyb25tZW50LzIwMjUvMDMvMDcvdHJ1bXAtd2F0ZXItcmVsZWFzZS1jYWxpZm9ybmlhLWZpcmVzLyJ9.i57PLw1yOiwRWUC1p7BUDUcWH3hkk8WW0HC2c1a-Y-I&itid=gfta"
  },
  {
    "text": "Federal prosecutors who worked on the Eric Adams case escorted out of workplace  —  It's the latest way the move to dismiss the case against New York City's mayor has roiled the Justice Department.  —  Two federal prosecutors in the Southern District of New York who worked on the case … ",
    "url": "https://www.nbcnews.com/politics/justice-department/federal-prosecutors-worked-eric-adams-case-escorted-workplace-rcna195398"
  },
  {
    "text": "Exclusive: U.S. CDC plans study into vaccines and autism, sources say  —  The U.S. Centers for Disease Control and Prevention is planning a large study into potential connections between vaccines and autism, two sources familiar with the matter told Reuters, despite extensive scientific research … ",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-cdc-plans-study-into-vaccines-autism-sources-say-2025-03-07"
  },
  {
    "text": "Thrust into unemployment, axed federal workers face relatives who celebrate their firing  —  NEW YORK (AP) — Scrambling to replace their health insurance and to find new work, some laid-off federal workers are running into another unexpected unpleasantry: Relatives cheering their firing.",
    "url": "https://www.bostonherald.com/2025/03/07/trump-doge-family-strife/"
  },
  {
    "text": "Exclusive: Donald Trump Jr. Considering a Run For President in 2028  —  When President Donald Trump sat down for an interview with Fox News last month, anchor Bret Baier asked what should have been a softball question: “Do you view Vice President JD Vance as your successor, the Republican nominee in 2028?”",
    "url": "https://www.mediaite.com/politics/donald-trump-jr-considering-a-run-for-president-in-2028-sources/"
  },
  {
    "text": "Attention Deficit and Defiance Division of Labor: There's Stuff Happening Where You're Not Looking  —  Last week, I wrote a post about the five ways Trump is sabotaging America.  Those included:  — The original Project 2025 plan, an Orbanist plot to turn the US into an elected authoritarian government",
    "url": "https://www.emptywheel.net/2025/03/07/attention-deficit-and-defiance-division-of-labor-theres-stuff-happening-where-youre-not-looking/"
  },
  {
    "text": "DOGE Has Deployed Its GSAi Custom Chatbot for 1,500 Federal Workers  —  Elon Musk's DOGE team is automating tasks as it continues its purge of the federal workforce.  —  Elon Musk's so-called Department of Government Efficiency has deployed a proprietary chatbot called GSAi to 1,500 federal workers … ",
    "url": "https://www.wired.com/story/gsai-chatbot-1500-federal-workers/"
  },
  {
    "text": "Trump Organization sues Capital One for closing its bank accounts four years ago  —  President Donald Trump's business trust sued Capital One for closing its bank accounts in 2021, claiming the Virginia lender “debanked” them over their political views causing “considerable financial harm.”",
    "url": "https://www.cnn.com/2025/03/07/business/trump-organization-sues-capital-one/"
  },
  {
    "text": "Sam Bankman-Fried Ramps Up Effort for a Pardon From Trump  —  Mr. Bankman-Fried's family and allies are trying to help him escape a 25-year prison sentence for fraud related to the collapse of his cryptocurrency exchange, FTX.  —  Consulting with a lawyer who has ties to President Trump.",
    "url": "https://www.nytimes.com/2025/03/07/technology/sam-bankman-fried-pardon-trump.html"
  },
  {
    "text": "I'm sad to share that I was fired today from the job I have poured my heart and soul into for the last three years.  I am so proud of the team we built in the Office of the Pardon Attorney, who will carry on our important work.  I'm very grateful for the many extraordinary people I've had the opportunity to connect with on this journey.",
    "url": "https://www.linkedin.com/posts/liz-oyer-245042206_im-sad-to-share-that-i-was-fired-today-from-activity-7303903623426560002-CneR"
  },
  {
    "text": "New DOGE Staffer Has Ties to a Sanctioned Russian Oligarch  —  Sam Corcos, a new member of Elon Musk's DOGE team, reportedly showed up at the IRS demanding detailed info about American taxpayers to hunt for fraud  —  There is a new staffer from the so-called Department of Government Efficiency seeking access … ",
    "url": "https://www.rollingstone.com/politics/politics-features/doge-staffer-corcos-wife-ties-russian-oligarch-1235291673/"
  },
  {
    "text": "Treasury Secretary Bessent says economy could be ‘starting to roll a little bit’  —  Treasury Secretary Scott Bessent on Friday acknowledged some signs of weakness in the U.S. economy.  —  “Could we be seeing that this economy that we inherited starting to roll a bit?  Sure.",
    "url": "https://www.cnbc.com/2025/03/07/treasury-secretary-bessent-says-economy-could-be-starting-to-roll-a-little-bit.html"
  },
  {
    "text": "‘Just following Hispanic people’: Citizen detained by ICE questions vote for Trump  —  Manassas man says he was pulled over on his way to work by agents looking for another man  —  A naturalized Hispanic man says he was detained by Immigration and Customs Enforcement agents who were looking … ",
    "url": "https://www.nbcwashington.com/news/local/northern-virginia/just-following-hispanic-people-citizen-detained-by-ice-questions-vote-for-trump/3861172/"
  },
  {
    "text": "Trump Plans to Restrict Loan Forgiveness for Non-Profit Workers  —  President Donald Trump plans to sign an executive order that will restrict eligibility for a government-run student loan forgiveness program, targeting individuals whose work for non-profits clashes with the administration's immigration policies.",
    "url": "https://www.bloomberg.com/news/articles/2025-03-07/trump-plans-to-restrict-loan-forgiveness-for-non-profit-workers"
  },
  {
    "text": "LIVE March 7, 2025, 12:36 p.m. ET Trump Talks About Tariffs, Ukraine and Student Loans From the Oval Office  —  Where Things Stand  — Russia sanctions: President Trump said Friday that he was “strongly considering” imposing new sanctions and tariffs on Russia until a cease-fire … ",
    "url": "https://www.nytimes.com/live/2025/03/07/us/trump-news-crypto"
  },
  {
    "text": "Trump threatens new tariffs on Canada, including 250% tax on dairy  —  A day after offering Canada a one-month reprieve on punishing nearly across-the-board 25% tariffs, President Donald Trump has threatened new tariffs as soon as Friday on Canadian lumber and dairy products.",
    "url": "https://www.cnn.com/2025/03/07/business/tariffs-trump-canada/"
  },
  {
    "text": "Charlie Kirk warns “all these campuses that don't treat us well at Turning Point USA” may have their funding cut  —  Pro-Trump podcaster Kyle Forgeard talks about YouTube's event during Trump's inauguration weekend  —  Media Matters weekly newsletter, March 7  —  Broadcast correspondents covering climate change in 2024",
    "url": "https://www.mediamatters.org/charlie-kirk/charlie-kirk-warns-all-these-campuses-dont-treat-us-well-turning-point-usa-may-have"
  },
  {
    "text": "How Trump's ‘51st State’ Canada Talk Came to Be Seen as Deadly Serious  —  President Trump, in an early February call, challenged the border treaty between the two countries and told Justin Trudeau he didn't like their shared water agreements.  —  After President Trump imposed tariffs on Canada on Tuesday … ",
    "url": "https://www.nytimes.com/2025/03/07/world/canada/trump-trudeau-canada-51st-state.html?unlocked_article_code=1.2E4.1xeE.HqJcQUoYdF55&smid=url-share"
  },
  {
    "text": "Trans women transferred to men's prisons despite rulings against Trump's order  —  Incarcerated trans women report being groped by male guards and suicidal thoughts: 'I'm punished for existing'  —  Transgender women incarcerated in the US prison system have been transferred … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/07/transgender-women-prison-trump"
  },
  {
    "text": "Fox Business host on ‘shocking decline’ in consumer spending: ‘The boom times are over’  —  Fox Business Network host Charles Payne said the apparent decline in consumer spending was “shocking” on Friday, and said a return to “boom times” was not on the horizon.",
    "url": "https://thehill.com/business/5183167-fox-business-host-on-shocking-decline-in-consumer-spending-the-boom-times-are-over/"
  },
  {
    "text": "OCC Clarifies Bank Authority to Engage in Certain Cryptocurrency Activities  —  WASHINGTON—The Office of the Comptroller of the Currency (OCC) today took action to reaffirm that a range of cryptocurrency activities are permissible in the federal banking system.",
    "url": "https://occ.gov/news-issuances/news-releases/2025/nr-occ-2025-16.html"
  },
  {
    "text": "Hatching a Conspiracy: A BIG Investigation into Egg Prices  —  This issue is part one of a three-part series on the egg industry.  It is written by antitrust lawyer Basel Musharbash, based in part on a report he authored for Farm Action.  —  Over the past two months, egg prices have become a political football.",
    "url": "https://www.thebignewsletter.com/p/hatching-a-conspiracy-a-big-investigation"
  },
  {
    "text": "Monmouth University will shutter its gold-standard polling institute  —  Patrick Murray, institute's director since 2005, will depart  —  Monmouth University is planning to imminently shutter its lauded polling institute, sources with direct knowledge of the matter have told the New Jersey Globe … ",
    "url": "https://newjerseyglobe.com/polling/monmouth-university-will-shutter-its-gold-standard-polling-institute/"
  },
  {
    "text": "DOGE's Latest Casualty: The Government's Texting Service For Urgent Reminders  —  Code in the agency's web site says the service is no longer available.  Sources tell Forbes most of the team that manages it have been “fired, transferred, or have resigned.”  —  Cyrus Farivar is a Forbes senior writer who covers retail and more.",
    "url": "https://www.forbes.com/sites/cyrusfarivar/2025/03/07/doges-latest-casualty-the-governments-texting-service-for-urgent-reminders/"
  },
  {
    "text": "Entire Phoenix field office of General Services Administration fired, says court executive  —  The entire Phoenix field office of the U.S. General Services Administration has been fired, according to a federal court administrator.  —  The field office “was the subject of a reduction in force … ",
    "url": "https://www.azcentral.com/story/news/local/phoenix/2025/03/07/phoenix-field-office-firings-major-impact-federal-courts/81953179007/"
  }
]