[
  {
    "text": "Lindsey Graham ‘threw Trump under the bus’ in Georgia case, book says  —  Senator told grand jury in election subversion case Trump would have believed martians stole the election, per Find Me the Votes  —  The South Carolina senator Lindsey Graham “threw Donald Trump under the bus” … ",
    "url": "https://www.theguardian.com/books/2024/jan/24/find-me-the-votes-book-graham-trump-georgia"
  },
  {
    "text": "The irony of Trump's angry reaction to his N.H. primary victory  —  So let me get this straight.  Donald Trump, of all people, is outraged by the very idea of a candidate presenting a second-place finish as a success?  —  For speechwriters, remarks after a primary victory are an easy lift.",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/irony-trumps-angry-reaction-nh-primary-victory-rcna135420"
  },
  {
    "text": "Collins, leading Senate GOP centrist, won't endorse Trump in 2024  —  Sen. Susan Collins (Maine), the top-ranking Republican on the Senate Appropriations Committee and a key figure in getting bills passed through Congress, says she will not endorse former President Trump, even if he becomes the Republican Party's nominee for president.",
    "url": "https://thehill.com/homenews/senate/4426835-collins-wont-endorse-trump-2024/"
  },
  {
    "text": "Trump fumes in victory, Haley spins in defeat: Takeaways from New Hampshire … A disgusted Trump lashed out in response, dropping any pretense of civility as he ripped Haley as an “imposter” standing in his way.  —  3 takeaways from New Hampshire … - You wouldn't know it from the tone of her speech … ",
    "url": "https://www.axios.com/2024/01/24/new-hampshire-trump-haley-takeaways"
  },
  {
    "text": "Auto Workers Union Endorses Biden Over ‘Scab’ Trump  —  The UAW is backing the president months after he made history by picketing alongside striking workers  —  THE UNITED AUTO Workers (UAW), one of the nation's largest and most influential unions in the country, has endorsed Joe Biden for president.",
    "url": "https://www.rollingstone.com/politics/politics-news/uaw-endorses-biden-scab-trump-1234953626/"
  },
  {
    "text": "Wall Street's bargain with Trump  —  Many corporate leaders are misguided in playing down the risks of a second term for the Republican former president  —  The Financial Times had only nice things to say about Benito Mussolini in a June 1933 supplement entitled “The Renaissance of Italy: Fascism's gift of order and progress”.",
    "url": "https://www.ft.com/content/8fbf3a47-f622-46cc-ac06-17732cecc313"
  },
  {
    "text": "The time for denial is over: Republicans are really nominating Donald Trump  —  Huge numbers of voters still don't believe Trump will be the nominee — will New Hampshire be the wake-up call?  —  Tuesday night's primary results from New Hampshire are going to be a shock to a lot of people's systems.",
    "url": "https://www.salon.com/2024/01/24/the-time-for-denial-is-over-really-will-pick-donald-as-their-nominee/"
  },
  {
    "text": "Arizona GOP chair resigns, alleges Kari Lake blackmail  —  The chairman of the Arizona Republican Party announced he will resign on Wednesday after leaked audio appeared to show him attempting to pay Senate candidate Kari Lake not to run for office in 2024.  —  Jeff DeWit said that the audio was “selectively edited.”",
    "url": "https://thehill.com/homenews/state-watch/4427081-arizona-gop-chair-resigns-alleges-kari-lake-blackmail/"
  },
  {
    "text": "After seeming to bribe Senate hopeful Kari Lake not to run, Arizona GOP Chair resigns  —  The head of the Arizona Republican Party resigned Wednesday following the release of a surreptitiously recorded conversation of him seemingly trying to bribe Kari Lake to stay out of this year's U.S. Senate race.",
    "url": "https://www.npr.org/2024/01/24/1226681435/bribery-kari-lake-arizona-gop-resigns"
  },
  {
    "text": "The White House has its own pharmacy—and, boy, was it shady under Trump  —  It wasted $750K during the Trump years and freely handed out Ambien and Provigil.  —  The White House has its own pharmacy that, until recently, could perhaps best be described as a hot mess, according … ",
    "url": "https://arstechnica.com/science/2024/01/the-white-house-has-its-own-pharmacy-and-boy-was-it-shady-under-trump/"
  },
  {
    "text": "Senate panel advances bill to seize frozen Russian assets for Ukraine  —  The Senate Foreign Relations Committee advanced legislation Wednesday to allow the U.S. to seize frozen Russian assets to pay for Ukraine's reconstruction.  —  The top Democrat and Republican on the panel were confident … ",
    "url": "https://thehill.com/policy/international/4426738-seize-russian-assets-ukraine-senate/"
  },
  {
    "text": "Republicans Turn on Their Impeachment Chairman: ‘Parade of Embarrassments’ (Exclusive)  —  One Trump ally told The Messenger ‘the base is starting to get more and more frustrated’ with Comer  —  JWPlayer  —  House Republicans are increasingly disenchanted with Rep. James Comer, R-Ky. … ",
    "url": "https://themessenger.com/politics/republicans-turn-on-their-impeachment-chairman-a-parade-of-embarrassments-exclusive"
  },
  {
    "text": "Religious ‘Nones’ are now the largest single group in the U.S.  —  When Americans are asked to check a box indicating their religious affiliation, 28% now check ‘none.’  —  A new study from Pew Research finds that the religiously unaffiliated - a group comprised of atheists … ",
    "url": "https://www.npr.org/2024/01/24/1226371734/religious-nones-are-now-the-largest-single-group-in-the-u-s"
  },
  {
    "text": "Nose wheel falls off Boeing 757 passenger jet awaiting takeoff  —  Delta Air Lines jet was due to depart from Atlanta airport and none of six crew or 184 passengers were hurt  —  A nose wheel fell off a Delta Air Lines Boeing 757 passenger jet and rolled away as the plane lined up for takeoff … ",
    "url": "https://www.theguardian.com/business/2024/jan/24/delta-air-lines-plane-nose-wheel-falls-off"
  },
  {
    "text": "Video shows massive waves crashing Army base in Marshall Islands, causing extensive damage  —  A series of powerful weather-driven waves struck a key U.S. military installation in the Marshall Islands Saturday night, damaging infrastructure and forcing dozens of people to evacuate the island.",
    "url": "https://www.usatoday.com/story/news/nation/2024/01/23/marshall-islands-rogue-wave-video/72323059007/"
  },
  {
    "text": "Ohio lawmakers override DeWine veto of gender-affirming care ban, transgender athlete restrictions  —  The Ohio Senate voted 23-9 Wednesday to override Republican Gov. Mike DeWine's veto of legislation banning gender-affirming health care for minors and preventing transgender women and girls from competing on female school sports teams.",
    "url": "https://thehill.com/homenews/lgbtq/4427040-ohio-senate-house-override-dewine-veto-gender-affirming-care-ban-transgender-athlete/"
  },
  {
    "text": "Hillary Clinton says Margot Robbie and Greta Gerwig are ‘more than Kenough’ after ‘Barbie’ Oscar snubs  —  The former presidential candidate and secretary of state weighed in on Academy Awards controversy.  —  Hillary Clinton is the latest prominent voice to speak out against the Oscar snubs of … ",
    "url": "https://www.nbcnews.com/pop-culture/pop-culture-news/hillary-clinton-says-margot-robbie-greta-gerwig-are-kenough-barbie-osc-rcna135481"
  },
  {
    "text": "What is Tucker Carlson doing in Canada?  —  Albertans turn out for Tucker Carlson MAGA tour.  —  CALGARY — A year ago, Tucker Carlson was calling on Americans to invade and “liberate” Canada from Prime Minister Justin Trudeau.  —  Now, he's getting the red carpet treatment in Alberta.",
    "url": "https://www.politico.com/news/2024/01/24/tucker-carlson-canada-00137380"
  },
  {
    "text": "Judge denies Smartmatic bid to dismiss counterclaim made by Fox News  —  A judge in New York has denied a motion by voting systems company Smartmatic to toss a counterclaim made by Fox News as part of an ongoing legal battle between the two companies over the network's coverage of the 2020 election.",
    "url": "https://thehill.com/homenews/media/4426706-judge-denies-smartmatic-counterclaim-fox-news/"
  },
  {
    "text": "White House Said to Delay Decision on Enormous Natural Gas Export Terminal  —  Before deciding whether to approve it, the Energy Department will analyze the climate impacts of CP2, one of 17 proposed LNG export terminals.  —  The Biden administration is pausing a decision on whether to approve … ",
    "url": "https://www.nytimes.com/2024/01/24/climate/biden-lng-export-terminal-cp2.html"
  }
]