[
  {
    "text": "Congress Has the Opportunity to Do the Funniest Thing Ever  —  The Speaker election looks tight.  The presidential election certification is just days away.  Could Republicans impose their own January 6th through sheer obstinacy?  —  House Speaker Mike Johnson (R-LA) … ",
    "url": "https://prospect.org/politics/2025-01-02-congress-republicans-speaker-mike-johnson-january-6/"
  },
  {
    "text": "Scoop: GOP moderates warn Johnson not to repeat McCarthy's deal … - Johnson said in a “Fox and Friends” interview Thursday that he has spoken with “every single one” of his detractors and that “we'll be talking about process reforms in the House.”  — GOP sources have told Axios … ",
    "url": "https://www.axios.com/2025/01/02/mike-johnson-mccarthy-moderates-speaker-deal"
  },
  {
    "text": "Republicans are once again staring down House speaker drama.  Here's what's at stake.  —  Mike Johnson is trying to tamp down another Republican revolt. … On Friday, January 3, the newly elected Congress will convene for the first time and vote for a House speaker.",
    "url": "https://www.vox.com/politics/393091/house-republican-speaker-drama-mike-johnson"
  },
  {
    "text": "Cybertruck blast suspect was a ‘Rambo type’ who loved Trump, family says  —  Exclusive: Matthew Livelsberger's shocked uncle told The Independent that the Green Beret was a ‘supersoldier’  —  Your support helps us to tell the story  —  From reproductive rights to climate change to Big Tech … ",
    "url": "https://www.independent.co.uk/news/world/americas/cybertruck-explosion-suspect-matthew-livelsberger-vegas-b2672940.html"
  },
  {
    "text": "Soldier shot self in head before Cybertruck exploded outside Trump's Las Vegas hotel, officials say  —  The highly decorated Army soldier inside a Tesla Cybertruck packed with fireworks that exploded outside Trump International Hotel in Las Vegas shot himself in the head just before detonation, authorities said Thursday.",
    "url": "https://apnews.com/article/trump-hotel-explosion-tesla-cybertruck-5c5a8fd13a50e2bcde46370ae926d427"
  },
  {
    "text": "Alleged Cybertruck Bomber Was ‘Big’ Trump Supporter: Source  —  The man suspected of being behind Tesla Cybertruck explosion in Las Vegas was a “big” supporter of Donald Trump and voted for him in November, a senior law enforcement official tells the Daily Beast.That revelation came … ",
    "url": "https://www.thedailybeast.com/las-vegas-cybertruck-bomber-matthew-livelsberger-was-a-trump-supporter-source/"
  },
  {
    "text": "FBI releases new video of a suspect planting a pipe bomb near DNC offices on eve of the Capitol riot  —  A harrowing chapter in American history remains shrouded in mystery: Who planted pipe bombs outside offices of the Democratic and Republican national committees in Washington on the eve of the attack on the Capitol?",
    "url": "https://apnews.com/article/capitol-riot-pipe-bombs-fbi-washington-ea85b6fe5fe9140f1c75b7ee8c0554b2"
  },
  {
    "text": "FBI releases new video and evidence in D.C. pipe bomb case, still unsolved 4 years later  —  Washington — In the four years since the Capitol attack on Jan. 6, 2021, federal investigators have amassed troves of evidence leading to the arrests of more than 1,500 defendants.",
    "url": "https://www.cbsnews.com/news/dc-pipe-bomber-dnc-rnc-fbi-new-video/"
  },
  {
    "text": "Net Neutrality Rules Struck Down by Appeals Court  —  After nearly two decades of fighting, the battle over regulations that treat broadband providers like utilities came to an end on Thursday.  —  A federal appeals court struck down the Federal Communications Commission's landmark net neutrality rules … ",
    "url": "https://www.nytimes.com/2025/01/02/technology/net-neutrality-rules-fcc.html?unlocked_article_code=1.mE4.-uFh.y-1QX1by865j&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "The New Orleans attack shows that ISIS hasn't gone away.  It's changed.  —  The “caliphate” is history.  But ISIS is still a threat. … The deadly attack in New Orleans on New Year's Eve that left 15 people dead feels like a disturbing reminder of a past era, one when the transnational … ",
    "url": "https://www.vox.com/world-politics/393110/new-orleans-isis-jabbar"
  },
  {
    "text": "Why Don't the Tech Bros Just Hire from MAGA?  —  1. MSG  —  I remain fascinated by the intraparty MAGA-DOGE fight.  The MAGA position seems to be:  — Elite college-grad Americans are bad because they're woke or whatever.  — The Forgotten Men of MAGA are every bit as smart and capable … ",
    "url": "https://www.thebulwark.com/p/why-dont-the-tech-bros-just-hire"
  },
  {
    "text": "Siri “unintentionally” recorded private convos; Apple agrees to pay $95M … Apple has agreed to pay $95 million to settle a lawsuit alleging that its voice assistant Siri routinely recorded private conversations that were then sold to third parties for targeted ads.",
    "url": "https://arstechnica.com/tech-policy/2025/01/apple-agrees-to-pay-95m-delete-private-conversations-siri-recorded/"
  },
  {
    "text": "Elon Musk and the right's war on Wikipedia  —  Listen to me read this post here (not an AI-generated voice!), subscribe to the feed in your podcast app, or download the recording for later.  —  When Elon Musk launched his latest crusade against Wikipedia this Christmas Eve … ",
    "url": "https://www.citationneeded.news/elon-musk-and-the-rights-war-on-wikipedia/"
  },
  {
    "text": "Trump flunks 3 key tests following deadly New Orleans attack  —  Within hours of the New Year's attack in New Orleans, the president-elect simultaneously flunked tests of accuracy, decency and credibility.  —  As the public first started learning the details of the deadly attack in New Orleans … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-flunks-3-key-tests-deadly-new-orleans-attack-rcna185965"
  },
  {
    "text": "Eyeing Potential Bird Flu Outbreak, Biden Administration Ramps Up Preparedness  —  The administration is committing an additional $306 million toward battling the virus, and will distribute the money before President-elect Donald J. Trump takes office.  —  The Biden administration … ",
    "url": "https://www.nytimes.com/2025/01/02/us/politics/bird-flu-biden-trump.html"
  },
  {
    "text": "I Was Wrong About the 2024 Election.  Here's Why.  —  I thought Kamala Harris would win.  I was wrong.  While I'm sure we Democrats can argue that the loss wasn't a landslide or take a little solace in our House performance, the most important thing for us now is to face that we were wrong and take action on the prevailing “why.”",
    "url": "https://www.nytimes.com/2025/01/02/opinion/democrats-donald-trump-economy.html"
  },
  {
    "text": "Meta will appoint Republican Joel Kaplan to lead global policy team, as Nick Clegg steps down  —  THE SCOOP  —  Meta is revamping its global policy team, with President Nick Clegg stepping down and being replaced by Joel Kaplan, his deputy and the company's most prominent Republican, people familiar with the matter said.",
    "url": "https://www.semafor.com/article/01/02/2025/meta-will-appoint-joel-kaplan-to-lead-global-policy-team-replacing-nick-clegg"
  },
  {
    "text": "Governor seeks resignation of Western New Mexico University regents after spending revelations  —  New Mexico Gov. Michelle Lujan Grisham has asked for the immediate resignation of regents at Western New Mexico State University after revelations of wasteful spending and failures in financial oversight … ",
    "url": "https://apnews.com/article/western-new-mexico-regents-resignation-553678a0735d9bfbd5c60a6fd073827e"
  },
  {
    "text": "GrantED: U.S. Department of Justice  —  Over $100 Million for Restorative Justice, DEI and Social Emotional Learning  —  Total DOJ Grant Money Awarded (2021-present): $100,113,942  —  Total number of DOJ grants (2021-present): 102  —  Number of States: 36",
    "url": "https://defendinged.org/investigations/granted-u-s-department-of-justice/"
  },
  {
    "text": "Suspects in Vegas explosion, New Orleans attack served at same Army base, sources tell Denver7 Investigates  —  Authorities were investigating the link as a possible connection between the two attacks, those sources said.  —  DENVER — The Colorado Springs resident suspected of detonating … ",
    "url": "https://www.denver7.com/news/local-news/suspects-in-vegas-explosion-new-orleans-attack-served-at-same-army-base-sources-tell-denver7-investigates"
  },
  {
    "text": "Buddy MacKay, a Democrat who briefly served as Florida's governor, dead at 91  —  Former Florida Gov. Buddy MacKay, who lost to Jeb Bush in 1998 but still served 23 days in office after the sudden death of Gov. Lawton Chiles, has died.  He was 91.  —  The former Democratic governor took … ",
    "url": "https://apnews.com/article/buddy-mackay-dead-former-florida-governor-obituary-23b9cbdc43b54b6d8d97dd4b2a6799ee"
  },
  {
    "text": "FBI: Now We Don't Believe This *Terrorist* Acted Alone  —  More details of the terrorist attack in New Orleans have emerged, including the fact that the local FBI team finally admitted it was terrorism.  The deceased perp has been identified as a US-born citizen named Shamsud-Din Jabbar … ",
    "url": "https://hotair.com/ed-morrissey/2025/01/01/fbi-we-dont-believe-this-terrorist-acted-alone-n3798407"
  },
  {
    "text": "Judges uphold ruling: Parson to appoint St. Louis County prosecutor  —  ST. LOUIS — A state appeals court on Thursday upheld a ruling that gives Missouri Gov. Mike Parson the power to appoint the next St. Louis County prosecutor.  —  The ruling came hours after lawyers for state … ",
    "url": "https://www.stltoday.com/news/local/crime-courts/judges-uphold-ruling-parson-to-appoint-st-louis-county-prosecutor/article_67674b3a-c86a-11ef-918c-e7a63507de17.html"
  },
  {
    "text": "Scoop: Biden discussed plans to strike Iran nuclear sites if Tehran speeds toward bomb … - Biden and his national security team discussed various options and scenarios during the meeting, which took place roughly one month ago, but the president did not make any final decision, according to the sources.",
    "url": "https://www.axios.com/2025/01/02/iran-nuclear-weapon-biden-white-house"
  }
]