[
  {
    "text": "Another Flag for Alito  —  Don't Despair, Vote  —  My God.  —  Tonight, more reporting from Jodi Kantor, joined by Aric Toler and Judy Tate at The New York Times, on Justice Alito's flag-flying practices.  It turns out that in the summer of 2023, the Alitos flew an “Appeal to Heaven” flag at their summer beach house in New Jersey.",
    "url": "https://joycevance.substack.com/p/another-flag-for-alito"
  },
  {
    "text": "Sam Alito is a problem  —  Chief Justice John Roberts must take responsibility for his court.  If he does not, what follows will be his legacy — and we'll have to deal with the fallout.  —  It's been clear for some time that Justice Sam Alito was the Fox News (or an even further right-wing channel) … ",
    "url": "https://www.lawdork.com/p/sam-alito-is-a-problem"
  },
  {
    "text": "Nikki Haley Surrendered, but Not Her Voters  —  Sign up for The Decision, a newsletter featuring our 2024 election coverage.  —  The views of Nikki Haley Republicans—pro-Ukraine, pro-Israel, pro-market—reflect all those things that Republicans used to think in that bygone era when Reagans and Bushes and Romneys roamed the Earth.",
    "url": "https://www.theatlantic.com/politics/archive/2024/05/nikki-haley-trump-endorse/678461/"
  },
  {
    "text": "Biden campaign met with Haley voters to woo them following her pledge to vote for Trump  —  Voters shared policy issues that were important to them heading into November.  —  People cheer as U.S. Republican Presidential hopeful and former UN Ambassador Nikki Haley arrives for a campaign rally, Feb. 23, 2024, in Moncks Corner, S.C.",
    "url": "https://abcnews.go.com/Politics/biden-campaign-met-haley-voters-woo-pledge-vote/story?id=110505447"
  },
  {
    "text": "A Unique Election Driven by a Traditional Issue  —  There are a lot of unique and untested variables in this upcoming presidential election.  It is the first race in more than 100 years between an incumbent and former incumbent president (both of whom would be the oldest ever to be inaugurated).",
    "url": "https://www.cookpolitical.com/survey-research/2024-swing-state-project/unique-election-driven-traditional-issue"
  },
  {
    "text": "Obama State Dept blocked FBI from arresting supporters of Iran nuclear program in US: Emails  —  The State Department blocked arrests of several individuals suspected of aiding Iran's nuclear program as the Obama administration was negotiating the JCPOA  —  EXCLUSIVE: The Obama-Biden State Department … ",
    "url": "https://www.foxnews.com/politics/obama-state-dept-blocked-fbi-arresting-supporters-iran-nuclear-program-us-emails"
  },
  {
    "text": "Louisiana Lawmakers Vote to Make Abortion Pills Controlled Substances  —  The legislation would make possession of the drugs without a prescription a crime in Louisiana, punishable with jail time.  —  Louisiana lawmakers passed legislation on Thursday to make the state the first in the nation … ",
    "url": "https://www.nytimes.com/2024/05/23/us/politics/louisiana-abortion-pills-controlled-substances.html"
  },
  {
    "text": "Justice Department Sues Live Nation-Ticketmaster for Monopolizing Markets Across the Live Concert Industry  —  For Immediate Release  —  Live Nation-Ticketmaster's Exclusionary Conduct and Dominance Across the Live Concert Ecosystem Harms Fans, Innovation, Artists, and Venues",
    "url": "https://www.justice.gov/opa/pr/justice-department-sues-live-nation-ticketmaster-monopolizing-markets-across-live-concert"
  },
  {
    "text": "Garland calls Trump's false claim of Biden DOJ plan to potentially assassinate him during FBI's Mar-a-Lago search ‘extremely dangerous’  —  He noted the FBI had a similar policy during the search of Biden's home.  —  A police car is seen outside former President Donald Trump's residence in Mar-A-Lago … ",
    "url": "https://abcnews.go.com/Politics/garland-calls-trumps-false-claim-biden-doj-plan/story?id=110504598"
  },
  {
    "text": "The White House to the left: We told you so on crime  —  ‘Well-meaning ideas have gone too far, and we need a sensible approach.’  —  The defeat of a liberal Portland prosecutor at the hands of a tough-on-crime challenger has hardened a view among top White House officials that Democrats need … ",
    "url": "https://www.politico.com/news/2024/05/23/white-house-oregan-turn-towards-center-00159588"
  },
  {
    "text": "Natalie Harp: Gatekeeper to the Reich  —  I want to unpack a Marc Caputo story about Natalie Harp, who he says is the person who posted the Reich meme video to Trump's Truth Social account this week.  —  Trump's account posted the Reich video on Monday.  —  On Tuesday, AP identified a troll … ",
    "url": "https://www.emptywheel.net/2024/05/23/natalie-harp-gatekeeper-to-the-reich/"
  },
  {
    "text": "Congressman Andy Ogles admits his claims to have loaned $320,000 to his campaign were not true  —  GOP opponent Courtney Johnston: 'If Andy Ogles is willing to lie about his own money, what won't he lie about?'  —  NASHVILLE, Tenn. (WTVF) — Tennessee Congressman Andy Ogles filed 11 amendments … ",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/revealed/congressman-andy-ogles-admits-his-claims-to-have-loaned-320-000-to-his-campaign-were-not-true"
  },
  {
    "text": "Political consultant indicted for AI robocalls with fake Biden voice made to New Hampshire voters  —  MANCHESTER, N.H. —  A man who admitted to sending out robocalls mimicking President Joe Biden's voice on the day of the New Hampshire primary is now facing criminal charges.",
    "url": "https://www.wmur.com/article/steve-kramer-ai-robocalls-biden-indictment-52224/60875422"
  },
  {
    "text": "Senate Democrats Open Inquiry Into Trump's $1 Billion Request of Oil Industry  —  Two committees are seeking information from oil executives about a dinner where, the lawmakers say, the former president proposed a quid pro quo.  —  Senate Democrats opened an investigation on Thursday … ",
    "url": "https://www.nytimes.com/2024/05/23/climate/trump-oil-democrats.html"
  },
  {
    "text": "Judge Outlines ‘Shell Game’ Played with Classified Docs at Mar-a-Lago  —  THIS WEEK'S MOST IMPORTANT NEWS is barely making headlines: On Tuesday, it was revealed that a federal judge found over a year ago that there is sufficient evidence, if believed by a jury, to find that Donald J. Trump … ",
    "url": "https://www.thebulwark.com/p/judge-outlines-mar-a-lago-shell-game-classified"
  },
  {
    "text": "The Minnesota GOP endorsed an anti-semite for U.S. Senate.  Republicans are silent.  —  Earlier this month, Congressman Tom Emmer (R-MN) blasted college students protesting Israel's military operations in Gaza.  “By these students' own admission, they're not just standing in solidarity with this pro-Hamas … ",
    "url": "https://popular.info/p/the-minnesota-gop-endorsed-an-anti"
  },
  {
    "text": "Do you need a college degree to succeed?  Here's what the data shows.  —  College was once widely viewed as a pathway to success, but today only about 1 in 4 Americans say a bachelor's degree is necessary to secure a well-paying job, according to a new survey from the Pew Research Center.",
    "url": "https://www.cbsnews.com/news/college-degree-income-is-college-worth-it-pew/"
  },
  {
    "text": "Supreme Court Sides With Republicans Over South Carolina Voting Map  —  The case concerned a constitutional puzzle: how to distinguish the roles of race and partisanship in drawing voting maps when Black voters overwhelmingly favor Democrats.  —  The Supreme Court cleared the way on Thursday … ",
    "url": "https://www.nytimes.com/2024/05/23/us/supreme-court-south-carolina-voting-map.html"
  },
  {
    "text": "Florida attorney general says state will investigate Starbucks for DEI practices  —  Florida's top legal officer on Wednesday said the state will investigate Starbucks, the multinational chain of coffeehouses, for its diversity, equity and inclusion practices.",
    "url": "https://www.usatoday.com/story/news/nation/2024/05/23/florida-investigates-dei-starbucks/73816554007/"
  },
  {
    "text": "Will RFK Jr. Swing the Election to Biden?  —  Third parties never win, but on occasion they've been known to determine the loser.  —  No third-party candidate will win the 2024 presidential election or even a single state.  But a third-party candidate could decide the election's outcome.",
    "url": "https://www.wsj.com/articles/will-rfk-jr-swing-the-election-to-biden-307b113e"
  },
  {
    "text": "House Democrat Banned From Speaking for Simply Listing Trump's Trials  —  SPITTING FACTS  —  Lawmakers apparently aren't allowed to speak about Trump's trials on the House floor—unless they're backing him.  —  Rep. Jim McGovern (D-MA) was temporarily banned from speaking on the House floor Wednesday … ",
    "url": "https://www.thedailybeast.com/house-democrat-banned-from-speaking-for-simply-listing-trumps-trials"
  },
  {
    "text": "Arizona lawmaker uses ChatGPT to help craft legislation to combat deepfakes  —  Republican state Rep. Alex Kolodin says he used the artificial intelligence software to help define a subsection of a bill Gov. Katie Hobbs signed into law.  —  PHOENIX — A Republican member of the Arizona House used ChatGPT … ",
    "url": "https://www.nbcnews.com/politics/2024-election/arizona-lawmaker-uses-chatgpt-help-craft-deepfake-legislation-rcna153432"
  },
  {
    "text": "Crypto's ‘huge moment’ scrambling US politics  —  Recent votes surfaced household names like Chuck Schumer and Nancy Pelosi as unexpected allies.  —  Cryptocurrency is used by a fraction of the American electorate.  But it's starting to have an outsize impact on U.S. politics and policy.",
    "url": "https://www.politico.com/news/2024/05/23/crypto-2024-election-impact-00159506"
  },
  {
    "text": "South Carolina 1st District Republican Primary Poll: Rep. Mace Leads Primary Opponents  —  Home Polls South Carolina 1st District Republican Primary Poll: Rep. Mace Leads Primary Opponents  —  Economy is Top Issue for Primary Voters  —  A new Emerson College Polling/The Hill poll … ",
    "url": "https://emersoncollegepolling.com/south-carolina-1st-district-republican-primary-poll-rep-mace-leads-primary-opponents/"
  }
]