[
  {
    "text": "House Republicans narrowly pass defense bill loaded with culture war issues  —  The tactic represented a gamble for Speaker Mike Johnson, who could have pushed to pass a more bipartisan version with the help of Democrats.  —  The House narrowly cleared defense policy legislation on Friday … ",
    "url": "https://www.politico.com/news/2024/06/14/house-republicans-narrowly-pass-defense-bill-loaded-with-culture-war-issues-00163453"
  },
  {
    "text": "Supreme Court rules gun ‘bump stocks’ ban is unlawful  —  The ban was imposed by the Trump administration after the accessory was used during the 2017 mass shooting in Las Vegas.  —  WASHINGTON — In a loss for the Biden administration, the Supreme Court on Friday ruled that federal ban on … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rules-gun-bump-stocks-ban-unlawful-rcna154651"
  },
  {
    "text": "Moment Biden, 81, freezes AGAIN after shuffling away from G7 leaders forcing Italian PM to shepherd him back for pic  —  Watch Biden's latest concerning incident in the clip above  —  ELDERLY Joe Biden has given his “worst ever” performance at a major international summit, G7 insiders say … ",
    "url": "https://www.thesun.co.uk/news/28495274/joe-biden-freezes-again-shuffling-g7-giorgia-meloni/"
  },
  {
    "text": "Biden's condition shocks allies at G7 summit, with one saying it's ‘worst he has ever been’: report  —  President Biden has been “losing focus” during discussions at this week's G7 summit in Italy, with one diplomatic insider saying the commander-in-chief is “the worst he has ever been.”",
    "url": "https://nypost.com/2024/06/14/us-news/bidens-condition-shocks-allies-at-g7-summit-with-one-saying-its-worst-he-has-ever-been-report/"
  },
  {
    "text": "Alex Jones' personal assets will be sold to help pay Sandy Hook debt as judge decides Infowars' fate  —  A federal judge on Friday ordered the liquidation of conspiracy theorist Alex Jones ′ personal assets but was still deciding on his company's separate bankruptcy case … ",
    "url": "https://apnews.com/article/alex-jones-sandy-hook-lawsuit-3ccd113496caee18a085dfa54c6e6c0e"
  },
  {
    "text": "The Chilling Reason You May Never See the New Trump Movie  —  This week I finally got to see “The Apprentice,” an absorbing, disturbing movie about the relationship between the red-baiting mob lawyer Roy Cohn and a young Donald Trump.  The film, which was received with an extended standing ovation … ",
    "url": "https://www.nytimes.com/2024/06/14/opinion/the-apprentice-trump-movie.html"
  },
  {
    "text": "CEOs at Trump meeting: Ex-president ‘meandering’ and 'doesn't know what he's talking about' … WATCH NOW  —  WASHINGTON — Former President Donald Trump failed to impress everyone in a room full of top CEOs Thursday at the Business Roundtable's quarterly meeting, multiple attendees told CNBC.",
    "url": "https://www.cnbc.com/2024/06/14/ceos-at-trump-meeting-not-impressed.html"
  },
  {
    "text": "Pentagon ran secret anti-vax propaganda campaign to incite fear of China vaccines during pandemic  —  The U.S. military launched a clandestine program amid the COVID crisis to discredit China's Sinovac inoculation - payback for Beijing's efforts to blame Washington for the pandemic.",
    "url": "https://www.reuters.com/investigates/special-report/usa-covid-propaganda/"
  },
  {
    "text": "Anthony Fauci: Volcanic Donald Trump Screamed F-Bombs, Then Said He Loved Me  —  COVID BOOK LEAK  —  In his memoir “On Call,” Anthony Fauci tells how Trump lurched from crisis to crisis and said he would win in a “f***ing landslide.” … Donald Trump shouted foul-mouthed abuse at Anthony Fauci … ",
    "url": "https://www.thedailybeast.com/anthony-fauci-covid-book-volcanic-donald-trump-screamed-f-bombs-at-me"
  },
  {
    "text": "Scoop: McConnell eyes his next move … - McConnell, 82, is both a student and a practitioner of power.  — While no final decision has been made, such a post would let him remain a force with real juice, wielding enviable say over funding for everything from the Pentagon to pet projects until he finishes his term in 2027.",
    "url": "https://www.axios.com/2024/06/14/mcconnell-trump-senate-republicans-appropriations"
  },
  {
    "text": "Scoop: Democrats plan to go bigger than a boycott for Netanyahu speech … - The proposals include a press conference, a vigil, or an event with families of those taken hostage by Hamas, many of whom feel Netanyahu hasn't done enough to free their loved ones.",
    "url": "https://www.axios.com/2024/06/14/democrats-boycott-netanyahu-speech-congress"
  },
  {
    "text": "Biden's senior momentum: Why he's courting older voters … - Former President Trump, as Axios reported yesterday, appears to be making stunning gains of his own among young voters.  — The polls could still be wrong. … (Another theory: The hippies got old.)",
    "url": "https://www.axios.com/2024/06/14/biden-2024-election-polls-older-voters"
  },
  {
    "text": "Trump has ‘sort of a pretty good idea’ of VP pick, will probably announce during RNC convention  —  Trump will likely announce VP pick during the Republican National Convention, which will be held in July in Milwaukee  —  Join Fox News for access to this content",
    "url": "https://www.foxnews.com/politics/trump-has-sort-pretty-good-idea-vp-pick-probably-announce-during-rnc-convention"
  },
  {
    "text": "Top GOPer Accidentally Wrecks Trump's Biggest Lie About Jack Smith  —  Don't look now, but Donald Trump's criminality is slowly morphing into a serious wedge issue against the Republican Party—and Democrats, fortunately, are beginning to act like it.  —  Politico's Playbook reported Thursday … ",
    "url": "https://newrepublic.com/article/182728/top-goper-accidentally-wrecks-trumps-biggest-lie-jack-smith"
  },
  {
    "text": "Summers Says Trump Tax Ideas Mean ‘Mother of All Stagflations’  — Former Treasury secretary warns of 10% mortgage rates  — Summers urges GOP-leaning economists, executives to speak up  —  Trump Tax Ideas Could Cause ‘Economic Warfare,’ Summers Says",
    "url": "https://www.bloomberg.com/news/articles/2024-06-14/summers-says-trump-tax-ideas-mean-mother-of-all-stagflations"
  },
  {
    "text": "Putin offers truce if Ukraine exits Russian-claimed areas and drops NATO bid.  Kyiv rejects it  —  Russian President Vladimir Putin promised Friday to “immediately” order a cease-fire in Ukraine and begin negotiations if Kyiv started withdrawing troops from the four regions annexed by Moscow in 2022 and renounced plans to join NATO.",
    "url": "https://apnews.com/article/putin-russia-ukraine-war-4f58423548b3d2e8594c9d9eb8e9d36e"
  },
  {
    "text": "DOJ says it won't prosecute Attorney General Merrick Garland after House contempt vote  —  The Justice Department said Friday that it would not act on the House's contempt referral of Attorney General Merrick Garland.  —  In a letter to House Speaker Mike Johnson, DOJ pointed to its … ",
    "url": "https://www.cnn.com/2024/06/14/politics/merrick-garland-contempt-vote-no-prosecution"
  },
  {
    "text": "Hamas official says ‘no one has any idea’ how many Israeli hostages are still alive  —  The fate of the 120 remaining hostages in Gaza is crucial to any deal to end the protracted and bloody conflict between Israel and Hamas.  But a senior Hamas official has told CNN that “no one has an idea” … ",
    "url": "https://www.cnn.com/2024/06/13/middleeast/hamas-interview-israel-gaza-hostages-intl/"
  }
]