[
  {
    "text": "Judge Engoron's Ruling Is a Detailed Road Map to Trump's Thievery … The news about the eye-popping $355 million judgment against Donald Trump Friday minimized or even missed the real story in the judge's richly detailed ruling.  —  In justifying his findings of fact … ",
    "url": "https://newrepublic.com/article/179079/engoron-ruling-details-trump-thievery"
  },
  {
    "text": "We are all victims of Trump's fraud  —  Stealing a little bit from everyone is still stealing. … Is lying on your loan application to get better terms a victimless offense?  Donald Trump and his supporters claim it is, but in damning detail, Justice Authur Engoron sketched out who was wronged in his 92-page verdict.",
    "url": "https://www.publicnotice.co/p/engoron-trump-new-york-fraud-victims-explained"
  },
  {
    "text": "Anti-Trump Burnout: The Resistance Says It's Exhausted  —  Bracing for yet another election against Donald Trump, America's liberals are feeling the fatigue.  “We're kind of, like, crises-ed out,” one Democrat said.  —  In 2017 they donned pink hats to march on Washington … ",
    "url": "https://www.nytimes.com/2024/02/19/us/politics/trump-resistance-democrats-voters.html"
  },
  {
    "text": "Poll Ranks Biden as 14th-Best President, With Trump Last  —  President Biden may owe his place in the top third to his predecessor: Mr. Biden's signature accomplishment, according to the historians, was evicting Donald J. Trump from the Oval Office.  —  President Biden has not had a lot of fun perusing polls lately.",
    "url": "https://www.nytimes.com/2024/02/18/us/politics/biden-trump-presidential-rankings.html"
  },
  {
    "text": "Trump-Putin 2024  —  Happy Presidents' Day—a quick missive today, and we'll let you get back to your holiday.  —  Hanging Putin Around Trump's Neck  —  Not to be a Debbie Downer on Presidents' Day, but I want to talk about Donald Trump and Vladimir Putin.",
    "url": "https://plus.thebulwark.com/p/trump-putin-2024"
  },
  {
    "text": "Biden administration is leaning toward supplying Ukraine with long-range missiles  —  If Republicans continue to block U.S. military aid to Ukraine, the White House could turn to an ally to provide Kyiv with ATACM missiles capable of striking Russian-held Crimea.",
    "url": "https://www.nbcnews.com/investigations/biden-administration-leaning-supplying-ukraine-long-range-missiles-rcna139394"
  },
  {
    "text": "John Oliver Offers Clarence Thomas Millions to Resign Immediately  —  “Your move, Clarence,” the “Last Week Tonight” host said at the end of his 11th season premiere.  “Your fucking move.”  —  There's a reason John Oliver and his Last Week Tonight crew keep winning Emmys … ",
    "url": "https://www.thedailybeast.com/john-oliver-offers-clarence-thomas-millions-to-resign-immediately"
  },
  {
    "text": "Florida health officials investigate measles outbreak at school  — Four measles cases were confirmed at a South Florida elementary school  — The first case was reported Thursday; three others were confirmed Saturday  — Officials advise contacting health providers before vising offices if sick",
    "url": "https://thehill.com/policy/healthcare/4476924-florida-health-officials-investigate-measles-outbreak-at-school/"
  },
  {
    "text": "Wisconsin's Democratic governor signs his new state legislative maps into law  —  Republicans control the Legislature but approved the new lines to avoid a court fight.  —  MADISON, Wisconsin — Wisconsin Democratic Gov. Tony Evers signed new legislative district maps into law on Monday … ",
    "url": "https://www.politico.com/news/2024/02/19/wisconsin-democratic-governor-signs-state-legislative-maps-00142096"
  },
  {
    "text": "US proposes UN resolution supporting temporary ceasefire in Gaza  —  The United States has proposed a rival draft United Nations Security Council resolution that would underscore the body's “support for a temporary ceasefire in Gaza as soon as practicable,” according to the text seen by Reuters on Monday.",
    "url": "https://www.reuters.com/world/us-proposes-un-resolution-supporting-temporary-ceasefire-gaza-2024-02-19/"
  },
  {
    "text": "House Republicans' majority is falling apart  —  A television network boss once told me there is no political talk show that will get better ratings than a videotape of any politician tripping and falling.  —  That's still true.  —  American television networks can't pull their cameras away … ",
    "url": "https://thehill.com/opinion/campaign/4463811-house-republicans-majority-is-falling-apart/"
  },
  {
    "text": "Lauren Boebert Tries to Convince New District She's Not All Drama  —  Colorado Republican has fundraising and recognition advantages but faces chilly reception from local groups in crowded primary race  —  KIOWA, Colo.—Campaign swag for one of the nation's most visible and controversial members … ",
    "url": "https://www.wsj.com/politics/elections/lauren-boebert-colorado-district-election-2024-7414ca32"
  },
  {
    "text": "US Army under increasing pressure as it foots bill for Ukraine support  —  As funding for Ukraine faces an uncertain future in Congress, the US Army has been left to foot the bill for hundreds of millions of dollars in support for Ukraine's war effort against Russia over the last few months … ",
    "url": "https://www.cnn.com/2024/02/19/politics/us-army-ukraine-support-pressure/"
  },
  {
    "text": "The Kremlin has never been richer - thanks to a US strategic partner  —  Russia is entering its third year of war in Ukraine with an unprecedented amount of cash in government coffers, bolstered by a record $37 billion of crude oil sales to India last year, according to new analysis … ",
    "url": "https://www.cnn.com/2024/02/19/europe/russia-oil-india-shadow-fleet-cmd-intl/"
  }
]