[
  {
    "text": "How Republicans got Murkowski to yes on Trump's megabill … Her vote was at risk of being out of reach, especially after the Senate parliamentarian ruled that multiple sweetener provisions to boost Medicaid payments to Alaska and Hawaii violated Senate rules that limit what can pass through … ",
    "url": "https://www.politico.com/news/2025/07/01/murkowski-trump-alaska-megabill-00435981"
  },
  {
    "text": "At least 17 million Americans would lose insurance under Trump plan  —  GOP legislation would set back years of progress in expanding health care coverage, unwinding key parts of the Affordable Care Act.  —  The Senate version of President Donald Trump's massive tax and immigration spending plan … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/01/least-17-million-americans-would-lose-insurance-under-trump-plan/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUxMzQyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUyNzI0Nzk5LCJpYXQiOjE3NTEzNDI0MDAsImp0aSI6IjRmNmE0NTM1LWRlOTYtNDViMS1hZWIxLTIzYjQwOGVkODFkNCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA3LzAxL2xlYXN0LTE3LW1pbGxpb24tYW1lcmljYW5zLXdvdWxkLWxvc2UtaW5zdXJhbmNlLXVuZGVyLXRydW1wLXBsYW4vIn0.ocr08DvIPpFyQTant2DT9gT22fhxmBBk88-HeQ8Xt2U&itid=gfta"
  },
  {
    "text": "Poorest Americans Would Be Hurt By Trump's Big Bill  —  Small improvements in taxes are overshadowed by cuts to health insurance and other federal aid, resulting in a package favoring the wealthy.  —  Millions of low-income Americans could experience staggering financial losses under … ",
    "url": "https://www.nytimes.com/2025/07/01/business/poor-americans-senate-legislation.html?unlocked_article_code=1.TE8.CbLZ.zxYOJHMcFkJ8&smid=url-share"
  },
  {
    "text": "Lisa Murkowski says it was ‘agonizing’ to vote for the megabill  —  Sen. Lisa Murkowski made the “agonizing” decision to vote for Senate Republicans' version of the “big, beautiful” bill after winning key concessions on federal health and food-aid programs for her state.  “Did I get everything I wanted?",
    "url": "https://www.politico.com/live-updates/2025/07/01/congress/lisa-murkowski-repulican-megabill-alaska-00435150"
  },
  {
    "text": "Fox News, MAGA hats and cookies: Inside Trump's West Wing  —  Trump likes to see whom he wants and call whom he chooses, and in the new term, he presides over a White House that mirrors the man, current and former aides say.  —  WASHINGTON — The military leaders who came to the Oval Office … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/fox-news-maga-hats-cookies-trump-west-wing-rcna214754"
  },
  {
    "text": "Pardoned Jan. 6 Rioter Who Threatened Police Joins Justice Dept.  —  The pardoned rioter, a former F.B.I. agent who was charged with encouraging the mob that stormed the Capitol, is a counselor to Ed Martin, the director of the so-called weaponization committee.",
    "url": "https://www.nytimes.com/2025/07/01/us/politics/justice-department-rioter-weaponization.html?unlocked_article_code=1.TU8.f4oR.otlThwYIrbnU&smid=url-share"
  },
  {
    "text": "Pentagon halting some promised munitions for Ukraine … The people were granted anonymity to discuss current operations.  The Pentagon did not respond to a request for comment.  —  In a statement following the publication of this story, White House Deputy Press Secretary Anna Kelly said that the decision … ",
    "url": "https://www.politico.com/news/2025/07/01/pentagon-munitions-ukraine-halt-00436048"
  },
  {
    "text": "US won't send some weapons pledged to Ukraine following a Pentagon review of military aid  —  The U.S. is halting some shipments of weapons to Ukraine amid concerns that its own stockpiles have declined too much, officials said Tuesday, a setback for the country as it tries to fend off escalating attacks from Russia.",
    "url": "https://apnews.com/article/ukraine-us-weapons-shipments-halt-review-48229eb7c814419631a16067a38d6a1d"
  },
  {
    "text": "Trump OKs using National Guard as immigration judges at Florida detention center  —  President Donald Trump said Tuesday he would approve Florida's plan to expedite deportations by having qualified National Guard members work as immigration judges.  —  Trump made the announcement during … ",
    "url": "https://www.miamiherald.com/news/local/immigration/article309792865.html"
  },
  {
    "text": "Paramount to Pay Trump $16 Million to Settle ‘60 Minutes’ Lawsuit  —  President Trump sued Paramount over a “60 Minutes” interview with his opponent, former Vice President Kamala Harris.  —  Paramount has agreed to pay President Trump $16 million to settle his lawsuit over the editing … ",
    "url": "https://www.nytimes.com/2025/07/02/business/media/paramount-trump-60-minutes-lawsuit.html?unlocked_article_code=1.TU8.YC_b.1krdNQ5ih266&smid=nytcore-android-share"
  },
  {
    "text": "CBS owner Paramount settles Trump lawsuit over Harris interview for $16M  —  The network will not apologize as part of the agreement.  The lawsuit stemmed from the editing of a “60 Minutes” interview with Kamala Harris.  —  Paramount, the parent company of CBS News, has agreed to pay $16 million … ",
    "url": "https://www.washingtonpost.com/style/media/2025/07/02/paramount-cbs-settlement-trump-harris-interview/"
  },
  {
    "text": "U.S. Department of Education Announces the University of Pennsylvania Has Entered into a Resolution Agreement to Resolve its Title IX Violations  —  Today, the U.S. Department of Education (the Department) announced the University of Pennsylvania (UPenn) has entered into a Resolution Agreement … ",
    "url": "https://www.ed.gov/about/news/press-release/us-department-of-education-announces-university-of-pennsylvania-has-entered-resolution-agreement-resolve-its-title-ix-violations"
  },
  {
    "text": "Trump Tells States He's Holding Back $6.8 Billion for Schools  —  The funding is earmarked for English learners, migrant students, professional development, and more  —  Remove  —  The Trump administration is holding back nearly $6.8 billion in federal funding for K-12 schools it was scheduled … ",
    "url": "https://www.edweek.org/policy-politics/trump-tells-states-hes-holding-back-6-8-billion-for-schools/2025/06"
  },
  {
    "text": "Trump administration targets CNN coverage of migration app  —  The Trump administration said on Tuesday that it was looking into whether CNN could be prosecuted over its report on an Apple (AAPL.O) iPhone app that alerts users to Immigration and Customs Enforcement agents in their area.",
    "url": "https://www.reuters.com/business/media-telecom/homeland-security-secretary-noem-says-cnn-may-be-prosecuted-over-report-2025-07-01/"
  },
  {
    "text": "Gillibrand apologizes to Mamdani over ‘jihad’ comments … Mamdani would be the city's first Muslim mayor. … Mamdani has declined to condemn people using the phrase “globalize the intifada,” even though he said he doesn't use it himself, and once rapped his support for the “Holy Land Five” … ",
    "url": "https://www.politico.com/news/2025/07/01/kirsten-gillibrand-zohran-mamdani-00436031"
  },
  {
    "text": "Making Foreign Aid Great Again  —  Author: U.S. Secretary of State Marco Rubio  —  Every public servant has an obligation to American citizens to ensure any programs they fund advance our nation's interests.  During the Trump Administration's thorough review of thousands of programs … ",
    "url": "https://statedept.substack.com/p/making-foreign-aid-great-again"
  },
  {
    "text": "Man Who Helped Florida Shark Attack Victim Now Facing Deportation  —  PAYBACK  —  Luis Alvarez was reportedly arrested days after rushing into the water to help after a child was mauled by a shark.  —  A man who rushed into the water to help after a 9-year-old girl was bitten by a shark … ",
    "url": "https://www.thedailybeast.com/man-who-helped-florida-shark-attack-victim-now-facing-deportation/"
  },
  {
    "text": "Trump Launches America's Newest Concentration Camp, Complete With Tacky Merch  —  Not content with just shipping people to a foreign concentration camp, Donald Trump now has his own, homegrown concentration camp in Florida.  Trump, DHS Secretary Kristi Noem, and Florida Governor Ron DeSantis gleefully toured … ",
    "url": "https://www.techdirt.com/2025/07/01/trump-launches-americas-first-concentration-camp-complete-with-tacky-merch/"
  },
  {
    "text": "House members scramble to return to DC for megabill vote  —  Some House members are going to great lengths to make it back to to Washington for a vote on the Republican megabill after severe weather canceled dozens of flights.  President Donald Trump and Speaker Mike Johnson are pushing … ",
    "url": "https://www.politico.com/live-updates/2025/07/01/congress/rushing-back-to-the-capitol-00436824"
  },
  {
    "text": "Local officials grow wary of helping ICE detain immigrants  —  A growing number of local law enforcement officials are alarmed about their jails and prisons holding immigration detainees without warrants, saying it exposes their departments to legal risks.",
    "url": "https://www.axios.com/2025/07/02/local-officials-ice-detain-immigrants-trump"
  },
  {
    "text": "Federal judge finds HHS mass layoffs likely unlawful  —  A federal judge on Tuesday ruled that the mass layoffs carried out at the Department of Health and Human Services (HHS) likely went against the law and there is sufficient evidence to support claims of irreparable harm as a result.",
    "url": "https://thehill.com/policy/healthcare/5379630-federal-judge-finds-hhs-mass-layoffs-likely-unlawful/"
  },
  {
    "text": "Columbia University Applicant Personal Data Stolen by Hacker  —  Personal information about Columbia University students and applicants — including whether they were accepted or rejected by the school — has been stolen, according to a Bloomberg News review of data provided by a person who claimed to have hacked the school in June.",
    "url": "https://www.bloomberg.com/news/articles/2025-07-01/columbia-university-applicants-personal-data-stolen-by-hacker?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc1MTQxMjgwNiwiZXhwIjoxNzUyMDE3NjA2LCJhcnRpY2xlSWQiOiJTWUlZSEVUMEcxS1cwMCIsImJjb25uZWN0SWQiOiJGMUM1Mzc1OEY5Qjg0MDZCOUJCNzMyODRDN0RBMEY3QyJ9.o9xPoIloekMS3v1t1CPNB8CqzIZ79e6Qs7ABNcM3R_U"
  },
  {
    "text": "Issue 87 - SO ORDERED  —  Listen to me read this post here (not an AI-generated voice!), subscribe to the feed in your podcast app, or download the recording for later.  —  It feels like every week I write something along the lines of “Trump's crypto conflicts surge to new heights” … ",
    "url": "https://www.citationneeded.news/issue-87/"
  }
]