[
  {
    "text": "‘The boss is not going to leave’: Proffer videos show ex-Trump lawyers telling Georgia prosecutors about efforts to overturn 2020 election  —  ABC News obtained video from interviews held with Jenna Ellis and Sidney Powell.  —  Jenna Ellis reads a statement after Ellis pleading guilty … ",
    "url": "https://abcnews.go.com/US/boss-leave-proffer-videos-show-trump-lawyers-telling/story?id=104831939"
  },
  {
    "text": "Did ‘vermin’ mark a turning point in Trump coverage?  —  Saturday night was a low point in the elite media's coverage of Donald Trump.  —  The New York Times put a light-hearted headline on a news article about Trump's Veterans Day address in New Hampshire, in which he vowed to “root out” … ",
    "url": "https://presswatchers.org/2023/11/did-vermin-mark-a-turning-point-in-trump-coverage/"
  },
  {
    "text": "How Trump's rhetoric compares to Hitler's  —  Donald Trump has long toyed with the language of famous autocrats, authoritarians and fascists.  Think: “enemy of the people,” “retribution” and the frequent, years-long allusions to political violence.  —  But even by his standards … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/13/how-trumps-rhetoric-compares-hitlers/"
  },
  {
    "text": "It's Not the Gaffes.  It's the Plans.  —  Because it's Monday, let's start with the bottom story of the day: Tim Scott Suspends Campaign, as His Sunny Message Failed to Resonate - The New York Time s  —  Who knew that sunny optimism was not what GOP voters were looking for in the era of Trump?",
    "url": "https://plus.thebulwark.com/p/its-not-the-gaffes-its-the-plans"
  },
  {
    "text": "Trump Campaign Officials Try to Play Down Contentious 2025 Plans  —  But many aspects of those blueprints are based on Donald Trump's own words, his campaign website and an adviser whom the campaign asked to speak.  —  Two top officials on former President Donald J. Trump's 2024 campaign … ",
    "url": "https://www.nytimes.com/2023/11/13/us/politics/trump-campaign-2025-statement.html"
  },
  {
    "text": "Mike Johnson's Shady Finances Are Already Coming Back to Bite Him  —  Speaker Mike Johnson (R-LA) is facing a new ethics complaint over a litany of alleged violations with his financial disclosures. … When newly minted Republican Speaker of the House Mike Johnson was asked on Fox News … ",
    "url": "https://www.thedailybeast.com/mike-johnsons-shady-finances-are-already-coming-back-to-bite-him"
  },
  {
    "text": "'I've seen better run city council campaigns': Tim Scott's allies fume after exit  —  The South Carolina senator told just two campaign staff members of his plan to drop out.  —  When Tim Scott announced the end of his presidential bid from the studio of his house in Hanahan, S.C. … ",
    "url": "https://www.politico.com/news/2023/11/13/tim-scott-allies-fume-exit-00126827"
  },
  {
    "text": "Trump's Truth Social has lost $73 million in less than 2 years, new filing says  —  Former President Trump's social media platform, Truth Social, has lost $73 million in net sales since the platform's official launch in February 2022, according to a new financial disclosure filing from Digital World Acquisition Corp. (DWAC).",
    "url": "https://thehill.com/homenews/media/4308023-trumps-truth-social-has-lost-73-million-in-less-than-two-years-new-filing-says/"
  },
  {
    "text": "Republican Pat Fallon to give up Congress seat and run for his old Texas Senate post  —  Fallon served in the Texas Senate for two years before running for Congress.  He won't see reelection in the U.S. House.  —  U.S. Rep. Pat Fallon, R-Sherman, is quitting Congress and running for his old seat in the Texas Senate.",
    "url": "https://www.texastribune.org/2023/11/13/pat-fallon-texas-senate/"
  },
  {
    "text": "The Supreme Court says it is adopting a code of ethics, but it has no means of enforcement  —  The Supreme Court on Monday adopted its first code of ethics, in the face of sustained criticism over undisclosed trips and gifts from wealthy benefactors to some justices, but the code lacks a means of enforcement.",
    "url": "https://apnews.com/article/supreme-court-ethics-code-conflicts-clarence-thomas-64d393ceb6f05402d762dca06f0f4187"
  },
  {
    "text": "If Biden can't run a normal campaign, he should step aside  —  Democrats are taking a huge risk either way.  But they shouldn't try to get away with a Rose Garden campaign.  —  It's inherently kind of crazy that American presidential campaigns take more than a year to run, but they do.",
    "url": "https://www.natesilver.net/p/if-biden-cant-run-a-normal-campaign"
  },
  {
    "text": "EXCLUSIVE - First photos reveal the COCAINE found in the White House: Images of the baggy in cubby hole that sparked White House investigation - and the culprit has still not been found  — DailyMail.com uncovered photos through a Freedom of Information Act request",
    "url": "https://www.dailymail.co.uk/news/article-12744675/First-photos-reveal-COCAINE-White-House-Images.html"
  },
  {
    "text": "House shelves Greene's resolution to impeach Mayorkas  —  The House shelved a resolution to impeach Homeland Security Secretary Alejandro Mayorkas on Monday, punting on Rep. Marjorie Taylor Greene's (R-Ga.) effort to boot the Biden administration official from his post for his handling of the situation at the U.S.-Mexico border.",
    "url": "https://thehill.com/homenews/house/4307918-house-shelves-greenes-resolution-to-impeach-mayorkas/"
  },
  {
    "text": "First nonbinary Mexican magistrate found dead at home  —  Jesús Ociel Baena made history last year after becoming the first openly nonbinary person to assume a judicial position in the country.  —  MEXICO CITY — The first openly nonbinary person to assume a judicial position in Mexico … ",
    "url": "https://www.nbcnews.com/news/latino/first-nonbinary-mexican-magistrate-found-dead-home-rcna125009"
  },
  {
    "text": "Democrats get surprisingly good news from America's Trumpiest court  —  The Fifth Circuit decided to obey the law, for a change.  —  Last Friday, a federal appeals court nudged Louisiana toward redrawing its congressional maps to include a second Black-majority district.",
    "url": "https://www.vox.com/scotus/2023/11/13/23959252/supreme-court-fifth-circuit-louisiana-gerrymander-robinson-ardoin"
  },
  {
    "text": "Sen. Coons badgered about Gaza strikes and cease-fire on Amtrak ride  —  Sen. Chris Coons (D-Del.) was badgered on an Amtrak ride Monday about his position on calling for a cease-fire in Gaza by a passenger who claimed to be a journalist and who repeatedly ignored the senator's requests to leave him alone.",
    "url": "https://thehill.com/homenews/senate/4307920-sen-coons-badgered-about-gaza-strikes-and-cease-fire-on-amtrak-ride/"
  },
  {
    "text": "Scoop: Trump pollster sees Haley benefiting from Tim Scott's exit … - “Despite the narrative that the DeSantis team is trying to push, it's clear that other candidates dropping out is not causing voters to consolidate around him,” the memo argues.  — Trump (43%) continues to boast … ",
    "url": "https://www.axios.com/2023/11/14/haley-polls-tim-scott-trump-2024-election"
  },
  {
    "text": "Maryanne Trump Barry, Donald Trump's Older Sister, Dies at 86  —  A retired federal judge in New Jersey, she supported her brother but, as secret audio recordings revealed in 2019, she could also be scathingly critical of him.  —  Maryanne Trump Barry, a former federal judge who was an older sister … ",
    "url": "https://www.nytimes.com/2023/11/13/us/politics/maryanne-trump-barry-dead.html"
  },
  {
    "text": "Israel-Hamas War  —  Gaza Hospitals ‘Must Be Protected,’ Biden Says … Biden calls for ‘less intrusive action’ around Gaza's battered hospitals as Israeli forces close in.  —  The Gaza Strip's hospitals “must be protected,” President Biden said on Monday as Israeli troops battled … ",
    "url": "https://www.nytimes.com/live/2023/11/13/world/israel-hamas-gaza-war-news"
  }
]