[
  {
    "text": "A Weary Trump Appears to Doze Off in Courtroom Ahead of Criminal Trial  —  The former president flashed signs of irritation at times, but also seemed to fall asleep, before jolting back awake.  —  Former President Donald J. Trump seemed alternately irritated and exhausted Monday morning … ",
    "url": "https://www.nytimes.com/2024/04/15/nyregion/trump-asleep-criminal-trial.html"
  },
  {
    "text": "As hush money trial begins, Trump's sex life emerges as key theme  —  Before jurors are questioned, judge spends hours hashing out what a jury should know about allegations involving women other than Stormy Daniels  —  NEW YORK — The opening day of Donald Trump's criminal trial delved deep … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/15/trump-hush-money-trial-sex-tabloids/"
  },
  {
    "text": "I Was a Skeptic of the Stormy Daniels Prosecution.  I Was Wrong.  —  The prosecution of Donald Trump starting in New York this week is on firm legal ground.  —  When Manhattan District Attorney Alvin Bragg brought criminal charges against Donald Trump in 2023, I was highly skeptical of his decision.",
    "url": "https://slate.com/news-and-politics/2024/04/stormy-daniels-prosecution-stronger-than-i-thought.html"
  },
  {
    "text": "Live Updates: Trump Trial Poised to Begin, a Criminal Case Without Precedent  —  Jury selection is set to start as Donald J. Trump faces charges he faked business records to cover up a sex scandal before winning the presidency.  The judge declined Mr. Trump's request to recuse himself.",
    "url": "https://www.nytimes.com/live/2024/04/15/nyregion/trump-hush-money-trial"
  },
  {
    "text": "Trump Media closes down more than 18% after filing plans to issue more DJT stock … This photo illustration shows an image of former President Donald Trump reflected in a phone screen that is displaying the Truth Social app, in Washington, DC, on February 21, 2022.",
    "url": "https://www.cnbc.com/2024/04/15/trump-media-shares-plunge-after-company-files-to-issue-additional-djt-stock.html"
  },
  {
    "text": "Trump's Truth Social Stock Is Plummeting — Again  —  The company's stock value tanked 18% after it announced a plan to add more shares.  —  LOADING  —  Shares of Trump Media & Technology Group, the parent company of Donald Trump's Truth Social platform, plummeted Monday … ",
    "url": "https://www.huffpost.com/entry/trump-truth-social-stock-tanks_n_661d658fe4b015646f789caa"
  },
  {
    "text": "Freedom Caucus: Iran attack on Israel sets up ‘bogus’ reason to pass Ukraine aid  —  The House Freedom Caucus is warning GOP leadership not to use Iran's attack on Israel over the weekend as “justification” to send additional aid to Ukraine, as lawmakers in both parties and chambers call … ",
    "url": "https://thehill.com/homenews/house/4595464-freedom-caucus-iran-attack-on-israel-sets-up-bogus-reason-to-pass-ukraine-aid/"
  },
  {
    "text": "US Supreme Court lets Idaho enforce ban on transgender care for minors  —  The conservative-majority U.S. Supreme Court on Monday let a Republican-backed law in Idaho that criminalizes gender-affirming care for transgender minors broadly take effect after a federal judge blocked it as unconstitutional.",
    "url": "https://www.reuters.com/legal/us-supreme-court-lets-idaho-enforce-ban-transgender-care-minors-2024-04-15/"
  },
  {
    "text": "The Supreme Court effectively abolishes the right to mass protest in three US states  —  It is no longer safe to organize a protest in Louisiana, Mississippi, or Texas.  —  The Supreme Court announced on Monday that it will not hear Mckesson v. Doe.  The decision not to hear Mckesson leaves … ",
    "url": "https://www.vox.com/scotus/24080080/supreme-court-mckesson-doe-first-amendment-protest-black-lives-matter"
  },
  {
    "text": "How the U.S. Forged a Fragile Middle Eastern Alliance to Repel Iran's Israel Attack  —  American-led effort was years in the making and hadn't been battle-tested when Tehran launched missile and drone barrage against Israel",
    "url": "https://www.wsj.com/world/middle-east/how-the-u-s-forged-a-fragile-middle-eastern-alliance-to-repel-irans-israel-attack-4a1fbc00"
  },
  {
    "text": "Justice Clarence Thomas misses Supreme Court arguments  —  The conservative justice was not present for oral arguments on Monday, but the court did not provide a reason why.  —  WASHINGTON — Conservative Supreme Court Justice Clarence Thomas was not present at the court for oral arguments on Monday … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/justice-clarence-thomas-misses-supreme-court-arguments-rcna147826"
  },
  {
    "text": "Tesla lays off more than 10% of staff globally as sales fall  —  Tesla (TSLA.O) told staff it is laying off more than 10% of its global workforce, an internal memo seen by Reuters on Monday shows, as it grapples with falling sales and an intensifying price war for electric vehicles (EVs).",
    "url": "https://www.reuters.com/business/autos-transportation/tesla-lay-off-more-than-10-its-staff-electrek-reports-2024-04-15/"
  },
  {
    "text": "Bidens Report Earning $620,000 and Paying $181,000 in Taxes in 2023  —  The couple's tax return showed a 7 percent jump in income from 2022, a result of higher taxable interest income this year.  —  President Biden and Jill Biden, the first lady, reported earning roughly $620,000 in 2023 … ",
    "url": "https://www.nytimes.com/2024/04/15/us/politics/biden-tax-returns.html"
  },
  {
    "text": "Maine joins effort to elect president by popular vote with new law  —  Maine will become the latest state to join an interstate effort to elect the nation's president by a popular vote, Gov. Janet Mills (D) announced Monday.  —  Mills said she will allow the legislation to become law without her signature … ",
    "url": "https://thehill.com/homenews/state-watch/4596054-maine-joins-effort-to-elect-president-by-popular-vote-with-new-law/"
  },
  {
    "text": "Crickets from Chirp Systems in Smart Lock Key Leak  —  The U.S. government is warning that “smart locks” securing entry to an estimated 50,000 dwellings nationwide contain hard-coded credentials that can be used to remotely open any of the locks.  The lock's maker Chirp Systems remains unresponsive … ",
    "url": "https://krebsonsecurity.com/2024/04/crickets-from-chirp-systems-in-smart-lock-key-leak/"
  },
  {
    "text": "George Santos Explains Why He's Raised $0 for Return Congressional Bid  —  BROKE BOY  —  The disgraced former U.S. representative says he doesn't want people to think he's a grifter.  —  Disgraced former Rep. George Santos (R-NY) reported raising a stunning zero dollars in the first quarter … ",
    "url": "https://www.thedailybeast.com/george-santos-explains-why-hes-raised-dollar0-for-return-congressional-bid"
  },
  {
    "text": "They quit liberal public schools.  Now they teach kids to be anti-'woke.'  —  SOUTHWEST FLORIDA — Kali Fontanilla repeated the lesson title to herself one last time — “'A Com-plete History of Slavery in America'” — sipped her peppermint tea and hit record.",
    "url": "https://www.washingtonpost.com/education/2024/04/15/kali-joshua-fontanilla-exodus-institute/"
  },
  {
    "text": "Former Trump staffer who said to ‘fan the flame’ after 2020 loss hired to lead Wisconsin GOP  —  MADISON, Wis. (AP) — The director of Donald Trump's 2020 presidential campaign in Wisconsin, who pushed allegations of widespread fraud that were ultimately debunked, has been hired to run … ",
    "url": "https://apnews.com/article/wisconsin-republican-donald-trump-2020-election-46463044d8c07f1660673c9f5b299eff"
  },
  {
    "text": "Swalwell accuses Clay Travis of jury tampering in Trump trial  —  Rep. Eric Swalwell (D-Calif.) accused conservative media personality Clay Travis of jury tampering as former President Trump heads to trial this week in New York regarding an alleged hush money payment to adult film star Stormy Daniels.",
    "url": "https://thehill.com/homenews/media/4594964-trump-hush-money-trial-swalwell-clay-travis/"
  },
  {
    "text": "Nikki Haley Joins Hudson  —  WASHINGTON—Hudson Institute today announced that Nikki Haley, the former governor of South Carolina and US ambassador to the United Nations, will be the next Walter P. Stern Chair.  —  “When our policymakers fail to call out our enemies or acknowledge the importance … ",
    "url": "https://www.hudson.org/nikki-haley-joins-hudson"
  },
  {
    "text": "Audit cites potential legal violations in purchase of $19,000 lectern for Arkansas governor  —  LITTLE ROCK, Ark. (AP) — Arkansas Gov. Sarah Huckabee Sanders' office potentially violated state laws on purchasing, state property and government records when it purchased a $19,000 lectern … ",
    "url": "https://apnews.com/article/arkansas-huckabee-sanders-lectern-audit-19000-eb69927a5df693ac3e131b3c80f34b37"
  }
]