[
  {
    "text": "The Supreme Court's disastrous Trump immunity decision, explained  —  The Court's six Republicans handed down a decision on Monday that gives Donald Trump such sweeping immunity from prosecution that there are unlikely to be any legal checks on his behavior if he returns to the White House.",
    "url": "https://www.vox.com/scotus/358292/supreme-court-trump-immunity-dictatorship"
  },
  {
    "text": "Trump Moves to Overturn Manhattan Conviction, Citing Immunity Decision  —  Former President Donald J. Trump took the action hours after a U.S. Supreme Court ruling granted him immunity for official acts committed in office.  —  Donald J. Trump began an effort on Monday to throw … ",
    "url": "https://www.nytimes.com/2024/07/01/nyregion/trump-sentence-hush-money.html"
  },
  {
    "text": "A five-alarm fire for democracy  —  On Monday, six members of the Supreme Court granted Donald Trump — and every future president — broad criminal immunity.  The court found that, as president, Trump was free to use his “official” powers to commit crimes.",
    "url": "https://popular.info/p/a-five-alarm-fire-for-democracy"
  },
  {
    "text": "A Better Way To Respond To The Supreme Court's Intolerable Immunity Decision  —  Sauce for the goose is sauce for the gander.  —  ∙ Paid  —  If you're about my age or older, and a subscriber to this newsletter, you're familiar with this uncanny sensation of living through a moment when history turns.",
    "url": "https://www.offmessage.net/p/biden-response-supreme-court-immunity"
  },
  {
    "text": "Manhattan Prosecutors Agree to Delay Trump's Sentencing  —  Donald J. Trump's lawyers want to argue that a Supreme Court decision giving presidents immunity for official acts should void his felony conviction for covering up hush money paid to a porn star.  —  Manhattan prosecutors … ",
    "url": "https://www.nytimes.com/2024/07/02/nyregion/trump-sentencing-hush-money-trial.html"
  },
  {
    "text": "'We've all enabled the situation': Dems turn on Biden's inner sanctum post debate  —  The senior team's management of Biden has grown more strictly controlled as his term has gone on.  —  Over the course of his presidency, Joe Biden's small clutch of advisers have built … ",
    "url": "https://www.politico.com/news/2024/07/02/biden-campaign-debate-inner-circle-00166160"
  },
  {
    "text": "How much did debate hurt Biden's re-election bid?  New poll offers insight.  —  Trump's new, narrow advantage signals a close contest, not a decisive lead.  But other exclusive poll findings raise red flags for the president.  —  Susan Page Rachel BarberUSA TODAY",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/02/biden-trump-poll-post-debate/74263315007/"
  },
  {
    "text": "Behind the Curtain: The imperial presidency in waiting … - A re-elected Trump would quickly set up vast camps and deport millions of people in the U.S. illegally. … - In Washington, Trump would move to fire potentially tens of thousands of civil servants using a controversial interpretation of law and procedure.",
    "url": "https://www.axios.com/2024/07/02/trump-2025-imperial-us-presidency"
  },
  {
    "text": "Trump amplifies radical retaliatory message targeting Liz Cheney  —  When Donald Trump amplifies radical rhetoric about “treason” and “military tribunals” for his domestic foes, there's a problem.  —  The question of whether Donald Trump would try to prosecute his perceived political enemies in a second term has already been answered.",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-amplifies-radical-retaliatory-message-targeting-liz-cheney-rcna159915"
  },
  {
    "text": "Trump Amplifies Calls to Jail Top Elected Officials, Invokes Military Tribunals  —  A post that Mr. Trump circulated on Sunday called for Liz Cheney to be prosecuted by a military court reserved for enemy combatants and war criminals.  —  Former President Donald J. Trump over the weekend escalated … ",
    "url": "https://www.nytimes.com/2024/07/01/us/politics/trump-liz-cheney-treason-jail.html"
  },
  {
    "text": "Justice Roberts buried for smug ‘sit down, little ladies’ smear of liberal colleagues  —  Lost in the shuffle of the outrage over the conservative majority Supreme Court's 6-3 decision to hand Donald Trump a get-out-of-jail-free card with their expansive presidential immunity ruling on Monday … ",
    "url": "https://www.alternet.org/news-politics/supreme-court-chief-justice-john-roberts/"
  },
  {
    "text": "Recall issued for mushroom-infused chocolates and gummies after dozens of illnesses, hospitalizations reported  —  So far 39 illnesses from the candies have been reported across 20 states.  —  A brand of mushroom-infused chocolates and sweets has been recalled after dozens of consumers across … ",
    "url": "https://www.nbcnews.com/news/us-news/fda-recalls-mushroom-infused-chocolates-gummies-dozens-illnesses-hospi-rcna159916"
  },
  {
    "text": "Supreme Court says content moderation is speech  —  Happy Tuesday!  I'm celebrating my independence from waking up every morning to see if the Supreme Court has finally ruled in the NetChoice cases.  Send news tips and fireworks emojis to: will.oremus@washpost.com.",
    "url": "https://www.washingtonpost.com/politics/2024/07/02/netchoice-scotus-content-moderation-speech/"
  },
  {
    "text": "SCOTUS gives Trumpian autocrats a map for abusing power  —  The imperial court sides with their king.  —  ∙ Paid … Not content to utterly upend the separation of powers as it did last week by gutting the administrative state, the right-wingers on the US Supreme Court yesterday further unbalanced … ",
    "url": "https://www.publicnotice.co/p/scotus-immunity-ruling-trump-dictatorship"
  },
  {
    "text": "Apocalypse Not  —  The great operational question before us is not “Is Joe Biden too old?”  The question is “Do you trust the delegates to the Democratic convention in Chicago to replace the present ticket with a supposedly more winning ticket without ripping their party apart in catastrophic ways?”",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/joe-biden-democrats-convention/678863/"
  },
  {
    "text": "RFK Jr.'s Family Doesn't Want Him to Run.  Even They May Not Know His Darkest Secrets.  —  A shocking photograph.  Blowback from a Trump meeting.  Alleged sexual assault.  The Kennedys have voiced support for Joe Biden, but certain aspects of Robert F. Kennedy Jr.'s character are only just now coming to light.",
    "url": "https://www.vanityfair.com/news/story/robert-kennedy-jr-shocking-history"
  },
  {
    "text": "Campaign Finance Laws Give Harris Big Boost in Biden Dropout Scenario  —  If Biden were to withdraw his candidacy, only Kamala Harris could seamlessly use funds raised by the Biden-Harris campaign committee.  —  Dayen-HarrisFundraising-070224  —  Vice President Kamala Harris speaks … ",
    "url": "https://prospect.org/power/2024-07-02-campaign-finance-laws-harris-big-boost-biden-dropout-scenario/"
  },
  {
    "text": "Supreme Court to weigh FDA's refusal to approve flavored vapes  —  Manufacturers of flavored vapes are challenging the Food and Drug Administration's refusal to approve their products.  —  WASHINGTON —The Supreme Court on Tuesday agreed to consider whether the Food and Drug Administration acted unlawfully … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-weigh-fdas-refusal-approve-flavored-vapes-rcna158798"
  },
  {
    "text": "French candidates bow out in bid to block far-right  —  Opponents of France's National Rally (RN) stepped up their bid to block the far-right party from power on Tuesday as more candidates said they would bow out of this weekend's run-off election to avoid splitting the anti-RN vote.",
    "url": "https://www.reuters.com/world/uk/french-candidates-bow-out-concerted-bid-block-far-right-2024-07-02/"
  }
]