[
  {
    "text": "Playbook: GOP eyes some Santos payback  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  BREAKING OVERNIGHT — Gaza cease-fire talks appear to have collapsed following a Hamas rocket attack yesterday that killed three soldiers at an Israeli checkpoint … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/05/06/gop-eyes-some-santos-payback-00156216"
  },
  {
    "text": "Scoop: House GOP homes in on Biden as top 2024 punching bag … - In addition to citing Biden's underwater national approval, the memo posits that he is unpopular in evenDemocratic-leaning swing districts.  — “We expect Democrats to wake up and furiously backpedal away from Biden in the fall.",
    "url": "https://www.axios.com/2024/05/06/scoop-house-gop-homes-in-on-biden-as-top-2024-punching-bag"
  },
  {
    "text": "Behind the Curtain: 6% of six states … - Those were the battlegrounds disputed by Donald Trump after the 2020 election. … - A seventh state, North Carolina, is included in some swing-state polls. … Republicans think they're winning.  The swing-state map is a big reason why.",
    "url": "https://www.axios.com/2024/05/06/biden-trump-election-swing-states"
  },
  {
    "text": "It's a tie: Biden 37%-Trump 37% as Hispanic, Black and younger voters shift - Exclusive  —  Susan Page Sudiksha Kochi Rachel BarberUSA TODAY  —  It couldn't be closer.  —  Six months before Election Day, President Joe Biden and former President Donald Trump are tied 37%-37% … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/05/06/biden-trump-tie-hispanic-black-younger-voters/73504174007/"
  },
  {
    "text": "Hunter Biden's revenge  —  Smear campaigns have consequences.  —  ∙ Paid … Have you noticed that after years of saturation coverage, Fox News hosts have suddenly cooled it on the Hunter Biden stuff?  There's a reason for that.  —  Last week, Fox News pulled the six-part series … ",
    "url": "https://www.publicnotice.co/p/hunter-biden-sues-fox-news-explained"
  },
  {
    "text": "Kristi Noem Cries ‘Fake News’ After Disastrous Interview on CBS  —  DOGGED BY SCANDAL  —  The South Dakota governor complained that the host of “Face the Nation” had interrupted her “once every 25 seconds”—something that would never happen to, say, Gretchen Whitmer.",
    "url": "https://www.thedailybeast.com/kristi-noem-cries-fake-news-after-disastrous-interview-on-cbs"
  },
  {
    "text": "Kristi Noem Suggests Biden's Dog Should Have Been Killed, Too  —  The South Dakota governor, defending her tale of shooting and killing her family's dog, suggested that President Biden's German shepherd, Commander, had merited a similar fate.  —  Gov. Kristi Noem of South Dakota … ",
    "url": "https://www.nytimes.com/2024/05/05/us/politics/kristi-noem-biden-dog.html"
  },
  {
    "text": "Congress voted against funding a cure for cancer just to block a win for Biden  —  Some Republicans, refusing to give President Joe Biden a ‘win,’ voted against the renewal of funding for cancer research.  Vote for those who do not politicize Americans' health.  —  I'm afraid I have some bad news.",
    "url": "https://www.usatoday.com/story/opinion/voices/2024/05/05/biden-cancer-moonshot-initiative-congress-funding/73525016007/"
  },
  {
    "text": "400 Rich People Pay $40K to Hear Trump Glorify Cop Assailants  —  On Saturday, a bunch of people paid a lot of money — at least $40,0000 apiece, and one or two people took Trump up on an offer to speak if they gave $1 million — to hear Trump glorify cop assailants.",
    "url": "https://www.emptywheel.net/2024/05/06/400-rich-people-pay-40k-to-hear-trump-glorify-cop-assailants/"
  },
  {
    "text": "White House: Trump Gestapo comment echoes ‘appalling rhetoric of fascists’  —  The White House on Sunday slammed former President Trump after he compared the Biden administration to the Gestapo police force in Nazi Germany.  —  “Instead of echoing the appalling rhetoric of fascists … ",
    "url": "https://thehill.com/homenews/campaign/4645186-white-house-trump-gestapo-comment-echoes-appalling-rhetoric-of-fascists/"
  },
  {
    "text": "Congressman praises racist heckling.  Will his corporate backers stand by him?  —  On Thursday, Jaylin Smith, a graduate student at the University of Mississippi, participated in a small, non-violent protest calling for a ceasefire in Gaza.  Smith and the other protesters were greeted … ",
    "url": "https://popular.info/p/congressman-praises-racist-heckling"
  },
  {
    "text": "RNC chief counsel resigns after two months  —  The Republican National Committee's chief counsel Charlie Spies has resigned two months after accepting the position.  —  Spies' departure follows weeks of growing tension with RNC officials, a source familiar with the situation told CNN.",
    "url": "https://www.cnn.com/2024/05/05/politics/rnc-chief-counsel/"
  },
  {
    "text": "Who believes the most “taboo” conspiracy theories?  It might not be who you think  —  White men with graduate degrees, a new study finds, are highly likely to hold especially noxious beliefs  —  Like Henry Ford before him, Elon Musk has emerged as America's top conspiracy spreader.  But he's hardly alone.",
    "url": "https://www.salon.com/2024/05/05/believes-the-most-taboo-conspiracy-theories-it-might-not-be-you-think/"
  },
  {
    "text": "Biden Races to Trump-Proof His Agenda  —  Trump made unprecedented use of a 1996 law to overturn Obama-era regulations.  Biden's aides hope to stop the Republican from doing it again if he wins.",
    "url": "https://www.wsj.com/politics/policy/biden-races-to-trump-proof-his-agenda-92f38239"
  }
]