[
  {
    "text": "Trump, White House aides signal a possible détente with Musk  —  The two men have been embroiled in a feud over legislation that encompasses the president's agenda.  —  Signs of a truce are emerging in the increasingly bitter clash between two of the world's most powerful men.",
    "url": "https://www.politico.com/news/2025/06/05/trump-white-house-aides-signal-a-possible-detente-with-musk-00391502"
  },
  {
    "text": "The Day That Trump and Musk Torched Their Partnership  —  An afternoon of escalating attacks left the men threatening to wield their power against each other  —  WASHINGTON—This is exactly what President Trump and his advisers were trying to avoid.  —  Just six days ago … ",
    "url": "https://www.wsj.com/politics/elon-musk-trump-fight-gop-bill-c2e0be66?st=L4UgZk&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Live Updates: Trump Threatens to Cut Elon Musk's Government Contracts as Feud Escalates  —  The open acrimony between the two men comes after the billionaire denounced President Trump's signature domestic policy bill as an “abomination.”  —  Haiyun Jiang for The New York Times  —  Here's the latest.",
    "url": "https://www.nytimes.com/live/2025/06/05/us/trump-elon-musk"
  },
  {
    "text": "Elon Musk goes on a warpath against Trump and the GOP  —  The fallout from the very public breakup could engulf Republican hopes of holding onto the House.  —  Elon Musk just launched a war against the GOP.  Now the party's hopes of holding onto power are at stake.",
    "url": "https://www.politico.com/news/2025/06/06/elon-musk-gop-donald-trump-midterms-00391246"
  },
  {
    "text": "Scoop: Democrats probe whether Trump is in the Epstein files  —  House Democrats are asking the Department of Justice and FBI whether it is true, as Elon Musk now claims, that President Trump is in the Epstein files, Axios has learned.  —  Why it matters: It's the starkest example to date … ",
    "url": "https://www.axios.com/2025/06/06/trump-epstein-files-doj-democrats-musk-bondi"
  },
  {
    "text": "The epic breakup of Trump and Musk's White House bromance  —  Trump's criticism illuminated the dramatic erosion in his alliance with the world's richest man  —  The alliance between President Donald Trump and Elon Musk spectacularly imploded Thursday as the world's most prominent bromance collapsed into mutual public trolling.",
    "url": "https://www.washingtonpost.com/politics/2025/06/05/trump-musk-fight/"
  },
  {
    "text": "Trump tells ABC Musk ‘lost his mind’; ‘not particularly’ interested in talking to him  —  He spoke with ABC News Chief Washington Correspondent Jonathan Karl.  —  President Donald Trump attends a meeting with the Fraternal Order of Police in the State Dinning Room of the White House, June 5, 2025, in Washington.",
    "url": "https://abcnews.go.com/Politics/day-after-blistering-exchange-trump-calls-elon-musk/story?id=122567621"
  },
  {
    "text": "Moscow ready to grant Musk asylum if necessary amid rift with Trump, Russian official says  —  Russia is prepared to offer political asylum to tech billionaire Elon Musk following his public feud with U.S. President Donald Trump, Dmitry Novikov, deputy chair of the State Duma Committee on International Affairs, said June 6.",
    "url": "https://kyivindependent.com/moscow-ready-to-grant-musk-asylum-if-necessary-amid-rift-with-trump-russian-official-says/"
  },
  {
    "text": "The White House adviser who helped fuel Trump-Musk feud  —  Shortly after President Trump unexpectedly withdrew Elon Musk's pick to lead NASA last weekend, one name quickly surfaced as a major force behind the surprise decision: top White House aide Sergio Gor.",
    "url": "https://www.axios.com/2025/06/06/trump-musk-feud-nasa-white-house-aide"
  },
  {
    "text": "DOGE Developed Error-Prone AI Tool to “Munch” Veterans Affairs Contracts  —  We obtained records showing how a Department of Government Efficiency staffer with no medical experience used artificial intelligence to identify which VA contracts to kill.  “AI is absolutely the wrong tool for this,” one expert said.",
    "url": "https://www.propublica.org/article/trump-doge-veterans-affairs-ai-contracts-health-care"
  },
  {
    "text": "University of Michigan using undercover investigators to surveil student Gaza protesters  —  Revealed: security trailing students on and off campus as video shows investigator faking disability when confronted  —  The University of Michigan is using private, undercover investigators … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/06/michigan-university-gaza-surveillance"
  },
  {
    "text": "Inside the Billion-Dollar Effort to Make Trump Feel Good About Himself  —  Trump's administration is marshaling vast public resources and more than $1 billion worth of taxpayer money to flatter the president … Vice President J.D. Vance was seated directly across from the president … ",
    "url": "https://www.rollingstone.com/politics/politics-features/donald-trump-dear-leader-bondi-noem-republican-propaganda-1235356187/"
  },
  {
    "text": "Live Updates: In Chaotic Economy, Hiring Remained Steady in May  —  Employers added 139,000 jobs last month, continuing a steady run of hiring despite policy turmoil.  The unemployment rate was unchanged at 4.2 percent.  —  Here's what to know.  —  The labor market persevered in May … ",
    "url": "https://www.nytimes.com/live/2025/06/06/business/jobs-report-may-economy"
  },
  {
    "text": "Trump administration races to fix a big mistake: DOGE fired too many people  —  Across the government, officials are rehiring federal workers who were forced out or encouraged to resign.  —  Early this spring, the Food and Drug Administration fired nearly 50 workers in the Office of Regulatory Policy … ",
    "url": "https://www.washingtonpost.com/business/2025/06/06/doge-staff-cuts-rehiring-federal-workers/"
  },
  {
    "text": "ICE officers stuck in Djibouti shipping container with deported migrants  —  Trump officials transferred the migrants to the East African nation in response to a judge's order.  They now face threats that include rocket attacks from Yemen.  —  Nearly a dozen immigration officers … ",
    "url": "https://www.washingtonpost.com/immigration/2025/06/05/djibouti-deportations-migrants-ice-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9"
  },
  {
    "text": "Immigration agents mistakenly detain deputy U.S. marshal in Tucson, feds confirm  —  A deputy U.S. marshal was mistakenly detained by immigration agents inside the federal building that houses Tucson's immigration court, U.S. Marshals Service officials confirmed on Thursday.",
    "url": "https://tucson.com/news/local/border/article_2573f016-3596-4f32-93f7-7e99b6459675.html"
  },
  {
    "text": "Judge Blocks Trump Proclamation Banning International Students From Entering U.S. on Harvard Visas  —  A federal judge granted Harvard's request for a temporary restraining order hours after the University asked her to block the Trump administration's Wednesday proclamation banning international students … ",
    "url": "https://www.thecrimson.com/article/2025/6/6/judge-tro-trump-proclamation/"
  },
  {
    "text": "Chinese propaganda surges as the U.S. defunds Radio Free Asia  —  Beijing expanded its state propaganda, including to the persecuted Tibetan and Uyghur minorities, as RFA pulled back.  —  Two months after the Trump administration all but shut down its foreign news services in Asia … ",
    "url": "https://www.washingtonpost.com/politics/2025/06/06/trump-radio-free-asia-cuts-china-propaganda/"
  },
  {
    "text": "From 1,300 to 81 workers: Trump official plans to cut Voice of America to the bone  —  At times, President Trump's senior adviser Kari Lake has said she wants to shut down Voice of America, arguing it is rife with ideological bias and waste.  Now, Lake says she'll keep the federally funded … ",
    "url": "https://www.npr.org/2025/06/06/nx-s1-5424581/voa-job-cuts-kari-lake"
  },
  {
    "text": "A DOGE architect leaves the movement after Musk feuds with Trump  —  “What's not okay is his baseless personal attacks against President Trump,” James Fishback told POLITICO.  —  James Fishback, the chief architect behind the proposal to send “DOGE checks,” told POLITICO Friday he's stepping away … ",
    "url": "https://www.politico.com/news/2025/06/06/a-doge-architect-leaves-the-movement-after-musk-feuds-with-trump-00391651"
  }
]