[
  {
    "text": "At a private donor event, Trump likens the Biden administration to the ‘Gestapo’  —  Trump referenced the Nazi secret police as he was railing against the legal troubles he and his supporters are facing.  —  PALM BEACH, Fla. — Donald Trump compared President Joe Biden's administration … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-biden-administration-gestapo-private-donor-event-rcna150743"
  },
  {
    "text": "At Donor Retreat, Trump Calls Biden Administration the ‘Gestapo’  —  The speech by Donald J. Trump at a Republican National Committee fund-raising retreat came during his criminal trial in New York.  He faces a total of 88 criminal charges across four indictments.",
    "url": "https://www.nytimes.com/2024/05/04/us/politics/trump-donors.html"
  },
  {
    "text": "Trump escalates attacks on prosecutors, says Democrats run ‘a Gestapo administration’  —  Saturday's sometimes profane remarks illustrate the central role his legal cases are playing in his bid to return to the White House for a second term.  —  PALM BEACH, Fla. — Former president Donald Trump escalated … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/04/trump-indictments-attacks-democrats-gestapo/"
  },
  {
    "text": "Top RNC lawyer resigns after rift grows with Trump  —  The former president was angered by Charlie Spies's criticism of his false 2020 election-fraud claims.  —  The top lawyer at the Republican Party is resigning after he cited conflicts with his other work obligations and after Donald Trump grew angry … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/04/trump-rnc-spies-election-fraud/"
  },
  {
    "text": "RNC lawyer Charlie Spies to step down just 2 months after taking the job  —  Spies was “pushed out,” according to a source familiar with the move.  —  Republican National Committee chief counsel Charlie Spies is parting ways with the party apparatus just months after stepping into the role.",
    "url": "https://www.nbcnews.com/politics/2024-election/republican-national-committee-lawyer-charlie-spies-step-tumult-rcna150745"
  },
  {
    "text": "How Pope Francis opened the Vatican to transgender sex workers  —  The outreach, reflecting the most radical stage of his papacy, has prompted backlash while also altering the lives of the nearly 100 people he has met.  —  VATICAN CITY — Sea gulls soared over St. Peter's Square as Laura Esquivel … ",
    "url": "https://www.washingtonpost.com/world/2024/05/05/pope-francis-transgender-sex-workers/"
  },
  {
    "text": "6 months out, a tight presidential race with battle between issues and attributes: POLL  —  Trump has 46% support among U.S. adults and Biden 44% in a head-to-head matchup.  —  President Joe Biden speaks at a campaign rally for Democratic gubernatorial candidate Wes Moore at Bowie State University … ",
    "url": "https://abcnews.go.com/Politics/6-months-out-tight-presidential-race-trump-biden-poll/story?id=109909175"
  },
  {
    "text": "A Great American Con Led to the Mess on College Campuses.  Everyone Fell for It—Again.  —  A time-honored tactic by right-wing agitators brought on the “crisis” on American campuses.  Everyone fell for it—again.  —  In 2001, a Vietnam-era student radical named David Horowitz decided to once again start causing trouble on campus.",
    "url": "https://slate.com/news-and-politics/2024/05/university-protests-columbia-college-republicans.html"
  },
  {
    "text": "Gallows Humor and Talk of Escape: Trump's Possible Return Rattles Capital  —  At Washington dinner parties, dark jokes abound about where to go into exile if the former president reclaims the White House.  —  It has become the topic of the season at Washington dinner parties and receptions.",
    "url": "https://www.nytimes.com/2024/05/05/us/politics/trump-biden-election-dc.html"
  },
  {
    "text": "“May the 4th be with you”: Biden celebrates Star Wars Day with Luke Skywalker actor … - “Always,” Hamill added.  — The actor who played Luke Skywalker said he was “honored” to visit the White House, per the AP.",
    "url": "https://www.axios.com/2024/05/04/star-wars-day-biden-mark-hamill"
  },
  {
    "text": "Australia Pledges to Slash About $2 Billion From Student Debt  — Debt will retrospectively be capped at the lower of CPI or WPI  — Changes will cut the debt of about three million people  —  Australia plans to wipe out about A$3 billion ($2 billion) from student loans … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-05/australia-pledges-to-slash-about-2-billion-from-student-debt"
  },
  {
    "text": "Driver dies after crashing into White House perimeter gate  —  There was no threat to the president's home, law enforcement authorities said.  —  WASHINGTON — A driver died after a vehicle crashed into a gate at the White House Saturday night, but the fatal collision is being investigated … ",
    "url": "https://www.politico.com/news/2024/05/05/driver-dies-after-crashing-into-white-house-perimeter-gate-00156159"
  },
  {
    "text": "Noem: 'They're just attacking me like crazy right now.'  —  The South Dakota governor has come under intense criticism for her decision to shoot and kill her dog 20 years ago.  —  Kristi Noem cast herself as the victim of a liberal- and media-run smear campaign at a Republican donor retreat on Saturday … ",
    "url": "https://www.politico.com/news/2024/05/04/noem-dog-attack-00156153"
  },
  {
    "text": "Trump lawyer John Eastman can't pratice law in D.C. temporarily, court says  —  The suspension of Eastman's license was in response to a similar decision in California.  —  The D.C. Court of Appeals has temporarily suspended John Eastman's law license after a similar decision in California … ",
    "url": "https://www.washingtonpost.com/national-security/2024/05/04/john-eastman-trump-lawyer-disbarred/"
  }
]