[
  {
    "text": "Trump's Speeches, Increasingly Angry and Rambling, Reignite the Question of Age … Former President Donald J. Trump vividly recounted how the audience at his climactic debate with Vice President Kamala Harris was on his side.  Except that there was no audience.  The debate was held in an empty hall.",
    "url": "https://www.nytimes.com/2024/10/06/us/politics/trump-speeches-age-cognitive-decline.html?unlocked_article_code=1.QE4.Sj6N.wDMvFD_Cmj4k&smid=url-share"
  },
  {
    "text": "Election Skeptics Are Running Some County Election Boards in Georgia.  A New Rule Could Allow Them to Exclude Decisive Votes.  —  An examination of a new election rule in Georgia suggests that local officials in just a handful of rural counties could exclude enough votes to affect the outcome of the 2024 presidential race.",
    "url": "https://www.propublica.org/article/georgia-election-rule-could-exclude-votes"
  },
  {
    "text": "‘Sounding the alarm’: Election officials warn postal delays could invalidate mailed ballots  —  Postmaster General Louis DeJoy says staffers take ‘extraordinary measures’ to delivery ballots on time, but election officials warn delays could invalidate votes.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/06/absentee-mail-in-ballots-postal-service-delays/75499900007/"
  },
  {
    "text": "Republicans are trying to up their early voting game — but Trump keeps getting in the way  —  The former president's rhetoric threatens to undermine a massive get-out-the-vote effort, some Republican strategists say.  —  Republicans are pouring tens of millions of dollars into getting GOP voters to cast ballots before Election Day.",
    "url": "https://www.politico.com/news/2024/10/06/trumps-early-voting-00182611"
  },
  {
    "text": "Harris Will Appear in a Whirlwind of Interviews, Most of Them Friendly  —  After mostly avoiding interviews as her campaign began, the vice president will hold several this week, including with Howard Stern, Stephen Colbert and the hosts of “The View.”  —  Vice President Kamala Harris … ",
    "url": "https://www.nytimes.com/2024/10/06/us/politics/kamala-harris-interviews-the-view-stern-stephen-colbert.html"
  },
  {
    "text": "All Hell Is Going to Break Loose: Maybe Jack Smith Did Precisely What Elie Honig Claims He Didn't  —  There are a number of laugh-in-his-face funny things about Elie Honig's column bitching that Jack Smith submitted his immunity filing before the election.  First, for years Honig whined … ",
    "url": "https://www.emptywheel.net/2024/10/06/all-hell-is-going-to-break-loose-maybe-jack-smith-did-precisely-what-elie-honig-claims-he-didnt/"
  },
  {
    "text": "‘This is voter fraud’: FBI alerted as Elon Musk's mom accused of committing federal crime  —  Donald Trump's embrace of the richest man in the world, Elon Musk, hit another speedbump on Saturday as Musk's mom was accused of encouraging her followers to commit voter fraud.",
    "url": "https://www.rawstory.com/elon-musks-mom-voter-fraud-trump/"
  },
  {
    "text": "‘Undisciplined, unhinged and deranged’: will Trump's strange behavior hurt him at the polls?  —  While he's always been quick to insult, he's now frequently vicious, and his speeches are increasingly disjointed  —  A “beautiful” beach body and a “mentally disabled” opponent.",
    "url": "https://www.theguardian.com/us-news/2024/oct/06/trump-behavior-final-meltdown"
  },
  {
    "text": "October 5, 2024  —  William McKinley is having a moment (which I confess is a sentence I never expected to write).  —  Republican presidential nominee Donald Trump is elevating McKinley, representative from Ohio from 1877 to 1891 and president from 1897 to 1901, to justify his plan to impose new high tariffs.",
    "url": "https://heathercoxrichardson.substack.com/p/october-5-2024"
  },
  {
    "text": "Hines & RFK Jr. ‘Have Barely Spoken’ Since Affair News Broke  —  EMBARRASSED  —  Cheryl Hines and Robert F. Kennedy Jr. “have barely spoken” since news emerged that he had a digital affair with New York magazine reporter Olivia Nuzzi, a source told People magazine.",
    "url": "https://www.thedailybeast.com/cheryl-hines-and-rfk-jr-have-barely-spoken-since-affair-news-broke"
  },
  {
    "text": "Tim Walz Easily Bats Down Fox Anchor's Anti-Abortion Questions  —  Shannon Bream tried to frame the vice presidential nominee as an extremist on abortion.  He didn't let her  —  Gov. Tim Walz vociferously defended his record on abortion rights during an appearance on Fox News Sunday.",
    "url": "https://www.rollingstone.com/politics/politics-news/tim-walz-fox-anchor-abortion-law-1235127283/"
  },
  {
    "text": "Hungarians protest state media ‘propaganda factory’ and demand unbiased press  —  Thousands of protesters gathered outside the headquarters of Hungary's public media corporation on Saturday to demonstrate against what they say is an entrenched propaganda network operated by the nationalist government at taxpayer expense.",
    "url": "https://apnews.com/article/hungarians-protest-media-propaganda-ef0f419ea38ea8d2beb4f0dd56d82d57"
  },
  {
    "text": "Fact check: Six days of Trump lies about the Hurricane Helene response  —  Former President Donald Trump has delivered a barrage of lies and distortions about the federal response to Hurricane Helene.  —  While various misinformation about the response has spread widely without Trump's involvement … ",
    "url": "https://www.cnn.com/2024/10/06/politics/fact-check-trump-helene-response-north-carolina/"
  },
  {
    "text": "How Donald Trump Jr. Became the Crown Prince of MAGA World  —  The eldest son has a mission for the next four years: keeping ‘snakes’ out of the White House  —  Sitting next to the man he installed as the Republican vice presidential nominee, Donald Trump Jr.couldn't help but gloat.",
    "url": "https://www.wsj.com/politics/elections/how-donald-trump-jr-became-the-crown-prince-of-maga-world-debd9c52"
  },
  {
    "text": "Playbook: Michigan messes mount for Harris  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  TICK TOCK — One month until Election Day.  —  RETURN TO BUTLER — Former President DONALD TRUMP heads back to Butler, Pennsylvania, today … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/10/05/michigan-messes-mount-for-harris-00182609"
  }
]