[
  {
    "text": "Harris to hold first rally with running mate Tuesday in Philadelphia  —  The vice president is expected to announce her pick sometime before the appearance.  —  Vice President Kamala Harris is expected to announce her running mate by Tuesday, when she will hold her first rally with her pick in Philadelphia.",
    "url": "https://www.politico.com/news/2024/07/30/harris-first-rally-running-mate-tuesday-philadelphia-00171999"
  },
  {
    "text": "Kamala Harris Wipes Out Trump's Swing-State Lead in Election Dead Heat  —  The vice president is polling better than Biden was before he dropped out, according to the latest Bloomberg News/Morning Consult survey.  —  Kamala Harris has wiped out Donald Trump's lead across seven battleground states … ",
    "url": "https://www.bloomberg.com/news/features/2024-07-30/kamala-harris-erases-trump-s-swing-state-lead-in-2024-election-poll"
  },
  {
    "text": "Harris dares Trump to debate her as she campaigns in Atlanta: “Say it to my face”  —  Vice President Kamala Harris taunted former President Donald Trump to meet her on a debate stage before the November election while she campaigned in Atlanta on Tuesday night.",
    "url": "https://www.cbsnews.com/news/kamala-harris-rally-atlanta-megan-thee-stallion/"
  },
  {
    "text": "Harris campaign unveils ad hitting Trump back over the border  —  Vice President Harris's campaign on Tuesday unveiled a new campaign video that attacks former President Trump over the U.S.-southern border in response to a Trump ad targeting Harris on the issue.",
    "url": "https://thehill.com/homenews/4801766-kamala-harris-donald-trump-border/"
  },
  {
    "text": "Playbook: Harris puts Trump on his heels  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  DEVELOPING OVERNIGHT — “Hamas leader ISMAIL HANIYEH was assassinated in the early hours of the morning in Iran, the Palestinian militant group said on Wednesday … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/31/harris-puts-trump-on-his-heels-00172025"
  },
  {
    "text": "Read J.D. Vance's Violent Foreword to Project 2025 Leader's New Book  —  Donald Trump has been desperate lately to distance himself from Project 2025, the Heritage Foundation's radical plan to remake the federal government under his presidency.  “I have no idea who is behind it,” … ",
    "url": "https://newrepublic.com/article/184393/jd-vance-violent-foreword-kevin-roberts-project-2025-leader-book"
  },
  {
    "text": "Trump Forces Out Project 2025 Mastermind  —  YOU'RE FIRED  —  The Trump campaign ousted the architect of Project 2025, an ultra-conservative policy manifesto.  But J.D. Vance is still tied to the right-wing project. … Donald Trump's campaign has forced an architect … ",
    "url": "https://www.thedailybeast.com/trump-campaign-puts-the-screws-to-project-2025-mastermind"
  },
  {
    "text": "Hamas leader Haniyeh assassinated in Tehran  —  Haniyeh, along with one of his guards, was reportedly killed at his Tehran residence.  —  Hamas leader Ismail Haniyeh was killed in Iran, Hamas claimed on Wednesday morning, while claiming Israel was behind the attack.",
    "url": "https://www.jpost.com/breaking-news/article-812649"
  },
  {
    "text": "Iran says Hamas leader Ismail Haniyeh was assassinated in Tehran  —  Hamas leader Ismail Haniyeh was assassinated in Tehran, Iran's paramilitary Revolutionary Guard said early Wednesday.  No one immediately claimed responsibility for the assassination but suspicion immediately fell on Israel … ",
    "url": "https://apnews.com/article/iran-hamas-israel-30968a7acb31cd8b259de9650014b779"
  },
  {
    "text": "Arizona congressional primary election: Blake Masters behind in close House race  —  PHOENIX - Arizona's three most hotly contested U.S. congressional primaries remain too close to call, according to the first round of unofficial results from Tuesday's primary elections.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/31/arizona-congressional-primaries-blake-masters-house-race/74614817007/"
  },
  {
    "text": "Meet the conspiracy theorist and anti-LGBTQ extremist pulling the strings at major American corporations  —  In recent months, major companies have publicly announced that they are abandoning their diversity efforts.  In at least two cases, companies were pressured into taking action … ",
    "url": "https://popular.info/p/meet-the-conspiracy-theorist-and"
  },
  {
    "text": "J.D. Vance's Obsessions Are Way Creepier Than Being Childless  —  DON'T DISS DOLLY!  —  OK, J. D. Vance: When did we begin equating fertility with patriotism?  And, if Republicans are so keen on people having kids, why would the party cut family assistance programs? … Having children is good.",
    "url": "https://www.thedailybeast.com/michael-ian-black-jd-vances-obsessions-are-way-creepier-than-being-childless"
  },
  {
    "text": "Rick Wilson on the weirdness of JD Vance  —  “The Mountain Dew jokes, the awkward campaign videos — it just doesn't connect.”  —  ∙ Paid … Like many liberals, I quietly hoped heading into the RNC that Donald Trump would pick JD Vance as his running mate, because I suspected it might go badly.",
    "url": "https://www.publicnotice.co/p/rick-wilson-interview-jd-vance-trump-weird"
  },
  {
    "text": "Statement from President Joe Biden on New Initiatives to Beat the Opioid Epidemic  —  Our Administration's efforts have helped lead to the first decline in overdose deaths in five years.  We have seized more fentanyl at our border in the last two years than in the last five years combined … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/07/31/statement-from-president-joe-biden-on-new-initiatives-to-beat-the-opioid-epidemic/"
  },
  {
    "text": "‘Weird’ Times in American Politics: The New Democratic Playbook  —  Democrats embrace the ‘weird’ label, turning the tables on conservative rhetoric.  —  Alright, folks, let's talk about the strangest new trend in politics: calling your opponents “weird.”  Yes, you read that right.",
    "url": "https://www.readtpa.com/p/weird-times-in-american-politics"
  },
  {
    "text": "Maricopa County Recorder Stephen Richer loses GOP primary to right-wing challenger  —  Richer, a top election official in the largest county in battleground Arizona, drew the ire of Republicans who have echoed Trump's false 2020 election claims.  —  PHOENIX — Arizona state … ",
    "url": "https://www.nbcnews.com/politics/2024-election/maricopa-county-recorder-stephen-richer-loses-gop-primary-right-wing-c-rcna164046"
  },
  {
    "text": "Trump pressed for answers after saying supporters 'won't have to vote' again  —  What did Donald Trump mean when he told supporters they “won't have to vote anymore” if he wins?  The Republican's latest explanation was hardly reassuring.  —  Given Donald Trump's apparent discomfort … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-pressed-answers-saying-supporters-wont-vote-rcna164264"
  }
]