[
  {
    "text": "Trump camp escalates attempt to limit second-term talk from outside allies  —  Top officials in Donald Trump's campaign sought Friday to quell discussions about his possible second term in the White House, amid alarms about authoritarianism and reports about personnel.",
    "url": "https://www.washingtonpost.com/politics/2023/12/08/trump-campaign-statement-second-term/"
  },
  {
    "text": "Fears of a NATO Withdrawal Rise as Trump Seeks a Return to Power  —  Current and former European diplomats said there was growing concern a second Trump presidency could mean an American retreat from the continent and a gutting of NATO.  —  For 74 years, the North Atlantic Treaty Organization … ",
    "url": "https://www.nytimes.com/2023/12/09/us/politics/trump-2025-nato.html"
  },
  {
    "text": "Dems want to focus on abortion rights.  A Trump ally may have just helped.  —  A Texas case underscores the legal and ethical gray areas physicians have faced since the Supreme Court overturned Roe v. Wade.  —  A showdown in Texas over one woman's right to terminate a non-viable pregnancy … ",
    "url": "https://www.politico.com/news/2023/12/08/a-mess-in-texas-abortion-case-highlights-gray-areas-of-abortion-bans-00130919"
  },
  {
    "text": "Texas Supreme Court Temporarily Halts Court-Approved Abortion  —  The court, responding to an appeal from Attorney General Ken Paxton, put on hold a lower court order allowing an abortion for a woman whose fetus has a fatal condition.  —  The Texas Supreme Court late Friday temporarily halted … ",
    "url": "https://www.nytimes.com/2023/12/08/us/texas-abortion-court-ken-paxton.html"
  },
  {
    "text": "Liz Cheney says Donald Trump's ‘dictator’ remark should be taken ‘literally and seriously’  —  Cheney spoke with ABC's Jonathan Karl for “This Week.”  —  ABC “This Week” co-anchor Jonathan Karl interviews former Wyoming Congresswoman Liz Cheney.  —  Former GOP Rep. Liz Cheney … ",
    "url": "https://abcnews.go.com/Politics/liz-cheney-donald-trumps-dictator-remark-literally/story?id=105497248"
  },
  {
    "text": "Federal judge bars separating migrant families for 8 years  —  A federal judge on Friday blocked the federal government from separating families solely as part of border enforcement policy for the next eight years, stopping any potential return to the short-lived zero tolerance policy of 2018.",
    "url": "https://thehill.com/regulation/court-battles/4350827-judge-bars-separating-migrant-families-8-years/"
  },
  {
    "text": "Her Online Sex Life Was Exposed.  She Lost Her Election.  Now She's Speaking Out.  —  Susanna Gibson's campaign was rocked when an opponent exposed her private digital life to the public.  She won't be the last.  —  It is not often that a state legislative campaign in an off-season election seizes the national spotlight.",
    "url": "https://www.politico.com/news/magazine/2023/12/09/susanna-gibson-virginia-digital-privacy-00130883"
  },
  {
    "text": "Trump PAC paid for expert witness testimony in N.Y. civil fraud trial  —  Eli Bartov, an accounting professor at New York University, said that his $900K in expert witness fees were paid by the Trump Organization and Trump's Save America PAC.  —  An expert witness in the $250 million civil fraud trial … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-pac-paid-expert-witness-testimony-ny-civil-fraud-trial-rcna128804"
  },
  {
    "text": "‘I Am Sorry’: Harvard President Gay Addresses Backlash Over Congressional Testimony on Antisemitism  —  Harvard President Claudine Gay apologized for her remarks at the end of her congressional testimony, which sparked fierce national criticism and led the leadership of Harvard Hillel … ",
    "url": "https://www.thecrimson.com/article/2023/12/8/gay-apology-congressional-remarks/"
  },
  {
    "text": "As More ‘Fake Electors’ Face Charges, a Key Witness Emerges  —  Kenneth Chesebro, an architect of the plan to deploy people claiming to be Trump electors in states won by President Biden, is cooperating with inquiries in Michigan, Arizona and Nevada.  —  Twenty-four of the so-called fake Trump electors … ",
    "url": "https://www.nytimes.com/2023/12/08/us/politics/chesebro-fake-electors-trump.html"
  },
  {
    "text": "Appeals court largely upholds Trump gag order in federal election interference case  —  Trump is prohibited from making public statements about potential witnesses.  —  Former President Donald Trump speaks during a Commit to Caucus rally, Dec. 2, 2023, in Ankeny, Iowa.",
    "url": "https://abcnews.go.com/US/appeals-court-largely-upholds-trump-gag-order-federal/story?id=105503790"
  },
  {
    "text": "US vetoes UN resolution backed by many nations demanding immediate humanitarian cease-fire in Gaza  —  UNITED NATIONS (AP) — The United States vetoed a United Nations resolution Friday backed by almost all other Security Council members and dozens of other nations demanding an immediate humanitarian cease-fire in Gaza.",
    "url": "https://apnews.com/article/israel-palestinians-un-resolution-ceasefire-humanitarian-6d3bfd31d6c25168e828274d96b85cf8"
  },
  {
    "text": "Billionaire GOP donor endorses Haley, says Trump's time has ‘come and gone’  —  Home Depot co-founder and billionaire Ken Langone put his support behind GOP hopeful Nikki Haley on Friday, calling her approach to the 2024 election “smart.”  —  “I think she's just what we need right now.",
    "url": "https://thehill.com/homenews/campaign/4350728-nikki-haley-billionaire-gop-donor-endorsement-2024/"
  },
  {
    "text": "Why are the 14th Amendment lawsuits seeking to bar Trump failing?  —  So far, all 14th Amendment lawsuits against Trump have been rejected by courts.  —  Former President Donald Trump attends a Manhattan courthouse trial in a civil fraud case in New York, October 18, 2023.",
    "url": "https://abcnews.go.com/Politics/14th-amendment-lawsuits-seeking-bar-trump-failing/story?id=105391248"
  },
  {
    "text": "Casey DeSantis causes Iowa caucus confusion with call to descend on state  —  Casey DeSantis, the wife of Gov. Ron DeSantis (R-FL), briefly caused confusion on Friday when she appeared to call for supporters of her husband across the country to descend on Iowa and seemingly take part in the Iowa caucuses in January.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/casey-desantis-causes-confusion-over-iowa-caucus"
  },
  {
    "text": "Nancy Mace and her entrepreneur fiancé Patrick Byrant split after 18 months - as staff quit her office and she's accused of discussing her sex life with aides  — The South Carolina lawmaker - who was one of the eight to vote out former Speaker Kevin McCarthy - split with her fiancé last month",
    "url": "https://www.dailymail.co.uk/news/article-12833527/nancy-mace-fiance-break-charleston-south-carolina.html"
  },
  {
    "text": "RNC officially bows out of hosting primary debates  —  The organization steps aside as television networks plan more early state debates.  —  The Republican National Committee is pausing its participation in 2024 GOP primary debates, the organization decided Friday.",
    "url": "https://www.politico.com/news/2023/12/08/rnc-officially-bows-out-of-hosting-primary-debates-for-now-00130857"
  },
  {
    "text": "What to know about Trump-appointed judge in Hunter Biden tax case  —  Mark Scarsi, a U.S. district court judge, has been assigned to the case involving a federal indictment against President Biden's son, Hunter Biden.  —  Scarsi is based in the Central District of California and oversees Los Angeles.",
    "url": "https://thehill.com/regulation/court-battles/4350050-what-to-know-trump-appointed-judge-hunter-biden-tax-case/"
  },
  {
    "text": "This Is Who Melania Trump Is Reportedly Pushing for Her Husband's VP, and It's Not Surprising  —  In less than six weeks, voting is set to start in the 2024 Republican primary, and the only top contender is former President Trump.  —  So the only question remains: who will be his vice president pick?",
    "url": "https://townhall.com/tipsheet/saraharnold/2023/12/07/this-is-the-person-melania-trump-is-reportedly-pushing-for-her-husbands-vp-and-its-not-surprising-n2632145"
  },
  {
    "text": "FDA approves 2 new gene therapies for sickle cell disease, a ‘functional cure’ for many patients  —  Sickle cell disease is a genetic condition affecting at least 100,000 Americans.  —  Research for sickle cell disease.  —  The U.S. Food and Drug Administration (FDA) … ",
    "url": "https://abcnews.go.com/Health/fda-approves-new-gene-therapies-sickle-cell-disease/story?id=105482870"
  }
]