[
  {
    "text": "JD Vance got a former professor to delete a blog post Vance wrote in 2012 attacking GOP over anti-immigrant rhetoric  —  A week after President Barack Obama won reelection in November 2012, JD Vance, then a law student at Yale, wrote a scathing rebuke of the Republican Party's stance on migrants … ",
    "url": "https://www.cnn.com/2024/09/17/politics/jd-vance-delete-2012-blog-post-attacking-gop-anti-immigrant-rhetoric/"
  },
  {
    "text": "Overseas threats hit the Ohio city where Trump and Vance lied about Haitians eating pets  —  SPRINGFIELD, Ohio (AP) — Ohio stationed state police at Springfield schools Tuesday in response to a rash of bomb threats — the vast majority that officials said came from overseas —",
    "url": "https://apnews.com/article/trump-vance-haitian-immigrants-ohio-threats-8035cbe409b471e61fe2e5457870d7b4"
  },
  {
    "text": "Dozens of Hezbollah members wounded in Lebanon when pagers exploded, sources and witnesses say  —  At least eight people were killed and 2,750 others including Hezbollah fighters, medics and Iran's envoy to Beirut were wounded on Tuesday when the pagers they use to communicate exploded across Lebanon … ",
    "url": "https://www.reuters.com/world/middle-east/dozens-hezbollah-members-wounded-lebanon-when-pagers-exploded-sources-witnesses-2024-09-17/"
  },
  {
    "text": "Hezbollah Pagers Explode in Apparent Attack Across Lebanon  —  Eight people were killed and 2,750 wounded, country's health minister says  —  BEIRUT—Pagers carried by thousands of Hezbollah operatives exploded at about the same time Tuesday afternoon in what appeared to be an unprecedented attack … ",
    "url": "https://www.wsj.com/world/middle-east/hundreds-of-hezbollah-operatives-pagers-explode-in-apparent-attack-across-lebanon-cf31cad4?st=trumvlry6nd9rff&reflink=article_copyURL_share"
  },
  {
    "text": "Judge Aileen Cannon Failed to Disclose a Right-Wing Junket  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Federal Judge Aileen M. Cannon, the controversial jurist who tossed … ",
    "url": "https://www.propublica.org/article/judge-aileen-cannon-trump-documents-case-travel-disclosures"
  },
  {
    "text": "Secret Service Told Trump It Needs to Bolster Security if He Keeps Golfing  —  The agency's acting director, Ronald L. Rowe Jr., met with Donald J. Trump on Monday in the aftermath of the apparent assassination attempt on Sunday.  —  The acting director of the Secret Service told former … ",
    "url": "https://www.nytimes.com/2024/09/17/us/politics/trump-secret-service-golf.html"
  },
  {
    "text": "Trump, without evidence, blames ‘rhetoric’ of Biden, Harris for possible assassination attempt  —  Former president Trump, who has a long history of inflammatory rhetoric, repeated the claim on his social media platform Truth Social.  —  Former president Donald Trump on Monday blamed the … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/16/trump-blames-biden-harris-rhetoric-potential-assassination-attempt/"
  },
  {
    "text": "Republicans block Democratic bill on IVF protections  —  As Trump pitches himself as a “leader on IVF,” GOP senators dismiss the legislation as a Democratic stunt.  —  Senate Republicans blocked passage on Tuesday of a Democratic bill that would federally protect access to in vitro fertilization … ",
    "url": "https://www.politico.com/news/2024/09/17/republicans-block-ivf-bill-00179626"
  },
  {
    "text": "Harris soars to record 6-point lead over Trump in post-debate poll … - “A majority of likely voters — including 1 in 5 Republicans — believe Harris won the debate, and performance appears to be crystalizing her national lead over the former president,” said Eli Yokley, political analyst at Morning Consult, in an emailed statement.",
    "url": "https://www.axios.com/2024/09/17/harris-leads-trump-poll-after-debate-record"
  },
  {
    "text": "Watch live: Trump, Sarah Huckabee Sanders hold town hall in Michigan  —  Former President Trump will speak with voters in the storied auto manufacturing community of Flint, Mich., Tuesday evening at a town hall moderated by Arkansas Gov. Sarah Huckabee Sanders, who served in his administration as press secretary.",
    "url": "https://thehill.com/video-clips/4884551-trump-sarah-huckabee-sanders-hold-town-hall-in-michigan/"
  },
  {
    "text": "“Depressed, disgusted and horrified”: These lifelong Republicans say they're finally done with Trump  —  Former Republicans opposed to Donald Trump are working to give conservatives “permission” to vote for a Democrat  —  Robert Nix, a 62-year-old lawyer from Philadelphia, was a lifelong Republican before Donald Trump came to office.",
    "url": "https://www.salon.com/2024/09/17/depressed-disgusted-and-horrified-these-lifelong-say-theyre-finally-done-with/"
  },
  {
    "text": "GOP Sen. John Kennedy To Arab American Witness: 'You Support Hamas, Don't You?'  —  “You should hide your head in a bag,” the Louisiana Republican sniped at Maya Berry of the Arab American Institute, after baselessly accusing her of backing terrorists.  —  LOADING",
    "url": "https://www.huffpost.com/entry/john-kennedy-arab-american-hamas-islamophobia_n_66e9c0a6e4b0bcfae11a0e3f"
  },
  {
    "text": "Vance: Trump's Health-Care Plan Is to Let Insurers Charge More for Preexisting Conditions … Donald Trump infamously said at the presidential debate he had the “concept of a plan” to replace Obamacare.  As is often the case when Trump commits verbal self-harm, it fell to J.D. Vance to turn … ",
    "url": "https://nymag.com/intelligencer/article/trump-health-plan-charge-more-preexisting-conditions-concept-plan-j-d-vance.html"
  },
  {
    "text": "McConnell: Government shutdown before election ‘politically beyond stupid’  —  Senate Republican Leader Mitch McConnell (Ky.) is warning colleagues that it would be “politically beyond stupid” for Congress to stumble into a government shutdown a few weeks before Election Day, saying Republicans would “certainly” get the blame.",
    "url": "https://thehill.com/homenews/senate/4884800-mcconnell-government-shutdown-election/"
  },
  {
    "text": "Russian cyber operatives shift focus to Harris campaign, Microsoft says … - One claimed to show a group of alleged Harris supporters attacking an assumed Trump rally attendee. … - Both videos were spread through a website posing as a local San Francisco news outlet.",
    "url": "https://www.axios.com/2024/09/17/harris-elections-russia-disinformation-microsoft"
  },
  {
    "text": "Court may decide if Arizonans with missing citizenship records can vote in state races  —  Arizona officials discovered they have no records showing if nearly 100,000 longtime residents provided proof of citizenship, which is required by law to vote in state and local races.",
    "url": "https://www.washingtonpost.com/politics/2024/09/17/arizona-noncitizen-voters/"
  },
  {
    "text": "Judge rules Trump Media breached stock contract with early investor … Trump Media breached an agreement with one of the investors that helped the company go public, and must grant the investor a larger share of its stock, a judge ruled.  —  The order in Delaware Chancery Court on Monday came … ",
    "url": "https://www.cnbc.com/2024/09/17/djt-trump-media-stock-lawsuit-lockup.html"
  },
  {
    "text": "Suspicious packages sent to election officials in at least 6 states  —  Suspicious packages were sent to election officials in at least six states on Monday, but there were no reports that any of the packages contained hazardous material.  —  Powder-containing packages were sent to secretaries … ",
    "url": "https://apnews.com/article/suspicious-packages-election-powder-iowa-nebraska-tennessee-63c85689b94f0f55cf68c64dd05bea8f"
  },
  {
    "text": "Mehdi Hasan sounds off  —  “The media is too timid, too cautious, too cowardly.”  —  ∙ Paid … Mehdi Hasan thinks elite media institutions are failing us, which is why he founded Zeteo, an “independent and unfiltered” news and commentary site that has grown exponentially since its debut earlier this year.",
    "url": "https://www.publicnotice.co/p/mehdi-hasan-interview-2024"
  },
  {
    "text": "Foreign hackers could target election litigation, federal judge warns  —  The judge, who heads a committee on information technology for the federal courts, urged his colleagues to be vigilant.  —  Federal judges were warned Tuesday to be extra-vigilant in their cybersecurity practices … ",
    "url": "https://www.politico.com/news/2024/09/17/foreign-hackers-election-2024-00179680"
  }
]