[
  {
    "text": "Los Angeles Times editorials editor resigns after owner blocks presidential endorsement  —  Mariel Garza, the editorials editor of the Los Angeles Times, resigned on Wednesday after the newspaper's owner blocked the editorial board's plans to endorse Vice President Kamala Harris for president.",
    "url": "https://www.cjr.org/business_of_news/los-angeles-times-editorials-editor-resigns-after-owner-blocks-presidential-endorsement.php"
  },
  {
    "text": "L.A. Times opinion editor quits after billionaire owner kills endorsement  —  Mariel Garza, editorials editor at The Los Angeles Times, has resigned to protest the paper's decision to cancel a presidential endorsement at the behest of its owner.  —  The news comes a day after it was revealed … ",
    "url": "https://sfstandard.com/2024/10/23/la-times-opinion-editor-quits-after-billionaire-kills-endorsement/"
  },
  {
    "text": "Trump Takes Narrow Lead Over Harris in Closing Weeks of Race  —  Voters remember Trump's presidency more fondly as negative views of Harris grow  —  Donald Trump has opened a narrow lead in the presidential race, as voters have adopted a more positive view of his agenda and past performance … ",
    "url": "https://www.wsj.com/politics/elections/trump-leads-harris-wsj-poll-779f8516?st=1xh3BC"
  },
  {
    "text": "Donald Trump groped me in what felt like a ‘twisted game’ with Jeffrey Epstein, former model alleges  —  Stacey Williams says the ex-president, whose spokesperson denied the allegations, touched her in an unwanted sexual way in 1993, after Epstein introduced them",
    "url": "https://www.theguardian.com/us-news/2024/oct/23/donald-trump-accuser-stacey-williams-jeffrey-epstein"
  },
  {
    "text": "The Sad, Pathetic Spectacle of John Kelly's Critics  —  WHEN GEN. JOHN KELLY WENT PUBLIC about Trump's praise for Hitler and his fears about a dictatorial second Trump term, he joined a growing list of former Trump officials ringing the alarm.  —  He also sparked what has become a pathetic … ",
    "url": "https://www.thebulwark.com/p/the-sad-pathetic-spectacle-of-john"
  },
  {
    "text": "FBI finds hundreds of weapons at home of suspected shooter of Arizona Democratic Party office  —  Lauren De Young Richard RuelasArizona Republic  —  (This story was updated with new information.)  —  Federal agents on Wednesday morning hauled more than 100 firearms, including “machine guns … ",
    "url": "https://www.azcentral.com/story/news/local/tempe-breaking/2024/10/23/suspect-identified-tempe-democratic-party-office-shootings/75806849007/"
  },
  {
    "text": "Man behind Phoenix-area political threats had huge stash of guns, ammo, police say  —  TEMPE, AZ (AZFamily) — Dozens of guns, thousands of rounds of ammunition and a grenade launcher were reportedly recovered from the home of a suspect accused of leaving bags of white powder at multiple locations … ",
    "url": "https://www.azfamily.com/2024/10/23/man-behind-phoenix-area-political-threats-had-huge-stash-guns-ammo-police-say/"
  },
  {
    "text": "Justice Department warns Elon Musk that his $1 million giveaway to registered voters may be illegal  —  The Justice Department warned Elon Musk's America PAC in recent days that his $1 million sweepstakes to registered voters in swing states may violate federal law, people briefed on the matter told CNN.",
    "url": "https://www.cnn.com/2024/10/23/politics/elon-musk-justice-department-letter/"
  },
  {
    "text": "McConnell says ‘MAGA movement is completely wrong’ and Reagan 'wouldn't recognize' Trump's GOP  —  Senate Minority Leader Mitch McConnell delivered a scathing assessment of the modern Republican Party in an upcoming biography, saying the “MAGA movement is completely wrong” and that Ronald Reagan “wouldn't recognize” the party today.",
    "url": "https://www.cnn.com/2024/10/23/politics/mcconnell-trump-gop-new-book"
  },
  {
    "text": "Guess who's suing the FTC to stop click to cancel … Three industry groups are suing to prevent the Federal Trade Commission (FTC) from enforcing its new “Click to Cancel” rule that requires companies to make it easy to cancel subscriptions, according to Reuters.  And yes, it's exactly who you'd expect.",
    "url": "https://www.theverge.com/2024/10/23/24278020/ftc-click-to-cancel-subscriptions-rule-lawsuit-telecoms-security-advertising-groups"
  },
  {
    "text": "Top Democrat sounds alarm over Trump transition plan delay … - The Maryland Democrat said the Trump team's actions demonstrated “a spectacular disregard for the successful continuation of the essential institutions of American democratic government.”  — Two deadlines on agreements … ",
    "url": "https://www.axios.com/2024/10/23/trump-raskin-letter-transition-team-ethics-deadlines"
  },
  {
    "text": "“Not Medically Necessary”: Inside the Company Helping America's Biggest Health Insurers Deny Coverage for Care  —  Co-published with The Capitol Forum  —  Uncovered: How the Insurance Industry Denies Coverage to Patients  — Dialing for Dollars: America's largest insurers hire EviCore … ",
    "url": "https://www.propublica.org/article/evicore-health-insurance-denials-cigna-unitedhealthcare-aetna-prior-authorizations"
  },
  {
    "text": "American creating deepfakes targeting Harris works with Russian intel, documents show  —  Russian documents reviewed by The Post expose the workings of a Moscow network that has become a potent source of fake news targeting American voters.  —  A former deputy Palm Beach County sheriff … ",
    "url": "https://www.washingtonpost.com/world/2024/10/23/dougan-russian-disinformation-harris/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5NjU2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxMDQxOTk5LCJpYXQiOjE3Mjk2NTYwMDAsImp0aSI6ImVmY2E3N2RlLTAzYzgtNGRjYy05NDAxLTAwNDhkNzEyM2QzOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI0LzEwLzIzL2RvdWdhbi1ydXNzaWFuLWRpc2luZm9ybWF0aW9uLWhhcnJpcy8ifQ.AI6DT-3a02S9Cgza-srzyduWyDv3rbrG7T0-jbVsjWY&itid=gfta"
  },
  {
    "text": "What's Preventing Harris From Crushing Trump Is Shockingly Simple  —  As Elon Musk's rabid pro-Trump mania makes clear, billionaires are wielding their financial might in this year's presidential election far more than in any previous campaign—and far more openly, too.",
    "url": "https://slate.com/news-and-politics/2024/10/trump-kamala-harris-election-elon-musk-gates-polls-2024.html"
  },
  {
    "text": "The AI-Generated Product Reviews Choking the Internet Are Now Illegal  —  Cleaning Up  —  It's officially illegal to publish fake, AI-generated product reviews.  —  Sweeping changes to Federal Trade Commission (FTC) guidelines aimed at cleaning up the polluted, confusing world … ",
    "url": "https://futurism.com/the-byte/illegal-fake-reviews-ai"
  },
  {
    "text": "Judge's ultimatum forces deal to shelve subpoena fight in House GOP probe of Hunter Biden  —  'Don't test me on this,' Judge Ana Reyes intoned, betting her dog that the subpoenas wouldn't yield the info Republicans are seeking.  —  A highly unusual ultimatum from a frustrated judge caused … ",
    "url": "https://www.politico.com/news/2024/10/23/subpoena-fight-hunter-biden-00185119"
  },
  {
    "text": "Half a pound of this powder can remove as much CO₂ from the air as a tree, scientists say  —  A typical large tree can suck as much as 40 kilograms of carbon dioxide out of the air over the course of a year.  Now scientists at UC Berkeley say they can do the same job with less than half a pound of a fluffy yellow powder.",
    "url": "https://www.latimes.com/environment/story/2024-10-23/this-powder-can-remove-as-much-co2-from-the-air-as-a-tree"
  }
]