[
  {
    "text": "This obscure law is one reason Trump's agenda keeps losing in court  —  Lawsuits challenging Trump policies raise big constitutional questions, but they also rely on a law that requires the government to follow the correct procedures when changing course.  —  WASHINGTON — Lawyers challenging … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-losing-court-boring-reason-adminitrative-procedure-act-rcna191113"
  },
  {
    "text": "White House says judges balking at Trump's actions are provoking a ‘constitutional crisis’  —  The White House said Wednesday that court rulings going against the Trump administration are coming from “judicial activists” on the bench whose decisions amount to a “constitutional crisis.”",
    "url": "https://apnews.com/article/trump-judges-rulings-constitutional-crisis-presidential-power-a9c593cf3f9faec23a03f4a5123fefdb"
  },
  {
    "text": "Republicans Love Trump's Spending Cuts.  Just Not in Their States.  —  Even as they praise the president's unilateral actions to slash federal spending, G.O.P. lawmakers have quietly moved to seek carve outs or exemptions for their own constituents.  —  Republicans in Congress have responded … ",
    "url": "https://www.nytimes.com/2025/02/12/us/politics/trump-spending-republicans-agriculture-research.html"
  },
  {
    "text": "Defying Johnson, Graham and Senate G.O.P. Push Their Own Budget Plan  —  Senator Lindsey Graham, the South Carolina Republican who relishes being in the middle of the action, is leapfrogging the House G.O.P., which is still tied in knots over how to pass its budget.",
    "url": "https://www.nytimes.com/2025/02/12/us/politics/lindsey-graham-budget-johnson-senate-house.html"
  },
  {
    "text": "Trump Humiliated in the ‘Most Powerless Image Ever’ of a U.S. President: O'Donnell  —  Trump has always craved is the attention of the “truly rich,” and how he finally has it, MSNBC's Lawrence O'Donnell said.",
    "url": "https://www.thedailybeast.com/lawrence-odonnell-musk-humiliates-trump-in-most-powerless-image-ever/"
  },
  {
    "text": "New Kennedy Center board elects Trump as chair.  Rutter departs as president.  —  President Trump's refashioned board of trustees voted him chairman in a meeting Wednesday afternoon.  President Deborah Rutter told staff she was leaving the institution.  —  The Kennedy Center board … ",
    "url": "https://www.washingtonpost.com/entertainment/2025/02/12/trump-elected-kennedy-center-board-chair/"
  },
  {
    "text": "Tulsi Gabbard confirmed as director of national intelligence, overcoming skepticism  —  The U.S. Senate has confirmed former Hawaii Rep. Tulsi Gabbard to lead the intelligence community as director of national intelligence, despite initial skepticism.  —  Gabbard was confirmed 52-48 … ",
    "url": "https://www.npr.org/2025/02/12/nx-s1-5294635/tulsi-gabbard-confirmed-dni-intelligence-senate"
  },
  {
    "text": "Senate votes to confirm Tulsi Gabbard as top U.S. intelligence official  —  Gabbard overcame initial skepticism from some Republican senators about her nomination, underscoring Trump's grip on the party.  —  WASHINGTON — The GOP-controlled Senate early Wednesday morning voted … ",
    "url": "https://www.nbcnews.com/politics/national-security/senate-votes-confirm-tulsi-gabbard-top-us-intelligence-official-rcna191587"
  },
  {
    "text": "Live Updates: Trump Holds Call With Putin to Start Talks on Ending Ukraine War  —  Where Things Stand  — Trump-Putin call: President Trump said that he had “a lengthy and highly productive” call with President Vladimir V. Putin of Russia on Wednesday that he characterized as the start of the negotiation to end the war in Ukraine.",
    "url": "https://www.nytimes.com/live/2025/02/12/us/trump-news-gabbard-rfk"
  },
  {
    "text": "“Armored Tesla” forecast to win $400 million State Department contract after Trump's election, government document shows  —  The State Department's procurement forecast, revised as of late December 2024, lists Tesla as the recipient of the largest expected contract, with Marco Rubio's department planning … ",
    "url": "https://www.dropsitenews.com/p/elon-musk-armored-tesla-forecast-400-million-state-department-contracts"
  },
  {
    "text": "Trump Softens Tone on Inflation After Pledging to Lower Prices  —  President Trump pledged to lower costs on “Day 1” as a candidate.  His administration now acknowledges it will take more time.  —  President Trump promised voters that, if elected, he would enact policies that would bring prices down on “Day 1” in office.",
    "url": "https://www.nytimes.com/2025/02/12/business/trump-inflation-prices.html"
  },
  {
    "text": "Federal judge won't prevent withholding of FEMA funding for New York City migrant hotel stays  —  The Federal Emergency Management Agency has clawed back more than $80 million from New York City, officials said Wednesday, escalating a dispute between the Trump administration and the nation's largest city … ",
    "url": "https://apnews.com/article/fema-migrant-hotels-new-york-musk-immigration-a41f36b2bfdc0bb78a5859bcec8dfb72"
  },
  {
    "text": "US sues New York state officials over immigration enforcement, attorney general says  —  The U.S. Justice Department has sued New York State officials over alleged failures to enforce federal immigration law, Attorney General Pam Bondi told reporters on Wednesday.",
    "url": "https://www.reuters.com/world/us/us-sues-new-york-state-officials-over-immigration-enforcement-attorney-general-2025-02-12/"
  },
  {
    "text": "Judge clears way for Trump's plan to downsize federal workforce.  Follow live updates.  —  A federal judge in Boston cleared the way for President Trump's plan to downsize the federal workforce with a deferred resignation program.  —  US District Judge George O'Toole Jr. found a group … ",
    "url": "https://www.bostonglobe.com/2025/02/12/nation/trump-presidency-live-updates/"
  },
  {
    "text": "BREAKING: NIH admits funding freeze is illegal, will resume issuing grants  —  On Monday afternoon, Popular Information broke the news that the National Institutes of Health (NIH) had frozen virtually all grant funding in violation of two federal court orders.",
    "url": "https://popular.info/p/breaking-nih-admits-funding-freeze"
  },
  {
    "text": "Elon Musk's DOGE takes aim at agency that had plans of regulating X  —  Elon Musk made a big leap late last month toward his long-shot goal of turning X into an “everything app,” a service that could encompass a broad range of services, including the ability to transfer money, similar to Venmo or PayPal.",
    "url": "https://www.npr.org/2025/02/12/nx-s1-5293382/x-elon-musk-doge-cfpb"
  },
  {
    "text": "Family of Venezuelan Migrant Sent to Guantánamo: ‘My Brother Is Not a Criminal.’ … Luis Alberto Castillo, a father of one from Venezuela, entered the United States on Jan. 19, one day before Donald Trump became president for a second term — swept into office on a promise to treat undocumented migrants with a heavy hand.",
    "url": "https://www.nytimes.com/2025/02/11/world/americas/luis-castillo-venezuela-migrant-guantanamo-bay-trump.html?unlocked_article_code=1.wU4.eCDH.fKOVfFbzEKCQ&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Musk's X Agrees to Pay About $10 Million to Settle Trump Lawsuit  —  Musk's platform becomes second social-media company to settle with Trump after Jan. 6, 2021 riot triggered bans  —  WASHINGTON—Elon Musk's X has agreed to pay about $10 million to settle a lawsuit that Donald Trump brought … ",
    "url": "https://www.wsj.com/tech/musks-x-agrees-to-pay-about-10-million-to-settle-trump-lawsuit-a38348f8?st=r5xhAA&reflink=article_imessage_share"
  },
  {
    "text": "Why the health care industry is letting RFK Jr. cruise to confirmation  —  From drugmakers to doctors, few health care groups are asking senators to block Robert F. Kennedy Jr. from becoming HHS secretary.  —  Robert F. Kennedy Jr.'s expected Senate confirmation on Thursday to lead … ",
    "url": "https://www.politico.com/news/2025/02/12/rfk-jr-confirmation-health-care-00203851"
  },
  {
    "text": "Americans Are Actually in a Position to Make Elon Musk Feel Our Rage  —  The company is in a precarious position.  This is a case where buying choices can effectively communicate rage.  —  There are myriad reasons to loathe Elon Musk, the CEO of Tesla, who has become a top ally of Donald Trump.",
    "url": "https://slate.com/business/2025/02/elon-musk-tesla-stock-valuation-consumer-boycott.html"
  },
  {
    "text": "Eric Adams Discussed Possible Republican Primary Run With G.O.P. Leader  —  The mayor discussed options to run for re-election in the Republican contest as recently as Monday.  Asked for comment, he said he was running as a Democrat.  —  Mayor Eric Adams of New York City has quietly explored running … ",
    "url": "https://www.nytimes.com/2025/02/12/nyregion/eric-adams-republican-primary.html"
  },
  {
    "text": "House GOP budget plan targets deep SNAP cuts  —  The higher level of spending cuts in the newly released House Republican budget blueprint means some current food aid benefits for low-income Americans will likely be reduced, according to two GOP lawmakers.  House Republicans … ",
    "url": "https://www.politico.com/live-updates/2025/02/12/congress/house-gop-budget-targets-snap-cuts-00203872"
  },
  {
    "text": "Judge rules Trump's sweeping plan to persuade federal workers to resign can move forward  —  U.S. District Judge George A. O'Toole Jr. dissolved his restraining order blocking the “deferred resignations” program after finding the plaintiffs lacked legal standing.",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-rules-trumps-sweeping-plan-persuade-federal-workers-resign-can-m-rcna191947"
  },
  {
    "text": "The GSA Plans to Sell Hundreds of Its Federal Government Buildings  —  The General Services Administration, staffed at its upper levels by Elon Musk associates, plans to sell 500-plus buildings—some of which house government agencies and the offices of US senators.",
    "url": "https://www.wired.com/story/gsa-sell-government-buildings/"
  },
  {
    "text": "Pope Francis's Stunning Rebuke of JD Vance Exposes MAGA's Dark Soul  —  The other day, JD Vance sought to reconcile President Donald Trump's “America First” vision with the tenets of Christianity.  Vance argued for a “Christian concept” that orders our ethical obligations in a series of concentric circles … ",
    "url": "https://newrepublic.com/article/191427/pope-francis-jd-vance-maga-dark-soul"
  }
]