[
  {
    "text": "Trump is seeking to deport another academic who is legally in the country, lawsuit says  —  Badar Khan Suri, a fellow at Georgetown, says he is being punished because of the suspected views of his wife, a U.S. citizen with Palestinian heritage.  —  A Georgetown University researcher … ",
    "url": "https://www.politico.com/news/2025/03/19/trump-deportation-georgetown-graduate-student-00239754"
  },
  {
    "text": "Exclusive: Trump to sign order Thursday aimed at eliminating Education Department  —  Trump will direct his education secretary, Linda McMahon, to take ‘all necessary steps to facilitate the closure of the Department of Education.’  —  Joey Garrison Zachary SchermeleUSA TODAY",
    "url": "https://www.usatoday.com/story/news/education/2025/03/19/trump-eliminate-education-department-order/82235735007/?taid=67db3cffea562000016a0b1f"
  },
  {
    "text": "Trump Administration Live Updates: Trump to Sign Order Shuttering Education Department  —  Where Things Stand  — Education Department: President Trump plans to sign an executive order on Thursday instructing Education Secretary Linda McMahon to begin dismantling the agency, according to two White House officials.",
    "url": "https://www.nytimes.com/live/2025/03/19/us/trump-news"
  },
  {
    "text": "French scientist denied US entry after phone messages critical of Trump found  —  France's research minister said the scientist was traveling to Houston for a conference when his phone was searched  —  France's research minister said a French scientist was denied entry to the US this month … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/19/trump-musk-french-scientist-detained"
  },
  {
    "text": "Trump-appointed prosecutor's office drops assault case against Enrique Tarrio  —  Ryan J. Reilly and Ted Oberg  —  The U.S. Attorney's for the District of Columbia has dropped an assault case against Enrique Tarrio, the Proud Boys member who was serving 22 years in federal prison following … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/live-blog/trump-administration-russia-ukraine-putin-zelenskyy-doge-immigration-rcna196781/rcrd75235?canonicalCard=true"
  },
  {
    "text": "Social Security numbers and other private information unmasked in JFK files  —  The data belongs to more than 200 former congressional staffers and others with connections to decades-old investigations.  —  The Social Security numbers and other private information of more than 200 former … ",
    "url": "https://www.washingtonpost.com/investigations/2025/03/19/personal-information-jfk-files-social-security-numbers/"
  },
  {
    "text": "Musk Donates to G.O.P. Members of Congress Who Support Impeaching Judges  —  Amid a controversy over whether President Trump will abide by court rulings, Elon Musk gave the maximum to the campaigns of Republicans who back ousting judges who impede the administration.",
    "url": "https://www.nytimes.com/2025/03/19/us/politics/musk-donations-congress-judges.html?unlocked_article_code=1.5E4.VADz.hdASSaebxU33&smid=bs-share"
  },
  {
    "text": "Jury Orders Greenpeace to Pay Pipeline Company More Than $660 Million  —  The environmental group had said the lawsuit, over its role in a protest movement, could mean an end to its operations in the United States.  —  A North Dakota jury on Wednesday awarded damages totaling more than $660 million … ",
    "url": "https://www.nytimes.com/2025/03/19/climate/greenpeace-energy-transfer-dakota-access-verdict.html"
  },
  {
    "text": "Immigrant rights activist's arrest marks big shift in enforcement  —  The arrest of a longtime immigrant rights activist — who made national headlines when she took sanctuary in a Denver church during President Trump's first term — has rattled advocates and immigrants across the country.",
    "url": "https://www.axios.com/2025/03/19/immigrant-activist-arrest-jeanette-vizguerra-trump"
  },
  {
    "text": "Massive purge of Pentagon websites includes content on Holocaust remembrance, sexual assault and suicide prevention  —  Articles about the Holocaust, September 11, cancer awareness, sexual assault and suicide prevention are among the tens of thousands either removed or flagged for removal … ",
    "url": "https://www.cnn.com/2025/03/19/politics/pentagon-website-purge"
  },
  {
    "text": "Tesla (TSLA) accounting raises red flags as report shows $1.4 billion missing  —  Tesla's (TSLA) accounting practices are raising red flags as a new report from the Financial Times shows that $1.4 billion is missing.  —  Many Tesla shorts and detractors have questioned Tesla's accounting for years … ",
    "url": "https://electrek.co/2025/03/19/tesla-tsla-accounting-raises-red-flags-as-report-shows-1-4-billion-missing/"
  },
  {
    "text": "Menaced by Trump, Canada Prepares to Join E.U. Military Industry Buildup  —  Canada's draft deal to participate in Europe's defense industry will bring contracts to Canadian manufacturers and help lessen dependence on the United States.  —  Canada is in advanced talks with the European Union … ",
    "url": "https://www.nytimes.com/2025/03/19/world/canada/canada-eu-military-industry-trump.html?unlocked_article_code=1.5E4.SuMZ._0pgVzy-RXbn&smid=url-share"
  },
  {
    "text": "Germany updates US travel advice after citizens detained  —  Germany updated its travel advisory for the United States to emphasise that a visa or entry waiver does not guarantee entry for its citizens after several Germans were detained at the border recently, a foreign ministry spokesperson said.",
    "url": "https://www.reuters.com/world/europe/germany-updates-us-travel-advice-after-citizens-detained-2025-03-19/"
  },
  {
    "text": "Trump team makes plans for military to hold migrants at border  —  If enacted, miles of buffer zone would become a temporary military installation, giving U.S. troops their most direct role yet in the president's enforcement mission.  —  The Trump administration is evaluating plans … ",
    "url": "https://www.washingtonpost.com/national-security/2025/03/19/trump-border-military-buffer-zone/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyMzU2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzNzM5MTk5LCJpYXQiOjE3NDIzNTY4MDAsImp0aSI6ImFmYjlkYWMyLWVmMmEtNDRlYy1iYTdkLThkMDE2ZGUyMTBkMCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAzLzE5L3RydW1wLWJvcmRlci1taWxpdGFyeS1idWZmZXItem9uZS8ifQ.c981-mNyN5ClnuF8qdg2VLdOxgM7-bTz9Awn876aPas&itid=gfta"
  },
  {
    "text": "Trump Had ‘Aptitude for Music’ as a Child, He Told Kennedy Center Board  —  The president, who recently took over Washington's major performing arts center, reportedly said that he had not been encouraged to develop his musical talents.  —  During his first visit to the Kennedy Center since making himself … ",
    "url": "https://www.nytimes.com/2025/03/19/arts/music/trump-kennedy-center-music.html"
  },
  {
    "text": "Trump-Musk Scandal on Ukrainian Kids Stolen by Russia Just Got Darker  —  Update: CNN reports that the State Department is now confirming cancellation of the contract tracking abducted Ukrainian kids, claiming it's not in U.S. interests.  Also, a State Department spokesperson said the data … ",
    "url": "https://newrepublic.com/article/192924/trump-musk-scandal-ukrainian-kids-stolen-russia"
  },
  {
    "text": "Stephen Miller Has a Plan  —  During the first Trump administration, when Stephen Miller's immigration policy proposals hit obstacles in federal court, rumors would circulate about his plans to dust off arcane presidential powers.  Government lawyers were wary of overreach … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/03/stephen-miller-presidency/682097/"
  },
  {
    "text": "BREAKING: DOGE Strong-Armed USIP Security Contractors to Switch Sides … Each time we hear more about the unfolding situation with the takeover of the U.S. Institute of Peace, the story gets darker and involves greater abuses of power.  My colleague Kate Riga is, as I write … ",
    "url": "https://talkingpointsmemo.com/edblog/breaking-doge-strong-armed-usip-security-contractors-to-switch-sides"
  },
  {
    "text": "USDA halts millions of dollars worth of deliveries to food banks  —  The halt in deliveries comes after the Trump administration separately slashed $1 billion for schools and food banks to buy food from farms.  —  The Agriculture Department has halted millions of dollars worth of deliveries … ",
    "url": "https://www.politico.com/news/2025/03/19/usda-halts-deliveries-food-banks-trump-00239453"
  },
  {
    "text": "Justice department removes disability guidelines for US businesses  —  Multiple pages scrubbed from the Americans with Disabilities Act (ADA) website due to a Trump order  — Never miss global breaking news.  Download our free app to keep up with key stories in real time.",
    "url": "https://www.theguardian.com/us-news/2025/mar/19/justice-department-disability-business-guidelines"
  },
  {
    "text": "Columbia Is Nearing Agreement to Give Trump What He Wants  —  The school faces a deadline to yield to administration demands, with $400 million in federal funding at stake  —  Columbia University is getting close to yielding to President Trump's demands in negotiations to restore $400 million … ",
    "url": "https://www.wsj.com/us-news/education/columbia-is-nearing-agreement-to-give-trump-what-he-wants-14315bb3?st=Qdpxz1&reflink=mobilewebshare_permalink"
  },
  {
    "text": "A list of the Social Security offices across the US expected to close this year  —  Dozens of Social Security Administration offices across the country are slated to close this year due to actions taken by Elon Musk's Department of Government Efficiency as part of the Trump administration's … ",
    "url": "https://apnews.com/article/social-security-offices-closures-doge-trump-b2b1a5b2ba4fb968abc3379bf90715ff"
  },
  {
    "text": "Scoop: Schumer faces growing House Dem calls to step down  —  Senate Minority Leader Chuck Schumer (D-N.Y.) is facing more calls to step aside than have previously been reported, with the possibility of more soon to come, Axios has learned.  —  Why it matters: No senators have called for Schumer to step down.",
    "url": "https://www.axios.com/2025/03/19/chuck-schumer-house-democrat-calls-step-down"
  },
  {
    "text": "War-Torn Congo Has a Deal for Trump: Kick Out Rebels, Get Minerals  —  U.S. president's ally Erik Prince in separate talks to help embattled Congolese government  —  The leader of a war-torn African nation has put a deal on the table for President Trump: Help his country defeat … ",
    "url": "https://www.wsj.com/world/africa/war-torn-congo-has-a-deal-for-trump-kick-out-rebels-get-minerals-295acfb4?st=xZLwxS&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Facial Recognition Company Clearview Attempted to Buy Social Security Numbers and Mugshots for its Database  —  Controversial facial recognition company Clearview AI attempted to purchase hundreds of millions of arrest records including social security numbers, mugshots … ",
    "url": "https://www.404media.co/facial-recognition-company-clearview-attempted-to-buy-social-security-numbers-and-mugshots-for-its-database/"
  },
  {
    "text": "Hold My Snacks: Pirate's Booty Founder Attempts a Seaside Coup  —  A snack food magnate declared himself mayor of the Village of Sea Cliff, on Long Island.  The voters said otherwise.  —  The little village of Sea Cliff, on Long Island's north shore, re-elected its mayor on Tuesday.",
    "url": "https://www.nytimes.com/2025/03/19/nyregion/sea-cliff-mayor-pirates-booty-election.html?unlocked_article_code=1.5E4.uisL.NE7cPx-zip1q&smid=url-share"
  },
  {
    "text": "Murkowski says her colleagues are ‘afraid’ of Trump and Musk: 'I'm not going to compromise my own integrity'  —  “That's why you've got everybody just like, zip lip, not saying a word because they're afraid they're going to be taken down,” she said.  —  Alaska Sen. Lisa Murkowski … ",
    "url": "https://www.politico.com/news/2025/03/19/lisa-murkowski-musk-primary-026590"
  },
  {
    "text": "Exclusive: US suspends some efforts to counter Russian sabotage as Trump moves closer to Putin  —  Several U.S. national security agencies have halted work on a coordinated effort to counter Russian sabotage, disinformation and cyberattacks, easing pressure on Moscow as the Trump Administration pushes Russia to end its war in Ukraine.",
    "url": "https://www.reuters.com/world/us-suspends-some-efforts-counter-russian-sabotage-trump-moves-closer-putin-2025-03-19/"
  }
]