[
  {
    "text": "Donald Trump faces many signs of potential political trouble; here are a few of them  —  WASHINGTON - Most presidential candidates look for signs of trouble during campaigns - but none before Donald Trump saw the threats of criminal convictions and getting thrown off the ballot.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2023/12/24/donald-trump-faces-signs-of-political-trouble-here-are-just-a-few/71983708007/"
  },
  {
    "text": "Graham says Colorado's Trump ballot ruling is ‘chilling’  —  Sen. Lindsey Graham (R-S.C.) called Colorado's ruling disqualifying former President Trump from the state's ballot “chilling” and a “political decision” rather than a ruling based in law.  —  Asked on ABC News's “This Week” … ",
    "url": "https://thehill.com/homenews/senate/4375774-graham-says-colorados-trump-ballot-ruling-is-chilling/"
  },
  {
    "text": "House GOP traps itself in impeachment box  —  Republicans are barreling toward an impeachment vote, still short of a majority.  But if they skip one altogether, it might look like failure to the base.  —  Now that House Republicans have formalized the impeachment inquiry into President Joe Biden … ",
    "url": "https://www.politico.com/news/2023/12/24/house-gop-biden-impeachment-00132916"
  },
  {
    "text": "What Went Wrong for Ron DeSantis in 2023  —  The Florida governor entered the year flush with cash and momentum.  In the months since, internal chaos and Donald Trump's indictments have sapped even his most avid supporters.  —  Gov. Ron DeSantis of Florida woke up in Iowa with a familiar political headache.",
    "url": "https://www.nytimes.com/2023/12/24/us/politics/desantis.html"
  },
  {
    "text": "Deputy AG says GOP attacks on DOJ have contributed to an ‘unprecedented rise’ in threats  —  Former President Donald Trump has repeatedly disparaged Monaco and other Justice Department officials involved in the various legal cases against him.  —  Deputy Attorney General Lisa Monaco decried Republican claims … ",
    "url": "https://www.nbcnews.com/politics/justice-department/deputy-ag-says-gop-attacks-doj-contributed-unprecedented-rise-threats-rcna131073"
  },
  {
    "text": "Donald Trump can't dodge his NY fraud verdict by moving Trump Org or giving it to, say, Ivanka: experts  — A Manhattan judge has said he'll reach a verdict in the Trump civil-fraud trial by late January.  — He has already ordered the dissolution of all Trump properties licensed to do business in New York.",
    "url": "https://www.businessinsider.com/how-the-ny-fraud-verdict-could-kill-the-trump-organization-2023-12"
  },
  {
    "text": "Pope Francis Blasts Weapons Industry in Christmas Appeal for Global Peace  —  Pope Francis on Monday blasted the weapons industry and its “instruments of death” that fuel wars as he made a Christmas Day appeal for peace in the world and in particular between Israel and the Palestinians.",
    "url": "https://www.bloomberg.com/en/news/thp/2023-12-25/pope-francis-blasts-the-weapons-industry-as-he-makes-a-christmas-appeal-for-peace-in-the-world"
  },
  {
    "text": "‘We can reclaim control of our destiny,’ Al Gore says of climate change  —  The former vice president found hope in the possibility that humans have the tools to repair the planet.  —  Former Vice President Al Gore expressed optimism that humanity can still repair the damage to the environment that is causing global warming.",
    "url": "https://www.politico.com/news/2023/12/24/al-gore-climate-change-00133166"
  },
  {
    "text": "Martin O'Malley's confirmation as Social Security commissioner is a win for the American people  —  Last week, the Senate confirmed Martin O'Malley to be the next Commissioner of Social Security.  This is a major achievement: It marks the first time in over 25 years that the Senate has confirmed … ",
    "url": "https://thehill.com/opinion/congress-blog/4374644-martin-omalleys-confirmation-as-social-security-commissioner-is-a-win-for-the-american-people/"
  },
  {
    "text": "The elephant in the Giuliani defamation courtroom  —  A jury has ordered Rudy Giuliani to pay $148 million — covering compensatory and punitive damages, and emotional suffering — for defaming Ruby Freeman and Shaye Moss, two poll workers in Atlanta, Georgia, in 2020.  He quickly filed for bankruptcy.",
    "url": "https://thehill.com/opinion/judiciary/4374655-the-elephant-in-the-giuliani-defamation-courtroom/"
  },
  {
    "text": "Israel has waged one of this century's most destructive wars in Gaza  —  The damage in Gaza has outpaced other recent conflicts, evidence shows.  Israel has dropped some of the largest bombs commonly used today near hospitals.  —  The Israeli military campaign in the Gaza Strip has been unlike any other in the 21st century.",
    "url": "https://www.washingtonpost.com/investigations/interactive/2023/israel-war-destruction-gaza-record-pace/"
  },
  {
    "text": "Protecting endangered species used to be bipartisan — it needs to be again  —  Fifty years ago this month, the Endangered Species Act (ESA) came into force.  The Senate had unanimously passed the bill in July 1973, in a bipartisan show of support that's almost unthinkable today … ",
    "url": "https://thehill.com/opinion/congress-blog/4374664-protecting-endangered-species-used-to-be-bipartisan-it-needs-to-be-again/"
  },
  {
    "text": "Chad Adopts Constitution to Prepare for Return to Democracy  —  Chadians approved a new constitution that the Central African nation's military rulers say will pave the way for elections and a return to civilian rule.  —  Preliminary results show that 86% of votes were cast in favor … ",
    "url": "https://www.bloomberg.com/news/articles/2023-12-24/chad-adopts-constitution-to-prepare-for-return-to-democracy"
  },
  {
    "text": "Sen. Bill Hagerty says US is sending ‘mixed messages’ to Israel  —  Sen. Bill Hagerty (R-TN) believes the United States is sending “mixed messages” to Israel regarding their war against Hamas.  —  The Biden administration has largely stood by Israel following the Oct. 7 terrorist attacks … ",
    "url": "https://www.washingtonexaminer.com/policy/defense-national-security/us-sending-mixed-messages-israel-senate-republican-hamas"
  }
]