[
  {
    "text": "On political endorsement  —  A note from the publisher:  —  William Lewis is publisher and chief executive officer of The Washington Post.  —  The Washington Post will not be making an endorsement of a presidential candidate in this election.  Nor in any future presidential election.",
    "url": "https://www.washingtonpost.com/opinions/2024/10/25/washington-post-endorsement/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5ODI4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxMjE0Nzk5LCJpYXQiOjE3Mjk4Mjg4MDAsImp0aSI6ImMwYjA4OGU5LTM4YmQtNDg4NS05Y2ExLWY4ZTBjYzFlNjI4MyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzEwLzI1L3dhc2hpbmd0b24tcG9zdC1lbmRvcnNlbWVudC8ifQ.QytUuqJxYTcrn1R5eJrfxbNGtWzcRD0bPDrI-mjUMOo"
  },
  {
    "text": "Editor resigns, subscribers cancel as Washington Post non-endorsement prompts crisis at Bezos paper  —  The Scoop  —  The Washington Post's leadership recently sought meetings with the Democratic and Republican nominees for president, Kamala Harris and Donald Trump, people familiar with the requests said.",
    "url": "https://www.semafor.com/article/10/25/2024/editor-resign-subscribers-cancel-as-washington-post-non-endorsement-prompts-crisis-at-bezos-paper"
  },
  {
    "text": "LA Times Planned ‘Case Against Trump’ Series Alongside Kamala Harris Endorsement Before Owner Quashed It |  Exclusive  —  Patrick Soon-Shiong's interference with the paper's editorial freedom has sparked a crisis that includes canceled subscriptions and several high profile resignations",
    "url": "https://www.thewrap.com/la-times-case-against-trump-kamala-endorsement-canceled/"
  },
  {
    "text": "Jeff Bezos killed Washington Post endorsement of Kamala Harris, paper reports … The Washington Post said Friday that it will not endorse a candidate in the presidential election for the first time since 1976.  —  The newspaper also on Friday ran an article by two staff reporters saying … ",
    "url": "https://www.cnbc.com/2024/10/25/jeff-bezos-killed-washington-post-endorsement-of-kamala-harris-.html"
  },
  {
    "text": "Post columnists respond  —  The newspaper's refusal to endorse a presidential candidate is a mistake.  —  By 11 Post Opinions columnists  —  The Washington Post's decision not to make an endorsement in the presidential campaign is a terrible mistake.  It represents an abandonment … ",
    "url": "https://www.washingtonpost.com/opinions/2024/10/25/post-columnist-no-endorsement-2024-trump-harris/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5ODI4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxMjE0Nzk5LCJpYXQiOjE3Mjk4Mjg4MDAsImp0aSI6IjAyYjE0MzFjLWE3NDItNGQxNi1iMWUxLTUxYWI3NTBiYjdjOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzEwLzI1L3Bvc3QtY29sdW1uaXN0LW5vLWVuZG9yc2VtZW50LTIwMjQtdHJ1bXAtaGFycmlzLyJ9.KCWBtmo8IMrEBOJbSZfuDv38U6GLmgAaDDTifHmVGxw&itid=gfta"
  },
  {
    "text": "The Washington Post says it will not endorse a candidate for president  —  Publisher William Lewis explained the decision as a return to the newspaper's roots.  —  The Washington Post's editorial board announced Friday that it will not make an endorsement in this year's presidential contest … ",
    "url": "https://www.washingtonpost.com/style/media/2024/10/25/washington-post-endorsement-president/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5ODI4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxMjE0Nzk5LCJpYXQiOjE3Mjk4Mjg4MDAsImp0aSI6IjA0ODQ3ZmEwLTc2N2EtNDMwMi04ZTIzLTI5YzFmNmE2ZGFiYSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9zdHlsZS9tZWRpYS8yMDI0LzEwLzI1L3dhc2hpbmd0b24tcG9zdC1lbmRvcnNlbWVudC1wcmVzaWRlbnQvIn0.KpwHmXGXy0IaqEhSAi-TN0t93LrI0WnuWuywQv9k6DM&itid=gfta"
  },
  {
    "text": "The Guardrails Are Already Crumpling  —  Editor's note: The Bulwark is supported not by a billionaire, but by the members who gather here every day to read, talk to, and learn from each other.  We believe that this is how you save democracy.  With the little platoons of a community.",
    "url": "https://www.thebulwark.com/p/bezos-kills-washington-post-endorsement-guardrails-falling"
  },
  {
    "text": "Top Editors Eviscerate Jeff Bezos' Decision to Kill WaPo Endorsement  —  ‘MIGHTILY P—ED’  —  Major reporters and former editors speak out after Bezos squashed a Harris endorsement drafted by Post writers.  —  EXCLUSIVE  —  David Maraniss, an associate editor at The Washington Post … ",
    "url": "https://www.thedailybeast.com/top-editors-eviscerate-jeff-bezos-decision-to-kill-washington-post-kamala-harris-endorsement/"
  },
  {
    "text": "‘Washingon Post’ won't endorse in White House race for first time since 1980s  —  Even though the presidential race between former President Donald Trump and Vice President Kamala Harris remains neck and neck, The Washington Post editorial page has decided not to make a presidential endorsement … ",
    "url": "https://www.npr.org/2024/10/25/nx-s1-5165353/washingon-post-presidential-endorsement-trump-harris"
  },
  {
    "text": "Court rules ballots that arrive late shouldn't be counted despite postmarks  —  The 5th Circuit's ruling in a Mississippi case could have implications for other states with similar laws.  —  A federal appeals court Friday ruled invalid a Mississippi law that allows election officials … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/25/late-ballots-fifth-circuit-mississippi/"
  },
  {
    "text": "These Americans told our pollsters Trump is a fascist.  They'll still vote for him  —  Among registered voters who say Trump is a fascist, 8% support him anyway.  —  Republican presidential nominee, former U.S. President Donald Trump speaks at a Turning Point Action campaign rally, Oct. 24, 2024, in Las Vegas.",
    "url": "https://abcnews.go.com/Politics/americans-told-pollsters-trump-fascist-theyll-vote/story?id=115152532"
  },
  {
    "text": "Chinese Hackers Are Said to Have Targeted Phones Used by Trump and Vance  —  The Trump campaign was informed this week that hackers may have gained access to data from the phones through a breach of American telecommunications systems.  —  Chinese hackers who are believed to have burrowed deep … ",
    "url": "https://www.nytimes.com/2024/10/25/us/politics/trump-vance-hack.html?unlocked_article_code=1.U04.Qlq4.J0iSftVgPdec&smid=url-share"
  },
  {
    "text": "U.S. Department of Defense and Army Records Regarding Incident at Arlington National Cemetery … INQUIRIES PRESS@AMERICANOVERSIGHT.ORG  —  Records from the U.S. Department of Defense and Army in response to American Oversight's litigation seeking the expedited release of records regarding … ",
    "url": "https://americanoversight.org/featureddocument/u-s-department-of-defense-and-army-records-regarding-incident-at-arlington-national-cemetery/"
  },
  {
    "text": "Freedom Caucus leader endorses radical proposal for North Carolina to hand its electoral votes to Trump  —  Rep. Andy Harris said the damage caused by Hurricane Helene in pro-Trump counties would justify the extraordinary maneuver.  —  The chair of the conservative House Freedom Caucus … ",
    "url": "https://www.politico.com/news/2024/10/25/trump-freedom-caucus-north-carolina-electors-00185520"
  },
  {
    "text": "Russian actors made fake video depicting mail-in ballots for Trump being destroyed, FBI says  —  Russian actors were behind a widely circulated video falsely depicting mail-in ballots for Donald Trump being destroyed in Pennsylvania, U.S. officials confirmed on Friday.",
    "url": "https://apnews.com/article/misinformation-fact-check-trump-ballots-destroyed-pennsylvania-d75fdc56c71d77c7a48d8fca96b03288"
  },
  {
    "text": "“Extreme Danger”: Harris Earns a Stunning Endorsement Over Trump … More than 100 Arizona Palestinian, Arab, Muslim, and progressive Democrats and community leaders have signed a letter making the case for those reluctant to support Kamala Harris against Donald Trump.",
    "url": "https://newrepublic.com/post/187537/kamala-harris-donald-trump-stunning-endorsement"
  },
  {
    "text": "BCSO: Voter punches poll worker when reminded Texas law requires removal of MAGA hat at election site  —  The man, who had cast his ballot before the incident, was later arrested.  Sheriff Salazar implored the public to “tone down” the anger.  —  SAN ANTONIO — A 63-year-old Bexar County man … ",
    "url": "https://www.kens5.com/article/news/local/election-official-assaulted-at-early-voting-location-on-the-southwest-side-elections-officials-say/273-c95bac23-14f1-4427-8403-c403fd59a355"
  },
  {
    "text": "NASA chief calls for investigation into report that Musk and Putin have spoken regularly  —  NASA Administrator Bill Nelson on Friday called for an investigation into a Wall Street Journal report that SpaceX founder and Donald Trump ally Elon Musk and Russian President Vladimir Putin have been in “regular contact” since late 2022.",
    "url": "https://www.cnn.com/2024/10/25/politics/elon-musk-vladimir-putin/"
  },
  {
    "text": "Judge Declines to Fix DMV Error Disenfranchising 11,000 South Carolina Teens  —  A judge declined to order South Carolina's Department of Motor Vehicles (DMV) and State Election Commission (SEC) to register thousands of young voters whose registrations were mistakenly denied because they were not yet 18 … ",
    "url": "https://www.democracydocket.com/news-alerts/aclu-says-south-carolina-dmv-denied-voter-registration-for-thousands-of-17-year-olds/"
  },
  {
    "text": "The ‘Black Insurrectionist’ was actually white.  The deception did not stop there  —  “Black Insurrectionist,” the anonymous social media persona behind some of the most widely circulated conspiracy theories about the 2024 election, can be traced to a man from upstate New York.  He's also white.",
    "url": "https://apnews.com/article/black-trump-kamala-harris-tim-walz-aca31c66fe5bfef1e8827581e7919ece"
  },
  {
    "text": "Watch live: Harris expected to rally with Beyonce in Houston  —  Vice President Harris is campaigning Friday in Houston and may host a rumored special guest: Beyoncé.  —  The music sensation, who was raised in the city, is expected to attend the rally, according to sources familiar with the event.",
    "url": "https://thehill.com/homenews/4953868-harris-campaigning-houston-beyonce-watch/"
  }
]