[
  {
    "text": "Trump escalates gendered personal insults against Harris, defying GOP pressure  —  The Republican nominee also stoked Democrats' rift over Israel by baselessly claiming Harris passed over Gov. Josh Shapiro to be her running mate because he is Jewish.  —  WILKES-BARRE, Pa. … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/17/trump-harris-presidential/"
  },
  {
    "text": "Behind the Curtain: Trump's devil-in-Georgia problem … Yet Trump himself has made this make-or-break state dramatically more breakable by torching its popular Republican governor, Brian Kemp, bluntly and repeatedly.  — “He's a bad guy. … - “Little Brian, little Brian Kemp,” Trump continued.",
    "url": "https://www.axios.com/2024/08/18/trump-2024-election-georgia-brian-kemp"
  },
  {
    "text": "Harris holds slight national lead over Trump, Post-ABC-Ipsos poll finds  —  The result is a notable improvement for Democrats in a contest that a little more than a month ago showed Biden and Trump in a dead heat.  —  Vice President Kamala Harris holds a narrow lead over former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/18/harris-trump-post-abc-ipsos-poll/"
  },
  {
    "text": "Trump campaign attempts to reset with candidate who sometimes has his own plans  —  Kamala Harris's entry into the race has scrambled Donald Trump's plans and revived concerns about whether he can focus his attacks.  —  Donald Trump's top brass gathered reporters in West Palm Beach, Fla. … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/17/trump-campaign-harris/"
  },
  {
    "text": "Kamala Harris heads to DNC in Chicago with momentum and a big opportunity  —  WASHINGTON — Riding a wave of momentum since announcing her candidacy, Vice President Kamala Harris heads to Chicago this week for the Democratic National Convention with an opportunity to reintroduce herself … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/18/kamala-harris-dnc-opportunity/74796684007/"
  },
  {
    "text": "Trump tries to undermine Harris' legitimacy as a candidate  —  “Why is she going to the convention?  Because it's a rigged convention, obviously,” he said.  —  For former President Donald Trump, the 2024 race is a contest between him and Vice President Kamala Harris.  And President Joe Biden.",
    "url": "https://www.politico.com/news/2024/08/17/trump-rally-pennsylvania-kamala-harris-rigged-00174502"
  },
  {
    "text": "Democrats still might invoke the 25th Amendment to make Harris president  —  Politics aside, it's understandable that some now view President Joe Biden as a “broken man,” walking alone in a deep valley of depression, confusion and anger.  One day he is declaring that he is the Democratic nominee … ",
    "url": "https://thehill.com/opinion/campaign/4831471-democrats-might-invoke-the-25th-amendment-to-make-harris-president/"
  },
  {
    "text": "Harris and Walz launch their 1st bus tour through western Pennsylvania  —  Both Harris and Trump are holding dueling events in the critical swing state.  —  Vice President and Democratic presidential candidate Kamala Harris and her running mate Minnesota Governor Tim Walz greet the crowd during … ",
    "url": "https://abcnews.go.com/Politics/harris-walz-launch-1st-bus-tour-western-pennsylvania/story?id=112905290"
  },
  {
    "text": "Inciting rioters in Britain was a test run for Elon Musk.  Just see what he plans for America  —  The presidential election is three months away.  What if the billionaire contests the result?  What if he decides democracy is over-rated?  —  Just over four years ago … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/aug/18/inciting-rioters-in-britain-was-a-test-run-for-elon-musk-just-see-what-he-plans-for-america"
  },
  {
    "text": "You Should Know  —  I flagged this on social media.  But I wanted to make sure you knew.  Trump just announced a “crime and safety” rally for next Tuesday in Howell, Michigan, a town that has been heavily associated with the KKK for decades.  Indeed, just late last month White Supremacists marched … ",
    "url": "https://talkingpointsmemo.com/edblog/you-should-know"
  },
  {
    "text": "Willie Brown to Donald Trump: Mention My Name Again and Get Sued  —  The former president has falsely claimed that he nearly died in a helicopter ride with Mr. Brown, and that Mr. Brown said “terrible things” about Kamala Harris.  —  Willie Brown, the former mayor of San Francisco … ",
    "url": "https://www.nytimes.com/2024/08/17/us/politics/willie-brown-donald-trump-sue-lawsuit.html"
  },
  {
    "text": "‘Things I Trust More Than Donald Trump’ List Goes Viral: ‘Dinner with Jeffrey Dahmer’  —  ‘A CASEY ANTHONY DAYCARE’  —  When “The View” co-host Anna Navarro posted the list to her Instagram account, numerous social media users added their own comments.  —  A viral list called … ",
    "url": "https://www.thedailybeast.com/the-view-co-host-anna-navarro-posts-things-i-trust-more-than-donald-trump-list"
  },
  {
    "text": "Mark Robinson, Who Often Calls Abortion Murder: ‘We Had an Abortion’  —  The North Carolina Republican gubernatorial candidate previously said mass shootings were karma for the “murder of infants” … He compared supporters of reproductive rights to people who fought to preserve slavery.",
    "url": "https://www.rollingstone.com/politics/politics-features/mark-robinson-abortion-murder-north-carolina-1235082406/"
  },
  {
    "text": "Election Countdown, 80 Days to Go: Media Failure Reaches a Turning Point.  —  The tone of American politics may finally be brightening.  Maybe the mainstream press will recognize that a time for change has come for it as well.  —  ∙ Paid  —  This post is about a recent convergence of articles … ",
    "url": "https://fallows.substack.com/p/election-countdown-80-days-to-go"
  },
  {
    "text": "Ohio lawmaker: Vance ‘not good for Ohio’ and ‘not good for America’  —  Rep. Joyce Beatty (D-Ohio) went after her fellow Ohioan and current Republican vice presidential nominee, Sen. JD Vance, saying he “is not good for Ohio” in an interview Saturday.  —  “JD Vance is not good for Ohio … ",
    "url": "https://thehill.com/homenews/campaign/4832987-ohio-lawmaker-vance-not-good-for-ohio-and-not-good-for-america/"
  },
  {
    "text": "VP Kamala Harris' stepdaughter Ella Emhoff pushes ketamine, ‘shorter work days’ in ‘pain management’ rant  —  Vice President Kamala Harris' stepdaughter, Ella Emhoff, revealed this week that she grew up with a spinal condition that caused a “hunchback” - and suggested using the controversial drug ketamine … ",
    "url": "https://nypost.com/2024/08/17/us-news/vp-kamala-harris-stepdaughter-ella-emhoff-pushes-ketamine-shorter-work-days-in-pain-management-rant/"
  }
]