[
  {
    "text": "How Trump's rhetoric compares to Hitler's  —  Donald Trump has long toyed with the language of famous autocrats, authoritarians and fascists.  Think: “enemy of the people,” “retribution” and the frequent, years-long allusions to political violence.  —  But even by his standards … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/13/how-trumps-rhetoric-compares-hitlers/"
  },
  {
    "text": "Did ‘vermin’ mark a turning point in Trump coverage?  —  Saturday night was a low point in the elite media's coverage of Donald Trump.  —  The New York Times put a light-hearted headline on a news article about Trump's Veterans Day address in New Hampshire, in which he vowed to “root out” … ",
    "url": "https://presswatchers.org/2023/11/did-vermin-mark-a-turning-point-in-trump-coverage/"
  },
  {
    "text": "‘The boss is not going to leave’: Proffer videos show ex-Trump lawyers telling Georgia prosecutors about efforts to overturn 2020 election  —  ABC News obtained video from interviews held with Jenna Ellis and Sidney Powell.  —  Jenna Ellis reads a statement after Ellis pleading guilty … ",
    "url": "https://abcnews.go.com/US/boss-leave-proffer-videos-show-trump-lawyers-telling/story?id=104831939"
  },
  {
    "text": "Here's How Biden Can Turn It Around  —  Top Democrats agree that the president needs more aggressiveness, more help from his friends and a few more friends.  Liz Cheney, Rahm Emanuel and Mitt Romney can help.  —  Just under one year before the presidential election, Democrats should be concerned … ",
    "url": "https://www.politico.com/news/magazine/2023/11/13/biden-2024-reelection-challenges-strategy-00126776"
  },
  {
    "text": "Maryanne Trump Barry, Donald Trump's Older Sister, Dies at 86  —  A retired federal judge in New Jersey, she supported her brother but, as secret audio recordings revealed in 2019, she could also be scathingly critical of him.  —  Maryanne Trump Barry, a former federal judge who was an older sister … ",
    "url": "https://www.nytimes.com/2023/11/13/us/politics/maryanne-trump-barry-dead.html"
  },
  {
    "text": "Maryanne Trump Barry, older sister of Donald Trump, has died at 86: Sources  —  Barry was a senior judge on the U.S. Court of Appeals until 2019.  —  Donald Trump, Maryanne Trump, and Robert Trump during Opening of Donald Trump's Taj Mahal Casino in April 5, 1990 at Taj Mahal Hotel and Casino in Atlantic City, N.J.",
    "url": "https://abcnews.go.com/Politics/maryanne-trump-barry-older-sister-donald-trump-died/story?id=104846289"
  },
  {
    "text": "Behind the Curtain: Trump allies pre-screen loyalists for unprecedented power grab … - His top obsession will be the Justice Department, the FBI and the intelligence community — all of which he thinks conspired to investigate him, thwart him, screw him.",
    "url": "https://www.axios.com/2023/11/13/trump-loyalists-2024-presidential-election"
  },
  {
    "text": "The Supreme Court says it is adopting a code of ethics for the first time  —  The Supreme Court is adopting its first code of ethics, in the face of sustained criticism over undisclosed trips and gifts from wealthy benefactors to some justices.  The policy was issued by the court Monday.",
    "url": "https://apnews.com/article/supreme-court-ethics-code-conflicts-clarence-thomas-64d393ceb6f05402d762dca06f0f4187"
  },
  {
    "text": "Jeffries suggests Democrats could support GOP stopgap funding bill  —  House Minority Leader Hakeem Jeffries (D-N.Y.) suggested Monday that Democrats may support the Republicans' short-term funding bill to prevent a government shutdown — a sharp change of tone that could pave the way for easy passage … ",
    "url": "https://thehill.com/homenews/house/4307730-jeffries-says-democrats-might-support-gop-stopgap-funding-bill/"
  },
  {
    "text": "Secret Service agents protecting Biden's granddaughter open fire when 3 people try to break into SUV  —  Secret Service agents protecting President Joe Biden's granddaughter opened fire after three people tried to break into an unmarked Secret Service vehicle in the nation's capital, a law enforcement official told The Associated Press.",
    "url": "https://apnews.com/article/naomi-biden-secret-service-shooting-washington-georgetown-997126378e864c5acd0c9a1c6618c4e2"
  },
  {
    "text": "MAGA-dominated state Republican parties plagued by infighting, money woes  —  National Republicans fear the cash crunch could hamper field operations in key swing states come 2024  —  In Arizona, the state GOP chairman has been begging the Republican National Committee for a financial bailout.",
    "url": "https://www.washingtonpost.com/politics/2023/11/13/republican-state-parties-struggles-maga/"
  },
  {
    "text": "Democrats flipped this Pennsylvania county for first time in 100 years  —  Democrats gained control of one Pennsylvania county's Board of Commissioners for the first time in 100 years following the concession of the incumbent Republican commissioner on Monday.",
    "url": "https://thehill.com/homenews/state-watch/4307546-democrats-flipped-this-pennsylvania-county-for-first-time-in-100-years/"
  },
  {
    "text": "South Carolina Sen. Tim Scott abruptly ends 2024 presidential bid, shocking even his campaign staff  —  Republican presidential candidate Tim Scott abruptly announced late Sunday that he was dropping out of the 2024 race, a development that surprised his donors and stunned his campaign staff … ",
    "url": "https://apnews.com/article/tim-scott-drops-out-2024-race-b9cc8fbeba57a123789d8d0484164e38"
  },
  {
    "text": "'I'm more worried today than I was on January 6': top conservative's warning to America  —  Retired judge Michael Luttig is battling to stop a Trump victory - which he says would be 'catastrophic for America's democracy'  —  Michael Luttig knows the eye of the storm.",
    "url": "https://www.theguardian.com/us-news/2023/nov/13/january-6-michael-luttig-trump-warning"
  },
  {
    "text": "EXCLUSIVE - First photos reveal the COCAINE found in the White House: Images of the baggy in cubby hole that sparked White House investigation - and the culprit has still not been found  — DailyMail.com uncovered photos through a Freedom of Information Act request",
    "url": "https://www.dailymail.co.uk/news/article-12744675/First-photos-reveal-COCAINE-White-House-Images.html"
  },
  {
    "text": "Pro-Hitler and Holocaust denier account: X has paid me $3,000 in ad revenue sharing  —  Musk and Yaccarino's X has been placing ads for BetMGM, DraftKings, and FanDuel on the pro-Hitler account  —  There's more bad news for brands that advertise on X (formerly Twitter): They're helping financially reward pro-Adolf Hitler propaganda.",
    "url": "https://www.mediamatters.org/twitter/pro-hitler-and-holocaust-denier-account-x-has-paid-me-3000-ad-revenue-sharing"
  },
  {
    "text": "Ex-Fox News Reporter Claims Network Fired Him for Calling Out Jan. 6 Lies  —  Donner, who spent 12 years at Fox News, is now suing the network under D.C.'s human-rights statutes, alleging wrongful termination.  —  Jason Donner, a former reporter for Fox News, is suing the right-wing network … ",
    "url": "https://www.thedailybeast.com/ex-fox-news-reporter-jason-donner-claims-network-fired-him-for-calling-out-jan-6-lies"
  }
]