[
  {
    "text": "How Trump was talked into — and out of — a run for speaker  —  A behind-the-scenes campaign coaxed the former president out of a quixotic campaign.  —  Just hours after Kevin McCarthy was deposed as House speaker, the “draft Trump” movement began.  —  “I called him and I said, 'Sir … ",
    "url": "https://www.politico.com/news/2023/10/06/trump-jim-jordan-house-speaker-endorsements-00120320"
  },
  {
    "text": "How a Texas Congressman ‘Totally F—d’ Trump's House Speaker Race Strategy (Exclusive)  —  According to one adviser, the former president is ‘pissed’ at Rep. Troy Nehls  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing an external link … ",
    "url": "https://themessenger.com/politics/donald-trump-house-speaker-race-troy-nehls"
  },
  {
    "text": "Trump loses bid to stay NY fraud trial, but gets delay of business certificate cancellations  — A New York appeals court declined to stay the civil business fraud trial against Donald Trump.  — But the court did halt a judge's order that cancelled the business certificates of Trump's companies.",
    "url": "https://www.cnbc.com/2023/10/06/trump-loses-bid-to-stay-ny-fraud-trial-but-gets-delay-of-business-certificate-cancellations.html"
  },
  {
    "text": "Inside Trump's earlier secret bid for House speaker as McCarthy nomination drama unfolded  —  From ABC News Chief Washington Correspondent Jonathan Karl's upcoming book.  —  Former U.S. President Donald Trump arrives to deliver remarks at the South Carolina State House, Jan. 28, 2023 in Columbia, SC.",
    "url": "https://abcnews.go.com/Politics/inside-trumps-earlier-secret-bid-house-speaker-mccarthy/story?id=103779066"
  },
  {
    "text": "New York appeals court halts the process of breaking up Trump's businesses but rejects halting the trial  —  A New York appeals court judge on Friday rejected Donald Trump's attempt to stop the ongoing $250 million civil fraud trial, but temporarily halted the process of breaking up his businesses.",
    "url": "https://www.cnn.com/2023/10/06/politics/donald-trump-judge-engoron/"
  },
  {
    "text": "Donald Trump's lawyers seek to halt civil fraud trial and block ruling disrupting real estate empire  —  Former President Donald Trump's civil fraud trial will roll ahead next week after he lost a bid Friday to postpone it.  Trump wanted to halt the trial while he fights a pretrial ruling … ",
    "url": "https://apnews.com/article/donald-trump-letitia-james-fraud-new-york-77f3691ad7fa73ea008f058ae6f772d6"
  },
  {
    "text": "Kevin McCarthy considers resigning from the House before the end of his term  —  The deposed former speaker has made clear he plans to stay at least through the speakership election before ending his House career, two people familiar with the matter tell POLITICO.",
    "url": "https://www.politico.com/news/2023/10/06/kevin-mccarthy-considers-resigning-congress-00120381"
  },
  {
    "text": "Is the speaker pro tempore acting up?  —  Presented by With assists from POLITICO's Congress team  —  PARSING PATRICK'S POWERS  —  The word “unprecedented” often gets bandied about in politics for things that are actually just uncommon.  What's happening now in the House, however, is truly unprecedented.",
    "url": "https://www.politico.com/newsletters/huddle/2023/10/05/is-the-speaker-pro-tempore-acting-up-00120248"
  },
  {
    "text": "America needs to talk about the right's ‘Red Caesar’ plan for U.S. dictatorship  —  The incredible scenes this week on Capitol Hill — leaving the U.S. House without a speaker and promising an autumn of sheer chaos in Congress — marked a rapid escalation of the downward spiral of American democracy.",
    "url": "https://www.inquirer.com/opinion/red-caesar-right-american-dictatorship-20231005.html"
  },
  {
    "text": "A bipartisan coalition is the way forward for the House  —  Hakeem Jeffries (N.Y.) is the Democratic leader of the House of Representatives.  —  In recent days, Democrats have tried to show our colleagues in the Republican majority a way out of the dysfunction and rancor they have allowed to engulf the House.",
    "url": "https://www.washingtonpost.com/opinions/2023/10/06/hakeem-jeffries-bipartisan-coalition-house-gop/"
  },
  {
    "text": "Iowa police dispute Ramaswamy campaign's claim that protesters rammed their car  —  “Our investigation has revealed no evidence to substantiate” the claim that protesters hit Ramaswamy's car on purpose and fled, police said.  —  Republican presidential candidate Vivek Ramaswamy's campaign claimed Thursday … ",
    "url": "https://www.politico.com/news/2023/10/06/vivek-ramaswamy-iowa-car-00120318"
  },
  {
    "text": "Michael Benz, a rising voice for conservative criticism of online censorship, appears to have a secret history as an alt-right persona  —  Frame Game, the pseudonym of an alt-right internet personality, hid his face while pushing racist conspiracy theories.  Inadvertent slips revealed details about his identity.",
    "url": "https://www.nbcnews.com/tech/internet/michael-benz-rising-voice-conservative-criticism-online-censorship-rcna119213"
  },
  {
    "text": "New York v. Trump on Day Five: Company Exec Testifies About Mar-a-Lago and Eric Trump's Golf Club Directive to ‘Leave Value as Is’  —  The former controller of the Trump Organization revealed over-valuations of key real estate properties including the so-called ‘winter White House’",
    "url": "https://themessenger.com/politics/eric-trump-trial-new-york-day-five-maralago-golf"
  },
  {
    "text": "Former Soldier Indicted for Attempting to Pass National Defense Information to People's Republic of China  —  For Immediate Release  —  Defendant Arrested Upon Arrival in San Francisco on Flight from Hong Kong  —  A former U.S. Army Sergeant whose last duty post was Joint Base Lewis-McChord … ",
    "url": "https://www.justice.gov/opa/pr/former-soldier-indicted-attempting-pass-national-defense-information-peoples-republic-china"
  },
  {
    "text": "During an online fundraiser, Matt Gaetz denounced the Biden impeachment effort as unserious  —  As the House tries to replace Kevin McCarthy, the future of the impeachment inquiry could become a bargaining chip in the wrangling to win the speakership.  —  WASHINGTON — Days before Rep. Matt Gaetz led … ",
    "url": "https://www.nbcnews.com/politics/congress/gaetz-biden-impeachment-rosendale-rcna119131"
  },
  {
    "text": "The final 11 seconds of a fatal Tesla Autopilot crash  —  A reconstruction of the wreck shows how human error and emerging technology can collide with deadly results  —  The sun had yet to rise in Delray Beach, Fla., when Jeremy Banner flicked on Autopilot.",
    "url": "https://www.washingtonpost.com/technology/interactive/2023/tesla-autopilot-crash-analysis/"
  },
  {
    "text": "Massive Changes Could Be Coming From the Vatican.  Conservative US Catholics Are Mad as Hell.  —  This week, hundreds of delegates from around the world began a monthlong meeting as part of Pope Francis' “Synod on Synodality”—a gathering to discuss the future of the Catholic Church.",
    "url": "https://www.motherjones.com/politics/2023/10/catholic-church-vatican-pope-francis-raymond-burke-same-sex-marriage-women-priests/"
  },
  {
    "text": "We've Finally Solved The Mystery Of George Santos' Mysterious Fortune  —  The world knows a lot about Rep. George Santos (R-NY).  His backstory is full of lies and his campaign finance reports were studded with extraordinary irregularities.  However, amid a cascade of revelations … ",
    "url": "https://talkingpointsmemo.com/news/weve-finally-solved-the-mystery-of-george-santos-mysterious-fortune"
  },
  {
    "text": "Moms for Liberty Is Taking Over Banned Books Week  —  It's the American Library Association's annual Banned Books Week, a tradition that started in 1982.  This year, the theme is “Let Freedom Read!” in honor of record-breaking efforts to censor books now sweeping the nation's libraries and schools.",
    "url": "https://www.motherjones.com/politics/2023/10/moms-for-liberty-is-taking-over-banned-books-week/"
  },
  {
    "text": "Biden Blames ‘Negative’ Media for Americans' Poor View of the Economy  —  ‘I MEAN THIS SINCERELY’  —  Following another strong jobs report that far exceeded expectations, President Joe Biden was asked on Friday why the majority of Americans do not feel positive about the economy, prompting the president to blame media coverage.",
    "url": "https://www.thedailybeast.com/joe-biden-blames-negative-media-for-americans-poor-view-of-the-economy"
  },
  {
    "text": "Time to go big on Ukraine aid  —  Russian President Vladimir Putin caught a lucky break this week.  Just when he was planning to use his spy agencies to weaken U.S. support for Ukraine, far-right U.S. lawmakers advanced that mission on their own by derailing the path to passing supplemental aid to Ukraine.",
    "url": "https://thehill.com/opinion/congress-blog/4242670-time-to-go-big-on-ukraine-aid/"
  },
  {
    "text": "Pharmacies begin dispensing abortion pills  —  A handful of pharmacies are offering the pills 10 months after the Biden administration allowed them to do so.  —  A handful of independent pharmacies across the country have quietly begun dispensing the abortion pill mifepristone under … ",
    "url": "https://www.politico.com/news/2023/10/06/pharmacies-begin-dispensing-abortion-pills-00120397"
  },
  {
    "text": "N.J. Attorney General Opens Inquiry Into Nadine Menendez's Fatal Crash  —  The scrutiny could create fresh legal and political peril for Senator Robert Menendez, a Democrat, who has been charged with accepting bribes.  —  The New Jersey attorney general's office seized records on Thursday … ",
    "url": "https://www.nytimes.com/2023/10/06/nyregion/nadine-menendez-investigation-koop.html"
  },
  {
    "text": "Payrolls soared by 336,000 in September, defying expectations for a hiring slowdown  — Nonfarm payrolls increased by 336,000 for the month, better than the Dow Jones consensus estimate for 170,000.  — Average hourly earnings rose 0.2% for the month and 4.2% from a year ago, compared to respective estimates for 0.3% and 4.3%.",
    "url": "https://www.cnbc.com/2023/10/06/jobs-report-september-2023.html"
  },
  {
    "text": "Running Spoiler Campaigns Does Not Protect ‘Democracy’ … Most Americans who oppose Donald Trump agree the threat to democracy is the major issue of the 2024 election.  But what, precisely, constitutes the threat?  To most Democrats, the danger is that the election will install into power … ",
    "url": "https://nymag.com/intelligencer/2023/10/running-spoiler-campaigns-does-not-protect-democracy.html"
  }
]