[
  {
    "text": "SCOOP: Trump crafts plan to cut spending without Congress after shutdown is averted  —  Trump and his allies believe the Impoundment Control Act is unconstitutional  —  The White House has already started mapping out how to make good on its promise to slash federal spending in preparation … ",
    "url": "https://www.foxnews.com/politics/scoop-trump-crafts-plan-cut-spending-without-congress-after-shutdown-averted"
  },
  {
    "text": "My Vote on the GOP Spending Bill  —  I'm a hard NO on the Republican spending bill.  On cloture.  On all of it.  When a wannabe dictator is trying to seize power, it must not be given to him.  Not without a fight.  —  Sen. Adam Schiff  —  Transcript  —  Tomorrow, the U.S. Senate … ",
    "url": "https://schiffnotes.substack.com/p/my-vote-on-the-gop-spending-bill"
  },
  {
    "text": "Trump and Musk Would Love a Shutdown.  We Must Not Give Them One.  —  Over the past two months, the United States has confronted a bitter truth: The federal government has been taken over by a nihilist.  —  President Trump has taken a blowtorch to our country and wielded chaos like a weapon.",
    "url": "https://www.nytimes.com/2025/03/13/opinion/trump-musk-shutdown-senate.html?unlocked_article_code=1.304.vyIR.3Ib7Aj9iPg_I&smid=url-share"
  },
  {
    "text": "House Dems go into “complete meltdown” as Schumer folds  —  House Democrats erupted into apoplexy Thursday night after Senate Minority Leader Chuck Schumer (D-N.Y.) said he would support Republicans' stopgap government funding measure.  —  Why it matters: House Democrats feel like they “walked the plank,” in the words of one member.",
    "url": "https://www.axios.com/2025/03/14/house-democrats-angry-chuck-schumer-shutdown"
  },
  {
    "text": "Ocasio-Cortez mobilizes Democrats against Schumer plan as colleagues privately urge her to consider primary challenge  —  New York Rep. Alexandria Ocasio-Cortez said Thursday that she plans to mobilize her massive base of followers to oppose what she described as an “acquiesce” … ",
    "url": "https://www.cnn.com/2025/03/13/politics/ocasio-cortez-schumer-democratic-shutdown-plan/"
  },
  {
    "text": "Schumer Will Clear the Way for G.O.P. Spending Bill, Breaking With His Party  —  Many Democrats had agitated for the party to hang together and block the measure in defiance of President Trump, but the leader said doing so would prompt a shutdown that would only empower Mr. Trump.",
    "url": "https://www.nytimes.com/2025/03/13/us/government-shutdown-senate-democrats.html"
  },
  {
    "text": "Schumer backs away from shutdown, says he'll vote to advance GOP bill  —  Senate Minority Leader Chuck Schumer privately told fellow Democrats during a closed-door lunch Thursday that he would help advance a House GOP funding bill — a strong indication that Senate Democrats will ultimately … ",
    "url": "https://www.politico.com/live-updates/2025/03/13/congress/chuck-schumer-shutdown-vote-00230000"
  },
  {
    "text": "Senate Democrats signal plans to advance GOP bill to avoid a government shutdown  —  Senate Minority Leader Chuck Schumer, D-NY, says he will vote to keep the government open, signaling a path for Democrats to vote with Republicans to overcome a filibuster in the Senate and pass a six-month spending bill ahead of the Friday deadline.",
    "url": "https://www.npr.org/2025/03/13/g-s1-53495/senate-democrats-funding-bill-government-shutdown"
  },
  {
    "text": "Thousands of fired federal workers must be rehired immediately, judge rules  —  U.S. District Judge William Alsup described the mass firings as a “sham” strategy by the government's central human resources office.  —  A federal judge on Thursday ordered federal agencies to rehire tens … ",
    "url": "https://www.politico.com/news/2025/03/13/fired-federal-probationary-employees-court-ruling-00228721"
  },
  {
    "text": "Inside Elon Musk's ‘Digital Coup’  —  Musk's loyalists at DOGE have infiltrated dozens of federal agencies, pushed out tens of thousands of workers, and siphoned millions of people's most sensitive data.  The next step: Unleash the AI.  —  As America's most decorated civil servants sipped cocktails … ",
    "url": "https://www.wired.com/story/elon-musk-digital-coup-doge-data-ai/"
  },
  {
    "text": "These Are the 10 DOGE Operatives Inside the Social Security Administration  —  The team working at the Social Security Administration appears to be among the largest DOGE units deployed to any government agency.  —  At least 10 people associated with Elon Musk's so-called Department of Government Efficiency … ",
    "url": "https://www.wired.com/story/doge-operatives-access-social-security-administration/"
  },
  {
    "text": "Democratic Rep. Raúl M. Grijalva Of Arizona Dies From Complications From Cancer Treatment  —  Rep. Raúl Grijalva, a 12-term Democrat from Arizona, has died after complications from cancer treatment, his office says.  —  Democratic U.S. Rep. Raúl M. Grijalva of Arizona … ",
    "url": "https://www.huffpost.com/entry/raul-grijalva-democrat-dead-arizona-cancer_n_67d34c3fe4b0e72dd7ff058a"
  },
  {
    "text": "Mahmoud Khalil Isn't the Only Green-Card Holder Targeted for Arrest  —  As the details of Mahmoud Khalil's arrest by U.S. immigration agents first emerged this week, attorneys I spoke with were so astonished that they wondered if the government had made a mistake.",
    "url": "https://www.theatlantic.com/politics/archive/2025/03/trump-deportation-green-card-holder-mahmoud-khalil/682037/?gift=UvnwM_ucHtaApOJJQ10uJpxYC7KLvPfoJU_b00RaJMY&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Stocks Tumble Into Correction as Investors Sour on Trump  —  The S&P 500 is now more than 10% below its last record high — a line in the sand for investors worried about a sell-off gathering steam.  —  The world's most widely followed stock-market benchmark slid into a correction on Thursday … ",
    "url": "https://www.nytimes.com/2025/03/13/business/sp-500-stocks-market-correction.html"
  },
  {
    "text": "Trump's Ukraine Peace Strategy Put to Test After Putin Balks at Cease-Fire  —  If Moscow rejects a deal, U.S. leader will have to decide whether to impose new sanctions  —  WASHINGTON—President Trump finds himself a “yes” away from brokering a cease-fire between Russia and Ukraine.",
    "url": "https://www.wsj.com/politics/national-security/trumps-ukraine-peace-strategy-put-to-test-after-putin-balks-at-cease-fire-00c8460b"
  },
  {
    "text": "Trump asks Supreme Court to allow birthright citizenship ban in some states  —  Lower court judges have blocked Trump's initiative nationwide, saying it violates the citizenship clause of the 14th Amendment.  —  just now  —  The Trump administration asked the Supreme Court on Thursday … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/13/supreme-court-birthright-citizenship-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxODM4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzMjIwNzk5LCJpYXQiOjE3NDE4Mzg0MDAsImp0aSI6ImQ4MTYwMDA2LTUyMmItNGFmMy1iMmJjLTJlMzhmNWQ3ZTBjNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzEzL3N1cHJlbWUtY291cnQtYmlydGhyaWdodC1jaXRpemVuc2hpcC10cnVtcC8ifQ.uzYLP57x27RMaHDU28xZv4RQVYUX0yS3cf3uQZCr29s&itid=gfta"
  },
  {
    "text": "Dr. Mehmet Oz may have underpaid Medicare and Social Security taxes, Senate Democratic memo finds  —  The report comes as Oz, Trump's nominee to lead the Center for Medicare and Medicaid Services, is set to face a Senate confirmation hearing Friday.  —  Dr. Mehmet Oz, President Donald Trump's nominee … ",
    "url": "https://www.nbcnews.com/politics/congress/dr-mehmet-oz-medicare-social-security-taxes-democrats-memo-rcna196237"
  },
  {
    "text": "Musk Shares Claim That Stalin and Hitler Didn't Murder Millions: ‘Public Sector Employees Did’  —  Musk's sharing of the inflammatory social media post comes amid his regular posting of memes and jokes related to Nazis and the Holocaust - and after the billionaire appeared to make a fascist salute at a Trump inauguration rally",
    "url": "https://www.haaretz.com/israel-news/2025-03-13/ty-article/musk-shares-claim-that-stalin-hitler-didnt-murder-millions-public-sector-workers-did/00000195-8ee8-d155-affd-8fec8f8e0000"
  },
  {
    "text": "Judge rejects DOJ's effort to expand reach of Trump's Jan. 6 pardon  —  U.S. District Judge Dabney Friedrich, a Trump appointee, called the Justice Department's position irrational.  —  A federal judge has denied the Justice Department's attempt to apply President Donald Trump's blanket pardon … ",
    "url": "https://www.politico.com/news/2025/03/13/judge-rejects-trump-pardon-expansion-00230518"
  },
  {
    "text": "Johns Hopkins to Cut More Than 2,000 Workers Funded by Federal Aid  —  The university, a leader in scientific research, has been hard hit by the Trump administration's cuts, which will slash at least $800 million from its budget.  —  Johns Hopkins University, one of the country's leading centers … ",
    "url": "https://www.nytimes.com/2025/03/13/us/trump-cuts-johns-hopkins-university-layoffs.html?unlocked_article_code=1.3k4.oksp.IRgzd1wp37Ic"
  },
  {
    "text": "Arlington Cemetery website drops links for Black, Hispanic, and women veterans  —  The website for Arlington National Cemetery “unpublished” links to lists of notable graves, walking tours and educational material pertaining to Black, Hispanic and women veterans, as well as some Medal of Honor recipients.",
    "url": "https://taskandpurpose.com/news/arlington-cemetery-scrubs-website-dei/"
  },
  {
    "text": "Voters' Ratings On Economy And Trump Dip, Trade And Russia - Ukraine War Weigh On Trump's Numbers, Quinnipiac University National Poll Finds; Majority Disapprove Of Trump's Handling Of Zelensky Meeting  — mail_outline  —  Seven weeks after President Donald Trump began his second term … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3921"
  },
  {
    "text": "B.C. woman detained at U.S. border, sent to Arizona detention facility in chains  —  Her mother says 35-year-old Jasmine Mooney has been detained in inhumane conditions since March 3  —  A B.C. mom is pleading for help after her daughter was unexpectedly detained in the United States over an incomplete visa.",
    "url": "https://vancouversun.com/news/bc-woman-detained-at-us-border-sent-to-arizona-detention-facility"
  },
  {
    "text": "Tesla warns Trump administration it is ‘exposed’ to retaliatory tariffs  —  Elon Musk's electric-car maker says levies could make it costlier to produce vehicles in the US  —  Elon Musk's electric-car maker Tesla has warned that President Donald Trump's trade war could make it a target … ",
    "url": "https://www.ft.com/content/605295c5-dc8f-4247-ba35-8036b5058915?accessToken=zwAGMD90mKaQkc9gUpXF3I9CR9O6NYA2tQWJFQ.MEQCIDxQi1aVBZZTj1-AJwwYZFYOiB4EApM2XGB-dNpVr2oEAiAVsUxZP9KQ-2sxR0v5JHp3EWQgib4NamXFYbEemmEe4g&sharetype=gift&token=71b8eee7-1740-4f07-88c1-0fdecb73edee"
  },
  {
    "text": "Trump expected to invoke wartime authority to speed up mass deportation effort in coming days  —  The Trump administration is expected to invoke a sweeping wartime authority to speed up the president's mass deportation pledge in the coming days, according to four sources familiar with the discussions.",
    "url": "https://www.cnn.com/2025/03/13/politics/alien-enemies-act-deportation-consideration/"
  },
  {
    "text": "Paper-Thin Ethics  —  The Los Angeles Times is facing ethical questions after one of its shows aired what looked like a news story—but was actually an undisclosed promotion for billionaire owner Patrick Soon-Shiong's drug company. … Unlike the other stories that Coronado was spotlighting on the show, this one was rather peculiar.",
    "url": "https://www.status.news/p/patrick-soon-shiong-la-times-companies-coverage"
  },
  {
    "text": "Ron Nessen, Ford's White House Press Secretary, Dies at 90  —  He pledged a new era of openness in the wake of the Watergate scandal, but his relationship with the press corps proved rocky.  —  Ron Nessen, who as President Gerald R. Ford's press secretary from 1974 to 1977 pledged a new era … ",
    "url": "https://www.nytimes.com/2025/03/13/us/politics/ron-nessen-dead.html?unlocked_article_code=1.3k4.w9B_.uC8zrouZ2yiv&smid=url-share"
  }
]