[
  {
    "text": "Trump's Fury at Gavin Newsom Backfires—and Reveals His Own Weakness  —  With President Donald Trump sending more troops into Los Angeles amid protests there, a remarkable image has gone viral on social media.  It shows members of the National Guard crowded into a sterile-looking office … ",
    "url": "https://newrepublic.com/article/196674/trump-gavin-newsom-fury-backfires-reveals-weakness"
  },
  {
    "text": "‘No Kings’: Millions to Protest Trump's ‘Dictator-Style Birthday Parade’  —  A national day of protest is set for June 14.  Can non-violent resistance counter Trump's authoritarian show of force?  —  Even before Donald Trump militarized his crackdown on pro-immigrant protesters in Los Angeles … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-no-kings-protests-june-14-los-angeles-1235359409/"
  },
  {
    "text": "‘He does love being commander in chief’: Trump leans in on the military  —  On one coast, military forces are arriving by the thousands to defend federal buildings and agents.  On the other, they're readying a celebration of American military might.  —  President Donald Trump loves displays of military force.",
    "url": "https://www.politico.com/news/2025/06/11/trump-military-parade-protests-00398716"
  },
  {
    "text": "Newsom Says Trump Is Destroying U.S. Democracy in Speech on L.A. Protests  —  Gov. Gavin Newsom of California called on Americans to stand up to President Trump in a nationally televised address.  —  Gov. Gavin Newsom made the case in a televised address Tuesday evening that President Trump's decisions … ",
    "url": "https://www.nytimes.com/2025/06/10/us/newsom-speech-trump-la-protests.html?unlocked_article_code=1.OE8.29sT.vD5yj7eCwxFt&smid=re-share"
  },
  {
    "text": "Trump Wants to Be a Strongman, but He's Actually a Weak Man  —  President Trump thinks it is a sign of strength to send in troops to deal with protesters in Los Angeles.  To that end, he has federalized a portion of the California National Guard and mobilized nearby Marines to support Immigration … ",
    "url": "https://www.nytimes.com/2025/06/11/opinion/trump-los-angeles-ice-strongman.html?unlocked_article_code=1.OE8.E5I6.RwfRanUrJCEw&smid=url-share"
  },
  {
    "text": "Democrats Enter Risky Political Terrain as Protests Grip California  —  Scenes of unrest in Southern California, stoked by President Trump as he tries to deport more immigrants, have left Democratic leaders worried the confrontation elevates a losing issue for the party.",
    "url": "https://www.nytimes.com/2025/06/10/us/politics/trump-immigration-ice-democrats.html?unlocked_article_code=1.OE8.MQ4n.Cfog0kLDSHU_&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "X's Sales Pitch: Give Us Your Ad Business or We'll Sue  —  Elon Musk and CEO Linda Yaccarino launched a campaign to strong-arm advertisers back onto the platform  —  Late last year, Verizon Communications got an unusual message from a media company that wanted its business: Spend your ad dollars with us or we'll see you in court.",
    "url": "https://www.wsj.com/business/media/x-twitter-ad-revenue-campaign-lawsuit-a882b5c6?st=AAxSTY&reflink=article_copyURL_share"
  },
  {
    "text": "Under Pressure From the White House, ICE Seeks New Ways to Ramp Up Arrests  —  Former officials said the Trump administration's push for the agency to detain record numbers of undocumented immigrants increases the chances of mistakes.  —  Former officials said the Trump administration's push … ",
    "url": "https://www.nytimes.com/2025/06/11/us/politics/ice-la-protest-arrests.html?unlocked_article_code=1.OE8.3d_F.oSkeogGnHrsP&smid=url-share"
  },
  {
    "text": "Trump says governors should be able to handle disasters without FEMA  —  In remarks to reporters, the president said the administration plans to “wean” states off FEMA assistance after hurricane season ends.  —  President Donald Trump said Tuesday that his administration plans to “wean” … ",
    "url": "https://www.washingtonpost.com/weather/2025/06/10/trump-fema-states-hurricane-season/"
  },
  {
    "text": "Trump says he plans to phase out FEMA after 2025 hurricane season  —  President Donald Trump said Tuesday that he plans to phase out the Federal Emergency Management Agency after this year's hurricane season, offering the clearest timeline yet for his administration's long-term plans to dismantle … ",
    "url": "https://cnn.com/2025/06/11/politics/fema-hurricane-season-phase-out-trump"
  },
  {
    "text": "Congresswoman Charged for Forcibly Impeding and Interfering With Federal Officers  —  For Immediate Release  —  U.S. Attorney's Office, District of New Jersey  —  NEWARK, N.J. - U.S. Representative LaMonica McIver was charged in a three-count indictment today for forcibly impeding … ",
    "url": "https://www.justice.gov/usao-nj/pr/congresswoman-charged-forcibly-impeding-and-interfering-federal-officers"
  },
  {
    "text": "Trump says China will supply rare earths, US to allow students  —  “WE ARE GETTING A TOTAL OF 55% TARIFFS, CHINA IS GETTING 10%.  RELATIONSHIP IS EXCELLENT!”  Trump wrote on Truth Social without elaborating.  —  A White House official said the agreement allows the U.S. to charge a 55% tariff on imported Chinese goods.",
    "url": "https://www.reuters.com/world/china/trump-says-china-will-supply-rare-earths-us-allow-students-2025-06-11/"
  },
  {
    "text": "The Silence of the Generals  —  As President Donald Trump crossed a dangerous line at Fort Bragg, the brass failed to speak out in the Army's defense.  —  President Donald Trump continued his war against America's most cherished military traditions today when he delivered a speech at Fort Bragg.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/06/silence-generals/683106/?gift=otEsSHbRYKNfFYMngVFweC9SKhWuL8c7oypTub1ifvo&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump Says Army Bases Will Revert to Confederate Names  —  The move would reverse a yearslong effort to remove names and symbols honoring the Confederacy from the military.  —  President Trump, during a speech at Fort Bragg, N.C., said on Tuesday that he would restore the names of all Army bases … ",
    "url": "https://www.nytimes.com/2025/06/10/us/politics/trump-army-base-rename-confederate.html"
  },
  {
    "text": "Immigration raid rocks Nebraska meatpacking plant; protesters and law enforcement clash  —  Editor's note: Earlier reports indicated that U.S. Immigration and Customs Enforcement conducted raids at multiple locations in Omaha.  ICE has since confirmed worksite enforcement operations at one location.",
    "url": "https://flatwaterfreepress.org/ice-raids-hit-omaha-meatpacking-plants/"
  },
  {
    "text": "ICE detains local teen despite legal authorization to be in U.S.  —  DAVID MAMARIL HOROWITZ  —  david.horowitz@bgdailynews.com  —  U.S. Immigration and Customs Enforcement seized and detained a local teenager in Bowling Green who has legal authorization to be in the country, according to a Teranga Academy-partnered nonprofit.",
    "url": "https://bgdailynews.com/2025/06/10/ice-detains-local-teen-despite-legal-authorization-to-be-in-u-s/"
  },
  {
    "text": "Inflation inched up less than expected in May with little sign of tariffs  —  Annual inflation rose to a 2.4 percent pace, slightly hotter than in April.  —  Inflation picked up in May, but not as much as economists expected, suggesting that the effects of President Donald Trump's tariffs have yet to take hold.",
    "url": "https://www.washingtonpost.com/business/2025/06/11/trump-tariffs-may-inflation/"
  },
  {
    "text": "We published real photos of troops sleeping on a floor in L.A. Right-wing critics called them fake  —  In the hours after the Chronicle published two exclusive photos of California National Guard troops sleeping on the concrete floor of a Los Angeles federal building, a torrent of false claims … ",
    "url": "https://www.sfchronicle.com/california/article/national-guard-photos-20370678.php"
  },
  {
    "text": "Rubio Is Pressing to Open Sanctions Investigation Into Harvard  —  Experts and former officials said it was unusual for a cabinet secretary to try to influence the Treasury Department's sanctions process to target a domestic entity.  —  Secretary of State Marco Rubio is pushing … ",
    "url": "https://www.nytimes.com/2025/06/11/us/politics/rubio-is-pressing-to-open-sanctions-investigation-into-harvard.html"
  },
  {
    "text": "Musk says some of his posts about Trump ‘went too far’  —  Billionaire businessman Elon Musk said on Wednesday he regretted some of the posts he made last week about U.S. President Donald Trump as they had gone “too far”.  —  Trump said on Saturday his relationship with Musk … ",
    "url": "https://www.reuters.com/world/us/musk-says-he-regrets-some-posts-he-made-about-trump-2025-06-11/"
  },
  {
    "text": "Fulbright Board Resigns After Accusing Trump Aides of Political Interference  —  The board of the prestigious program told the State Department it had no right to cancel scholarships for nearly 200 American professors and researchers.  —  The dozen board members of the prestigious Fulbright program … ",
    "url": "https://www.nytimes.com/2025/06/11/us/politics/fulbright-board-resign-trump.html"
  },
  {
    "text": "Tulsi Gabbard Admits to Asking AI What to Classify in JFK Files  —  EASIER THAT WAY  —  Gabbard revealed that she fed tens of thousands of documents about the JFK assassination into an AI program for review.  —  Tulsi Gabbard relied on artificial intelligence to determine what to classify … ",
    "url": "https://www.thedailybeast.com/tulsi-gabbard-admits-to-asking-ai-what-to-classify-in-jfk-files/"
  },
  {
    "text": "Vance, Rubio peddle fiction that 88 percent of foreign aid doesn't go overseas  —  The vice president and secretary of state twist a statistic issued under the Biden administration — and pretend it's new.",
    "url": "https://www.washingtonpost.com/politics/2025/06/11/usaid-vance-rubio-fact-checker/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ5NjE0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwOTk2Nzk5LCJpYXQiOjE3NDk2MTQ0MDAsImp0aSI6ImJiMmMyN2Y0LTAyNzgtNDU0MS1hMWYwLTAzMTQ0ZDI3NjU1MCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA2LzExL3VzYWlkLXZhbmNlLXJ1YmlvLWZhY3QtY2hlY2tlci8ifQ.qzfLi0ibDVUF_GBMHlIrtgSA6uw1SZiw7cmfICayapw&itid=gfta"
  },
  {
    "text": "This Is What Trump Does When His Revolution Sputters  —  His military deployment in Los Angeles follows a long, disturbing tradition.  —  Revolutions have a logic.  The revolutionaries start with a big, transformative, impossible goal.  They want to remake society, smash existing institutions, replace them with something different.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/06/california-protests-ice-trump/683102/?gift=hVZeG3M9DnxL4CekrWGK302yYSiIkEmbIoKwOecqwLo&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Most GOP lawmakers plan to skip Trump's big parade  —  POLITICO surveyed 50 Hill Republicans.  Only six said they'd stick around Saturday for the big show.  —  President Donald Trump is celebrating the Army's 250th anniversary — and his own 79th birthday — with a massive, multimillion-dollar military parade Saturday in Washington.",
    "url": "https://www.politico.com/news/2025/06/10/trump-parade-congress-republicans-00398774"
  },
  {
    "text": "ABC News drops Terry Moran over late-night post attacking Trump and Stephen Miller  —  ABC News is parting ways with veteran correspondent Terry Moran, two days after he posted a missive on X calling President Donald Trump and deputy chief of staff Stephen Miller “world-class haters.”",
    "url": "https://cnn.com/2025/06/10/media/abc-news-terry-moran-exits-trump"
  },
  {
    "text": "Appeals Court Keeps Trump's Sweeping Tariffs in Place for Now  —  Court will hear fast-track oral arguments this summer  —  A federal appeals court on Tuesday granted the Trump administration's request to keep the president's far-reaching tariffs in effect for now but agreed to fast track its consideration of the case this summer.",
    "url": "https://www.wsj.com/economy/trade/appeals-court-keeps-trumps-sweeping-tariffs-in-place-for-now-5f5c7f35"
  }
]