[
  {
    "text": "Trump says Black voters like him more because of his indictments and mug shot  —  The GOP candidate tells a group of Black conservatives: 'I'm being indicted for you, the Black population'  —  COLUMBIA, S.C. — Former President Trump sought to appeal to Black voters on Friday night … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/24/trump-black-voters-indicted-mug-shot/"
  },
  {
    "text": "Trump Rambles His Way Through Incoherent Nashville Speech  —  “They want you to say what they want you, what they want to have you say.  And we're not gonna let that happen.”  —  LOADING  —  Former President Donald Trump delivered a whopper of a speech Thursday at the National Religious … ",
    "url": "https://www.huffpost.com/entry/trump-rambles-his-way-through-incoherent-nashville-speech_n_65d8c64ce4b0189a6a7db2dd"
  },
  {
    "text": "Trump says ‘the Black people’ like him because he's been ‘discriminated against’ in the legal system  —  In a speech to a group of Black conservatives, he also said Black Americans “embraced” his mug shot more than anyone else.  —  COLUMBIA, S.C. — Former President Donald Trump claimed … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-black-people-discriminated-legal-system-rcna140305"
  },
  {
    "text": "Ignoring Warnings, G.O.P. Trumpeted Now-Discredited Allegation Against Biden  —  Republicans in Congress built their impeachment case against President Biden around a bribery accusation that the F.B.I. had warned them was uncorroborated.  —  In May 2023, Senator Charles E. Grassley … ",
    "url": "https://www.nytimes.com/2024/02/23/us/politics/gop-smirnov-allegation-biden.html"
  },
  {
    "text": "Jim Jordan Offers Startling Confession on Indicted Biden Informant  —  After trying and failing to salvage Republicans' crumbling impeachment inquiry into President Joe Biden, Ohio Representative Jim Jordan at last, finally, conceded on Friday that Alexander Smirnov's story might not be totally accurate.",
    "url": "https://newrepublic.com/post/179270/jim-jordan-confession-indicted-biden-fbi-informant-smirnov"
  },
  {
    "text": "Exclusive — Dark Trump at CPAC: “Biden's fast track to hell” … Senior campaign officials tell us Trump will lay out his general-election case against Biden in the 1 p.m. speech — flipping the “four more years” argument to a series of dire warnings about Biden's re-election.",
    "url": "https://www.axios.com/2024/02/24/trump-cpac-speech-excerpt"
  },
  {
    "text": "Being Denied a Press Pass at CPAC Was the Best Way to Cover the Conference  —  This is what happened when MAGA people thought I was one of them.  —  I've attended the Conservative Political Action Conference almost yearly since 2009, always as a credentialed reporter.",
    "url": "https://www.motherjones.com/politics/2024/02/being-denied-a-press-pass-at-cpac-was-the-best-way-to-cover-the-conference/"
  },
  {
    "text": "RFK Jr.'s comedy night: Barbs for Biden, but the joke may be on Trump  —  The L.A. fundraiser featuring Adam Carolla, Jeremy Piven and others seemed to appeal to Kennedy-curious voters who might otherwise support the Republican  —  LOS ANGELES — There were plenty of moments during … ",
    "url": "https://www.washingtonpost.com/style/power/2024/02/22/rfk-jr-comedy-fundraiser-la/"
  },
  {
    "text": "Even Before His Trial, the N.R.A.'s Wayne LaPierre Was a Fraud  —  The pro-gun group's former leader used the organization's funds to enrich himself and those close to him.  But the deception went much deeper.  —  In early January, Wayne LaPierre, the longtime head of the National Rifle Association … ",
    "url": "https://www.newyorker.com/news/news-desk/wayne-lapierre-nra-trial-verdict-self-dealing"
  },
  {
    "text": "Vindman: Trump's NATO threat likely a ‘contributing factor’ in Navalny's death  —  Retired Army Lt. Col. Alexander Vindman argued that former President Trump's recent comments about NATO are likely a “contributing factor” in the death of Russian opposition leader Alexei Navalny.",
    "url": "https://thehill.com/policy/international/4486707-vindman-trump-nato-threat-likely-contrinuting-factor-navalny-death/"
  },
  {
    "text": "This week, we faced all that the Dobbs justices unleashed  —  The five justices of the U.S. Supreme Court who overturned Roe v. Wade 20 months ago Saturday gave a green light to a new brand of Republican extremism in hyperdrive — a hyperdrive that has been on full, frightening display this week.",
    "url": "https://www.lawdork.com/p/dobbs-ivf-marriage-nex"
  },
  {
    "text": "White House reverses West Bank policy, calling Israeli settlements illegal  —  The decision was in response to reports that the far-right government of Israeli Prime Minister Benjamin Netanyahu was planning further settlement expansion, an official said  —  BUENOS AIRES — Secretary … ",
    "url": "https://www.washingtonpost.com/national-security/2024/02/23/israel-west-bank-settlements-illegal/"
  },
  {
    "text": "Canada Gives Ukraine $2.2 Billion Lifeline as Kyiv Awaits US Aid  — Funding for 2024 will boost Kyiv's military, economy  — Prime Minister Justin Trudeau visited Ukraine on Saturday  —  Canada will provide Ukraine C$3 billion ($2.2 billion) in aid this year to prop up the war-ravaged economy … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-24/canada-gives-ukraine-2-2-billion-lifeline-as-kyiv-awaits-us-aid"
  },
  {
    "text": "Anti-abortion extremists in the US are waging a holy war against women  —  Republicans aren't content with just forcing women to give birth, they are intent on controlling all facets of reproductive healthcare, as we're seeing in Alabama  —  The holy war on IVF",
    "url": "https://www.theguardian.com/commentisfree/2024/feb/24/alabama-frozen-embryo-ivf-anti-abortion-patriarchy"
  },
  {
    "text": "IVF helps women become mothers — so why does the Christian right hate it so much?  —  Former Gov. Nikki Haley, R-S.C., gets a lot of glowing coverage simply because she occasionally criticizes Donald Trump in her fruitless presidential primary run against him.",
    "url": "https://www.salon.com/2024/02/23/alabamas-targeting-of-ivf-is-the-christian-rights-attempt-to-control-motherhood-and-theocracy/"
  },
  {
    "text": "125 House Republicans — including Speaker Mike Johnson — back a ‘life at conception’ bill without any IVF exception  —  Most House Republicans have cosponsored a bill declaring that life begins from the moment of conception, a position under increased scrutiny after the Alabama Supreme Court ruled … ",
    "url": "https://www.businessinsider.com/house-republicans-life-at-conception-ivf-exception-2024-2"
  }
]