[
  {
    "text": "Texas Supreme Court Rules Against Woman Who Sought Court-Approved Abortion  —  Hours before the ruling, a group representing the woman, whose fetus received a fatal diagnosis, said she was leaving Texas for an abortion.  —  The Texas Supreme Court on Monday overturned a lower court order allowing … ",
    "url": "https://www.nytimes.com/2023/12/11/us/texas-abortion-kate-cox.html"
  },
  {
    "text": "Texas woman who sought court permission for abortion leaves state for the procedure, attorneys say  —  A pregnant Texas woman who sought court permission for an abortion in an unprecedented challenge to one of the most restrictive bans in the U.S. has left the state to obtain the procedure, her attorneys said Monday.",
    "url": "https://apnews.com/article/abortion-texas-ban-7d865cdfd75bdc6b2f4186f4d1e6e8bd"
  },
  {
    "text": "Texas Supreme Court rules against woman at center of abortion battle  —  Kate Cox had already decided to go out of state for procedure after learning that carrying the pregnancy to term could jeopardize her future fertility  —  Kate Cox, a Dallas-area woman who petitioned a judge … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/11/kate-cox-texas-abortion/"
  },
  {
    "text": "Special counsel reveals plans to use Trump's phone data at trial  —  Jack Smith indicated that he plans to call an expert witness who extracted and reviewed data copied from Trump's phone.  —  Special counsel Jack Smith has extracted data from the cell phone Donald Trump used while in the White House … ",
    "url": "https://www.politico.com/news/2023/12/11/special-counsel-trump-phone-data-trial-00131196"
  },
  {
    "text": "How a US Partisan Clash Over Immigration Has Stalled Ukraine Aid  — Republicans sense political advantage over surging migration  — Despite Zelenskiy visit, aid bill not likely to pass this year  —  Republican lawmakers sense political advantage on immigration and are pressing Democrats … ",
    "url": "https://www.bloomberg.com/news/articles/2023-12-12/how-a-us-partisan-clash-over-immigration-has-stalled-ukraine-aid"
  },
  {
    "text": "Republican senator says Ukraine should cede land and cut a deal with Putin to end the war  —  Sen. JD Vance, on the eve of Ukrainian President Volodymyr Zelenskyy's trip to Capitol Hill, dismissed fears that Russia would keep making advances if it's victorious in Ukraine.",
    "url": "https://www.nbcnews.com/politics/congress/jd-vance-says-ukraine-cede-land-cut-deal-putin-end-war-rcna129195"
  },
  {
    "text": "Giuliani's Defense Says $43 Million in Damages Would Be ‘Death Penalty’  —  The bizarre remark came in opening statements of a trial to determine how much he'll owe in damages to two Georgia poll workers.  —  On day one of Rudy Giuliani's trial to determine how much he'll owe a pair … ",
    "url": "https://www.thedailybeast.com/rudy-giulianis-defense-says-awarding-dollar43-million-in-damages-would-be-death-penalty"
  },
  {
    "text": "Scoop: House Freedom Caucus drama erupts over its next leader  —  An influential member of the House Freedom Caucus won't run for a leadership spot, citing a recommendation by the group's board that Rep. Bob Good (R-Va.) serve as its next chairman. … - “I ask that we consider how to best increase … ",
    "url": "https://www.axios.com/2023/12/12/house-freedom-caucus-leader-drama-bob-good"
  },
  {
    "text": "A deadly delivery highlights ‘falsified’ heat records at USPS  —  The Postal Service allegedly doctored heat training records of thousands of mail carriers.  One of them died on a blistering day in June.  —  Eugene Gates, a Dallas letter carrier for the Postal Service, died of heat exposure in June.",
    "url": "https://www.politico.com/news/2023/12/11/usps-major-heat-deaths-00128875"
  },
  {
    "text": "“Bombshell”: Does Harvard's President Also Have a Plagiarism Scandal?  Update: Billionaire donor demands Gay's firing  —  Isn't the anti-Semitism and hypocrisy scandal enough for Claudine Gay?  Harvard's board has gotten very quiet over the past week after its president's congressional testimony outraged practically everyone.",
    "url": "https://hotair.com/ed-morrissey/2023/12/11/bombshell-does-harvards-president-also-have-a-plagiarism-scandal-n598202"
  },
  {
    "text": "Exclusive: Former Mar-a-Lago employee-turned-witness repeatedly contacted by Trump and associates before documents charges  —  West Palm Beach, FL CNN  —  Three months after the FBI seized classified records from Mar-a-Lago last August, a longtime employee of Donald Trump's private club quit his job.",
    "url": "https://www.cnn.com/2023/12/11/politics/former-mar-a-lago-employee-special-counsel-trump/"
  },
  {
    "text": "Project Veritas CEO Jumps Ship After Finding ‘Evidence of Past Illegality’  —  ANOTHER ONE BITES THE DUST  —  Hannah Giles, the CEO of conservative nonprofit Project Veritas, announced her resignation “effective immediately” on Monday, saying she'd unwittingly “stepped into an unsalvageable mess” upon taking the job earlier this year.",
    "url": "https://www.thedailybeast.com/project-veritas-ceo-hannah-giles-jumps-ship-after-finding-evidence-of-past-illegality"
  },
  {
    "text": "Michigan Gov. Gretchen Whitmer's latest move on abortion highlights Democrats' 2024 push  —  In an interview with NBC News before repealing a remaining state restriction on abortion, Whitmer said, “When you stay in the fight, you can win.”  —  Michigan Gov. Gretchen Whitmer on Monday repealed … ",
    "url": "https://www.nbcnews.com/politics/politics-news/gretchen-whitmers-abortion-move-highlights-democrats-2024-push-rcna128930"
  },
  {
    "text": "Google's App Store Ruled an Illegal Monopoly, as a Jury Sides With Epic Games  —  A jury in San Francisco unanimously found that Google stifled competition for its app store.  A judge will now decide on what fixes to require at the company, but appeals could delay the impact of the case for years.",
    "url": "https://www.wired.com/story/googles-app-store-monopoly-ruled-illegal-jury-epic/"
  },
  {
    "text": "House Takes Up Long-Building Debate Over Rival Surveillance Bills  —  The fight over privacy and national security, which has scrambled partisan lines, will come to a head with an unusual double vote on the floor.  —  A long-simmering debate over a powerful surveillance tool is coming to a head in Congress … ",
    "url": "https://www.nytimes.com/2023/12/11/us/politics/house-fisa-surveillance-bill.html"
  },
  {
    "text": "Biden Warns Israel That Public Opinion Can Shift in Hamas War  — President calls on Israel to be ‘careful’ as death toll mounts  — Biden calls surge in antisemitism around globe ‘sickening’  —  President Joe Biden cautioned that public opinion in support of Israel in its war … ",
    "url": "https://www.bloomberg.com/news/articles/2023-12-12/biden-warns-israel-that-public-opinion-can-shift-in-hamas-war"
  },
  {
    "text": "Iowa GOP debate in peril with Nikki Haley noncommittal  —  The final GOP presidential debate before the Iowa caucuses may not happen, as former UN Ambassador Nikki Haley hasn't committed to participating and Vivek Ramaswamy and former Gov. Chris Christie aren't on pace to qualify.",
    "url": "https://www.axios.com/2023/12/12/iowa-debate-republican-nikki-haley-ron-desantis-trump"
  },
  {
    "text": "Anwar Taps Pension Fund Boss in Malaysian Cabinet Reshuffle  — Finance ministry must have a ‘strong professional team:’ Anwar  — Ministerial revamp sees return of capable leaders: analyst  —  Malaysia's Prime Minister Anwar Ibrahim picked the head of the country's top pension fund … ",
    "url": "https://www.bloomberg.com/news/articles/2023-12-12/malaysia-s-anwar-to-add-cabinet-members-in-tuesday-s-reshuffle"
  }
]