[
  {
    "text": "A big insurer backed off its plan to pay less for anesthesia.  That's bad.  —  Support independent journalism that matters — become a Vox Member today.  —  In November, the American Society of Anesthesiologists (ASA) issued a dire warning: One of America's largest insurance companies … ",
    "url": "https://www.vox.com/policy/390031/anthem-blue-cross-blue-shield-anesthesia-limits-insurance"
  },
  {
    "text": "The Rage and Glee That Followed a C.E.O.'s Killing Should Ring All Alarms  —  It started barely minutes after the horrifying news broke that the chief executive of UnitedHealthcare, Brian Thompson, was fatally shot in midtown Manhattan.  Even before any details were available … ",
    "url": "https://www.nytimes.com/2024/12/06/opinion/united-health-care-ceo-shooting.html?unlocked_article_code=1.fk4.AaPM.urual_4V4Ud7&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump has an obsession with House members … - House members, by contrast, have to run for reelection every two years and are typically more in touch with the fanatically pro-Trump GOP base.  — “We know what people expect. … - Another two have served in the House … ",
    "url": "https://www.axios.com/2024/12/06/trump-cabinet-congress-house"
  },
  {
    "text": "Gabbard could be the next Trump nominee to come under fire in the Senate  —  The former Democratic congressperson's path to becoming the nation's top spy is far from guaranteed, according to current and former Senate GOP aides.  —  Tusli Gabbard looks likely to be the next … ",
    "url": "https://www.politico.com/news/2024/12/06/hegseth-is-on-thin-ice-gabbard-could-be-next-00193038"
  },
  {
    "text": "Democrats and Republicans in Congress worried that Gabbard might leak information to Syria  —  When she arrived in Congress, Tulsi Gabbard was seen as a rising Democratic star.  But over time, her views on Russia and Syria shocked, puzzled and alarmed her colleagues.",
    "url": "https://www.nbcnews.com/politics/national-security/democrats-republicans-congress-worried-gabbard-might-leak-information-rcna181316"
  },
  {
    "text": "Trump's billionaires set to take government by storm … - They've been picked to lead the departments of Treasury (Scott Bessent), Commerce (Howard Lutnick), Education (Linda McMahon), Interior (Doug Burgum), the Small Business Administration (Kelly Loeffler) and NASA (Jared Isaacman).",
    "url": "https://www.axios.com/2024/12/06/trump-billionaires-cabinet-elon-musk"
  },
  {
    "text": "Trump has assembled an uber-wealthy Cabinet, raising risks of ethics conflicts  —  President-elect Trump is stacking his cabinet with billionaires and centi-millionaires, whose financial entanglements pose conflict of interest challenges.  —  A month after securing the White House … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/06/trump-billionaires-cabinet-ethics/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMzNDYxMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM0ODQzNTk5LCJpYXQiOjE3MzM0NjEyMDAsImp0aSI6IjgzODI5MmJjLWE4MjYtNDU4NC05MGFkLTI0ZmExODNiNjc5MiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEyLzA2L3RydW1wLWJpbGxpb25haXJlcy1jYWJpbmV0LWV0aGljcy8ifQ.43xYPJC7w0sehcC1HB1hyu0q_3BxRj-5CApv3FROIl4&itid=gfta"
  },
  {
    "text": "USDA orders testing of milk for bird flu  —  The mandate targeting bulk milk transporters and dairy processors is meant to help identify herds that have caught the virus, which has spread among livestock.  —  The national milk supply must be tested for bird flu under a federal order announced Friday … ",
    "url": "https://www.nbcnews.com/health/health-news/usda-orders-testing-milk-bird-flu-rcna183212"
  },
  {
    "text": "Malliotakis says Republicans should keep investigating Hunter Biden after pardon  —  Rep. Nicole Malliotakis (R-N.Y.) said House Republicans' investigation into President Biden's son, Hunter Biden, should continue despite the president's decision to pardon his son on Sunday.",
    "url": "https://thehill.com/homenews/house/5027053-malliotakis-hunter-biden-pardon-house-republicans/"
  },
  {
    "text": "Melania Trump sells Christmas ornaments during Fox News appearance  —  Melania Trump — set to return to the White House in January as first lady — showcased her new Christmas ornament collection during a recent appearance on Fox News.  —  “After I left the White House … ",
    "url": "https://thehill.com/homenews/media/5026920-melania-trump-christmas-ornaments-fox-appearance/"
  },
  {
    "text": "Hegseth Brings His Nomination Back from the Brink  —  DONALD TRUMP WANTS HIS CABINET nominees to “earn” their confirmation on their own.  —  But on Friday, the president-elect went out of his way to give an attaboy to Pete Hegseth just hours after the defense secretary pick scolded reporters … ",
    "url": "https://www.thebulwark.com/p/hegseth-brings-his-nomination-back"
  },
  {
    "text": "Plutocracies Thrive in Darkness  —  Elon Musk has been dubbed Donald Trump's “First Buddy” — a riff, I assume, on the title First Lady.  The moniker seems innocuous, almost cute.  It is anything but.  —  Musk now has unchecked access to Donald Trump.  He is a regular fixture at Trump's Florida estate, Mar-a-Lago.",
    "url": "https://steady.substack.com/p/plutocracies-thrive-in-darkness"
  },
  {
    "text": "Eric Adams Doesn't Rule Out Becoming a Republican Again  —  The Democratic mayor of New York City has embraced President-elect Donald J. Trump lately.  He was a registered Republican in the 1990s.  —  With his political future in doubt, Eric Adams, the Democratic mayor of New York City … ",
    "url": "https://www.nytimes.com/2024/12/06/nyregion/eric-adams-republican.html"
  },
  {
    "text": "Millions will lose health coverage if ACA subsidies expire: CBO  —  A new report released by the Congressional Budget Office (CBO) found that if the Affordable Care Act's (ACA) extended subsidies are allowed to expire at the end of 2025, millions of people will become uninsured and premiums will rise.",
    "url": "https://thehill.com/policy/healthcare/5026478-affordable-care-act-subsidies-expiration-health-coverage/"
  },
  {
    "text": "Exclusive: Trump may cancel US Postal Service electric mail truck contract, sources say  —  Donald Trump's transition team is considering canceling the United States Postal Service's contracts to electrify its delivery fleet, as part of a broader suite of executive orders targeting electric vehicles … ",
    "url": "https://www.reuters.com/business/autos-transportation/trump-may-cancel-us-postal-service-electric-mail-truck-contract-sources-say-2024-12-06/"
  },
  {
    "text": "Jan. 6 defendants become more defiant ahead of Trump's return  —  In multiple sentencings Friday, judges saw firsthand how attentively some Jan. 6 perpetrators heed their reprimands.  (Which is to say, not at all.)  —  Federal judges in Washington D.C. have spent four years sounding alarms … ",
    "url": "https://www.politico.com/news/2024/12/06/jan-6-defendants-defiant-00193115"
  },
  {
    "text": "Paul Krugman retires as Times columnist  —  After nearly 25 years as an Opinion columnist, Paul is signing off.  —  I want to take you back to Jan. 2, 2000, a day when Y2K was in the rearview mirror and the dot-com bubble burst was just around the corner, when the Dow stood at a mighty 11,500 … ",
    "url": "https://www.nytco.com/press/paul-krugman-retires-as-times-columnist/"
  },
  {
    "text": "Owner of Los Angeles Times Plans ‘Bias Meter’ Next to Coverage  —  Dr. Patrick Soon-Shiong said that he planned to introduce the tool, which he said would appear next to the paper's news articles and opinion pieces, in January.  —  Patrick Soon-Shiong, the billionaire owner of The Los Angeles Times … ",
    "url": "https://www.nytimes.com/2024/12/06/business/media/la-times-owner-bias-meter.html?unlocked_article_code=1.fU4.t5Jt.c6WAUfp8E65h"
  },
  {
    "text": "Everybody Loves FRED: How America Fell for a Data Tool  —  From Facebook political debates to college classrooms, the St. Louis Fed's data tool has gained a major following.  —  Fans post about him on social media.  Swag bearing his name sells out on the regular.",
    "url": "https://www.nytimes.com/2024/12/06/business/economy/fred-economic-data-fandom.html"
  },
  {
    "text": "TikTok Faces U.S. Ban After Losing Bid to Overturn New Law  —  The law will ban the video app in the United States by Jan. 19 if its owner, ByteDance, does not sell it to a non-Chinese company.  —  TikTok is one step closer to disappearing in the United States after a panel of federal judges … ",
    "url": "https://www.nytimes.com/2024/12/06/business/media/tiktok-ban-court-decision.html"
  },
  {
    "text": "Trump announces new role for his administration, names PayPal co-founder ‘White House AI and crypto czar’  —  David Sacks is a longtime ally of Elon Musk and the former COO of PayPal.  —  In this July 15, 2024, file photo, David Sacks, CEO of Yammer, speaks during the first day of the 2024 … ",
    "url": "https://abcnews.go.com/Politics/trump-announces-new-role-administration-names-paypal-founder/story?id=116509911"
  },
  {
    "text": "How measles, whooping cough and worse could roar back on RFK Jr.'s watch  —  The availability of safe, effective COVID vaccines less than a year into the pandemic marked a high point in the 300-year history of vaccination, seemingly heralding an age of protection against infectious diseases.",
    "url": "https://www.npr.org/sections/shots-health-news/2024/12/06/nx-s1-5218574/rfk-vaccines-anti-vaccine-infectious-disease"
  },
  {
    "text": "Kash Patel's Podcast Problem  —  “Factions of Republican lawmakers at war over how to slash federal spending,” Politico reports, “are scrambling to recruit Elon Musk and Vivek Ramaswamy to their cause”: … And how better to do that than by lobbying Trump's quasi-governmental billionaire pals?",
    "url": "https://www.thebulwark.com/p/kash-patels-podcast-problem"
  },
  {
    "text": "UnitedHealth shooting stokes mourning and glee on social media  —  Jubilation among some users highlights scale of Americans' frustration over their health system  —  The killing on Wednesday of a top UnitedHealth Group executive unleashed a wave of commiseration, but also revelry … ",
    "url": "https://www.ft.com/content/79673e16-254f-4125-938b-b1d28683314f"
  },
  {
    "text": "Pre-election research shows disturbing trend among Republicans  —  Public opinion research conducted in October shows a shift in one political party that might make Donald Trump's election on Nov. 5 less of a surprise.  A majority of the party now agrees with a sentiment about immigration … ",
    "url": "https://www.alternet.org/trump-poisoning-the-blood/"
  },
  {
    "text": "Republican senators launch inquiry into unpublished NIH study on puberty blockers for trans youth  —  Six Republican senators in a letter to National Institutes of Health (NIH) Director Monica Bertagnolli said they are “concerned about the transparency” of studies funded by the NIH … ",
    "url": "https://thehill.com/homenews/lgbtq/5027047-nih-study-puberty-blockers-letter/"
  },
  {
    "text": "Health insurers step up security, scrub websites of leadership information  —  The killing of UnitedHealthcare CEO Brian Thompson is spurring other major health companies to remove the photos of executives from their websites, close buildings and even switch to a virtual investor day rather than an in-person public event.",
    "url": "https://thehill.com/policy/healthcare/5027508-unitedhealthcare-ceo-killing-insurer-security/"
  },
  {
    "text": "Military leaders are rattled by a list of ‘woke’ officers that a group urges Hegseth to fire  —  Military leaders are rattled by a list of “woke” senior officers that a conservative group urged Pete Hegseth to dismiss for promoting diversity in the ranks if he is confirmed to lead the Pentagon.",
    "url": "https://apnews.com/article/hegseth-trump-diversity-pentagon-list-602477b6e80641b53f4f9b640a14f4ce"
  },
  {
    "text": "How Trump's DOJ could severely curtail oversight of police  —  His second term could mean fewer federal investigations, and settlements, for police misconduct. … A new Justice Department investigation has revealed that officers in the Memphis Police Department use excessive force … ",
    "url": "https://www.vox.com/politics/390158/memphis-police-justice-department-trump"
  },
  {
    "text": "Many targeted for removal by Trump can't be deported, ICE data shows  —  Barriers to sending some immigrants home are among the legal and logistical obstacles President-elect Donald Trump faces as he pledges mass deportations  —  Nearly half of the 1.4 million people in the U.S. immigration system … ",
    "url": "https://www.washingtonpost.com/immigration/2024/12/06/mass-deportation-obstacles-trump-migrants/"
  },
  {
    "text": "CDC warns of new drug more deadly than fentanyl  —  A more potent form of fentanyl is contributing to the thousands of overdose deaths that happen every year, health officials warn.  —  An extremely powerful derivative of fentanyl, called carfentanil, was detected in 513 overdose deaths between 2021 … ",
    "url": "https://thehill.com/policy/healthcare/5026588-fentanyl-carfentanil-overdose-deaths/"
  }
]