[
  {
    "text": "Trump puts new limits on Elon Musk  —  The president convened his secretaries, with Musk, to clarify power.  —  President Donald Trump convened his Cabinet in person on Thursday to deliver a message: You're in charge of your departments, not Elon Musk.  —  According to two administration officials … ",
    "url": "https://www.politico.com/news/2025/03/06/trump-cabinet-musk-025093"
  },
  {
    "text": "Trump's latest tariff twist: A break for Mexico and Canada  —  Two days after putting 25% tariffs on goods from Mexico and Canada, President Trump said on Thursday that he will largely lift them — the latest twist in his on-again, off-again approach to an issue that has sent markets into a tailspin.",
    "url": "https://www.npr.org/2025/03/06/nx-s1-5320044/trump-tariffs-mexico-canada"
  },
  {
    "text": "DOGE is driving Social Security cuts and will make mistakes, acting head says privately  —  The Social Security Administration's acting commissioner said members of Elon Musk's cost-cutting team are outsiders who are unfamiliar with the nuances of the agency's programs.  —  Just now",
    "url": "https://www.washingtonpost.com/politics/2025/03/06/doge-is-driving-social-security-cuts-will-make-mistakes-acting-head-says-privately/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxMjM3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyNjE1OTk5LCJpYXQiOjE3NDEyMzcyMDAsImp0aSI6ImI1NWM2ODdkLWYyNGYtNGRiMy1iZDEzLTVjN2I2YWQwMjNhYSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzA2L2RvZ2UtaXMtZHJpdmluZy1zb2NpYWwtc2VjdXJpdHktY3V0cy13aWxsLW1ha2UtbWlzdGFrZXMtYWN0aW5nLWhlYWQtc2F5cy1wcml2YXRlbHkvIn0.YuFgrKQpIsfmrFc7hUR5Q9nksxXiarod42OowD2eJVw&itid=gfta"
  },
  {
    "text": "Social Security Workers Aren't Allowed to Read This Story  —  New internet restrictions at the embattled SSA have cut off access to WIRED, along with other “general news” websites like The Washington Post and The New York Times.  —  Employees at the Social Security Administration (SSA) … ",
    "url": "https://www.wired.com/story/social-security-workers-arent-allowed-to-read-this-story/"
  },
  {
    "text": "Scoop: Dems privately confront Trump speech disruptors  —  House Democratic leadership is privately confronting members who disrupted President Trump's speech to Congress, Axios has learned.  —  Why it matters: Many progressives defied House Minority Leader Hakeem Jeffries' (D-N.Y.) request to avoid making themselves the story.",
    "url": "https://www.axios.com/2025/03/06/trump-speech-congress-democrats-disrupt"
  },
  {
    "text": "The Advice Elissa Slotkin Didn't Take  —  Right around the time that Donald Trump was arriving at the U.S. Capitol to address a joint session of Congress—the longest such speech, it would turn out, in the history of the presidency—Elissa Slotkin, the newly elected Michigan senator tasked … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/03/elissa-slotkin-democratic-resistance/681933/?gift=Anx5_Gw2ocfAXDdTqoOT9zh7SzkF8bra1oqZ4EHCuyg&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Addressing Risks from Perkins Coie LLP  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  The dishonest and dangerous activity of the law firm Perkins Coie LLP (\"Perkins Coie\") has affected this country for decades.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/addressing-risks-from-perkins-coie-llp/"
  },
  {
    "text": "Treasury Secretary Bessent says the American dream is not about ‘access to cheap goods’ … Treasury Secretary Scott Bessent on Thursday offered a full-throated defense of the White House's position on tariffs, insisting that trade policy has to be about more than just getting low-priced items from other countries.",
    "url": "https://www.cnbc.com/2025/03/06/treasury-secretary-bessent-says-the-american-dream-is-not-about-access-to-cheap-goods.html"
  },
  {
    "text": "Exclusive: Trump plans to revoke legal status of Ukrainians who fled to US, sources say  —  U.S. President Donald Trump's administration is planning to revoke temporary legal status for some 240,000 Ukrainians who fled the conflict with Russia, a senior Trump official and three sources familiar … ",
    "url": "https://www.reuters.com/world/us/trump-plans-revoke-legal-status-ukrainians-who-fled-us-sources-say-2025-03-06/"
  },
  {
    "text": "DOGE targets child support database full of income data  —  Associates of Elon Musk's group provoked yet another clash with career civil servants over sensitive government records  —  Just now  —  Representatives of the U.S. DOGE Service have sought access to a powerful database of nearly … ",
    "url": "https://www.washingtonpost.com/business/2025/03/06/doge-hhs-ssa-data/"
  },
  {
    "text": "We Found Elon Musk's DOGE Email Address and We're Fighting to Reveal His Messages  —  The Freedom of Information Act is a vital tool to expose how the U.S. government operates, and it's especially critical when it comes to Elon Musk's so-called Department of Government Efficiency.",
    "url": "https://theintercept.com/2025/03/06/elon-musk-doge-email-address-foia/"
  },
  {
    "text": "MAGA world turns against Supreme Court Justice Amy Coney Barrett  —  The Trump-appointed justice has shifted the court to the right, but she has angered some in MAGA world by voting against some Trump priorities.  —  WASHINGTON — MAGA activists have turned against one of President Donald … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/maga-world-turns-supreme-court-justice-amy-coney-barrett-rcna194283"
  },
  {
    "text": "Gavin Newsom breaks with Democrats on trans athletes in sports  —  The Democratic California governor made the stunning remarks in his debut podcast with conservative guest Charlie Kirk.  —  California Gov. Gavin Newsom, a pioneer for LGBTQ+ rights who decades ago upset leaders in his own party … ",
    "url": "https://www.politico.com/news/2025/03/06/gavin-newsom-breaks-with-democrats-on-trans-athletes-in-sports-00215436"
  },
  {
    "text": "Trump considering major NATO policy shift  —  The president has discussed possibly favoring members of the alliance that spend a set percentage of their GDP on defense, sources told NBC News.  —  WASHINGTON — President Donald Trump is considering a major change to the U.S.' participation … ",
    "url": "https://www.nbcnews.com/politics/national-security/trump-considering-major-nato-policy-shift-rcna195089"
  },
  {
    "text": "Trump wants to dismantle the Education Department.  Here's what it does  —  President Donald Trump has said he wants his new education chief, Linda McMahon, to “put herself out of a job” and close the Education Department.  McMahon was confirmed by the Senate on Monday … ",
    "url": "https://apnews.com/article/education-department-trump-ab509ad5778497dfbd6d53b9eef692b5"
  },
  {
    "text": "‘People Are Going Silent’: Fearing Retribution, Trump Critics Muzzle Themselves … More than six weeks into the second Trump administration, there is a chill spreading over political debate in Washington and beyond.By Kenny Holston/The New York Times  —  The silence grows louder every day.",
    "url": "https://www.nytimes.com/2025/03/06/us/politics/trump-democracy.html?unlocked_article_code=1.104.bA78.onhUDRzXTMl3"
  },
  {
    "text": "A Sensitive Complex Housing a CIA Facility Was on GSA's List of US Properties for Sale  —  Plans to redevelop a Northern Virginia warehouse site have long been complicated by the area's worst-kept secret—the presence of a CIA facility.  The GSA put the site up for sale anyway.",
    "url": "https://www.wired.com/story/gsa-sale-cia-facility/"
  },
  {
    "text": "Second death reported in growing measles outbreak  —  The death of a New Mexico adult comes eight days after a 6-year-old child succumbed to the disease in Texas last week.  —  just now  —  An unvaccinated New Mexico adult who tested positive for measles has died, the second death … ",
    "url": "https://www.washingtonpost.com/health/2025/03/06/measles-death-outbreak-new-mexico/"
  },
  {
    "text": "‘She Needs to Shut Her Mouth’: Dad of Teen Cancer Survivor Whom Trump Honored Blasts Rachel Maddow  —  The father of DJ Daniel, the teenage cancer survivor whom President Trump honored on Tuesday, had harsh words for MSNBC host Rachel Maddow after she deemed the president “disgusting” for spotlighting the boy's fight with cancer.",
    "url": "https://www.breitbart.com/politics/2025/03/06/she-needs-to-shut-her-mouth-dad-of-teen-cancer-survivor-whom-trump-honored-blasts-rachel-maddow/"
  },
  {
    "text": "Marshals Escort DOGE Team Into African Aid Agency  —  A day earlier, U.S. African Development Foundation workers had refused entry to Department of Government Efficiency workers and the State Department official in charge of foreign aid.  —  Federal marshals on Thursday escorted officials … ",
    "url": "https://www.nytimes.com/2025/03/06/us/politics/doge-african-aid-agency.html"
  },
  {
    "text": "SpaceX Starship spirals out of control in second straight test flight failure  —  SpaceX's Starship spiraled out of control while in space during a test flight Thursday, marking the second launch in a row that the vehicle has run into a fatal problem on its way to orbit.",
    "url": "https://techcrunch.com/2025/03/06/spacex-starship-spirals-out-of-control-in-second-straight-test-flight-failure/"
  },
  {
    "text": "Scoop: State Dept. to use AI to revoke visas of foreign students who appear “pro-Hamas”  —  Secretary of State Marco Rubio is launching an AI-fueled “Catch and Revoke” effort to cancel the visas of foreign nationals who appear to support Hamas or other designated terror groups, senior State Department officials tell Axios.",
    "url": "https://www.axios.com/2025/03/06/state-department-ai-revoke-foreign-student-visas-hamas"
  },
  {
    "text": "Pentagon Cuts Threaten Programs That Secure Loose Nukes and Weapons of Mass Destruction  —  Documents obtained by WIRED show the US Department of Defense is considering cutting up to 75 percent of workers who stop the spread of chemical, biological, and nuclear weapons.",
    "url": "https://www.wired.com/story/pentagon-cuts-nukes-chemical-weapons-wmd/"
  },
  {
    "text": "He Gave a Name to What Many Christians Feel … Aaron Renn's “negative world” framework has inspired conferences, sermons, and essays.  —  In the two years since Aaron Renn moved to Carmel, Ind., he has become a kind of unofficial booster for the unusual suburb of Indianapolis.",
    "url": "https://www.nytimes.com/2025/03/06/us/aaron-renn-christianity-conservative-negative-world.html"
  },
  {
    "text": "FEMA's top lawyer placed on leave after less than one week in role  —  The Handbasket is 100% subscriber-funded.  If you want to support independent media during these dark times for democracy, become a paid subscriber today.  —  Video  —  Joshua Stanton had served as Acting Chief Counsel … ",
    "url": "https://www.thehandbasket.co/p/fema-lawyer-on-leave-josh-stanton"
  }
]