[
  {
    "text": "5 things to know about Mike Johnson, the GOP's latest House speaker nominee  —  Republicans in the House of Representatives picked Rep. Mike Johnson (La.), who serves as vice chairman of the House Republican Conference, as their fourth nominee for the speakership.",
    "url": "https://www.washingtonpost.com/politics/2023/10/25/who-is-mike-johnson-house-speaker/"
  },
  {
    "text": "GOP speaker nominee Mike Johnson played a key role in efforts to overturn the 2020 election  —  Johnson, the latest Republican nominee for House speaker, led an amicus brief in support of a Texas lawsuit seeking to overturn Joe Biden's 2020 victory in four battleground states.",
    "url": "https://www.nbcnews.com/politics/congress/mike-johnson-january-6-house-speaker-nominee-rcna122081"
  },
  {
    "text": "Live updates House expected to vote on Republican Mike Johnson as speaker  —  The House is expected to vote Wednesday on whether to install Rep. Mike Johnson (R-La.) as its speaker.  Late Tuesday, Johnson became the fourth Republican pick for the post since the ouster of Rep. Kevin McCarthy (R-Calif.) three weeks ago.",
    "url": "https://www.washingtonpost.com/politics/2023/10/25/house-speaker-vote/"
  },
  {
    "text": "New speaker of the House Mike Johnson once wrote in support of the criminalization of gay sex  —  Speaker of the House Mike Johnson has a history of harsh anti-gay language from his time as an attorney for a socially conservative legal group in the mid-2000s.",
    "url": "https://www.cnn.com/2023/10/25/politics/mike-johnson-gay-sex-criminalization-kfile/"
  },
  {
    "text": "Who is Mike Johnson?  Five things to know about the Republican nominee for speaker  —  The little-known Louisiana Republican says he's optimistic he'll win on the first ballot.  —  WASHINGTON — The newest Republican nominee for speaker, Rep. Mike Johnson, R-La., is slated for a vote Wednesday in the full House.",
    "url": "https://www.nbcnews.com/politics/congress/mike-johnson-house-speaker-republican-nominee-what-know-rcna122114"
  },
  {
    "text": "Playbook PM: The first MAGA speaker?  —  Here's one you probably didn't have on your 2023 bingo card: House Speaker MIKE JOHNSON.  —  After 22 days of speakerless chaos and division (as opposed to the normal chaos and division, which happens with a speaker), Johnson (R-La.) … ",
    "url": "https://www.politico.com/newsletters/playbook-pm/2023/10/25/the-first-maga-speaker-00123515"
  },
  {
    "text": "10/25/23 ☀️ Punchbowl News AM  —  We have a new GOP speaker nominee.  The fourth in three weeks.  And the second in just one day.  But this time may be different.  —  Late Tuesday night, the House Republican Conference tapped Rep. Mike Johnson (R-La.) as its speaker designate.",
    "url": "https://punchbowl.news/archive/102523-punchbowl-news-am/"
  },
  {
    "text": "Trump rages as former acolytes turn against him under legal heat  —  Donald Trump's wealth, power and fame acted like a magnet for new associates keen to enter his orbit.  But now, key figures who sought a share of his reflected glory are turning against him to save themselves.",
    "url": "https://www.cnn.com/2023/10/25/politics/trump-former-aides-turn-against-him/"
  },
  {
    "text": "Titanic Trump: Co-defendants flee sinking MAGA ship  —  The Titanic, then the world's largest ship, was considered unsinkable when it began its maiden voyage in 1912 — until it hit an iceberg and sank.  Donald Trump's presidential campaign is considered unstoppable by many today … ",
    "url": "https://thehill.com/opinion/judiciary/4274665-titanic-trump-co-defendants-flee-sinking-maga-ship/"
  },
  {
    "text": "Trump Hit With $10,000 Fine for Gag Order Violation After Judge Puts Ex-President on Witness Stand and Finds Him ‘Not Credible’  —  The former president claimed under oath that he had been referring to his former fixer Michael Cohen, who was on the witness stand throughout the day and the focal point … ",
    "url": "https://themessenger.com/politics/trumpg-gag-order-violation-judge-engoron"
  },
  {
    "text": "Justice Thomas's R.V. Loan Was Forgiven, Senate Inquiry Finds  —  The justice failed to repay much, perhaps all, of the $267,230 loan.  His benefactor wiped the slate clean, with ethical and potential tax consequences.  —  The terms of the private loan were as generous as they were clear … ",
    "url": "https://www.nytimes.com/2023/10/25/us/politics/clarence-thomas-rv-loan-senate-inquiry.html"
  },
  {
    "text": "Israel Agrees to Delay Invasion of Gaza So U.S. Can Rush Missile Defenses to Region  —  Israel has agreed, for now, to a request from the U.S. to get its air defenses in place to protect U.S. troops in the region ahead of an expected ground invasion of Gaza, U.S. and Israeli officials said.",
    "url": "https://www.wsj.com/livecoverage/israel-hamas-war-palestinians-news/card/israel-agrees-to-delay-invasion-of-gaza-so-u-s-can-rush-missile-defenses-to-region-wFU3kduhruPhm6e8OM7b?mod=followamazon"
  },
  {
    "text": "It's the culture war, stupid: How Republicans view the presidency  —  One of the central refrains of Donald Trump's campaign for the 2024 Republican presidential nomination — a refrain focused, justifiably, on a general election rematch against President Biden — is that the economy was more robust during his tenure in the White House.",
    "url": "https://www.washingtonpost.com/politics/2023/10/25/republicans-trump-economy-issues/"
  },
  {
    "text": "Voters soundly reject Gabrielle Hanson, other MAGA candidates in historic Franklin, Tennessee election  —  FRANKLIN, Tenn. (WTVF) — In perhaps the most bizarre race that this picturesque Middle Tennessee community has ever experienced, Franklin voters resoundingly rejected a candidate for mayor … ",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/franklin-politics/voters-soundly-reject-gabrielle-hanson-other-maga-candidates-in-historic-franklin-tennessee-election"
  },
  {
    "text": "12-year-old who emailed bomb threats to Maryland schools knew state law would prevent charges  —  A 12-year-old admitted to emailing seven bomb threats to schools, but state law says children younger than 13 can only face “crime of violence” charges.  —  A 12-year-old responsible … ",
    "url": "https://www.nbcnews.com/news/us-news/12-year-old-emailed-bomb-threats-maryland-schools-knew-state-law-preve-rcna122195"
  },
  {
    "text": "North Carolina lt. governor quoted Hitler in newly unearthed social media posts  —  Mark Robinson, the leading GOP candidate for governor, also likened the toppling of a Confederate statue to Kristallnacht, among other incendiary remarks  —  Mark Robinson, the lieutenant governor of North Carolina … ",
    "url": "https://jewishinsider.com/2023/10/mark-robinson-lieutenant-governor-north-carolina-republican-candidate-hitler/"
  },
  {
    "text": "Trump made crude Oval Office remark about fate of Kurds in Syria, book says  —  Ex-president interrupted briefing to ask why he should ‘give a fuck’ about Kurds amid US troop withdrawal, Adam Kinzinger writes  —  Donald Trump surprised his own national security adviser and a group … ",
    "url": "https://www.theguardian.com/books/2023/oct/25/trump-kurds-syria-adam-kinzinger-book"
  },
  {
    "text": "FBI received ‘criminal information’ from over 40 confidential sources on Joe Biden, Hunter, James: Grassley  —  Grassley alleges that the FBI and DOJ sought to shut down investigations into the Bidens  —  EXCLUSIVE: The FBI maintained more than 40 confidential human sources … ",
    "url": "https://www.foxnews.com/politics/fbi-received-criminal-information-40-confidential-sources-joe-biden-hunter-jim-grassley"
  }
]