[
  {
    "text": "The one thing US fears after Iranian president's death  —  Biden administration officials still fear Iran could blame the U.S. or Israel for the helicopter crash that killed Ebrahim Raisi.  —  The Biden administration is closely watching how Iran reacts to the sudden death of its president … ",
    "url": "https://www.politico.com/news/2024/05/20/ebrahim-raisi-iran-death-blame-biden-00158940"
  },
  {
    "text": "On the Death of Iranian President Raisi and Others in a Helicopter Crash  —  The United States expresses its official condolences for the death of Iranian President Ebrahim Raisi, Foreign Minister Amir-Abdollahian, and other members of their delegation in a helicopter crash in northwest Iran.",
    "url": "https://www.state.gov/on-the-death-of-iranian-president-raisi-and-others-in-a-helicopter-crash/"
  },
  {
    "text": "Iranian Women Celebrate the Death of President Raisi  —  The Butcher of Tehran is dead.  Good riddance.  —  Iranian President Ebrahim Raisi, Iranian's foreign minister, Hossein Amir-Abdollahian, and others were killed in a helicopter crash Sunday.  Raisi, 63, was thought to be the most likely successor … ",
    "url": "https://hotair.com/karen-townsend/2024/05/20/iranian-women-celebrate-the-death-of-president-president-raisi-n3788701"
  },
  {
    "text": "Statement of ICC Prosecutor Karim A.A. Khan KC: Applications for arrest warrants in the situation in the State of Palestine  —  Today I am filing applications for warrants of arrest before Pre-Trial Chamber I of the International Criminal Court in the Situation in the State of Palestine.",
    "url": "https://www.icc-cpi.int/news/statement-icc-prosecutor-karim-aa-khan-kc-applications-arrest-warrants-situation-state"
  },
  {
    "text": "Judge blasts Trump defense witness for ‘contemptuous’ staring, muttering at hush money trial … The judge presiding over the New York criminal hush money trial of Donald Trump had journalists removed from a courtroom Monday to blast a defense witness for his “contemptuous” reactions to the judge's rulings during his testimony.",
    "url": "https://www.cnbc.com/2024/05/20/trump-trial-end-looms-in-hush-money-case.html"
  },
  {
    "text": "Prosecution Rests Case in Trump Trial as Defense Targets Cohen Again  —  Michael D. Cohen, Donald J. Trump's former fixer, was the last witness called to the stand by prosecutors.  He made the hush-money payment that underpins the case, and the defense called his one-time legal adviser.",
    "url": "https://www.nytimes.com/live/2024/05/20/nyregion/trump-trial-hush-money"
  },
  {
    "text": "Scarlett Johansson says she is ‘shocked, angered’ over new ChatGPT voice  —  Lawyers for Scarlett Johansson are demanding that OpenAI disclose how it developed an AI personal assistant voice that the actress says sounds uncannily similar to her own.  —  Johansson's legal team has sent OpenAI … ",
    "url": "https://www.npr.org/2024/05/20/1252495087/openai-pulls-ai-voice-that-was-compared-to-scarlett-johansson-in-the-movie-her"
  },
  {
    "text": "FDIC Chairman Martin Gruenberg to Resign Following Report Detailing Sexual Harassment at Agency  —  Gruenberg plans to stay until successor is confirmed, avoiding scenario that would leave a Republican as acting chairman  —  Federal Deposit Insurance Corp. Chairman Martin Gruenberg bowed … ",
    "url": "https://www.wsj.com/politics/policy/fdic-chairman-martin-gruenberg-resignation-ab7fed5f"
  },
  {
    "text": "Trump's Social Media Company Posts Q1 Revenue of $770,500 and Net Loss of $327.6 Million  —  Trump Media and Technology Group, the company affiliated with former U.S. president Donald Trump that operates Truth Social, reported $770,500 in revenue for the first quarter of 2024 and a net loss of $327.6 million.",
    "url": "https://variety.com/2024/digital/news/trump-truth-social-media-q1-2024-revenue-net-loss-1236010937/"
  },
  {
    "text": "Cohen's bombshell admission could lead to hung jury, if not acquittal: expert  —  Former Trump attorney MIchael Cohen admitted Monday that he stole thousands from the Trump Organization  —  Former Trump attorney Michael Cohen's admission in court Monday that he stole from the Trump Organization … ",
    "url": "https://www.foxnews.com/politics/cohens-bombshell-admission-could-lead-hung-jury-if-not-acquittal-expert"
  },
  {
    "text": "New 9/11 Evidence Points to Deep Saudi Complicity  —  Two decades of U.S. policy appear to be rooted in a mistaken understanding of what happened that day.  —  For more than two decades, through two wars and domestic upheaval, the idea that al-Qaeda acted alone on 9/11 has been the basis of U.S. policy.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/05/september-11-attacks-saudi-arabia-lawsuit/678430/"
  },
  {
    "text": "Trump's social media account shares a campaign video with a headline about a ‘unified Reich’  —  A video posted to Donald Trump's account on his social media network Monday included references to a “unified Reich” among hypothetical news headlines if he wins the election in November.",
    "url": "https://apnews.com/article/trump-election-2024-rhetoric-germany-antisemitism-31002afb91b642c0314223d19e51f427"
  },
  {
    "text": "Supreme Court Justice Alito sold Bud Light stock, then bought Coors during boycott … Supreme Court Justice Samuel Alito sold shares of beer giant Anheuser-Busch InBev as conservatives were ditching the Bud Light brewer over its partnership with a transgender social media influencer.",
    "url": "https://www.cnbc.com/2024/05/20/supreme-court-alito-sold-bud-light-stock-bought-coors-boycott.html"
  },
  {
    "text": "Exclusive: Donald Trump foreign policy advisers met Israeli PM Netanyahu, source says  —  Three former U.S. foreign policy officials in Donald Trump's administration met with Prime Minister Benjamin Netanyahu and other public figures in Israel on Monday, according to a person with direct knowledge of the matter.",
    "url": "https://www.reuters.com/world/us/donald-trump-foreign-policy-advisers-met-israeli-pm-netanyahu-source-says-2024-05-20/"
  },
  {
    "text": "A Former Leader of the Hells Angels Motorcycle Gang Joins Trump in Court  —  Chuck Zito, who did time on drug conspiracy charges, has tried to recast his persona as a general-purpose tough guy around town.  —  An entourage of more than a dozen supporters who joined President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/05/20/nyregion/chuck-zito-hells-angels-trump-trial.html"
  },
  {
    "text": "The Polls Probably Aren't Lying  —  I feel the need to reinforce much of what Paul has said recently.  —  Joe Biden may very well lose this election and Donald Trump may very well be the 47th president of the United States.  —  It boggles my mind too.  —  Now, I grant you, polling is broken.",
    "url": "https://www.lawyersgunsmoneyblog.com/2024/05/the-polls-probably-arent-lying"
  },
  {
    "text": "Sources: Manchin is being encouraged to hop into governor's race against Morrisey  —  Sources close to Senator Joe Manchin, a mainstay of Democratic politics in West Virginia, say he is being encouraged to run for governor.  —  Two sources confirmed that the outreach comes from Republicans … ",
    "url": "https://wvmetronews.com/2024/05/20/sources-manchin-is-being-encouraged-to-hop-into-governors-race-against-morrisey/"
  },
  {
    "text": "Nevada abortion rights groups submit signatures to advance ballot measure  —  An amendment that would enshrine abortion rights in the Nevada constitution is now one step closer to making the November ballot.  —  A proposed amendment to enshrine access to abortion in Nevada's constitution … ",
    "url": "https://www.nbcnews.com/politics/nevada-abortion-rights-groups-signatures-ballot-measure-rcna146116"
  },
  {
    "text": "‘October 7 was a turning point’: Trump's pro-Israel fundraising accelerates.  —  ALMOST AS SOON AS PRESIDENT JOE BIDEN announced he would halt a weapons shipment to Israel, Steve Witkoff's iPhone started buzzing.  —  “Every one of my friends started calling and asking, ‘What can I do for Donald Trump?’”",
    "url": "https://www.thebulwark.com/p/october-7-turning-point-trump-fundraising"
  },
  {
    "text": "Robert F Kennedy Jr lists foreclosed New York home as voting address  —  Independent presidential candidate does not own the listed property and is not in public searches as one of its residents  —  Robert F Kennedy Jr has listed a home in foreclosure for non-payment as his voting address … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/20/robert-f-kennedy-jr-address"
  }
]