[
  {
    "text": "How the Special Counsel's Portrayal of Biden's Memory Compares With the Transcript  —  The special counsel, Robert K. Hur, accused the president last month of “significant” memory problems.  The interview transcript offers context to his report.  —  A transcript of a special counsel's hourslong interview … ",
    "url": "https://www.nytimes.com/2024/03/12/us/politics/hur-biden-memory-transcript.html"
  },
  {
    "text": "Full transcript of Biden's special counsel interview paints nuanced portrait  —  The president doesn't seem as absent-minded as Hur has made him out to be — and Hur doesn't appear as crass as Biden has portrayed him  —  President Biden was in the early stages of his interview … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/12/biden-hur-transcript-classified-documents/"
  },
  {
    "text": "News outlets that trumpeted Hur's story now discover “context” and “nuance” in transcript  —  Major news outlets that ran dozens of stories hyping then-special counsel Robert Hur's claim that President Joe Biden evinced a “poor memory” during their interview are now acknowledging that Hur's depiction … ",
    "url": "https://www.mediamatters.org/new-york-times/news-outlets-trumpeted-hurs-story-now-discover-context-and-nuance-transcript"
  },
  {
    "text": "Robert Hur stands by assessments on Biden's age during hearing  —  The special counsel who impugned the president's age and competence in his report on how Joe Biden handled classified documents will himself be up for questioning this week.  —  Photos",
    "url": "https://apnews.com/article/classified-documents-biden-hur-special-counsel-122526da6d89d7bf4d6ccfc54590312b"
  },
  {
    "text": "Trump's Corruption-Policy Nexus Comes Into Focus  —  Did the disgraced former one-term president sell Social Security and Medicare the same way he sold his position on TikTok and Bud Light?  —  ∙ Paid  —  It didn't escape the Biden campaign's notice that Donald Trump abruptly changed … ",
    "url": "https://www.offmessage.net/p/trump-corruption-policy-nexus"
  },
  {
    "text": "Republican group planning $50M campaign to block Trump from reelection  —  An anti-Trump Republican group is planning to spend $50 million in a campaign to stop the former president from winning a second term to the White House.  —  Republican Voters Against Trump plans to share testimonial videos … ",
    "url": "https://thehill.com/homenews/state-watch/4526513-republican-group-planning-50m-campaign-to-block-trump-from-reelection/"
  },
  {
    "text": "Why Trump Might Cut Social Security and Medicare in a Second Term … This week, CNBC host Joe Kernan prodded Donald Trump to support cuts to social-insurance programs.  “Have you changed your outlook on how to handle entitlements — Social Security, Medicare, Medicaid — Mr. President?” he asked.",
    "url": "https://nymag.com/intelligencer/article/why-second-term-trump-might-cut-social-security-and-medicare.html"
  },
  {
    "text": "Aileen Cannon Continues To Make A Mess Of The MAL Case  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  —  What Cannon Hath Wrought  —  Two developments yesterday that show what an absolute mess U.S. District Judge Aileen Cannon is making of the Mar-a-Lago case.",
    "url": "https://morningmemo.talkingpointsmemo.com/p/aileen-cannon-continues-to-make-a"
  },
  {
    "text": "There's new reason to think Trump still has classified documents  —  The central reason that Donald Trump was indicted for retaining documents marked as classified but President Biden was not is that Trump tried to retain the documents once the government sought their return.",
    "url": "https://www.washingtonpost.com/politics/2024/03/12/theres-new-reason-think-trump-still-has-classified-documents/"
  },
  {
    "text": "It Sure Seems Like the Courts Have Placed Christianity Above Other Faiths  —  “Religious freedom” is having a moment in federal courts.  One of the big successful goals of the conservative legal movement was that religious freedom would be advanced in a way that it supposedly had not been before.",
    "url": "https://slate.com/news-and-politics/2024/03/supreme-court-and-religion-judges-christianity.html"
  },
  {
    "text": "Trump asked Elon Musk if he wanted to buy Truth Social  —  The idea went nowhere, but the former president and the billionaire X owner have continued to communicate more than was previously known  —  Former president Donald Trump asked Elon Musk last summer whether the billionaire industrialist … ",
    "url": "https://www.washingtonpost.com/technology/2024/03/12/trump-musk-truth-social-sale/"
  },
  {
    "text": "Bloodbath at the RNC as Team Trump Takes Over  —  There's a new team in town and the RNC is experiencing an overhaul.  Trump has installed his leadership team.  Monday the process of letting about 60 staffers go began.  —  The RNC staffers being let go are from the political, communications, and data departments.",
    "url": "https://hotair.com/karen-townsend/2024/03/12/bloodbath-at-the-rnc-as-team-trump-takes-over-n3784513"
  },
  {
    "text": "Boeing whistleblower found dead in US  —  Prior to his death, whistleblower John Barnett was testifying against Boeing over concerns about standards.",
    "url": "https://www.bbc.com/news/business-68534703"
  },
  {
    "text": "Donald Trump Stung as New Poll Shows How Unpopular He Is  —  Donald Trump continues to have a low favorability score among Americans, new polling shows, despite being the likely Republican nominee after winning the lion's share of primaries and seeing off his only remaining rival.",
    "url": "https://www.newsweek.com/donald-trump-unpopular-polls-2024-election-1877870"
  },
  {
    "text": "Trump's newfound opposition to a TikTok ban isn't swaying Republicans  —  The House is moving forward with a Wednesday vote on legislation that would ban TikTok in the U.S. unless its China-based owner divests the popular app.  —  WASHINGTON — Former President Trump reversed course and now opposes a ban on social media giant TikTok.",
    "url": "https://www.nbcnews.com/politics/congress/trumps-newfound-opposition-tiktok-ban-isnt-swaying-republicans-rcna142796"
  },
  {
    "text": "Republican women don't care about rape victims  —  Forget the theatrics of Katie Britt, Nancy Mace and Marjorie Taylor Greene — supporting Trump means backing abusers  —  It can be confusing, tracking the multiple lawsuits journalist E. Jean Carroll filed against Donald Trump … ",
    "url": "https://www.salon.com/2024/03/12/women-dont-care-about-rape-victims/"
  },
  {
    "text": "Republicans Can't Restructure North Carolina Election Boards, Judges Rule  —  A panel made up of two Republicans and one Democrat ruled that a law passed last year to change the makeup of election boards is unconstitutional.  —  A bipartisan panel of three judges in North Carolina ruled … ",
    "url": "https://www.nytimes.com/2024/03/12/us/politics/north-carolina-election-boards.html"
  },
  {
    "text": "US sending Ukraine first weapons package since December  —  The Biden administration on Tuesday announced it will send Ukraine a new emergency military aid package worth $300 million, the first such weapons tranche Washington has sent an increasingly desperate Kyiv since late December.",
    "url": "https://thehill.com/policy/international/4526714-us-sending-ukraine-500-million-weapons-package/"
  },
  {
    "text": "Diplomatic source to ‘Post’: Gaza maritime route was Netanyahu's idea - exclusive  —  According to the source, on October 22, two weeks following the war's outbreak, Netanyahu discussed with President Biden the concept of “delivering humanitarian aid to Gaza via the sea”",
    "url": "https://www.jpost.com/international/article-791239"
  }
]