[
  {
    "text": "Trump backs out of ‘60 Minutes’ primetime interview, CBS says  —  New York CNN  —  Former President Donald Trump has backed out of a previously scheduled interview with “60 Minutes,” the most-watched newsmagazine in the United States, CBS News said Tuesday evening.",
    "url": "https://www.cnn.com/2024/10/01/media/trump-backs-out-60-minutes-interview-cbs/"
  },
  {
    "text": "Harris launches a new ad that hits Trump's age in criticizing Vance  —  The ad is timed to begin airing with the vice presidential debate on Tuesday.  —  WASHINGTON — Vice President Kamala Harris' campaign is launching a new digital ad Tuesday slamming Republican vice presidential nominee … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-launches-new-ad-hits-trumps-age-criticizing-vance-rcna173526"
  },
  {
    "text": "Republicans Will Secretly Cheer Walz during Debate: Friend  —  SILENTLY ANTI-TRUMP  —  A congressman who served with Tim Walz predicts even more will come out of the woodwork.  —  Deputy Washington Bureau Chief  —  Tim Walz's former roommate and fellow lawmaker claims there's a secret cabal … ",
    "url": "https://www.thedailybeast.com/republicans-will-secretly-cheer-walz-during-debate-friend"
  },
  {
    "text": "Trump rejects “60 Minutes” interview; Harris accepts … Steven Cheung, the Trump campaign communications director, told Axios:  — “There were discussions but nothing was ever scheduled or locked in. … - “For over half a century, 60 Minutes has invited the Democratic and Republican tickets … ",
    "url": "https://www.axios.com/2024/10/01/trump-harris-60-minutes-interview"
  },
  {
    "text": "Olivia Nuzzi accuses ex-fiance of orchestrating blackmail campaign amid RFK relationship  —  New York magazine writer Olivia Nuzzi is publicly accusing her ex-fiancé Ryan Lizza, a prominent political journalist with Politico, of orchestrating a harassment and blackmail campaign … ",
    "url": "https://www.cnn.com/2024/10/01/media/olivia-nuzzi-ryan-lizza-rfk-relationship/"
  },
  {
    "text": "Cook Political Report shifts Texas Senate race toward Democrats  —  The Cook Political Report on Tuesday shifted Texas's Senate race from “likely Republican” to “lean Republican,” signaling momentum for Rep. Colin Allred's (D-Texas) challenge against incumbent Sen. Ted Cruz (R-Texas) in the red state.",
    "url": "https://thehill.com/homenews/campaign/4910340-texas-senate-cook-political-report/"
  },
  {
    "text": "Live Updates: Iran Launches About 180 Ballistic Missiles at Israel  —  Many of the missiles were intercepted with the help of the United States, but some fell in central and southern Israel, the Israeli military said.  Israel vowed to retaliate.  —  Raja Abdulrahim/The New York Times",
    "url": "https://www.nytimes.com/live/2024/10/01/world/israel-lebanon-hezbollah?unlocked_article_code=1.O04.WhtG.h_OxzNa9i6I_&smid=url-share"
  },
  {
    "text": "What Democrats Don't Understand About J. D. Vance  —  If you show up to a J. D. Vance campaign event and ask some of the red-hat-wearing attendees whether they're fans of the senator from Ohio, they will say: No, they are fans of Donald Trump.  —  Yet Vance is better than his ticketmate … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/vance-fans-trump-debate/680091/"
  },
  {
    "text": "Swing State Poll 2024: Georgia, North Carolina: Trump Ahead In GA, On Upside Of Tight Race In NC, Quinnipiac University Poll Finds; NC Governor Race: More Voters Say Robinson Should Stay In Race  —  mail_outline  —  GEORGIA: Trump 50%, Harris 44%, other candidates 3%",
    "url": "https://poll.qu.edu/poll-release?releaseid=3909"
  },
  {
    "text": "Tim Walz speaks loudly and carries a big schtick  —  But the vice-presidential pick best known for calling Donald Trump and JD Vance “weird” is a surprisingly risk-averse campaigner.  —  Tim Walz, who became Kamala Harris's vice-presidential pick partially on the strength of a viral … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/01/walz-trail-press-access-vance/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3NzU1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI5MTM3NTk5LCJpYXQiOjE3Mjc3NTUyMDAsImp0aSI6IjcwMGViODc5LWEzYTUtNGU4Ni1hOGE2LWFiNzYwNmVkMGNhZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEwLzAxL3dhbHotdHJhaWwtcHJlc3MtYWNjZXNzLXZhbmNlLyJ9.fPAgQh4Vd6HfQ9j54Iko0ey-hgz1VrI03JAQJn3fKy0&itid=gfta"
  },
  {
    "text": "Taylor Lorenz Exits Washington Post to Launch ‘User Mag’ on Substack (Exclusive)  —  Lorenz, who is leaving the newspaper to launch the publication, says that it will “cover technology from the user side,” in contrast to traditional coverage of social media.",
    "url": "https://www.hollywoodreporter.com/business/digital/taylor-lorenz-leaves-washington-post-launch-user-mag-substack-1236011888/"
  },
  {
    "text": "John Amos, ‘Good Times’ Dad and ‘Roots’ Actor, Dies at 84  —  John Amos, the star of “Good Times,” “Roots” and more, died on Aug. 21 in Los Angeles of natural causes, his representative confirmed to Variety on Tuesday.  He was 84.  —  “It is with heartfelt sadness that I share … ",
    "url": "https://variety.com/2024/tv/obituaries-people-news/john-amos-dead-good-times-roots-1236161810/"
  },
  {
    "text": "Biden Fumes After Reporter Parrots Trump Lies on Hurricane Helene  —  President Biden isn't happy with Donald Trump's lies about him ignoring the plight of hurricane victims.  —  Speaking to reporters Thursday night along with North Carolina Governor Roy Cooper, who was present via teleconference … ",
    "url": "https://newrepublic.com/post/186557/biden-fumes-trump-hurricane-helene-lies"
  },
  {
    "text": "If Helene affects voting, Trump may pay the price  —  Nearly a quarter of 2020 Trump voters in Florida, Georgia and the Carolinas live in counties declared federal disaster areas.  —  Hurricane Helene is gone, fragmented into large cloud formations over the Eastern United States that folded into the rest of the country's weather.",
    "url": "https://www.washingtonpost.com/politics/2024/10/01/if-helene-affects-voting-trump-may-pay-price/"
  },
  {
    "text": "24 hours of MAGA misinformation  —  A small sampling of the inundation of false and dubious claims flowing from Donald Trump and his allies.  —  We're now in the final full month of the 2024 campaign, and that means politicians and their allies are frantically seeking votes for their side.",
    "url": "https://www.washingtonpost.com/politics/2024/10/01/trump-maga-misinformation/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3NzU1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI5MTM3NTk5LCJpYXQiOjE3Mjc3NTUyMDAsImp0aSI6ImM5YjBhMDA4LTczNzktNDg5YS05NTlhLWVkZDk3N2U3NmEyOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEwLzAxL3RydW1wLW1hZ2EtbWlzaW5mb3JtYXRpb24vIn0.702quIYJhMAM_2yIThE9dGrDWTYUHnQEhDUDufzP9bY&itid=gfta"
  },
  {
    "text": "Paypal Opted You Into Sharing Data Without Your Knowledge  —  PayPal quietly opted users into sharing data with third parties for “personalized shopping experiences,” according to multiple complaints on social media and 404 Media's own tests.  —  “Starting early summer 2025 … ",
    "url": "https://www.404media.co/paypal-personalized-shopping-opt-out/"
  },
  {
    "text": "Apple quietly deletes nearly a hundred VPNs that allowed Russians to get around censorship  —  The multinational has removed dozens of apps, even though the Kremlin's censorship body did not order the move.  These services, half-permitted by the government, enable people in Russia to access social networks and independent media",
    "url": "https://english.elpais.com/international/2024-09-30/apple-quietly-deletes-nearly-a-hundred-vpns-that-allowed-russians-to-get-around-censorship.html"
  },
  {
    "text": "Trump's Team Is Trying to Stop — Or Heavily Redact — the Release of Jack Smith's Election Fraud Report  —  The former president's lawyers are trying to get ahead of what could be his campaign's October surprise.  — Copy  —  Donald Trump's lawyers are scrambling to get ahead … ",
    "url": "https://www.notus.org/trump-team-jack-smith-election-fraud-report-redaction"
  },
  {
    "text": "Arizona Voter Data Error Affected 218,000 Voters  —  The administrative error in Arizona's elections systems that briefly risked the voting eligibility of 97,000 residents actually affected twice that number of voters.  —  According to Arizona Secretary of State Adrian Fontes (D) … ",
    "url": "https://www.democracydocket.com/news-alerts/arizona-data-error-could-disenfranchise-nearly-100000-voters/"
  },
  {
    "text": "Have Government Employees Mentioned Climate Change, Voting or Gender Identity?  The Heritage Foundation Wants to Know.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.",
    "url": "https://www.propublica.org/article/have-government-employees-mentioned-climate-change-voting-or-gender-identity-the-heritage-foundation-wants-to-know"
  },
  {
    "text": "America's Strategy of Renewal  —  Rebuilding Leadership for a New World  —  A fierce competition is underway to define a new age in international affairs.  A small number of countries—principally Russia, with the partnership of Iran and North Korea, as well as China … ",
    "url": "https://www.foreignaffairs.com/united-states/antony-blinken-americas-strategy-renewal-leadership-new-world"
  },
  {
    "text": "Video Out of North Carolina After Hurricane Helene Is Tough Viewing  —  Meanwhile, eighty-two Republicans voted to shut down the government as a catastrophic storm prepared to devastate a quarter of the country.  —  The video evidence from western North Carolina looks like something Matthew Brady would have sent back from Antietam.",
    "url": "https://www.esquire.com/news-politics/politics/a62449008/hurricane-helene-north-carolina-impact/"
  },
  {
    "text": "Walz's claim that he was in Hong Kong during Tiananmen Square protests undercut by unearthed newspaper reports  —  Newly unearthed reports contradict previous claims made by Minnesota Gov. Tim Walz about his travel to China, including a claim that the Democratic vice presidential nominee … ",
    "url": "https://www.cnn.com/2024/10/01/politics/tim-walz-china-tiananmen-square/"
  },
  {
    "text": "Philly-Area Republican Couple Threatened After Filming Kamala Harris Ad  —  The normally idyllic lives of these Main Line farmers changed after MSNBC spotlighted the commercial.  —  Pennsylvania farmers Bob Lange and wife Kristina Chadwick Lange are lifelong Republicans.",
    "url": "https://www.phillymag.com/news/2024/09/30/bob-lange-kristina-kamala-harris/"
  },
  {
    "text": "JD Vance Can't Be Trusted to Protect the Constitution  —  BEFORE TONIGHT'S VICE PRESIDENTIAL DEBATE, we should recall why JD Vance will be on the stage.  Donald Trump didn't pick Vance as his running mate because the junior senator from Ohio had any significant experience in government.",
    "url": "https://www.thebulwark.com/p/jd-vance-cant-be-trusted-to-protect-the-constitution"
  },
  {
    "text": "Georgia judge signals a need to clarify ‘vague’ new election certification rule  —  A Georgia judge signaled Tuesday that he sees a need to bring clarity to the meaning of a “vague” new election certification rule approved by Donald Trump allies that critics say will inject chaos into the battleground state after Election Day.",
    "url": "https://www.cnn.com/2024/10/01/politics/georgia-judge-signals-a-need-to-clarify-vague-new-election-certification-rule/"
  }
]