[
  {
    "text": "Jeff Flake endorses Kamala Harris for president: ‘I know of her character’  —  Former Republican Sen. Jeff Flake is endorsing Vice President Kamala Harris because of his conservative values — not in spite of them — he said Saturday in an interview announcing his support for the Democratic presidential nominee.",
    "url": "https://www.azcentral.com/story/news/politics/elections/2024/09/29/jeff-flake-endorses-kamala-harris-for-president/75421304007/"
  },
  {
    "text": "Harris team quietly courts big-name GOP endorsements  —  Anti-Trump conservatives are serving as emissaries to bring prominent Republicans on board, hoping to influence rank-and-file voters.  —  As former congresswoman Liz Cheney repeatedly and publicly spoke out over the last year … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/29/harris-campaign-courts-prominent-republican-endorsements/"
  },
  {
    "text": "Kamala Harris for President  —  The Vice-President has displayed the basic values and political skills that would enable her to help end, once and for all, a poisonous era defined by Donald Trump.  —  At the 1940 Republican National Convention, in Philadelphia, an uneasy affair marked by bomb scares … ",
    "url": "https://www.newyorker.com/magazine/2024/10/07/kamala-harris-for-president-endorsement?currentPage=all"
  },
  {
    "text": "J. D. Vance's Thin Skin Makes Him Vulnerable  —  Kamala Harris used Donald Trump's psychic weaknesses against him in their televised debate on September 10.  Can Governor Tim Walz do the same to Senator J. D. Vance when they meet on Tuesday?  —  Watch what happens when Vance is asked … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/tim-walz-debate-jd-vance/680060/"
  },
  {
    "text": "Far right in Austria heads for unprecedented election victory  —  Austria's far-right Freedom Party is heading for an unprecedented general election victory under leader Herbert Kickl, projections say.  —  The projections, based on initial results, give Kickl's party 29.2% … ",
    "url": "https://www.bbc.com/news/articles/c8rdygy5888o"
  },
  {
    "text": "How Project 2025 Became Toxic and Exposed the Right's Toxicity  —  On September 22, NBC News published its latest national poll.  The headline results: Kamala Harris's favorability has soared since July and she now also leads Trump head-to-head, a significant shift compared to two months ago … ",
    "url": "https://thomaszimmer.substack.com/p/how-project-2025-became-toxic-and"
  },
  {
    "text": "Kamala's Attempted Troll of Trump at Alabama Game Fails Miserably, While Trump Is Cheered Wildly  —  Kamala Harris told the media she was going to try to troll former President Donald Trump at the Alabama-Georgia game on Saturday.  —  But the effort failed miserably and just showed how desperate she was.",
    "url": "https://redstate.com/nick-arama/2024/09/29/kamalas-attempted-troll-of-trump-fails-miserably-shows-how-desperate-she-is-n2179911"
  },
  {
    "text": "Fact check: To attack Harris, Trump falsely describes new stats on immigrants and homicide  —  Former President Donald Trump is wildly distorting new statistics on immigration and crime to attack Vice President Kamala Harris.  —  Trump falsely claimed Friday and Saturday that the statistics … ",
    "url": "https://www.cnn.com/2024/09/29/politics/fact-check-trump-harris-immigrants-homicide/"
  },
  {
    "text": "Statement From Pentagon Press Secretary Maj. Gen. Pat Ryder  —  Secretary Austin has been receiving updates from and providing guidance to his team throughout the weekend on the latest developments in the Middle East.  He and DoD leaders remain focused on the protection of U.S. citizens … ",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3920303/statement-from-pentagon-press-secretary-maj-gen-pat-ryder/"
  },
  {
    "text": "Vance not allowed to campaign in Pittsburgh culinary landmark — despite Harris event at same restaurant chain  —  The vice presidential nominee met supporters outside instead after the restaurant said it wasn't told in advance about the campaign stop  —  Vice presidential candidate … ",
    "url": "https://www.foxnews.com/politics/vance-not-allowed-campaign-pittsburgh-culinary-landmark-despite-harris-event-same-restaurant-chain"
  },
  {
    "text": "“You've been a good friend”: Biden honors Jimmy Carter ahead of 100th birthday … - In a message endorsing Biden's 2020 presidential campaign, Carter called the president his “first and most effective supporter in the Senate” and “my loyal and dedicated friend.”",
    "url": "https://www.axios.com/2024/09/29/jimmy-carter-joe-biden-100th-birthday"
  },
  {
    "text": "Harris's tax cut plan shows how startup costs cripple entrepreneurs  —  Kamala Harris announced her latest economic proposal last week — an increase in the maximum up-front tax deduction for new business startups to $50,000.  —  This higher deduction is intended to offset the costs … ",
    "url": "https://thehill.com/opinion/finance/4903729-kamala-harris-tax-deduction-startups/"
  },
  {
    "text": "Poll: Democrats' advantage with Latino voters continues to shrink  —  Harris leads Trump nationally among Latinos, 54% to 40%, but Democrats' edge is at its lowest level in the last four presidential cycles.  —  Vice President Kamala Harris is leading former President Donald Trump among Latino voters.",
    "url": "https://www.nbcnews.com/politics/2024-election/poll-harris-trump-democrats-advantage-latino-voters-continues-shrink-rcna172686"
  },
  {
    "text": "Elon Musk is one of illegal immigration's harshest critics.  He once described his past immigration status as a ‘gray area’  —  The world's richest man stood steps away from the US-Mexico border, adjusting the brim of his black cowboy hat.  —  “As an immigrant to the United States … ",
    "url": "https://www.cnn.com/2024/09/29/us/elon-musk-immigration-gray-area-cec/"
  },
  {
    "text": "Wealthy GOP Candidates Face Rough Homecomings  —  Senate hopeful David McCormick says he is a seventh-generation Pennsylvanian, while Democrats call him ‘Connecticut Dave’  —  SCRANTON, Pa.— David McCormick faces several challenges in flipping a Senate seat in Pennsylvania.",
    "url": "https://www.wsj.com/politics/elections/dave-mccormick-pennsylvania-senate-race-election-2024-d9c032f6?st=YfoGJ6&reflink=article_copyURL_share"
  }
]