[
  {
    "text": "When the New York Times lost its way  —  America's media should do more to equip readers to think for themselves  —  Are we truly so precious?  \" Dean Baquet, the executive editor of the New York Times, asked me one Wednesday evening in June 2020.  I was the editorial-page editor of the Times … ",
    "url": "https://www.economist.com/1843/2023/12/14/when-the-new-york-times-lost-its-way"
  },
  {
    "text": "Republicans Tap Israeli Military Veteran to Run for Santos's Seat  —  Party leaders believe Mazi Melesa Pilip has the potential to be a breakout star.  But she has little political experience and her policy views are largely unknown.  —  Republicans battling to hold onto the New York House seat vacated … ",
    "url": "https://www.nytimes.com/2023/12/14/nyregion/pilip-santos-special-election.html"
  },
  {
    "text": "Playbook: The politics that could make or break a border deal  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WHAT YOUR MEDIA FRIENDS ARE TEXTING ABOUT — The Economist's James Bennet is out with a very buzzy, nearly 17,000-word piece on the culture war roiling … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/12/14/the-politics-that-could-make-or-break-a-border-deal-00131713"
  },
  {
    "text": "House sends annual defense policy bill to Biden's desk  —  The House passed the annual Defense authorization bill Thursday, sending the $886 billion Pentagon policy and funding package to President Biden's desk.  —  The vote was 310-118, with 45 Democrats and 73 Republicans opposing the measure.",
    "url": "https://thehill.com/policy/defense/4359994-ndaa-defense-policy-bill-house-passes/"
  },
  {
    "text": "Trump Got a Big Sign the Supreme Court Doesn't Have His Back  —  Donald Trump may have handpicked three members of the Supreme Court's conservative majority.  That doesn't mean they are doing him any favors.  —  Former President Donald Trump has tried every legal trick in the book to postpone … ",
    "url": "https://www.vice.com/en/article/ak3qv4/trump-got-a-big-sign-the-supreme-court-doesnt-have-his-back"
  },
  {
    "text": "‘He has no right to offer defenseless civil servants up to a virtual mob’  —  Attorneys for Ruby Freeman and Shaye Moss are urging the eight-member panel to award the women $24 million apiece for Rudy Giuliani's defamation against them.  —  A Washington, D.C. jury is set to begin considering … ",
    "url": "https://www.politico.com/news/2023/12/14/rudy-giuliani-jury-georgia-election-00131796"
  },
  {
    "text": "Giuliani's words used against him in poll worker defamation trial  —  Rudy Giuliani repeatedly promised that he would use his defamation trial to explain why he falsely claimed two Georgia poll workers helped steal the 2020 election.  Instead, he was silent in court.",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/12/14/giuliani-defamation-trial-testimony-georgia-election-workers/"
  },
  {
    "text": "Morning Consult |  Bloomberg News Partnership Survey: Biden's and Trump's Ballot Performance as of Early December 2023  —  Trump leads Biden in all seven swing states, regardless of whether or not third party candidates are listed. … This survey, which identifies key issues in the 2024 election … ",
    "url": "https://pro.morningconsult.com/articles/2024-swing-states-survey-key-issues-ballot-performance-december-2023"
  },
  {
    "text": "Election 2024: Trump Opens 10-Point Lead  —  Former President Donald Trump now has a double-digit lead for 2024, as support for re-electing President Joe Biden has faded in the past month.  —  The latest Rasmussen Reports national telephone and online survey finds that … ",
    "url": "https://www.rasmussenreports.com/public_content/politics/public_surveys/election_2024_trump_opens_10_point_lead"
  },
  {
    "text": "Israel-Hamas War  —  Washington Urges Israel to Scale Back Ground War in Gaza by Year's End … U.S. wants Israel to scale down its ground campaign in Gaza within weeks.  —  The Biden administration has told the Israeli government that it wants Israel to end its large-scale ground campaign … ",
    "url": "https://www.nytimes.com/live/2023/12/14/world/israel-hamas-war-gaza-news"
  },
  {
    "text": "Kamala Harris pushes White House to be more sympathetic toward Palestinians  —  Her response to the Israel-Hamas war underscores how Democrats are walking a fine line between pro-Israel and pro-Palestinian constituencies.  —  Vice President Kamala Harris has been telling colleagues … ",
    "url": "https://www.politico.com/news/2023/12/14/kamala-harris-gaza-palestinians-00131633"
  },
  {
    "text": "Liz Cheney's Checkered History  —  Deep in her new book, “Oath and Honor,” Liz Cheney points out that the likeness of Clio, the Greek muse of history, is found in the Capitol's National Statuary Hall.  “Clio is depicted riding in the chariot of time, making notes in the book in her hand,” … ",
    "url": "https://www.nytimes.com/2023/12/14/opinion/trump-liz-cheney-memoir.html"
  },
  {
    "text": "The Republican leading the probe of Hunter Biden has his own shell company and complicated friends  —  Rep. James Comer, a multimillionaire farmer, boasts of being one of the largest landholders near his rural Kentucky hometown, and he has meticulously documented nearly all of his landholdings … ",
    "url": "https://apnews.com/article/comer-shell-company-biden-hunter-impeachment-6fde28673d5dced307b95cab8425c7ba"
  },
  {
    "text": "Kevin McCarthy Bids Farewell on House Floor: ‘I Loved Every Single Day’  —  McCarthy encouraged fellow lawmakers to never make decisions out of fear and said he thinks the party's future is bright  —  Former Speaker Rep. Kevin McCarthy, R-Calif., on Thursday delivered his final remarks … ",
    "url": "https://themessenger.com/politics/kevin-mccarthy-bids-farewell-on-house-floor-i-loved-every-single-day"
  },
  {
    "text": "Vibes, the Economy and the Election  —  Recent positive news may put two theories on economic disenchantment to the test.  —  A Federal Reserve announcement about the future of the funds rate is not the sort of news that would typically factor into analysis of public opinion and the economy.",
    "url": "https://www.nytimes.com/2023/12/14/upshot/economy-vibes-election-biden.html"
  },
  {
    "text": "Senate to return next week in hopes of pre-Christmas border deal  —  The Senate will return Monday in the hopes of getting a border deal to unlock aid for Ukraine before Christmas.  —  Senate Majority Leader Chuck Schumer (D-N.Y.) decided Thursday to keep members in town next week … ",
    "url": "https://thehill.com/homenews/senate/4360737-border-deal-senate-recess/"
  },
  {
    "text": "Jan. 6 rioter with ‘Foxmania’ pleads guilty to felony Capitol attack charge  —  “You want war?”  Anthony Alexander Antonio shouted during the Jan. 6 attack.  “We got war. 1776 all over again.”  —  WASHINGTON — A Jan. 6 defendant whose attorney said was infected with “Foxmania” … ",
    "url": "https://www.nbcnews.com/politics/justice-department/jan-6-rioter-foxmania-pleads-guilty-felony-capitol-attack-charge-rcna129621"
  },
  {
    "text": "Why Hunter Biden went public: “I need to call out their lies”  —  After mostly lying low for years, Hunter Biden is publicly hitting back at Republicans — a more aggressive approach he believes will help him and President Biden, according to people familiar with his team's thinking.",
    "url": "https://www.axios.com/2023/12/14/hunter-biden-impeachment-president-republicans"
  }
]