[
  {
    "text": "Vance defends Trump over former president's false claims about Harris' racial identity  —  Republican vice presidential nominee JD Vance on Thursday defended Donald Trump's false comments about Kamala Harris' racial identity, saying that it was “totally reasonable” for his ticket mate to describe … ",
    "url": "https://www.cnn.com/2024/08/01/politics/chameleon-trump-vance-harris-ethnicity/"
  },
  {
    "text": "Trump and his allies had a plan for how to hit Harris.  Then he opened his mouth.  —  “He's grasping around,” said Chuck Coughlin, an Arizona-based political strategist.  —  Scrambling to put an end to Kamala Harris' ascent, Donald Trump's campaign and outside allies came up with a plan … ",
    "url": "https://www.politico.com/news/2024/08/01/donald-trump-kamala-harris-attack-plan-00172178"
  },
  {
    "text": "WSJ Reporter Evan Gershkovich Is Free  —  Release of 32-year-old American from Russia secured as part of largest East-West prisoner swap since Cold War  —  Russia freed wrongly convicted Wall Street Journal reporter Evan Gershkovich as part of the largest and most complex East-West prisoner swap since … ",
    "url": "https://www.wsj.com/world/russia/evan-gershkovich-free-cde745b3?st=1ik3ftlbeb6izcd&reflink=article_copyURL_share"
  },
  {
    "text": "Putin Wanted His Hit Man Back.  A Mother Wanted Her Journalist Son to Come Home.  —  The secret negotiations to free The Wall Street Journal's Evan Gershkovich unfolded on three continents, involving spy agencies, billionaires, political power players and his fiercest advocate—his mom.",
    "url": "https://www.wsj.com/world/europe/evan-gershkovich-prisoner-exchange-ccb39ad3?st=4is8gx68wgvk2ar"
  },
  {
    "text": "Vance: Prisoners coming home 'a testament to Trump's strength'  —  Sen. JD Vance (R-Ohio) suggested on Thursday that fear of a second Trump administration motivated Russia to agree to the historic prisoner swap with the U.S., in an interview with CNN.  —  Vance, former President Trump's … ",
    "url": "https://thehill.com/homenews/campaign/4806049-vance-trump-prisoner-swap/"
  },
  {
    "text": "US Reporter to Be Freed by Russia in Major Prisoner Swap  — Wall Street Journal reporter Gershkovich to be let go in deal  — US, Russia had held extensive talks on prisoner exchange  —  Russia is releasing Wall Street Journal reporter Evan Gershkovich and former US Marine Paul Whelan … ",
    "url": "https://www.bloomberg.com/news/articles/2024-08-01/us-reporter-released-by-russia-in-multi-country-prisoner-swap"
  },
  {
    "text": "Harris campaign has met with 6 potential VP picks as the selection process nears its end  —  The top contenders include governors, a senator in a key battleground state and a member of President Joe Biden's Cabinet.  —  WASHINGTON — Vice President Kamala Harris' campaign has met … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-campaign-met-6-potential-vp-picks-selection-process-nears-end-rcna164706"
  },
  {
    "text": "Pennsylvania Gov. Shapiro cancels Hamptons trip, days before expected Harris VP reveal … Pennsylvania Gov. Josh Shapiro has cancelled a trip to the ritzy New York beach enclave of the Hamptons, as he's being considered to be Vice President Kamala Harris' running mate, according to a person with direct knowledge of the matter.",
    "url": "https://www.cnbc.com/2024/08/01/shapiro-harris-vp-reveal-plans.html"
  },
  {
    "text": "The presidential election is a toss-up  —  Kamala Harris is giving Democrats the race that Joe Biden couldn't.  —  I don't want to get in the habit of making a huge ruckus every time the election model passes a certain arbitrary probabilistic threshold.  There are still a very long 96 days … ",
    "url": "https://www.natesilver.net/p/the-presidential-election-is-a-toss"
  },
  {
    "text": "Trump co-defendant Jeff Clark barred from practicing law after fake elector charges  —  The Washington D.C. Bar Association has suspended former acting Assistant Attorney General Jeffrey Clark from practicing law for two years, Politico's Kyle Cheney reported Thursday.",
    "url": "https://www.rawstory.com/jeffrey-clark-bar-association-2668860887/"
  },
  {
    "text": "How Hamas Leader Ismail Haniyeh Was Killed in Iran … A photograph circulating on Telegram and among Iranian officials on Wednesday showed a damaged building in northern Tehran.Provided to The New York Times  —  Ismail Haniyeh, a top leader of Hamas, was assassinated on Wednesday … ",
    "url": "https://www.nytimes.com/2024/08/01/world/middleeast/how-hamas-leader-haniyeh-killed-iran-bomb.html?unlocked_article_code=1._k0.5p-b.ORvQNs8_SL9A&smid=url-share"
  },
  {
    "text": "The MAGA Abuse of the English Language  —  Thank you for reading The Garden of Forking Paths.  This article is free, but if you'd like to support my work—and unlock more than 130 articles—consider upgrading to a paid subscription for just $4/month, or, support me by buying my book, FLUKE.",
    "url": "https://www.forkingpaths.co/p/maga-corruptions-of-the-english-language"
  },
  {
    "text": "Legendary activist Kimberlé Crenshaw on why those white people Zooms give her hope  —  When word of massive, star-studded Zoom fundraisers for white Kamala Harris supporters spread across the internet, it certainly raised eyebrows.  —  Fundraisers from groups like Win With Black Women … ",
    "url": "https://www.vox.com/culture/364410/kamala-harris-white-people-zooms-race-intersectionality-crenshaw"
  },
  {
    "text": "Senate GOP blocks bipartisan bill to expand child tax credit  —  Senate Republicans blocked Wednesday a bipartisan bill that would boost a tax credit for parents as the GOP and Democrats feud over remarks from Republican vice president nominee Sen. JD Vance (Ohio).",
    "url": "https://thehill.com/business/4805927-senate-republicans-block-child-tax-credit-bill/"
  },
  {
    "text": "CBP officers in Arizona seize more than half a ton of fentanyl in largest seizure in agency history  —  TUCSON, Ariz. - U.S. Customs and Border Protection officers at the Port of Lukeville recently seized approximately 4 million blue fentanyl pills — weighing more than 1,000 pounds … ",
    "url": "https://www.cbp.gov/newsroom/local-media-release/cbp-officers-arizona-seize-more-half-ton-fentanyl-largest-seizure"
  },
  {
    "text": "Gov. Beshear cancels planned stop in western Ky.  —  HICKMAN, Ky. (KFVS) - Governor Andy Beshear canceled a stop in western Kentucky planned for Friday, August 2, according to his office.  —  They say Lieutenant Governor Jacqueline Coleman will visit the Jackson Purchase Distillery instead.",
    "url": "https://www.kfvs12.com/2024/08/01/gov-beshear-cancels-planned-stop-western-ky/"
  },
  {
    "text": "Trump loses appeal of gag order in hush money criminal case  —  A New York state appeals court on Thursday rejected former U.S. President Donald Trump's challenge to a gag order in his criminal case on charges stemming from hush money paid to a porn star.  —  The Appellate Division's ruling … ",
    "url": "https://www.reuters.com/legal/trump-loses-appeal-gag-order-hush-money-criminal-case-2024-08-01/"
  },
  {
    "text": "The Man Behind Project 2025's Most Radical Plans  —  In January 2023, a group of about 15 people gathered for three days at the Heritage Foundation, the conservative Washington think tank a few blocks from the Capitol.  Their aim was ambitious and farsighted: to start building … ",
    "url": "https://www.propublica.org/article/project-2025-trump-campaign-heritage-foundation-paul-dans"
  }
]