[
  {
    "text": "Could McCarthy really lose his job?  —  Good morning, Early Birds.  If you're looking to brush up on Bibi ahead of President Biden's meeting with him in New York on Wednesday, allow us to suggest David Remnick's 1998 profile in which Benjamin Netanyahu smokes a Davidoff in his office without offering Remnick one.",
    "url": "https://www.washingtonpost.com/politics/2023/09/18/could-mccarthy-really-lose-his-job/"
  },
  {
    "text": "9/18/23 ☀️ Punchbowl News AM  —  This is an enormous week for Speaker Kevin McCarthy and House Republicans.  —  The federal government will shut down in 13 days unless Congress greenlights more funding.  And House Republicans are pushing a partisan stopgap spending bill … ",
    "url": "https://punchbowl.news/archive/91823-punchbowl-news-am/"
  },
  {
    "text": "Playbook: McCarthy's latest gambit falls flat  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  BREAKING OVERNIGHT — “Iran-US prisoner swap likely set in motion as $6 billion of once-frozen Iranian assets reaches Qatar,” by AP's Jon Gambrell … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/09/18/mccarthys-latest-gambit-falls-flat-00116484"
  },
  {
    "text": "How not to interview Trump  —  This free edition of Public Notice is made possible by paid subscribers.  If you aren't one already, please sign up to support our work.  We're currently offering free trials for all new signups.  Just click the button below.  —  Subscribe now",
    "url": "https://www.publicnotice.co/p/kristen-welker-trump-interview-meet-the-press"
  },
  {
    "text": "The unchanging malleability of Donald Trump  —  Donald Trump's success in the 2016 Republican nominating contest was, at its essence, uncomplicated.  —  Running against a cadre of sitting and former elected officials, Trump said things they wouldn't — mostly the things … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/18/trump-welker-interview/"
  },
  {
    "text": "Rep. Jennifer Wexton will not seek reelection as diagnosis changes  —  Wexton was diagnosed this summer with progressive supranuclear palsy, a rare neurological condition for which there is no cure  —  Rep. Jennifer Wexton (D-Va.) promised this spring to persevere as she revealed … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/09/18/jennifer-wexton-parkinsons-diagnosis-progressive-supranuclear-palsy/"
  },
  {
    "text": "I Was Attacked by Trump and Musk.  It Was a Strategy to Change What You See Online.  —  When I worked at Twitter, I led the team that placed a fact-checking label on one of Donald Trump's tweets for the first time.  Following the violence of Jan. 6, I helped make the call to ban his account from Twitter altogether.",
    "url": "https://www.nytimes.com/2023/09/18/opinion/trump-elon-musk-twitter.html"
  },
  {
    "text": "Hunter Biden sues IRS over disclosures  —  The lawsuit over IRS agent interviews with Congress and the press comes as a special counsel weighs charging him with tax crimes  —  President Biden's son Hunter Biden filed a lawsuit Monday against the Internal Revenue Service … ",
    "url": "https://www.washingtonpost.com/national-security/2023/09/18/hunter-biden-lawsuit-irs/"
  },
  {
    "text": "Five Americans freed from Iran land in Qatar before flying to the US  —  Doha and Washington CNN  —  Five Americans who had been imprisoned in Iran have been freed and have landed in Doha, Qatar, before flying to the United States later on Monday.  —  The five, all of whom had been designated … ",
    "url": "https://www.cnn.com/2023/09/18/politics/iran-us-prisoner-release-intl/"
  },
  {
    "text": "U.S. asks for help finding missing F-35 fighter jet after pilot ejects during ‘mishap’  —  Joint Base Charleston in South Carolina appealed to the public for information in its bid to “locate an F-35 that was involved in a mishap” on Sunday afternoon.  —  A U.S. fighter jet's stealth abilities appear … ",
    "url": "https://www.nbcnews.com/news/us-news/f-35-fighter-jet-missing-pilot-ejects-mishap-rcna105534"
  },
  {
    "text": "Trump shares post bashing ‘liberal Jews who voted to destroy America’  —  Former President Donald Trump late Sunday shared an image on Truth Social telling “liberal Jews” to “make better choices” amid celebrations of the Jewish New Year.  —  Trump shared a photo on Sunday evening without any caption of his own.",
    "url": "https://thehill.com/homenews/campaign/4209650-trump-shares-post-bashing-liberal-jews-who-voted-to-destroy-america/"
  },
  {
    "text": "Her students reported her for a lesson on race.  Can she trust them again?  —  Mary Wood's school reprimanded her for teaching a book by Ta-Nehisi Coates.  Now she hopes her bond with students can survive South Carolina's politics.  —  CHAPIN, S.C. — As gold sunlight filtered into her kitchen … ",
    "url": "https://www.washingtonpost.com/education/2023/09/18/south-carolina-teacher-ta-nehisi-coates-racism-lesson/"
  },
  {
    "text": "Billionaire Ken Griffin, former DeSantis donor, on sidelines for GOP presidential primary  — Billionaire and Citadel CEO Ken Griffin says he is sitting on the sidelines for the 2024 Republican presidential primary.  — Griffin explained that so far he's not impressed with what he's seeing … ",
    "url": "https://www.cnbc.com/2023/09/18/billionaire-ken-griffin-former-desantis-donor-sits-out-gop-primary.html"
  },
  {
    "text": "Mark Meadows's Testimony in Georgia Case May Have Done Him No Favors  —  Mark Meadows, a former top Trump aide, took the witness stand in hopes of having his election interference case moved to federal court.  So far, the strategy has not paid off.  —  One morning last month … ",
    "url": "https://www.nytimes.com/2023/09/18/us/mark-meadows-georgia-trump-case.html"
  },
  {
    "text": "Scoop: How GOP pressured Texas senators over Paxton's impeachment trial  —  Following a secret campaign coordinated by top Trump allies, Texas state senators yesterday acquitted Attorney General Ken Paxton of all impeachment charges, allowing him to return to his post.",
    "url": "https://www.axios.com/2023/09/17/ken-paxton-texas-impeachment-gop"
  }
]