[
  {
    "text": "Trump deputy campaign manager identified in Arlington National Cemetery dustup  —  One of two staffers involved in the altercation at Arlington National Cemetery is a deputy campaign manager for Donald Trump's reelection bid, NPR has learned.  The former president insisted this week the incident … ",
    "url": "https://www.npr.org/2024/09/05/nx-s1-5101991/trump-campaign-arlington-national-cemetery-staff-debate"
  },
  {
    "text": "JD Vance says school shootings are a ‘fact of life,’ calls for better security  —  School shootings are a “fact of life,” so the U.S. needs to harden security to prevent more carnage like the shooting this week that left four dead in Georgia, Republican vice presidential nominee JD Vance said Thursday.",
    "url": "https://apnews.com/article/jd-vance-georgia-shooting-7d7727a1aff8491f66914a4d8a14cd8c"
  },
  {
    "text": "The father of the Georgia school shooting suspect has been arrested and charged, authorities say  —  The father of the Apalachee High School shooting suspect has been arrested in connection with the shooting that left four people dead, according to the Georgia Bureau of Investigation.",
    "url": "https://www.cnn.com/2024/09/05/us/winder-georgia-shooting-apalachee-high-school"
  },
  {
    "text": "Russia's useful idiots  —  The MAGA influencer ecosystem is even shadier than we thought. … On Wednesday, the Department of Justice indicted two employees of RT, formerly Russia Today, a Russian state-run media outlet, for covertly shoveling millions of dollars at MAGA influencers happy to do Russia's bidding.",
    "url": "https://www.publicnotice.co/p/russia-indictment-tim-pool-benny-johnson-rubin"
  },
  {
    "text": "Tucker Carlson and the Heterodoxy-to-Holocaust Denial Pipeline  —  This week Tucker Carlson, the former Fox News star who now hosts one of America's top podcasts, had an apologist for Adolf Hitler on his show.  Darryl Cooper, who runs a history podcast and newsletter called Martyr Made … ",
    "url": "https://www.nytimes.com/2024/09/06/opinion/tucker-carlson-holocaust-denial.html"
  },
  {
    "text": "White House condemns Tucker Carlson's ‘Nazi propaganda’ interview as ‘disgusting and sadistic insult’  —  New York CNN  —  The Biden administration is denouncing Tucker Carlson after the far-right personality hosted a guest on his show this week who suggested the Holocaust happened by accident … ",
    "url": "https://www.cnn.com/2024/09/05/media/white-house-condemns-tucker-carlson-nazi-propaganda-interview/"
  },
  {
    "text": "Harris Opens $110 Million Cash Edge Over Trump After August Fund-Raising Haul  —  Vice President Kamala Harris's campaign reported raising $361 million in August, her first full month as the Democrats' nominee, far surpassing the $130 million reported by Mr. Trump in the same month.",
    "url": "https://www.nytimes.com/2024/09/06/us/politics/harris-august-fundraising-trump.html?unlocked_article_code=1.Ik4.ojNO.SI-fbQXT-mMc&smid=url-share"
  },
  {
    "text": "Trump's federal election prosecution isn't going to trial anytime soon.  But it could still produce damaging revelations before Nov. 5.  —  A new schedule from Judge Tanya Chutkan leaves the door open for an October surprise.  —  Special counsel Jack Smith and Donald Trump … ",
    "url": "https://www.politico.com/news/2024/09/05/trump-federal-election-case-chutkan-schedule-00177619"
  },
  {
    "text": "Stop letting right wing influencers cosplay as ‘independent’ media  —  We need to know who is funding the creator economy  —  Yesterday, a federal indictment revealed that a Tennessee media company working with right-wing influencers including Benny Johnson, Tim Pool, Dave Rubin … ",
    "url": "https://taylorlorenz.substack.com/p/we-need-to-know-who-is-funding-the"
  },
  {
    "text": "FBI raids homes of top aides to New York City Mayor Eric Adams  —  The two deputy mayors are the highest-ranking Adams administration officials yet to be ensnared in the federal probe into Adams' 2021 campaign.  —  NEW YORK — Federal authorities have raided the homes of two of New York City Mayor Eric Adams … ",
    "url": "https://www.politico.com/news/2024/09/05/fbi-new-york-city-mayor-eric-adams-00177536"
  },
  {
    "text": "Physician sentenced to 9 months in prison for punching police officer during Capitol riot  —  A Massachusetts medical doctor who punched a police officer during a mob's attack on the U.S. Capitol was sentenced Thursday to nine months of imprisonment followed by nine months of home confinement.",
    "url": "https://apnews.com/article/jacquelyn-starer-doctor-massachusetts-capitol-riot-76190db8a354c339776f3e1c8169306a"
  },
  {
    "text": "Hunter Biden intends to change his plea in federal tax charges  —  The president's son was indicted in December on three felony and six misdemeanor counts alleging that he failed to pay his taxes over several years.  —  LOS ANGELES — Hunter Biden intends to change his plea … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/hunter-biden-intends-plead-guilty-federal-tax-charges-rcna169621"
  },
  {
    "text": "Whoops: Report That Harris Team Regrets Not Picking Shapiro, As Nate Silver Has More Bad News for Them  —  As we reported, that honeymoon for Kamala Harris is looking like it might be over as the American people take a better look at her and her running mate, Tim Walz.",
    "url": "https://redstate.com/nick-arama/2024/09/05/whoops-sounds-like-harris-people-are-regretting-picking-walz-as-nate-silver-has-more-bad-news-for-them-n2178952"
  },
  {
    "text": "Trump Can't Get Himself Out of the Abortion Straitjacket  —  Donald Trump is stuck.  —  He is a brutally transactional politician who represents a coalition of ideologues.  His instinct is to promise the moon, and he'll say anything to get a vote — or just to get out of a room.",
    "url": "https://www.nytimes.com/2024/09/06/opinion/trump-dobbs-abortion.html"
  },
  {
    "text": "‘A huge mistake’: Trump's crypto allies cringe over family's startup  —  The crypto venture is attracting what appear to be hacks and attempted scams ahead of its launch.  —  Donald Trump's sons want to turn their father's growing bromance with the cryptocurrency industry into the new family business.",
    "url": "https://www.politico.com/news/2024/09/06/trump-family-crypto-startup-00177566"
  },
  {
    "text": "Harris leads Trump in four of seven swing states, Times poll says  —  Survey taken by YouGov after Democratic convention suggests the vice-president may be on course to win the electoral college  —  Kamala Harris leads Donald Trump in four of the swing states likely to decide the election … ",
    "url": "https://www.thetimes.com/world/us-world/article/polls-trump-vs-harris-2024-us-election-sx6rjw0p2"
  },
  {
    "text": "Donald Trump Rambles Incoherently When Asked About Reducing Child Care Costs  —  Without explaining his child care policy, Trump suggested revenue from tariffs would more than cover its cost.  —  LOADING  —  Donald Trump on Thursday got a question about what he would do as president to make child care more affordable and accessible.",
    "url": "https://www.huffpost.com/entry/trump-child-care-answer-tariffs_n_66da026ce4b06ce2f28f5c9d"
  },
  {
    "text": "JD Vance's plan to lower childcare costs: have grandma and grandpa ‘help a little bit more’  — JD Vance said in recent remarks that older family members could step in to help with childcare.  — It was part of his solution to address high childcare costs in the US.",
    "url": "https://www.businessinsider.com/jd-vance-lower-childcare-costs-grandma-grandpa-help-retirement-crisis-2024-9"
  },
  {
    "text": "Trump to attend oral arguments Friday in E. Jean Carroll judgment appeal: Sources  —  Oral arguments are set to begin in his appeal of the E. Jean Carroll verdict.  —  Republican presidential nominee, former President Donald Trump speaks during a campaign rally at Desert Diamond Arena, on Aug. 23, 2024, in Glendale, Arizona.",
    "url": "https://abcnews.go.com/Politics/trump-attend-oral-arguments-friday-jean-carroll-judgment/story?id=113442469"
  },
  {
    "text": "Rep. Byron Donalds didn't properly disclose up to $1.6 million in stock trades, violating federal law  — Rep. Byron Donalds failed to properly disclose two years' worth of his and his wife's stock trades.  — It was up to $1.6 million, including stock in companies he oversees on a House committee.",
    "url": "https://www.businessinsider.com/byron-donalds-stock-trades-insider-trading-ethics-complaint-2024-9"
  },
  {
    "text": "Alaska judge strikes down law saying only doctors can provide abortions  —  A state judge in Alaska struck down a law prohibiting anyone other than a licensed physician from performing abortions.  —  Superior Court Judge Josie Garton ruled Wednesday the law imposed a substantial burden … ",
    "url": "https://thehill.com/policy/healthcare/4864049-alaska-judge-strikes-down-law-saying-only-doctors-can-provide-abortions/"
  }
]