[
  {
    "text": "SCOOP: Trump crafts plan to cut spending without Congress after shutdown is averted  —  Trump and his allies believe the Impoundment Control Act is unconstitutional  —  The White House has already started mapping out how to make good on its promise to slash federal spending in preparation … ",
    "url": "https://www.foxnews.com/politics/scoop-trump-crafts-plan-cut-spending-without-congress-after-shutdown-averted"
  },
  {
    "text": "My Vote on the GOP Spending Bill  —  I'm a hard NO on the Republican spending bill.  On cloture.  On all of it.  When a wannabe dictator is trying to seize power, it must not be given to him.  Not without a fight.  —  Sen. Adam Schiff  —  Transcript  —  Tomorrow, the U.S. Senate … ",
    "url": "https://schiffnotes.substack.com/p/my-vote-on-the-gop-spending-bill"
  },
  {
    "text": "Trump and Musk Would Love a Shutdown.  We Must Not Give Them One.  —  Over the past two months, the United States has confronted a bitter truth: The federal government has been taken over by a nihilist.  —  President Trump has taken a blowtorch to our country and wielded chaos like a weapon.",
    "url": "https://www.nytimes.com/2025/03/13/opinion/trump-musk-shutdown-senate.html?unlocked_article_code=1.304.vyIR.3Ib7Aj9iPg_I&smid=url-share"
  },
  {
    "text": "Senate Democrats signal plans to advance GOP bill to avoid a government shutdown  —  Senate Minority Leader Chuck Schumer, D-NY, says he will vote to keep the government open, signaling a path for Democrats to vote with Republicans to overcome a filibuster in the Senate and pass a six-month spending bill ahead of the Friday deadline.",
    "url": "https://www.npr.org/2025/03/13/g-s1-53495/senate-democrats-funding-bill-government-shutdown"
  },
  {
    "text": "Is Our Democrats Learning?  UPDATE: No  —  Trump's team said one too many times that Congress doesn't matter.  Will enough Senate Democrats try to make sure they do? … The headline is hard to ignore.  “Trump crafts plan to cut spending without Congress after shutdown is averted,” according to Fox News.",
    "url": "https://prospect.org/politics/2025-03-13-is-our-democrats-learning/"
  },
  {
    "text": "Schumer Says He'll Vote to Advance Spending Bill, Breaking With His Party  —  Many Democrats are agitating for their party's senators to block the measure in defiance of President Trump, but the leader said doing so would prompt a shutdown that would only empower Mr. Trump.",
    "url": "https://www.nytimes.com/2025/03/13/us/government-shutdown-senate-democrats.html"
  },
  {
    "text": "Schumer backs away from shutdown, says he'll vote to advance GOP bill  —  Senate Minority Leader Chuck Schumer privately told fellow Democrats during a closed-door lunch Thursday that he would help advance a House GOP funding bill — a strong indication that Senate Democrats will ultimately … ",
    "url": "https://www.politico.com/live-updates/2025/03/13/congress/chuck-schumer-shutdown-vote-00230000"
  },
  {
    "text": "Thousands of fired federal workers must be rehired immediately, judge rules  —  U.S. District Judge William Alsup described the mass firings as a “sham” strategy by the government's central human resources office.  —  A federal judge on Thursday ordered federal agencies to rehire tens … ",
    "url": "https://www.politico.com/news/2025/03/13/fired-federal-probationary-employees-court-ruling-00228721"
  },
  {
    "text": "Inside Elon Musk's ‘Digital Coup’  —  Musk's loyalists at DOGE have infiltrated dozens of federal agencies, pushed out tens of thousands of workers, and siphoned millions of people's most sensitive data.  The next step: Unleash the AI.  —  As America's most decorated civil servants sipped cocktails … ",
    "url": "https://www.wired.com/story/elon-musk-digital-coup-doge-data-ai/"
  },
  {
    "text": "These Are the 10 DOGE Operatives Inside the Social Security Administration  —  The team working at the Social Security Administration appears to be among the largest DOGE units deployed to any government agency.  —  At least 10 people associated with Elon Musk's so-called Department of Government Efficiency … ",
    "url": "https://www.wired.com/story/doge-operatives-access-social-security-administration/"
  },
  {
    "text": "Stocks Tumble Into Correction as Investors Sour on Trump  —  The S&P 500 is now more than 10% below its last record high — a line in the sand for investors worried about a sell-off gathering steam.  —  The world's most widely followed stock-market benchmark slid into a correction on Thursday … ",
    "url": "https://www.nytimes.com/2025/03/13/business/sp-500-stocks-market-correction.html"
  },
  {
    "text": "Trump asks Supreme Court to allow birthright citizenship ban in some states  —  Lower court judges have blocked Trump's initiative nationwide, saying it violates the citizenship clause of the 14th Amendment.  —  just now  —  The Trump administration asked the Supreme Court on Thursday … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/13/supreme-court-birthright-citizenship-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxODM4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzMjIwNzk5LCJpYXQiOjE3NDE4Mzg0MDAsImp0aSI6ImQ4MTYwMDA2LTUyMmItNGFmMy1iMmJjLTJlMzhmNWQ3ZTBjNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzEzL3N1cHJlbWUtY291cnQtYmlydGhyaWdodC1jaXRpemVuc2hpcC10cnVtcC8ifQ.uzYLP57x27RMaHDU28xZv4RQVYUX0yS3cf3uQZCr29s&itid=gfta"
  },
  {
    "text": "Statement from the Office of Raúl M. Grijalva  —  The Office of the 7th District of Arizona is saddened to announce the passing of Congressman Raúl M. Grijalva.  Rep. Grijalva fought a long and brave battle.  He passed away this morning due to complications of his cancer treatments.",
    "url": "https://grijalva.house.gov/statement-from-the-office-of-raul-m-grijalva/"
  },
  {
    "text": "Musk Shares Claim That Stalin and Hitler Didn't Murder Millions: ‘Public Sector Employees Did’  —  Musk's sharing of the inflammatory social media post comes amid his regular posting of memes and jokes related to Nazis and the Holocaust - and after the billionaire appeared to make a fascist salute at a Trump inauguration rally",
    "url": "https://www.haaretz.com/israel-news/2025-03-13/ty-article/musk-shares-claim-that-stalin-hitler-didnt-murder-millions-public-sector-workers-did/00000195-8ee8-d155-affd-8fec8f8e0000"
  },
  {
    "text": "Trump expected to invoke wartime authority to speed up mass deportation effort in coming days  —  The Trump administration is expected to invoke a sweeping wartime authority to speed up the president's mass deportation pledge in the coming days, according to four sources familiar with the discussions.",
    "url": "https://www.cnn.com/2025/03/13/politics/alien-enemies-act-deportation-consideration/"
  },
  {
    "text": "B.C. woman detained at U.S. border, sent to Arizona detention facility in chains  —  Her mother says 35-year-old Jasmine Mooney has been detained in inhumane conditions since March 3  —  A B.C. mom is pleading for help after her daughter was unexpectedly detained in the United States over an incomplete visa.",
    "url": "https://vancouversun.com/news/bc-woman-detained-at-us-border-sent-to-arizona-detention-facility"
  },
  {
    "text": "Oz may have underpaid Medicare, Social Security taxes, Democrats say  —  Oz and his advisers said that he would not amend his returns.  —  Former TV personality Dr. Mehmet Oz, President Donald Trump's nominee to lead the Centers for Medicare and Medicaid Services, may have “significantly underpaid” … ",
    "url": "https://www.politico.com/news/2025/03/13/oz-medicare-social-security-taxes-00228953"
  },
  {
    "text": "Johns Hopkins to Cut More Than 2,000 Workers Funded by Federal Aid  —  The university, a leader in scientific research, has been hard hit by the Trump administration's cuts, which will slash at least $800 million from its budget.  —  Johns Hopkins University, one of the country's leading centers … ",
    "url": "https://www.nytimes.com/2025/03/13/us/trump-cuts-johns-hopkins-university-layoffs.html?unlocked_article_code=1.3k4.oksp.IRgzd1wp37Ic"
  },
  {
    "text": "Voters' Ratings On Economy And Trump Dip, Trade And Russia - Ukraine War Weigh On Trump's Numbers, Quinnipiac University National Poll Finds; Majority Disapprove Of Trump's Handling Of Zelensky Meeting  — mail_outline  —  Seven weeks after President Donald Trump began his second term … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3921"
  },
  {
    "text": "Detained Protester Mahmoud Khalil Sues Columbia University  —  Mahmoud Khalil, who ICE arrested on Saturday, and a group of other students from Columbia are suing the university to stop the release of disciplinary records.  —  Mahmoud Khalil, the green card holding legal permanent resident arrested … ",
    "url": "https://www.404media.co/detained-protester-mahmoud-khalil-sues-columbia-university/"
  },
  {
    "text": "Pete Hegseth to overhaul US military lawyers in effort to relax rules of war  —  The defense secretary has empowered his lawyer Tim Parlatore to remake the judge advocate general's corps  —  The US defense secretary, Pete Hegseth, is expected in the coming weeks to start a sweeping overhaul … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/13/pete-hegseth-pentagon-lawyers-rules-of-war"
  },
  {
    "text": "Tesla warns Trump administration it is ‘exposed’ to retaliatory tariffs  —  Elon Musk's electric-car maker says levies could make it costlier to produce vehicles in the US  —  Elon Musk's electric-car maker Tesla has warned that President Donald Trump's trade war could make it a target … ",
    "url": "https://www.ft.com/content/605295c5-dc8f-4247-ba35-8036b5058915?accessToken=zwAGMD90mKaQkc9gUpXF3I9CR9O6NYA2tQWJFQ.MEQCIDxQi1aVBZZTj1-AJwwYZFYOiB4EApM2XGB-dNpVr2oEAiAVsUxZP9KQ-2sxR0v5JHp3EWQgib4NamXFYbEemmEe4g&sharetype=gift&token=71b8eee7-1740-4f07-88c1-0fdecb73edee"
  },
  {
    "text": "Meta Seeks to Block Further Sales of Ex-Employee's Scathing Memoir  —  An arbitrator has prevented the employee from promoting her book and disparaging the company until private arbitration concludes.  —  Meta won a legal victory on Wednesday against a former employee who published an explosive … ",
    "url": "https://www.nytimes.com/2025/03/12/technology/meta-book-sales-blocked.html?unlocked_article_code=1.3k4.VUuA.fUv1huo783m_&smid=nytcore-android-share"
  },
  {
    "text": "Scoop: White House to pull CDC director nomination  —  The White House is withdrawing the nomination of Dave Weldon to be the director of the Centers for Disease Control and Prevention (CDC), per a source close to Senate health committee and another source familiar.",
    "url": "https://www.axios.com/2025/03/13/white-house-pulls-cdc-nomination"
  },
  {
    "text": "A DOGE reality check in Treasury data  —  Mega-tariffs!  Mass government layoffs!  Slashed federal spending!  Those have been the headlines, but if you get your information from the Treasury Department's monthly accounting of its revenue and spending, things don't look nearly so dramatic — at least, for now.",
    "url": "https://www.axios.com/2025/03/13/doge-tariffs-layoffs-treasury-data"
  },
  {
    "text": "Nearly 100 protesters arrested after sit-in at Trump Tower in NYC to demand release of Mahmoud Khalil  —  Some protesters held signs that read “Fight Nazis not students,” “Free Mahmoud free Palestine,” and “You can't deport a movement.”  —  Nearly 100 protesters were arrested Thursday following … ",
    "url": "https://www.nbcnews.com/news/us-news/protesters-take-trump-tower-nyc-demand-release-mahmoud-khalil-rcna196265"
  },
  {
    "text": "Ron Nessen, Ford's White House Press Secretary, Dies at 90  —  He pledged a new era of openness in the wake of the Watergate scandal, but his relationship with the press corps proved rocky.  —  Ron Nessen, who as President Gerald R. Ford's press secretary from 1974 to 1977 pledged a new era … ",
    "url": "https://www.nytimes.com/2025/03/13/us/politics/ron-nessen-dead.html?unlocked_article_code=1.3k4.w9B_.uC8zrouZ2yiv&smid=url-share"
  },
  {
    "text": "Arlington Cemetery website drops links for Black, Hispanic, and women veterans  —  The website for Arlington National Cemetery “unpublished” links to lists of notable graves, walking tours and educational material pertaining to Black, Hispanic and women veterans, as well as some Medal of Honor recipients.",
    "url": "https://taskandpurpose.com/news/arlington-cemetery-scrubs-website-dei/"
  },
  {
    "text": "Trump Family Has Held Deal Talks With Binance Following Crypto Exchange's Guilty Plea  —  Discussions for stake in Binance's U.S. arm come as founder Changpeng Zhao has pushed for the administration to pardon him for his own 2023 guilty plea  —  Representatives of President Trump's family … ",
    "url": "https://www.wsj.com/finance/currencies/trump-family-has-held-deal-talks-with-binance-following-crypto-exchanges-guilty-plea-05b029fa?st=jj92BE&reflink=article_copyURL_share"
  },
  {
    "text": "Americans worry Trump too closely aligned with Russia, Reuters/Ipsos poll finds  —  More than half of Americans, including one in four Republicans, think President Donald Trump is “too closely aligned” with Russia, as he radically realigns U.S. foreign policy, a new Reuters/Ipsos poll shows.",
    "url": "https://www.reuters.com/world/us/americans-worry-trump-too-closely-aligned-with-russia-reutersipsos-poll-finds-2025-03-13/"
  },
  {
    "text": "Trump White House has asked U.S. military to develop options for the Panama Canal, officials say  —  Potential plans range from partnering more closely with the Panamanian military to a less likely option of U.S. troops seizing the canal by force, according to two U.S. officials..",
    "url": "https://www.nbcnews.com/politics/national-security/trump-white-house-asked-us-military-develop-options-panama-canal-offic-rcna195994"
  },
  {
    "text": "A Dangerous New Supreme Court Case Could Open the Door to Prosecutions for DEI  —  It's no secret that the Trump administration has moved quickly over the past few months to dismantle diversity, equity, inclusion, and accessibility programs in both the federal government and the private sector.",
    "url": "https://slate.com/news-and-politics/2025/03/supreme-court-analysis-trump-bondi-dei-prosecutions.html"
  },
  {
    "text": "DOGE Makes Its Latest Errors Harder to Find  —  Elon Musk's group obscured the details of some new claims on its website, despite promises of transparency.  But The Times was still able to detect another batch of mistakes.  —  Elon Musk's Department of Government Efficiency … ",
    "url": "https://www.nytimes.com/2025/03/13/us/politics/doge-errors-funding-grants-claims.html?unlocked_article_code=1.3k4.8KhI.1rovIZyh6byZ&smid=url-share"
  }
]