[
  {
    "text": "Shocker From Top Conservative Judge: Trump Likely To Skate Completely  —  “I'm profoundly disturbed about the apparent direction of the court,” J. Michael Luttig told me.  “I now believe that it is unlikely Trump will ever be tried for the crimes he committed in attempting to overturn the 2020 election.”",
    "url": "https://newrepublic.com/article/181059/luttig-trump-january-6-case"
  },
  {
    "text": "Trump immunity fight turns Supreme Court textualists topsy-turvy  —  “It sure ain't originalism,” one critic said.  —  The Supreme Court's conservatives often accuse liberals of inventing provisions nowhere to be found in the Constitution.  Now, the fingers are pointed in the other direction.",
    "url": "https://www.politico.com/news/2024/04/27/supreme-court-trump-immunity-00154744"
  },
  {
    "text": "Mastodon forms new U.S. non-profit  —  As part of our commitment to supporting the growth and operational capabilities of Mastodon, we have established a 501(c)(3) non-profit entity in the United States aimed at facilitating our efforts, including being able to receive tax-deductible U.S. donations and in-kind support.",
    "url": "https://blog.joinmastodon.org/2024/04/mastodon-forms-new-u.s.-non-profit/"
  },
  {
    "text": "Barr, who said Trump shouldn't be near Oval Office, says he will vote for him in 2024  —  Former Attorney General Bill Barr, who previously said that Donald Trump shouldn't be near the Oval Office, told CNN's Kaitlan Collins Friday that he would vote for the former president over President Joe Biden in the 2024 election.",
    "url": "https://www.cnn.com/2024/04/26/politics/barr-vote-for-trump-2024/"
  },
  {
    "text": "A physician, a lawyer, a CEO: the 84 fake electors who allegedly tried to steal the 2020 election  —  With a new indictment this week, 36 have been criminally charged and 10 face a civil lawsuit - but seven hold office  —  With the indictment announced in Arizona this week … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/27/fake-electors-2020-presidential-election"
  },
  {
    "text": "Harvey Weinstein Isn't Alone.  Our Institutions Are Rapists  —  VOTE THEM OUT  —  In state after state, governments dominated by white men are dehumanizing and taking ownership over women's bodies.  Every branch of our government commodifies and devalues women.",
    "url": "https://www.thedailybeast.com/alyssa-milano-harvey-weinstein-isnt-alone-our-institutions-are-rapists"
  },
  {
    "text": "Exclusive: Some US officials say in internal memo Israel may be violating international law in Gaza  —  Some senior U.S. officials have advised Secretary of State Antony Blinken that they do not find “credible or reliable” Israel's assurances that it is using U.S.-supplied weapons in accordance … ",
    "url": "https://www.reuters.com/world/middle-east/some-us-officials-say-internal-memo-israel-may-be-violating-international-law-2024-04-27/"
  },
  {
    "text": "GOP urges Secret Service to move protesters from park near convention arena  —  The Republican Party is urging the Secret Service to move protesters farther away from the arena in Milwaukee where the party will hold its convention in July, according to a letter sent to the agency Friday and reviewed by The Washington Post.",
    "url": "https://www.washingtonpost.com/politics/2024/04/26/republican-national-convention-protests-milwaukee/"
  },
  {
    "text": "How Trump's Rhetoric at Rallies Has Escalated  —  No major American presidential candidate has talked like he now does at his rallies — not Richard Nixon, not George Wallace, not even Donald Trump himself.  —  Donald Trump at a campaign rally in Greensboro, N.C., in March.",
    "url": "https://www.nytimes.com/2024/04/27/magazine/trump-rallies-rhetoric.html"
  },
  {
    "text": "Harvey Weinstein hospitalized after his return to New York from upstate prison  —  Harvey Weinstein's lawyer said Saturday that the onetime movie mogul has been hospitalized for a battery of tests after his return to New York City following an appeals court ruling nullifying his 2020 rape conviction.",
    "url": "https://apnews.com/article/weinstein-hospital-rikers-bellevue-conviction-12b765ba6ec3b9522d2ff5ed46cc7af6"
  },
  {
    "text": "Trump on trial: Personal anguish, political defiance and a loss of control  —  The former president has tried to campaign during his New York trial, but it's constraining him  —  NEW YORK — For 20 minutes Donald Trump campaigned like everything was normal.",
    "url": "https://www.washingtonpost.com/elections/2024/04/27/trump-trial-election-2024-campaign/"
  },
  {
    "text": "‘Demolishing democracy’: how much danger does Christian nationalism pose?  —  Documentary Bad Faith looks at the history of a group trying to affect and corrupt politics under the guise of religion  —  Bad Faith, a new documentary on the rise of Christian nationalism in the United States … ",
    "url": "https://www.theguardian.com/film/2024/apr/27/bad-faith-documentary-christian-nationalism"
  },
  {
    "text": "Britain's Conservative Party, like the U.S. Republican Party, is in turmoil  —  Five years after a landslide victory, Britain's Conservative Party is deeply divided and appears headed towards one of its worst defeats in a generation  —  LONDON — Five years ago, Britain's Conservative Party scored … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/28/britain-conservative-party-turmoil-analysis/"
  },
  {
    "text": "Donald Trump is now blasting RFK Jr. for taking support from him  —  WASHINGTON - Former President Donald Trump is now going all-out against Robert F. Kennedy, Jr., amid polls that indicate the independent candidate would take more votes than Trump than incumbent President Joe Biden.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/04/27/donald-trump-attacks-rfk-jr-votes/73481350007/"
  }
]