[
  {
    "text": "Live updates House speakership stalled as Scalise withdraws from race  —  Rep. Steve Scalise (R-La.) announced at a Republican conference meeting Thursday night that he is pulling out of the race to become speaker.  The announcement came after a day full of lengthy meetings with fellow Republicans … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/12/house-speaker-vote/"
  },
  {
    "text": "Top House Republican Wants Help From Democrats to Pick a Speaker  — House Armed Services Chair Says GOP unable to elect speaker  — Calls on Democratic leader to offer conditions to aid GOP  —  A powerful Republican is looking to Democrats to help resolve his party's impasse over naming a speaker of the House.",
    "url": "https://www.bloomberg.com/news/articles/2023-10-12/democrats-to-the-rescue-some-republicans-see-it-as-solution-to-speaker-impasse"
  },
  {
    "text": "With the World in Crisis, House Republicans Bicker Among Themselves  —  Despite conflicts overseas and an approaching deadline to avert a government shutdown, Republicans are unable to rise above their internal divisions.  —  Two key U.S. allies are engulfed in vicious wars.",
    "url": "https://www.nytimes.com/2023/10/12/us/politics/house-republicans-bicker-world-crisis.html"
  },
  {
    "text": "Former President Trump on Israel, Speaker's race, Nikki Haley & RFK, Jr.  —  Former President Trump joined Brian for a wide ranging interview in which he criticized Israel's lack of preparedness for the horrific attack by the terrorist group Hamas on Saturday, October 7th.",
    "url": "https://radio.foxnews.com/2023/10/12/former-president-trump-on-israel-speakers-race-nikki-haley-rfk-jr/"
  },
  {
    "text": "Steve Scalise drops out of Speaker's race  —  House Majority Leader Steve Scalise (R-La.) on Thursday dropped out of the race for Speaker, just one day after he won the Republican nomination for the role.  —  Scalise narrowly prevailed in a secret ballot internal GOP election on Wednesday … ",
    "url": "https://thehill.com/homenews/house/4253448-steve-scalise-drops-out-speakers-race/"
  },
  {
    "text": "Moderate House Republicans Plot To Empower McHenry Amid Stalled Speaker Search  —  The Republican Governance Group has gathered signatures on a petition to give temporary Speaker Patrick McHenry, R-N.C., more authority … As House Republicans remain divided over their next leader … ",
    "url": "https://themessenger.com/politics/moderate-house-republicans-plot-to-empower-mchenry-amid-stalled-speaker-search"
  },
  {
    "text": "Chaos persists as ‘fractured’ House GOP frets about when — or if — it will elect a speaker  —  Some Republicans worry they might never get the votes without some Democratic help.  Others say it's time to empower Speaker Pro Tempore Patrick McHenry to conduct business.",
    "url": "https://www.nbcnews.com/politics/congress/chaos-house-republicans-speaker-rcna119967"
  },
  {
    "text": "Steve Scalise drops out of speaker's race as House GOP faces leadership crisis  —  House Majority Leader Steve Scalise announced he was dropping out of the speaker's race Thursday after House Republicans failed to coalesce behind him in the aftermath of Kevin McCarthy's historic ouster.",
    "url": "https://www.cnn.com/2023/10/12/politics/steve-scalise-speaker-fight/"
  },
  {
    "text": "Why is Trump Trashing Netanyahu?  —  On Wednesday, Donald Trump held a rally in West Palm Beach, Florida.  Considering Palm Beach County has one of the highest concentrations of Jewish people in America, the typical person at a Trump rally is quite conservative, and Israel is now responding … ",
    "url": "https://washingtonmonthly.com/2023/10/12/why-is-trump-trashing-netanyahu/"
  },
  {
    "text": "Israel-Hamas war: Strikes devastate Gaza as Israel prepares for possible ground assault  —  Gaza's energy crisis risk hospitals turning into morgues  —  US to Israel: we will always be there by your side  —  Eerie aftermath of Israel festival shooting  —  Israel's military on Friday directed … ",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-airstrikes-cabinet-beb1fa2b9e4ede6cf4568dd6c86ff11a"
  },
  {
    "text": "Poll: Majority blames gov't for Hamas massacre, says Netanyahu must resign  —  An overwhelming majority of 86% of respondents, including 79% of coalition supporters, said the surprise attack from Gaza is a failure of the country's leadership.  —  Four out of five Jewish Israelis believe … ",
    "url": "https://www.jpost.com/israel-news/article-767880"
  },
  {
    "text": "Jack Smith tells Trump to put up or shut up  —  Smith's demand that Trump and his lawyers clarify his strategy is important because an affirmative defense would trigger two significant consequences  —  Jack Smith is asking former President Donald Trump to put his money where his mouth is.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/trump-jack-smith-2020-election-interference-defense-rcna120166"
  },
  {
    "text": "IRS Contractor Pleads Guilty to Disclosing Tax Return Information to News Organizations  —  For Immediate Release  —  An IRS contractor, Charles Littlejohn, 38, of Washington, D.C., pleaded guilty today to disclosing tax return information without authorization.",
    "url": "https://www.justice.gov/opa/pr/irs-contractor-pleads-guilty-disclosing-tax-return-information-news-organizations"
  },
  {
    "text": "Fetterman calls on Senate to expel Menendez after foreign agent charges  —  Sen. John Fetterman (D-PA) on Thursday called on the Senate to expel Sen. Bob Menendez (D-NJ) after the latter was hit with additional federal charges that accuse him of being a foreign agent.",
    "url": "https://www.washingtonexaminer.com/news/senate/john-fetterman-bob-menendez-expulsion-fara-charges"
  },
  {
    "text": "Israeli official says government cannot confirm babies were beheaded in Hamas attack  —  The Israeli government has not confirmed the specific claim that Hamas attackers cut off the heads of babies during their shock attack on Saturday, an Israeli official told CNN, contradicting … ",
    "url": "https://www.cnn.com/2023/10/12/middleeast/israel-hamas-beheading-claims-intl"
  },
  {
    "text": "One officer who arrested Elijah McClain convicted of criminally negligent homicide; second officer acquitted  —  One of the Aurora, Colorado, police officers, Randy Roedema, who arrested Elijah McClain, an unarmed 23-year-old Black man who died after he was subdued by police and injected … ",
    "url": "https://www.cnn.com/2023/10/12/us/elijah-mcclain-police-trial-thursday/"
  },
  {
    "text": "What It Would Mean to Treat Hamas Like ISIS  —  The instant I understood the scale of Hamas's attack on Israel, I understood the probable response.  As I read reports of Hamas terrorists murdering entire families, raping Israeli women beside the bodies of their dead friends and dragging Israeli hostages … ",
    "url": "https://www.nytimes.com/2023/10/12/opinion/israel-hamas-isis-gaza.html"
  },
  {
    "text": "Donald Trump returning to civil trial next week with fixer-turned-foe Michael Cohen set to testify  —  Donald Trump will be back in court next week for his New York civil fraud trial, a person familiar with the former president's plans told The Associated Press on Thursday … ",
    "url": "https://apnews.com/article/donald-trump-letitia-james-fraud-new-york-c1865da048782b708de74c050f647df2"
  },
  {
    "text": "California Rep. Katie Porter Hauls in $3.4M in Third Fundraising Quarter  —  Porter is neck and neck with Adam Schiff in recent polling of the race … California Rep. Katie Porter announced raising $3.4 million for her Senate campaign in the third fundraising quarter of 2023, spanning June through September.",
    "url": "https://themessenger.com/politics/california-rep-katie-porter-hauls-in-3-4m-in-third-fundraising-quarter"
  }
]