[
  {
    "text": "Rainbow Bridge in Niagara Falls closed after explosion of vehicle reportedly entering U.S. from Canada  —  “I've been briefed on the incident on the Rainbow Bridge in Niagara Falls and we are closely monitoring the situation.”  Gov. Kathy Hochul said.  —  The FBI is investigating … ",
    "url": "https://www.nbcnews.com/news/us-news/rainbow-bridge-niagara-falls-closed-explosion-vehicle-reportedly-enter-rcna126397"
  },
  {
    "text": "NY vehicle explosion at Rainbow Bridge border crossing is attempted terror attack: sources  —  Rainbow Bridge, which connects Niagara Falls, New York to Niagara Falls, Canada, is currently shut down as the investigation unfolds  —  The FBI is investigating a vehicle explosion Wednesday … ",
    "url": "https://www.foxnews.com/us/ny-vehicle-explosion-reported-rainbow-bridge-niagara-falls-injured"
  },
  {
    "text": "Have You Listened Lately to What Trump Is Saying?  —  He is becoming frighteningly clear about what he wants.  —  In 2019, Kennedy Ndahiro, the editor of the Rwandan daily newspaper The New Times, explained to readers of The Atlantic how years of cultivated had hatred led to death on a horrifying scale.",
    "url": "https://www.theatlantic.com/ideas/archive/2023/11/trump-becoming-frighteningly-clear-about-what-he-wants/676086/"
  },
  {
    "text": "Why Trump Represents a ‘Trifecta of Danger’  —  Brian Klaas, a political scientist at University College London, captures the remarkable nature of the 2024 presidential election in an Oct. 1 essay, “The Case for Amplifying Trump's Insanity.”  —  Klaas argues that the presidential contest now pits",
    "url": "https://www.nytimes.com/2023/11/22/opinion/trump-danger-rage-psychology.html"
  },
  {
    "text": "Dean Phillips hits Biden over handling of Hamas hostages: ‘Absurd, shocking and dismaying’  —  Rep. Dean Phillips (D-Minn.) bashed President Biden Tuesday for the recently negotiated hostage deal between the militant group Hamas and Israel.  —  “No, because we have nine Americans held hostage right … ",
    "url": "https://thehill.com/homenews/campaign/4323140-dean-phillips-hits-biden-over-handling-of-hamas-hostages-absurd-shocking-and-dismaying/"
  },
  {
    "text": "Woodbury County supervisor's wife found guilty of 52 counts of voter fraud  —  Prosecutors say Kim Phuong Taylor wanted her husband to win elections in 2020 “by any means necessary.”  —  A jury spent about five hours deliberating before convicting Kim Phuong Taylor on 52 counts of voter fraud in federal court Tuesday in Sioux City.",
    "url": "https://www.iowapublicradio.org/ipr-news/2023-11-21/woodbury-county-supervisors-wife-found-guilty-of-52-counts-of-voter-fraud"
  },
  {
    "text": "GOP official's wife convicted in months-long 2020 voter-fraud scheme  —  As Tam and Thien Doan tried to file for absentee ballots in Iowa in 2020, they were surprised to find out that votes had already been cast in their names.  The siblings, both Democrats, were even more astonished to learn … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/22/iowa-voter-fraud-wife-husband-republican/"
  },
  {
    "text": "The Red State Brain Drain Isn't Coming.  It's Happening Right Now.  —  On Memorial Day weekend in 2022, Kate Arnold and her wife, Caroline Flint, flew from Oklahoma City to Cabo San Lucas for a little R&R. They had five kids, the youngest of them five-year-old twin girls, and demanding jobs as obstetrician-gynecologists.",
    "url": "https://newrepublic.com/article/176854/republican-red-states-brain-drain"
  },
  {
    "text": "Witnesses saw smoke, fire from vehicle at Rainbow Bridge  —  The Rainbow Bridge has been closed to all traffic amid reports of a vehicle explosion just outside the border inspections plaza on the American side.  —  Traveling down Niagara Street, the car sped onto the bridge plaza … ",
    "url": "https://www.niagara-gazette.com/news/local_news/update-witnesses-saw-smoke-fire-from-vehicle-at-rainbow-bridge/article_eb3ffec8-8957-11ee-93e5-cf9e52289455.html"
  },
  {
    "text": "The GOP rallies around Musk after his self-inflicted antisemitism mess  —  Elon Musk's new lawsuit against Media Matters, which X Corp. filed late Monday, has been dismissed by legal experts as a frivolous effort to bully a prominent critic into silence.  But some Republicans apparently … ",
    "url": "https://www.washingtonpost.com/opinions/2023/11/22/elon-musk-lawsuit-media-matters-republicans/"
  },
  {
    "text": "Donor allegedly offered $20M to recruit a Tlaib primary challenger  —  The lucrative proposal to Democratic Michigan Senate candidate Hill Harper arrived on Oct. 16, according to a source with direct knowledge — and got rejected.  —  A Michigan businessman called Democratic Senate candidate Hill Harper … ",
    "url": "https://www.politico.com/news/2023/11/22/donor-20-million-tlaib-primary-00128443"
  },
  {
    "text": "November 2023 National Poll: Trump Maintains Lead Over Biden  —  A new Emerson College Polling national survey of registered voters finds former President Donald Trump with a four-point lead over President Biden in a hypothetical 2024 matchup, 47% to 43%, within the poll's margin of error.",
    "url": "https://emersoncollegepolling.com/november-2023-national-poll-trump-maintains-lead-over-biden/"
  },
  {
    "text": "How Many Abortions Did the Post-Roe Bans Prevent?  —  The first estimate of births since Dobbs found that almost a quarter of women who would have gotten abortions carried their pregnancies to term.  —  The first data on births since Roe v. Wade was overturned shows how much abortion bans … ",
    "url": "https://www.nytimes.com/2023/11/22/upshot/abortion-births-bans-states.html"
  },
  {
    "text": "Spyglass Says Melissa Barrera Was Fired From ‘Scream’ Due to Rhetoric That ‘Flagrantly Crosses the Line Into Hate Speech’ (EXCLUSIVE) … But now the production banner behind the hit horror franchise's revival is pushing back on a narrative that has quickly coalesced around the decision … ",
    "url": "https://variety.com/2023/film/news/scream-producers-explain-melissa-barrera-fired-antisemitism-1235804914/"
  },
  {
    "text": "Justice for the Palestinians and Security for Israel  —  There have been five wars in the last 15 years between Israel and Hamas.  How do we end the current one and prevent a sixth from happening, sooner or later?  How do we balance our desire to stop the fighting with the need to address the roots of the conflict?",
    "url": "https://www.nytimes.com/2023/11/22/opinion/bernie-sanders-israel-gaza.html"
  },
  {
    "text": "US thwarted plot to kill Sikh separatist on American soil  —  Washington warned India over concerns of government involvement in assassination conspiracy  —  US authorities thwarted a conspiracy to assassinate a Sikh separatist on American soil and issued a warning to India's government … ",
    "url": "https://www.ft.com/content/56f7d6d6-6a93-4172-a49e-d8a91991e29d"
  },
  {
    "text": "Biden admin quietly developing settlement with groups seeking to tear down key power source  —  ‘Congress alone has the authority’ to breach federal dams, lawmakers write in letter to White House  —  The Biden administration is quietly discussing a potentially far-reaching settlement … ",
    "url": "https://www.foxnews.com/politics/biden-admin-quietly-developing-settlement-groups-seeking-tear-down-key-power-source"
  },
  {
    "text": "Roman emperor was trans, says museum  —  Elagabalus will be referred to as she after claims in classical texts that the emperor asked to be called ‘lady’  —  A Roman emperor has been declared transgender by a UK museum, The Telegraph can reveal.  —  The North Hertfordshire Museum has said it will be … ",
    "url": "https://www.telegraph.co.uk/news/2023/11/20/trans-roman-emperor-hitchin-museum-claim-pronouns-woke/"
  },
  {
    "text": "Nearly half of Americans think the US is spending too much on Ukraine aid, an AP-NORC poll says  —  As lawmakers in Washington weigh sending billions more in federal support to Kyiv to help fight off Russian aggression, close to half of the U.S. public thinks the country is spending too much on aid … ",
    "url": "https://apnews.com/article/joe-biden-ukraine-russia-congress-white-house-2cd1be27f7f635e9a89fdbdb9eedb646"
  },
  {
    "text": "Susan Sarandon dumped by Hollywood agency UTA over anti-Jewish rant  —  Oscar winner Susan Sarandon has been dropped by top Hollywood agency UTA after saying frightened Jews are “getting a taste of how it feels to be Muslim in America,” Page Six can reveal.  —  The 77-year-old actress … ",
    "url": "https://pagesix.com/2023/11/21/celebrity-news/susan-sarandon-dropped-by-uta-over-anti-jewish-rant/"
  },
  {
    "text": "Record percentage says they or someone in household owns a gun: Survey  —  More than half of American voters, a record-high number, say they or someone in their household owns a gun, a new NBC News poll found.  —  According to the survey, which has polled voters since 1999 … ",
    "url": "https://thehill.com/blogs/blog-briefing-room/4322944-american-gun-ownership-record-survey/"
  }
]