[
  {
    "text": "Pence told Jan. 6 special counsel harrowing details about 2020 aftermath, warnings to Trump: Sources  —  The former VP is the top official known to have spoken with investigators.  —  In this Nov. 24, 2020 file photo President Donald Trump and Vice President Mike Pence prepare to speak … ",
    "url": "https://abcnews.go.com/US/pence-told-jan-6-special-counsel-harrowing-details/story?id=105183391"
  },
  {
    "text": "Bid to hold Trump accountable for Jan. 6 violence stalls at appeals court  —  The long-awaited D.C. Circuit ruling in a trio of civil lawsuits could influence Trump's criminal cases as well.  —  A federal appeals court mulling Donald Trump's legal liability for Jan. 6 violence is approaching a conspicuous anniversary of inaction.",
    "url": "https://www.politico.com/news/2023/11/27/trump-immunity-appeal-00128786"
  },
  {
    "text": "‘Take It Seriously’: Presidential Historian Issues Warning Over New Donald Trump Vow  —  “This is what authoritarians do.  This is what fascists do,” said Michael Beschloss, who explained why the former president must be taken at his word.  —  LOADING  —  NBC News presidential historian … ",
    "url": "https://www.huffpost.com/entry/michael-beschloss-donald-trump-second-term_n_6565a0fae4b05f498ba1b36d"
  },
  {
    "text": "Trump's New Gambit to Delay His Trials Isn't Quite Working  —  The New York judge overseeing Donald Trump's hush money trial won't even consider pushing it back, especially after prosecutors accused defense lawyers of delay games. … Donald Trump's calendar is filling up—and not with campaign events.",
    "url": "https://www.thedailybeast.com/trumps-new-gambit-to-delay-his-trials-isnt-quite-working"
  },
  {
    "text": "Georgia prosecutors oppose plea deals for Trump, Meadows and Giuliani  —  Exclusive: sources say Fulton county prosecutors unwilling to offer deals to key trio, preferring instead to force them to trial  —  Fulton county prosecutors do not intend to offer plea deals to Donald Trump and at least … ",
    "url": "https://www.theguardian.com/us-news/2023/nov/28/trump-trial-georgia-no-plea-deal"
  },
  {
    "text": "CIA director pushes big hostage deal in secret meeting with Mossad chief  —  The meeting in Qatar comes as William Burns takes on a central role navigating the crisis for President Biden  —  CIA Director William J. Burns arrived in Qatar on Tuesday for secret meetings with Israel's spy chief … ",
    "url": "https://www.washingtonpost.com/national-security/2023/11/28/cia-william-burns-israel-hamas-hostages/"
  },
  {
    "text": "Why Biden is falling behind on nominations  —  Good morning, Early Birds.  This evening is the Capitol Christmas Tree Lighting.  The tree is a Norway spruce from West Virginia's Monongahela National Forest.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.",
    "url": "https://www.washingtonpost.com/politics/2023/11/28/why-biden-is-falling-behind-nominations/"
  },
  {
    "text": "The Hunter Biden counter-offensive: A strategy long overdue, or a political minefield  —  The president's son has a new legal plan, and it will play out in parallel with his father's reelection campaign.  —  For years, as Hunter Biden faced a protracted criminal probe … ",
    "url": "https://www.politico.com/news/2023/11/28/hunter-biden-legal-strategy-00127787"
  },
  {
    "text": "Sports Illustrated Published Articles by Fake, AI-Generated Writers  —  There was nothing in Drew Ortiz's author biography at Sports Illustrated to suggest that he was anything other than human.  —  “Drew has spent much of his life outdoors, and is excited to guide you through his never-ending list … ",
    "url": "https://futurism.com/sports-illustrated-ai-generated-writers"
  },
  {
    "text": "Jewish groups sue University of California over ‘unchecked’ antisemitism  —  The 36-page lawsuit argues that UC Berkeley and its law school's inaction on discrimination against Jewish students has led to a spread of antisemitism.  —  Jewish groups are suing the University of California system … ",
    "url": "https://www.politico.com/news/2023/11/28/jewish-groups-university-california-antisemitism-lawsuit-00128772"
  },
  {
    "text": "Why the Fifth Circuit Keeps Making Such Outlandish Decisions  —  Where to even start in cataloging the most ridiculous—and alarming—recent rulings to come out of the U.S. Court of Appeals for the Fifth Circuit?  —  There's a case about whether a class action could go forward that boiled … ",
    "url": "https://www.theatlantic.com/politics/archive/2023/11/fifth-circuit-conservative-supreme-court/676116/"
  },
  {
    "text": "Russian Court Extends Detention of WSJ Reporter  —  Evan Gershkovich has been in custody since March and denies an allegation of espionage  —  A Russian court ruled to extend the detention of Wall Street Journal reporter Evan Gershkovich for a third time since he was taken into custody … ",
    "url": "https://www.wsj.com/world/russia/russian-court-extends-detention-of-wsj-reporter-ae25407c?mod=followamazon"
  },
  {
    "text": "Uncharitable giving  —  In the United States, the federal tax deduction for charitable giving was created in 1917.  The idea was that non-profit organizations provide tangible benefits to society, and donations should be encouraged.  The tax deduction effectively lowers the cost of donations to worthy causes through a public subsidy.",
    "url": "https://popular.info/p/uncharitable-giving"
  },
  {
    "text": "GOP faces ominous signs in effort to avoid January shutdown  —  No government funding bills are scheduled to hit the House floor this week, an ominous sign for Republicans returning to Washington for the first time since their Thanksgiving recess.  —  Lawmakers face a mid-January deadline … ",
    "url": "https://thehill.com/homenews/house/4329841-house-gop-funding-bills/"
  },
  {
    "text": "‘Stop the price gouging’: Biden hits corporations over high consumer costs  — President Joe Biden took aim at corporations for charging prices he said were artificially high.  — “Any corporation that has not brought their prices back down, even as inflation has come down … ",
    "url": "https://www.cnbc.com/2023/11/27/white-house-supply-chain-bidenomics-wins.html"
  },
  {
    "text": "Antagonisms flare as red states try to dictate how blue cities are run  —  Despite long advocating small government and local control, Republican governors and legislators across a significant swath of the country are increasingly overriding the actions of Democratic cities … ",
    "url": "https://www.washingtonpost.com/nation/2023/11/27/red-states-blue-cities-preemption-control/"
  },
  {
    "text": "In Alabama, another small-town paper hit in ‘open season’ on free press  —  It's an increasingly familiar drama: Local authorities go after journalists and publishers of small papers, which find themselves on the First Amendment's front lines.  —  ATMORE, Ala. — When Don Fletcher checked … ",
    "url": "https://www.washingtonpost.com/style/media/2023/11/27/atmore-news-arrests-alabama/"
  },
  {
    "text": "Jimmy Carter and all living former first ladies to attend Rosalynn Carter's memorial service  —  Former President Jimmy Carter is expected to attend the Tuesday memorial service for his late wife, Rosalynn Carter, in Atlanta, his grandson told CNN - a tribute that will also be attended by all of the living former first ladies.",
    "url": "https://www.cnn.com/2023/11/27/politics/president-jimmy-carter-rosalynn-funeral/"
  },
  {
    "text": "Expelling George Santos: Democrats May Force GOP's Hand  —  Democrats may make the first move if Santos doesn't resign, or if GOP leaders don't act  —  As GOP leaders agonize over how to handle disgraced Rep. George Santos, R-N.Y., whose expulsion from Congress seemed inevitable last week, Democrats have a plan to force action.",
    "url": "https://themessenger.com/politics/expelling-george-santos-democrats-may-force-gops-hand"
  }
]