[
  {
    "text": "Republicans can't pass bills for the same reason they support insurrection  —  The defense bill disaster shows that they can't even make deals with themselves. … Republican House Speaker Kevin McCarthy and the foaming clown car that is his caucus once again performed their expected rituals … ",
    "url": "https://www.publicnotice.co/p/house-republicans-mccarthy-defense-bill-disaster"
  },
  {
    "text": "Republicans resigned to being the villains in the inevitable government shutdown  —  “We always get the blame,” said Rep. Mike Simpson.  —  Washington is reaching a consensus: the government will shut down in 10 days — and Republicans will bear the brunt of voter disgust over it.",
    "url": "https://www.politico.com/news/2023/09/20/republicans-villains-government-shutdown-00117191"
  },
  {
    "text": "House Republicans expected to break logjam on Pentagon funding bill Thursday  —  House Republicans on Thursday are expected to advance a Department of Defense appropriations bill after successfully appeasing some hard-right lawmakers to end a broader blockade on considering long-term spending bills.",
    "url": "https://www.washingtonpost.com/politics/2023/09/21/house-republicans-spending/"
  },
  {
    "text": "Playbook: A breakthrough or a mirage?  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  WELCOME TO WASHINGTON, MR. ZELENSKYY — This morning, more than two dozen Hill Republicans — including six senators, led by Ohio's J.D. VANCE — are sending a letter … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/09/21/a-breakthrough-or-a-mirage-00117301"
  },
  {
    "text": "The Patriot  —  How General Mark Milley protected the Constitution from Donald Trump  —  The missiles that comprise the land component of America's nuclear triad are scattered across thousands of square miles of prairie and farmland, mainly in North Dakota, Montana, and Wyoming.",
    "url": "https://www.theatlantic.com/magazine/archive/2023/11/general-mark-milley-trump-coup/675375/"
  },
  {
    "text": "Why Is Donald Trump Afraid to Debate?  —  He's ducking exchanges with his competitors who could challenge his record and platform.  —  Donald Trump has a big lead in the polls for the GOP presidential nomination, but he's acting as if he has already won.  After skipping the first GOP debate … ",
    "url": "https://www.wsj.com/articles/donald-trump-debate-reagan-library-gop-2024-5770926f?mod=followamazon"
  },
  {
    "text": "It's Not a Race, Yet, in the Republican Primary  —  Donald Trump is polling about as well as any candidate in the modern history of contested presidential primaries.  —  Donald J. Trump's lead in the Republican primary just keeps growing.  —  He breached 60 percent of the vote in Fox News … ",
    "url": "https://www.nytimes.com/2023/09/21/upshot/polls-trump-republicans-primary.html"
  },
  {
    "text": "Ron DeSantis' descent continues, unabated by the debate and time on the trail  —  At the same time, the Florida governor is racing to raise money in Texas and California.  —  Ron DeSantis' long slide continues.  —  The Florida governor, once seen as the top rival to former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-descent-continues-unabated-debate-time-trail-rcna108101"
  },
  {
    "text": "Conservative media titan Rupert Murdoch to step down as chairman of Fox Corp. and News Corp.  —  He will become chairman emeritus of the two corporations, the company said in a news release.  —  Rupert Murdoch, the Australian press baron who reshaped conservative media in his image … ",
    "url": "https://www.nbcnews.com/media/rupert-murdoch-steps-chairman-fox-news-corp-rcna111323"
  },
  {
    "text": "Ignorant, pathetic Merrick Garland wilts on the hot seat before Congress  —  You would think that an attorney general who has presided over the embarrassing debacle of the Hunter Biden investigation would express contrition, or maybe a little anger at the underlings who have shamed him … ",
    "url": "https://nypost.com/2023/09/20/ignorant-pathetic-merrick-garland-wilts-on-the-hot-seat/"
  },
  {
    "text": "Book banners target public libraries  —  The campaign to censor America's libraries is expanding.  —  A new report from the American Library Association (ALA) finds that this year, between January 1 and August 31, there have been “695 attempts to censor library materials and services and documented challenges to 1,915 unique titles.”",
    "url": "https://popular.info/p/book-banners-target-public-libraries"
  },
  {
    "text": "Meet the Real Househusbands of the ‘Squad’  —  It pays to be married to the “Squad.”  —  As Democratic Reps. Ayanna Pressley (Mass.), Ilhan Omar (Minn.), and Cori Bush (Mo.) rage against capitalism from within the halls of Congress, their husbands bring home the bacon … ",
    "url": "https://freebeacon.com/democrats/meet-the-real-househusbands-of-the-squad/"
  },
  {
    "text": "Five suspected Russian spies to be charged in the U.K.  —  Britain has been seeking to take tougher action on external security threats and potential spies.  —  British prosecutors said on Thursday they had authorized charges to be brought against five Bulgarian nationals accused of spying for Russia for almost three years.",
    "url": "https://www.nbcnews.com/news/world/five-suspected-russian-spies-charged-uk-rcna111319"
  },
  {
    "text": "Blame Bidenomics for UAW strike  —  If you want to understand why the United Auto Workers union is striking now, look at the three factories it chose to target for its first wave shutdowns.  —  The General Motors plant in Wentzville, Missouri, makes the Chevy Colorado and the GMC Savana.",
    "url": "https://www.washingtonexaminer.com/opinion/editorials/blame-bidenomics-for-uaw-strike"
  },
  {
    "text": "The US is allowing hundreds of thousands of Venezuelans in the country to work legally  —  The Biden administration says it's granting temporary legal status to hundreds of thousands of Venezuelans who are already in the country — quickly making them eligible to work … ",
    "url": "https://apnews.com/article/biden-immigration-border-migrant-venezuela-b914be14aaeef14eb01bd10ee23067f4"
  },
  {
    "text": "Former prosecutor who quit Trump-Russia probe says she left over concerns with Barr  —  Nora Dannehy had been part of the investigation led by John Durham.  —  HARTFORD, Conn. — A former federal prosecutor who helped investigate the origins of the Trump-Russia probe said Wednesday she left … ",
    "url": "https://www.politico.com/news/2023/09/20/former-prosecutor-resigned-trump-russia-probe-barr-00117255"
  },
  {
    "text": "Texas Attorney General Ken Paxton suggests he might run against Sen. John Cornyn  —  Paxton last week was acquitted on 16 impeachment articles alleging corruption, abuse of public trust, misuse of public funds and other charges.  —  In the wake of his impeachment acquittal … ",
    "url": "https://www.nbcnews.com/politics/congress/texas-attorney-general-ken-paxton-suggests-might-run-sen-john-cornyn-rcna111302"
  },
  {
    "text": "Senate Poised to Confirm Military Chiefs, Sidestepping Tuberville Blockade  —  Three generals were on track for confirmation, but Senator Tommy Tuberville, the Alabama Republican who has been blocking them, said he would continue to hold up others over a Pentagon abortion policy.",
    "url": "https://www.nytimes.com/2023/09/20/us/politics/senate-military-nominations-tuberville.html"
  },
  {
    "text": "Extremists have turned Texas into a hotbed for hate, report finds  —  The report blames an “alarming rise in extremist ideology and activity” on white supremacist and anti-LGBTQ+ groups that are active or headquartered in Texas.  —  Texas continues to be a hotbed for extremism and antisemitism … ",
    "url": "https://www.texastribune.org/2023/09/21/texas-hate-crimes-extremists/"
  },
  {
    "text": "Trump in Iowa Rally Warns GOP They Will Lose Elections Without Exceptions to Abortion Bans  —  Trump added that Republicans should learn how to ‘properly talk about abortion’  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/trump-in-iowa-rally-warns-gop-they-will-lose-elections-without-exceptions-to-abortion-bans"
  },
  {
    "text": "Poland Seeks to Mend Ukraine Rift With Arms Supplies U-Turn  — Warsaw will continue to send weapons under existing contracts  — Escalating spat between Poland and Ukraine has alarmed allies  —  The Polish government sought to walk back remarks by its premier that the country … ",
    "url": "https://www.bloomberg.com/news/articles/2023-09-21/poland-says-it-s-still-supplying-ukraine-with-weapons"
  }
]