[
  {
    "text": "Hegseth Orders 20 Percent Cut in Four-Star Officers  —  Defense Secretary Pete Hegseth has already fired a raft of military leaders, many of them women and people of color, including the chairman of the Joint Chiefs of Staff.  —  Defense Secretary Pete Hegseth ordered a 20-percent reduction … ",
    "url": "https://www.nytimes.com/2025/05/05/us/politics/pete-hegseth-military-cuts.html"
  },
  {
    "text": "Declassified Spy Memo Contradicts Trump on Venezuela Gang Ties  —  The release of the memo further undercuts the Trump administration's rationale for using the Alien Enemies Act to deport scores of Venezuelans to a prison in El Salvador.  —  A newly declassified memo released on Monday confirms … ",
    "url": "https://www.nytimes.com/2025/05/05/us/trump-venezuela-gang-ties-spy-memo.html?unlocked_article_code=1.FE8.ekrJ.ejTHcs9yc702&smid=url-share"
  },
  {
    "text": "He was protected from deportation by a legal settlement.  Trump deported him anyway.  —  Court documents, news reports and pleas from his family reveal new details about the 20-year-old Venezuelan man a judge ordered returned from El Salvador.  —  The Trump administration's deportation … ",
    "url": "https://www.politico.com/news/2025/05/05/daniel-lozano-camargo-el-salvador-deportation-00330300"
  },
  {
    "text": "TeleMessage suspends services after hackers claim to have stolen files  —  The app was seemingly used by Mike Waltz in last week's Cabinet meeting, according to a photograph published by Reuters.  —  TeleMessage, the app that President Donald Trump's former national security adviser … ",
    "url": "https://www.nbcnews.com/tech/security/telemessage-suspends-services-hackers-say-breached-app-rcna204925"
  },
  {
    "text": "Hegseth Used Multiple Signal Chats for Official Pentagon Business  —  In at least one message, he asked aides to tell foreign countries about a military operation  —  Defense Secretary Pete Hegseth used Signal more extensively for official Pentagon business than previously disclosed … ",
    "url": "https://www.wsj.com/politics/national-security/pete-hegseth-signal-chats-defense-department-pentagon-ec9a4daa?st=T6CCqw&reflink=article_copyURL_share"
  },
  {
    "text": "Judge Orders Elections Board to Certify Democrat's Victory in Contested N.C. Race  —  The federal ruling on Monday was the most significant legal victory yet for Justice Allison Riggs, the Democratic incumbent in a State Supreme Court race.  —  A federal judge on Monday ordered … ",
    "url": "https://www.nytimes.com/2025/05/05/us/north-carolina-supreme-court-federal-ruling.html?unlocked_article_code=1.FE8.cjlU.we-IxpAfbevP&smid=url-share"
  },
  {
    "text": "Federal judge orders NC to certify Riggs as winner in Supreme Court election  —  In a ruling that could put an end to nearly six months of legal battles over North Carolina's contested Supreme Court election, a federal judge on Monday ruled against the Republican candidate's effort to overturn his narrow loss.",
    "url": "https://www.newsobserver.com/news/politics-government/article305391111.html"
  },
  {
    "text": "'It's been a tough period': NIH's new director speaks with Science  —  Jay Bhattacharya discusses staff morale, grant cuts, and “rumors”  —  When Jayanta “Jay” Bhattacharya took the helm of the National Institutes of Health (NIH) on 1 April, the agency was in turmoil.",
    "url": "https://www.science.org/content/article/it-s-been-tough-period-nih-s-new-director-speaks-science"
  },
  {
    "text": "Georgia Gov. Brian Kemp passes on running for Senate  —  The popular governor looked like a prime recruit against Sen. Jon Osoff.  —  Georgia Gov. Brian Kemp will not run for Senate in 2026, according to three people familiar with his decision.  —  Kemp, a popular Republican … ",
    "url": "https://www.politico.com/news/2025/05/05/georgia-gov-brian-kemp-passes-on-running-for-senate-00327843"
  },
  {
    "text": "Israel plans to occupy and flatten all of Gaza if no deal by Trump's trip  —  Israel has set President Trump's visit to the Middle East next week as a deadline for a new hostage and ceasefire deal, with a massive ground operation to commence if no deal is reached, Israeli officials say.",
    "url": "https://www.axios.com/2025/05/05/israel-gaza-destroy-trump-deal"
  },
  {
    "text": "Scoop: Senate Democrats to host Ezra Klein as retreat special guest  —  Senate Democrats have invited New York Times columnist Ezra Klein and Democratic data guru David Shor to talk to senators at their annual one-day issues retreat on Wednesday, sources tell Axios.",
    "url": "https://www.axios.com/2025/05/06/senate-democrats-ezra-klein-david-shor"
  },
  {
    "text": "Trump Administration Disqualifies Harvard From Future Research Grants  —  A letter from Linda McMahon, the education secretary, said the college leaders must demonstrate more responsible management of the university before receiving additional federal grants.",
    "url": "https://www.nytimes.com/2025/05/05/us/politics/trump-harvard-research-grants.html"
  },
  {
    "text": "Newsom Asks Trump to Work With Him on $7.5 Billion Tax Credit for Hollywood  —  The proposal for a federal program came after the president called for tariffs on movies filmed overseas, causing confusion and concern across the industry.  —  A day after President Trump stunned Hollywood … ",
    "url": "https://www.nytimes.com/2025/05/05/movies/tariffs-trump-voight.html"
  },
  {
    "text": "Trump announced Alcatraz reopening just hours after ‘Escape from Alcatraz’ aired on a South Florida PBS station  —  The 1979 film starring Clint Eastwood about the daring 1962 escape attempt aired on the local PBS channel just six hours before the president made his demand that the prison be reopened",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-escape-from-alcatraz-pbs-b2745233.html"
  },
  {
    "text": "DHS Is Touting High Deportation Numbers — But Won't Say How It's Counting  —  Some of the administration's removal numbers are raising red flags with experts who closely track immigration enforcement.  — Copy  —  While the Trump administration boasts about its high deportation numbers … ",
    "url": "https://www.notus.org/immigration/trump-removal-numbers-records-questions"
  },
  {
    "text": "Europe Seeks To Lure U.S. Scientists Disenfranchised Under Trump  —  Joshua Cohen is a Boston-based writer who covers health policy.  —  SaveComment  —  At a conference at Sorbonne University in Paris on Monday, May 5th, President Emmanuel Macron of France and the president of the European Commission … ",
    "url": "https://www.forbes.com/sites/joshuacohen/2025/05/05/europe-seeks-to-lure-us-scientists-disenfranchised-under-trump/"
  },
  {
    "text": "Trump's Justice Department Just Sided With Biden On Abortion Pill Case  —  The Trump administration essentially kicked the can down the road in the ongoing lawsuit over mifepristone.  —  President Donald Trump's Department of Justice sided with the Biden administration's defense of mifepristone … ",
    "url": "https://www.huffpost.com/entry/trump-biden-abortion-pill-case_n_6819304be4b085c2f857abb6"
  },
  {
    "text": "White House urges patience on tariffs as anxiety over prices escalates  —  Port officials say they've yet to hear from the administration as their shipping volumes plunge.  —  President Donald Trump and his top aides have settled on a decidedly non-Trumpian message for American businesses … ",
    "url": "https://www.politico.com/news/2025/05/05/white-house-tariffs-anxiety-00330259"
  },
  {
    "text": "US appeals court rejects Trump bid to revoke 400,000 migrants' legal status  —  A federal appeals court rejected on Monday a request by U.S. President Donald Trump's administration to allow it to revoke the temporary legal status of hundreds of thousand of Cubans, Haitians, Nicaraguans and Venezuelans living in the United States.",
    "url": "https://www.reuters.com/legal/us-appeals-court-rejects-trump-bid-revoke-400000-migrants-legal-status-2025-05-05/"
  },
  {
    "text": "A militarized conspiracy theorist group believes radars are ‘weather weapons’ and is trying to destroy them  —  National Weather Service offices around the country are on guard after recent threats to agency infrastructure — specifically Doppler weather radars — from a violent militia-style group … ",
    "url": "https://cnn.com/2025/05/05/weather/weather-weapons-nws-radar-attack"
  },
  {
    "text": "Stephen Miller's Former Colleague Reveals Why He Is a ‘Horrible Human Being’  —  NO HOLDS BARRED  —  Former homeland security adviser Olivia Troye didn't hold back when asked about one of President Donald Trump's top aides.  —  A former White House colleague of Stephen Miller had some things … ",
    "url": "https://www.thedailybeast.com/stephen-millers-former-colleague-reveals-why-he-is-a-horrible-human-being/"
  },
  {
    "text": "Trump Crypto Deals Provoke Senate Backlash and Calls for Investigation  —  Some Democrats who had supported legislation for so-called stablecoins are now demanding tougher language to prevent fraud and money laundering.  —  Senate Democrats are demanding changes to cryptocurrency legislation pending … ",
    "url": "https://www.nytimes.com/2025/05/05/us/politics/trump-crypto-senate-investigation.html?unlocked_article_code=1.E08.vWPU.fikxBeA7k1wc&smid=url-share"
  },
  {
    "text": "A.I. Is Getting More Powerful, but Its Hallucinations Are Getting Worse … Last month, an A.I. bot that handles tech support for Cursor, an up-and-coming tool for computer programmers, alerted several customers about a change in company policy.  It said they were no longer allowed to use Cursor on more than just one computer.",
    "url": "https://www.nytimes.com/2025/05/05/technology/ai-hallucinations-chatgpt-google.html"
  },
  {
    "text": "Trump ally Laura Loomer uses Nazi slogan to call for replacing Indian American congressperson  —  Loomer: “It'd be nice to have an American there, like a real blood and soil American”  —  Loomer's use of “blood and soil” is notable because the phrase is identified as a “Nazi rallying cry.”",
    "url": "https://www.mediamatters.org/laura-loomer/trump-ally-laura-loomer-uses-nazi-slogan-call-replacing-indian-american-congressperson"
  },
  {
    "text": "White House Says Trump's Proposal to Rename Veterans Day Has Been Scrapped  —  The White House has backed off President Donald Trump's stunning social media proposal to change the name of Veterans Day to “Victory Day for World War I” and will settle for keeping the name while adding … ",
    "url": "https://www.military.com/daily-news/2025/05/05/white-house-retreat-trumps-short-lived-proposal-rename-veterans-day.html"
  },
  {
    "text": "Pence rebuffs Trump on tariffs, Russia and January 6 pardons in CNN interview  —  Editor's Note: Watch Kaitlan Collins' interview with former Vice President Mike Pence on CNN's “The Source” at 9 pm ET.  —  CNN  —  Former Vice President Mike Pence criticized President Donald Trump's across … ",
    "url": "https://cnn.com/2025/05/05/politics/january-6-pence-trump-tariffs-russia"
  },
  {
    "text": "Former official targeted by Trump says the president is trying to silence critics  —  “You don't need a permission slip in the United States to criticize the president,” Miles Taylor told NBC News in an exclusive interview.  —  A former Homeland Security official whom President Donald Trump accused … ",
    "url": "https://www.nbcnews.com/politics/national-security/former-official-targeted-trump-says-president-trying-silence-critics-rcna204807"
  },
  {
    "text": "AOC won't seek top Oversight Committee post  —  She cited the caucus' preference for seniority.  —  Rep. Alexandria Ocasio-Cortez said Monday she won't seek the top Democratic position on the Oversight Committee, citing the caucus' preference for seniority.",
    "url": "https://www.politico.com/news/2025/05/05/aoc-wont-seek-top-oversight-committee-post-00330184"
  },
  {
    "text": "Illinois Democrat Schakowsky won't seek Congress reelection in 2026 after 14 terms  —  U.S. Rep. Jan Schakowsky announced Monday that she won't seek reelection next year after 14 terms, making her the latest longtime Illinois Democrat to announce a retirement from Congress.",
    "url": "https://apnews.com/article/jan-schakowsky-election-2026-illinois-5dd0c8e53158efd29a58c3f157535c25"
  }
]