[
  {
    "text": "How to think morally about the Israel-Hamas war  —  Massacring civilians is neither decolonization nor self-defense.  —  In southern Israel, Hamas terrorists broke into a room where a family of five was hiding and slaughtered every one of them.  In Gaza, a father wrapped in gauze held his child … ",
    "url": "https://www.vox.com/world-politics/23911550/israel-hamas-war-gaza-palestine-leftist-democrats"
  },
  {
    "text": "Rep. Rashida Tlaib, facing censure motion, calls Hamas actions ‘war crimes’  —  U.S. Rep. Rashida Tlaib, D-Detroit, said Wednesday evening her critics are purposefully distorting her position to make it seem she is sympathetic to Hamas and its attacks on Israel, which she called “war crimes.”",
    "url": "https://www.freep.com/story/news/politics/2023/10/11/rashida-tlaib-israel-hamas-war-crimes/71148560007/"
  },
  {
    "text": "Blinken Says Number of Americans Killed in Israel Has Risen to 25  —  The Secretary of State traveled to Israel to meet with Prime Minister Benjamin Netanyahu and emphasize that 'the United States has Israel's back' … U.S. Secretary of State Antony Blinken on Thursday said that the number … ",
    "url": "https://themessenger.com/politics/blinken-says-number-of-americans-killed-in-israel-has-risen-to-25"
  },
  {
    "text": "Cenk Uygur running for president as Democrat  —  The News  —  Progressive pundit Cenk Uygur will challenge President Biden for the Democratic nomination, offering himself as an alternative to an incumbent who “is definitely going to lose” if he makes it to the general election.",
    "url": "https://www.semafor.com/article/10/11/2023/cenk-uygur-running-for-president-as-democrat"
  },
  {
    "text": "Sen. Mitt Romney urged Democratic senators to challenge Biden — and he named names  —  At the Park City E2 Summit with Republican donors and influencers, the Utah senator made another plea for the anti-Trump crowd to coalesce around a single opponent to Trump",
    "url": "https://www.deseret.com/2023/10/10/23910516/mitt-romney-e2-summit-trump-israel-biden"
  },
  {
    "text": "Playbook: Why you shouldn't write Scalise off just yet  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  MAYBE NEXT TIME — “$1.73 billion Powerball jackpot goes to lucky lottery player in California,” AP  —  AMERICA'S VICTIMS — “More than 20 Americans were killed in Israel.",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/12/why-you-shouldnt-write-scalise-off-just-yet-00121150"
  },
  {
    "text": "Fox News Poll: Support for Haley doubles in GOP primary, she tops Biden by four  —  Trump received 59% support among Republican voters … Former President Donald Trump maintains his commanding lead in the Republican presidential contest, but his nomination would unify Democrats in the general election … ",
    "url": "https://www.foxnews.com/official-polls/fox-news-poll-haley-doubles-gop-primary-biden"
  },
  {
    "text": "Donald Trump Criticizes Israel PM Benjamin Netanyahu, Calls Hezbollah ‘Very Smart’  —  The former president admitted he could have been dishing classified information at a campaign event with a claim about the Israeli leader.  —  LOADING  —  Former President Donald Trump … ",
    "url": "https://www.huffpost.com/entry/donald-trump-israel-hezbollah_n_6527b1aae4b0102e6964bb29"
  },
  {
    "text": "Trump Lawyers Want Us to Believe Key Witness Knows Nothing  —  During his bank fraud trial in New York, Donald Trump's lawyers said ex-controller Jeff McConney wasn't an expert on real estate values—except that was his job for Trump.  —  For years, a high-ranking accountant at the Trump Organization … ",
    "url": "https://www.thedailybeast.com/trump-lawyers-want-us-to-believe-key-witness-jeff-mcconney-knows-nothing"
  },
  {
    "text": "Steve Scalise's celebration on pause  —  The House GOP's hoped-for moment of unity never materialized on Wednesday.  Now it's another long slog ahead.  —  After Steve Scalise clinched House Republicans' nod for speaker on Wednesday, he did not deliver a victory speech.",
    "url": "https://www.politico.com/news/2023/10/11/scalise-moment-of-unity-on-pause-house-gop-00121049"
  },
  {
    "text": "U.S. intelligence indicates Iranian leaders were surprised by Hamas attack  —  But Biden administration officials say Iran was “complicit” in the attack since it has armed and trained Hamas for decades.  —  American spy agencies have obtained “exquisite” intelligence that shows Iranian leaders … ",
    "url": "https://www.nbcnews.com/news/investigations/us-intelligence-indicates-iranian-leaders-surprised-hamas-attack-rcna119946"
  },
  {
    "text": "Judge Accused of Sending Wildly Inappropriate Texts During Her First Murder Trial  —  The Oklahoma judge swapped more than 500 texts about everything from a prosecutor's genitals to a “pretty” cop, an investigation found.  —  An Oklahoma judge could be booted from the bench after an investigation found … ",
    "url": "https://www.thedailybeast.com/oklahoma-judge-traci-soderstrom-busted-sending-inappropriate-texts-during-murder-trial"
  },
  {
    "text": "North Carolina's cautionary tale for purple states  —  Republicans have made themselves so powerful, it doesn't matter if Dems win elections. … North Carolina Republicans are having a very good year, and now that they've locked down both the legislature and the judiciary … ",
    "url": "https://www.publicnotice.co/p/north-carolina-gop-power-grab-roy-cooper"
  },
  {
    "text": "Texas Republicans are fighting about whether it's OK to associate with white supremacists  —  Last week, Jonathan Stickland — president of the far-right Defend Texas Liberty PAC and a former state representative — met with notorious white supremacist Nick Fuentes and other right-wing extremists.",
    "url": "https://popular.info/p/texas-republicans-are-fighting-about"
  },
  {
    "text": "Supreme Court likely to side with South Carolina GOP in racial gerrymandering case  —  A lower court had ruled that the state's Republican-drawn map was a racial gerrymander.  —  The Supreme Court's conservative majority on Wednesday appeared likely to uphold a Republican-drawn congressional district … ",
    "url": "https://www.politico.com/news/2023/10/11/supreme-court-likely-to-side-with-south-carolina-gop-in-racial-gerrymandering-case-00121003"
  },
  {
    "text": "She was told her twin sons wouldn't survive.  Texas law made her give birth anyway.  —  Miranda Michel, 26, couldn't leave the state for an abortion.  But she also couldn't bear the idea of carrying a nonviable pregnancy to term.  —  Editor's note: This story includes images some people may find distressing.",
    "url": "https://www.texastribune.org/2023/10/11/texas-abortion-law-texas-abortion-ban-nonviable-pregnancies/"
  },
  {
    "text": "Biden's choice: Let Iranian oil flow or watch prices rise  —  “Without oil, they have no money,” Sen. Lindsey Graham said of the Iranians.  “Without money, terrorism loses its biggest benefactor.”  —  Hamas' attack on Israel is bringing pressure on President Joe Biden to clamp … ",
    "url": "https://www.politico.com/news/2023/10/12/biden-iran-oil-gas-prices-00120924"
  },
  {
    "text": "It's Not Me, It's You: Cornel West's Messy Breakup  —  The presidential candidate's last-minute decision to ghost the Green Party is just the latest rift within the perennially squabbling American left.  —  Cornel West thinks the Greens can't take him where he wants to go.",
    "url": "https://www.politico.com/news/magazine/2023/10/12/cornel-west-campaign-breakup-green-party-00121048"
  }
]