[
  {
    "text": "A Texas-sized gamble: Details on the new map  —  We have a lot of news for you on the new shape of the political universe in Texas.  —  As early as today, Texas Republicans will release their proposed new congressional map for the Lone Star State.  —  This proposal could change some as it winds … ",
    "url": "https://punchbowl.news/article/campaigns/texas-sized-gamble/"
  },
  {
    "text": "Trump's Epstein Fiasco Worsens as Dems Suddenly Find Big New Weapon  —  Desperate times may call for desperate measures, but they also call for creative ones.  Faced with a criminal president and a GOP congressional majority that's wholly devoted to shutting down any and all transparency … ",
    "url": "https://newrepublic.com/article/198613/trump-epstein-fiasco-democrats-new-weapon"
  },
  {
    "text": "U.S. Economy Slowed in First Half of 2025 as Tariffs Scrambled Data  —  Gross domestic product rebounded in the spring after contracting at the start of the year, but consumer spending remained weak.  —  Economic growth softened in the first half of the year, as tariffs … ",
    "url": "https://www.nytimes.com/2025/07/30/business/us-economy-grew-in-second-quarter-as-tariffs-scrambled-data.html"
  },
  {
    "text": "U.S. Economy Grew at 3.0% Rate in Second Quarter  —  Consumer spending rose 1.4% but was offset by weaker business spending  —  Created with Highcharts 9.0.1GDP, change from previous quarterSources: Commerce Department (actual); WSJ survey of economists (forecasts)Notes … ",
    "url": "https://www.wsj.com/economy/us-gdp-q2-2025-359c022b?st=ENJB6g"
  },
  {
    "text": "House Democrats Sue ICE for Barring Them From Detention Facilities  —  The 12 Democrats accused the Trump administration of violating the law when it turned them away from immigrant detention sites and imposed a new policy limiting congressional access.  —  A dozen House Democrats who were barred … ",
    "url": "https://www.nytimes.com/2025/07/30/us/politics/house-democrats-ice-lawsuit.html?unlocked_article_code=1.aU8.E5nf.s72A-xs4VIy0&smid=url-share"
  },
  {
    "text": "Kamala Harris will not run for California governor, opening door for 2028 run  —  Harris has not ruled out another run for the White House, according to confidantes, while exploring the formation of a new group.  —  LOS ANGELES — Kamala Harris will not run for governor of California next year … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/30/kamala-harris-governor-president-2028/"
  },
  {
    "text": "Kamala Harris decides not to run for governor of California  —  The former vice president gave “serious thought” to a campaign but opted against it, after losing the 2024 presidential race.  —  Former Vice President Kamala Harris will not run for California governor, she announced Wednesday … ",
    "url": "https://www.nbcnews.com/politics/2026-election/kamala-harris-decides-not-run-governor-california-rcna222048"
  },
  {
    "text": "Brazil's President Lula Voices Frustration With Trump Amid Tariff Battle  —  Faced with threats of 50 percent tariffs and demands to end a criminal case, President Luiz Inácio Lula da Silva said he wouldn't take orders from President Trump.  —  President Luiz Inácio Lula da Silva … ",
    "url": "https://www.nytimes.com/2025/07/30/world/americas/brazil-president-lula-trump-tariffs.html?unlocked_article_code=1.aU8.mjgu.X19KMuAu-93E&smid=url-share"
  },
  {
    "text": "Trump says Epstein ‘stole’ Virginia Giuffre, a heartless and revealing admission  —  Virginia Giuffre died by suicide only three months ago, having lived much of her life as an advocate for survivors of sex trafficking.  Now the president is speaking about her like she's property.",
    "url": "https://www.usatoday.com/story/opinion/columnist/2025/07/29/trump-virginia-giuffre-epstein-mar-a-lago/85431490007/"
  },
  {
    "text": "Now That They're Free  —  Venezuelan men deported by the Trump administration say they endured months of physical and mental abuse inside a Salvadoran prison.  Though happy to be home, they say the fact that they were released is proof of how senseless their detentions were.  —  Reporting Highlights",
    "url": "https://www.propublica.org/article/venezuelan-men-cecot-interviews-trump"
  },
  {
    "text": "Fed holds rates steady but sees first double dissent in three decades  —  The Federal Reserve kept short-term interest rates at a level of 4.25 percent to 4.5 percent on Wednesday, but the vote saw the first double dissent from Fed board officials in more than 30 years.",
    "url": "https://thehill.com/homenews/administration/5427938-federal-reserve-interest-rates/"
  },
  {
    "text": "How the Israeli Right Explains the Aid Disaster It Created  —  The fiercest defenders of Netanyahu's war in Gaza continue to insist that Palestinians aren't starving.  —  Last week, in a piece for the Guardian, Nick Maynard, a volunteer surgeon at a hospital in southern Gaza, wrote … ",
    "url": "https://www.newyorker.com/news/q-and-a/how-the-israeli-right-explains-the-aid-disaster-it-created"
  },
  {
    "text": "Paramount deal thrusts David Ellison into Trump's war with US media  —  What began as a Hollywood studio merger has become a test of how far corporate America will bend to president's will  —  Anna Nicolaou and James Fontanella-Khan in New York, Christopher Grimes in Los Angeles and Daniel Thomas in London",
    "url": "https://www.ft.com/content/b0771100-9180-4a73-adb4-38595aa8c15c"
  },
  {
    "text": "Patel found thousands of sensitive Trump-Russia probe docs inside ‘burn bags’ in secret room at FBI  —  EXCLUSIVE: FBI Director Kash Patel found a trove of sensitive documents related to the origins of the Trump-Russia probe buried in multiple “burn bags” in a secret room inside the bureau, sources told Fox News Digital.",
    "url": "https://www.foxnews.com/politics/patel-found-thousands-sensitive-trump-russia-probe-docs-inside-burn-bags-secret-room-fbi"
  },
  {
    "text": "Fossil Fool  —  How Europe took Trump for a ride  —  Like many U.S. institutions, the European Union has abysmally failed the Trump test.  The EU is an economic superpower and could have retaliated effectively against Trump's illegal tariffs — illegal under both U.S. and international law.",
    "url": "https://paulkrugman.substack.com/p/fossil-fool"
  },
  {
    "text": "The antitrust war inside MAGA Powerful lobbyists are battling populist reformers  —  President Trump returned to the Oval Office thanks to massive support from working-class and low-income Americans.  During the transition, Trump telegraphed an intent to honor this realignment by nominating … ",
    "url": "https://unherd.com/2025/07/the-antitrust-war-inside-maga/?lang=us"
  },
  {
    "text": "Ex-CIA agent hits back at Tulsi Gabbard after she accused Obama of ‘treasonous conspiracy’ against Trump  —  Susan Miller says US intelligence chief's allegations were based on misrepresentations of discoveries made by her team about Russian actions  —  A former CIA officer who helped lead … ",
    "url": "https://www.theguardian.com/us-news/2025/jul/30/tulsi-gabbard-obama-russian-intelligence"
  },
  {
    "text": "Epstein grand jury transcripts include testimony from two witnesses, feds say  —  The disclosure raises questions on whether unsealing the transcripts would satiate the appetite for more information.  —  just now  —  The grand jury transcripts the Justice Department is seeking to make public … ",
    "url": "https://www.washingtonpost.com/national-security/2025/07/30/epstein-grand-jury-transcripts-include-testimony-two-witnesses-feds-say/"
  },
  {
    "text": "BREAKING: GOP Virginia Lawmaker Doused in Gasoline, Set on Fire in His Office - Attacker Identified and in Custody  —  A Danville, Virginia, City Councilman Lee Vogler was doused in gasoline and set on fire in his office on Tuesday.  —  According to reports, the attacker … ",
    "url": "https://www.thegatewaypundit.com/2025/07/breaking-virginia-lawmaker-doused-gasoline-set-fire-his/"
  },
  {
    "text": "His Name Is Jesus.  He's a Carpenter.  ICE Arrested Him.  —  Seriously.  —  ∙ Paid  —  JESUS TERAN FLED PERSECUTION in Venezuela, seeking asylum in the United States in 2021 and joining his family in Imperial, Pennsylvania, half an hour outside Pittsburgh.  He was living a version of the American Dream.",
    "url": "https://www.thebulwark.com/p/his-name-is-jesus-carpenter-arrested-ice-venezuela-pennsylvania-immigration"
  },
  {
    "text": "As MAGA storm over Epstein calms, White House plans next steps  —  Officials concede the furor has hurt Trump's standing, but the White House believes they've survived the worst of the furor.  —  Three weeks ago, White House officials were battling a frenzy from President Donald Trump's supporters over the Jeffrey Epstein case.",
    "url": "https://www.washingtonpost.com/politics/2025/07/30/trump-epstein-maga-white-house/"
  },
  {
    "text": "NYC Mayor's Race: Mamdani returns from Uganda trip without incident, immediately rejoins the campaign trail  —  Democratic mayoral nominee Zohran Mamdani returned to the United States on Wednesday from a week-and-a-half-long trip to his native country of Uganda and was allowed through Customs without … ",
    "url": "https://www.amny.com/news/mamdani-returns-from-uganda-campaign/"
  },
  {
    "text": "Transcript: Krugman Wrecks Trump's Europe Deal: “Scam on His Voters”  —  The following is a lightly edited transcript of the July 30 episode of the  —  Daily Blast podcast.  Listen to it here.  —  Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network.",
    "url": "https://newrepublic.com/article/198586/transcript-krugman-wrecks-trump-europe-deal-scam-voters"
  },
  {
    "text": "Texas Sen. Ted Cruz files bill to target activist groups with anti-organized crime laws  —  Activist groups that fund and organize protests could be targeted by federal law enforcement under the same statute used to go after organized crime if U.S. Sen. Ted Cruz gets his way.",
    "url": "https://www.houstonchronicle.com/politics/article/ted-cruz-rico-rioting-20789917.php"
  },
  {
    "text": "Federal Reserve issues FOMC statement  —  For release at 2:00 p.m. EDT  —  Although swings in net exports continue to affect the data, recent indicators suggest that growth of economic activity moderated in the first half of the year.  The unemployment rate remains low, and labor market conditions remain solid.",
    "url": "https://www.federalreserve.gov/newsevents/pressreleases/monetary20250730a.htm"
  },
  {
    "text": "GOP House committee chair yet to issue a subpoena for Epstein files  —  The chairman is physically required to sign each subpoena, but there is no deadline by which Rep. James Comer must issue the subpoenas, according to House rules.  —  Just now  —  A week after a House Oversight subcommittee voted … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/30/house-oversight-subpoena-epstein-files-james-comer/"
  },
  {
    "text": "Murdering higher education, 1-2-3  —  Much of Donald Trump's governing approach in his second term is to take conservative bogeymen — long used for fundraising and for riling up base voters — and actually use the power of the government to attack them.  We've seen that with foreign aid … ",
    "url": "https://smotus.substack.com/p/murdering-higher-education-1-2-3"
  },
  {
    "text": "Live updates: Trump administration to launch new private health tracking system with Big Tech's help  —  EDITED BY  BRIDGET BROWN, MICHAEL WARREN AND SHARON L. LYNCH  —  The Trump administration is pushing an initiative for millions of Americans to upload personal health data and medical records … ",
    "url": "https://apnews.com/live/donald-trump-news-updates-7-30-2025"
  },
  {
    "text": "US placed on rights watchlist over health of its civil society under Trump  —  International non-profit Civicus says ‘sustained attacks on civic freedoms’ put US on par with El Salvador and Kenya  —  A group of global civil society organizations have placed the US on a watchlist for urgent concern … ",
    "url": "https://www.theguardian.com/us-news/2025/jul/30/us-civil-society-watchlist-trump"
  },
  {
    "text": "Danny Davis to announce he won't seek House reelection  —  Democratic Rep. Danny Davis of Illinois is expected to announce Thursday he won't run for reelection in 2026, according to two people granted anonymity to discuss his plans in advance.  Davis — at 83, one of the oldest members of Congress … ",
    "url": "https://www.politico.com/live-updates/2025/07/30/congress/danny-davis-retiring-00483259"
  },
  {
    "text": "How Edward ‘Big Balls’ Coristine and DOGE Got Access to a Federal Payroll System That Serves the FBI  —  Hundreds of pages of records reviewed by WIRED show just how quickly DOGE gained access to systems at the Small Business Administration—and through it, a USDA system that handles payroll for federal law enforcement.",
    "url": "https://www.wired.com/story/edward-coristine-big-balls-doge-federal-pay-roll-system/"
  }
]