[
  {
    "text": "A “Delicate Matter”: Clarence Thomas' Private Complaints About Money Sparked Fears He Would Resign  —  Friends of the Court: SCOTUS Justices' Beneficial Relationships With Billionaire Donors  —  Supreme Court Justice Clarence Thomas' decadeslong friendship with real estate tycoon Harlan Crow … ",
    "url": "https://www.propublica.org/article/clarence-thomas-money-complaints-sparked-resignation-fears-scotus"
  },
  {
    "text": "President's Rating Hits Record Low  —  Biden gets especially poor marks on inflation and immigration; few Americans say he is paying enough attention to their concerns  —  West Long Branch, NJ - President Joe Biden's job rating has hit an all-time low in the Monmouth (\"Mon-muth\") … ",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_US_121823/"
  },
  {
    "text": "Biden said to be increasingly frustrated by dismal poll numbers  —  In one recent meeting he said poll numbers were unacceptably low and he wanted to know what his team and his campaign were doing about it  —  The night before President Biden departed Washington to celebrate Thanksgiving on Nantucket … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/18/joe-biden-polls-campaign/"
  },
  {
    "text": "Trump makes fresh bid to toss Georgia election interference charges  —  Attorneys for former President Trump on Monday formally asked a judge to toss Trump's Georgia 2020 election criminal racketeering case on First Amendment grounds.  —  Steve Sadow, Trump's lead Georgia attorney … ",
    "url": "https://thehill.com/regulation/court-battles/4366005-trump-makes-fresh-bid-to-toss-georgia-election-interference-charges/"
  },
  {
    "text": "Pope approves blessings for same-sex couples if they don't resemble marriage  —  Pope Francis has formally approved allowing priests to bless same-sex couples, with a new document explaining a radical change in Vatican policy by insisting that people seeking God's love and mercy shouldn't be subject to … ",
    "url": "https://apnews.com/article/vatican-lgbtq-pope-bfa5b71fa79055626e362936e739d1d8"
  },
  {
    "text": "Testo in lingua inglese  —  On the Pastoral Meaning of Blessings  —  This Declaration considers several questions that have come to this Dicastery in recent years.  In preparing the document, the Dicastery, as is its practice, consulted experts, undertook a careful drafting process … ",
    "url": "https://press.vatican.va/content/salastampa/it/bollettino/pubblico/2023/12/18/0901/01963.html#en"
  },
  {
    "text": "Trump's rhetoric in final campaign sprint goes to new dark extremes  —  Donald Trump's rhetoric dropped to a spine-tingling new low this weekend with less than a month before the Iowa caucuses.  —  The GOP primary front-runner said migrants are “poisoning the blood” of the US … ",
    "url": "https://www.cnn.com/2023/12/18/politics/trump-campaign-rhetoric-new-extremes/"
  },
  {
    "text": "Right-wing tantrum over Jill Biden Christmas video accidentally reveals how much MAGA hates America  —  When the “war on woke” is over, the only entertainment left for Trump cultists will be Dear Leader's speeches  —  Last week, First Lady Jill Biden, rejecting her predecessor's loathing of Christmas cheer … ",
    "url": "https://www.salon.com/2023/12/18/right-wing-tantrum-over-jill-biden-christmas-video-accidentally-reveals-how-much-maga-hates-america/"
  },
  {
    "text": "Ziwe Exposes George Santos Once and for All in Scathing Sit-Down  —  In a nearly 20-minute interview, comedian Ziwe Fumudoh gave America the George Santos takedown it was waiting for.  —  It instantly became the most hotly anticipated—and dreaded?—political stunt of the year … ",
    "url": "https://www.thedailybeast.com/ziwe-exposes-george-santos-once-and-for-all-in-scathing-sit-down"
  },
  {
    "text": "Trump defends former influencer convicted of election interference who has racist, antisemitic past  —  Donald Trump and Donald Trump Jr. have come to the defense of a one time social media influencer who has been convicted of election interference and has a well-known history of pushing deeply racist … ",
    "url": "https://www.cnn.com/2023/12/18/politics/kfile-donald-trump-defends-former-influencer-racist-antisemitic-past/"
  },
  {
    "text": "Conservatives move to keep abortion off the 2024 ballot  —  “We don't believe those rights should be subjected to majority vote.”  —  Conservatives are testing new tactics to keep abortion off the ballot following a series of high-profile defeats.  —  In Arizona, Florida, Nevada and other states … ",
    "url": "https://www.politico.com/news/2023/12/18/first-rule-of-the-anti-abortion-playbook-dont-let-the-public-vote-on-abortion-00132049"
  },
  {
    "text": "BP pauses all Red Sea shipments after rebel attacks  —  Oil giant BP has announced it is pausing all shipments of oil through the Red Sea after recent attacks on vessels by Houthi rebels.  —  The firm blamed the “deteriorating security situation” in the region as Iran-backed Houthis target ships they believe are bound for Israel.",
    "url": "https://www.bbc.com/news/business-67748605"
  },
  {
    "text": "Biden unharmed after car strikes president's motorcade in Delaware  —  It was not immediately clear why the sedan smashed into an SUV that was part of the motorcade.  The driver was surrounded by agents who had their guns drawn.  —  A sedan smacked into a Secret Service vehicle that was part … ",
    "url": "https://www.nbcnews.com/politics/politics-news/biden-unharmed-car-strikes-presidents-motorcade-delaware-rcna130189"
  },
  {
    "text": "Appeals court rejects Mark Meadows' bid to move his Georgia case out of state court  —  Meadows, who served as White House chief of staff under President Donald Trump, was previously denied a request to move his Georgia election interference case to federal court.",
    "url": "https://www.nbcnews.com/politics/politics-news/appeals-court-rejects-mark-meadows-bid-move-georgia-case-state-court-rcna130058"
  },
  {
    "text": "Interior Watchdog Confirms J6 Organizers Lied About Planned March On Capitol  —  “So, um, basically she lied to all of us,” a National Park Service official told investigators.  —  The group that organized the pro-Donald Trump rally in front of the White House on Jan. 6, 2021 … ",
    "url": "https://www.huffpost.com/entry/interior-watchdog-january-6-report_n_658081d0e4b036ecab461422"
  },
  {
    "text": "Everyone expected a recession.  The Fed and White House found a way out.  —  The economy's strength and stability — defying many of the most optimistic predictions — represents a remarkable development after seemingly endless crises  —  After two years of relentless pressure over everything … ",
    "url": "https://www.washingtonpost.com/business/2023/12/18/recession-economy-inflation/"
  },
  {
    "text": "Miami GOP Strategist Barbara Balmaseda Arrested on Capitol Riot Charges  —  Barbara Balmaseda has been charged with a felony count of obstructing an official proceeding during the Capitol riot. … Authorities have unsealed an arrest warrant for Barbara Balmaseda, a former Florida International … ",
    "url": "https://www.miaminewtimes.com/news/miami-gop-strategist-barbara-balmaseda-accused-of-storming-us-capitol-18501993"
  },
  {
    "text": "New York AG Ridicules Trump's Failed Courtroom Hail Marys  —  Donald Trump keeps asking a judge to hand him a total victory at his bank fraud trial.  The longshot strategy has failed miserably.  Now, the New York AG is tearing him apart for it.  —  The New York Attorney General's office … ",
    "url": "https://www.thedailybeast.com/new-york-ag-ridicules-trumps-failed-courtroom-hail-marys"
  },
  {
    "text": "Complaint accuses DeSantis campaign of illegally coordinating with Never Back Down  —  Campaign Legal Center has now filed a total of five complaints against DeSantis or his donors this year.  —  TALLAHASSEE, Florida — A watchdog group that has already filed several complaints … ",
    "url": "https://www.politico.com/news/2023/12/18/complaint-desantis-campaign-never-back-down-00132325"
  }
]