[
  {
    "text": "Trump executive order will attempt to end birthright citizenship  —  The incoming president plans to take at least 10 actions related to the border or immigration, including ramping up deportations and suspending refugee resettlement.  —  The U.S. government will no longer recognize … ",
    "url": "https://www.washingtonpost.com/immigration/2025/01/20/trump-immigration-executive-orders/"
  },
  {
    "text": "Here Are Trump's Expected Executive Orders  —  The incoming president's team said he would take unilateral action on a variety of fronts during his first hours in office, including 10 executive orders cracking down on immigration and immigrants.  —  President-elect Donald J. Trump on Monday … ",
    "url": "https://www.nytimes.com/2025/01/20/us/politics/trump-executive-orders-list.html"
  },
  {
    "text": "All of the Day 1 executive actions Trump has announced so far  —  For updates, context and analysis of Donald Trump's 2025 inauguration, check out NPR's live blog throughout the day Monday.  —  President Trump is expected to sign a flurry of executive orders, memorandums and proclamations … ",
    "url": "https://www.npr.org/2025/01/20/g-s1-43698/trump-inauguration-executive-orders-2025-day-1"
  },
  {
    "text": "Trump's honeymoon won't last  —  This is a very bleak moment for the United States and the world.  —  Donald Trump takes office today promising to immediately start in on a litany of human rights abuses and other efforts to harm marginalized people.  He's promised a sweeping assault … ",
    "url": "https://www.publicnotice.co/p/trump-inauguration-honeymoon-will-not-last"
  },
  {
    "text": "‘Disgrace’: Pope Francis revives feud with Trump just before inauguration  —  Pope Francis blasted Donald Trump's plans to deport millions of undocumented immigrants, calling the United States president-elect's proposal a “disgrace.”  —  “If true, this will be a disgrace … ",
    "url": "https://www.politico.eu/article/pope-francis-reviive-feud-donald-trumps-mass-deportation-plan-disgrace/"
  },
  {
    "text": "Biden pardons Fauci, Milley and the Jan. 6 committee in effort to guard against ‘revenge’ by Trump  —  President Joe Biden on Monday pardoned Dr. Anthony Fauci, retired Gen. Mark Milley and members of the House committee that investigated the Jan. 6 attack on the Capitol … ",
    "url": "https://apnews.com/article/biden-trump-fauci-milley-pardons-january-6-3cba287f89051513fb48d7ae700ae747"
  },
  {
    "text": "Biden in Final Hours Pardons Relatives and Others to Thwart Trump Reprisals  —  President Biden used his executive clemency power to protect people targeted by Donald J. Trump, including five members of his family as well as Liz Cheney, Anthony S. Fauci and Mark A. Milley.",
    "url": "https://www.nytimes.com/2025/01/20/us/politics/biden-pardons-fauci-milley-cheney-jan-6.html"
  },
  {
    "text": "Trump preparing sweeping pardons for Jan. 6 defendants, with commutations for violent offenders: Sources  —  President Donald Trump is preparing to issue a sweeping series of pardons for defendants charged in the Jan. 6, 2021, attack on the U.S. Capitol, including commuting the prison sentences … ",
    "url": "https://www.goodmorningamerica.com/news/story/trump-teases-pardoning-jan-6-rioters-day-1-117880690"
  },
  {
    "text": "Statement from President Joe Biden  —  I am issuing pardons to Gerald G. Lundergan and Ernest William Cromartie.  I am also commuting the life sentence imposed on Leonard Peltier so that he serves the remainder of his sentence in home confinement.  —  My family has been subjected … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/20/statement-from-president-joe-biden-16/"
  },
  {
    "text": "Biden pardons his family in final minutes in office … President Joe Biden on Monday issued preemptive pardons for three of his siblings and two of their spouses, citing concerns that they will be targeted by “baseless and politically motivated investigations.”",
    "url": "https://www.cnbc.com/2025/01/20/biden-pardons-family-members.html"
  },
  {
    "text": "Cecile Richards, former Planned Parenthood president and feminist activist, has died  —  Richards died Monday of an aggressive brain cancer.  She was 67.  —  Cecile Richards, the former president of Planned Parenthood and feminist activist, died Monday of an aggressive brain cancer, her family confirmed in a statement.",
    "url": "https://19thnews.org/2025/01/cecile-richards-former-planned-parenthood-president-and-feminist-activist-has-died/"
  },
  {
    "text": "Elon Musk's DOGE to be sued within minutes of Trump inauguration  —  The legal status of Musk's government waste panel will be challenged in federal court almost as soon as the president-elect is sworn in.",
    "url": "https://www.washingtonpost.com/business/2025/01/20/doge-trump-musk-ramaswamy/"
  },
  {
    "text": "Trump to withdraw from Paris climate agreement  —  The decision delivers a blow to the effort to keep global temperatures from rising to dangerous levels.  —  President Donald Trump will withdraw the United States from the Paris climate agreement for the second time, delivering a blow … ",
    "url": "https://www.politico.com/news/2025/01/20/trump-withdraws-paris-climate-agreement-00199385"
  },
  {
    "text": "Joe Biden Grants Clemency To Leonard Peltier  —  The ailing Native American rights activist has been in prison for nearly 50 years after the U.S. government lied to put him there.  —  LOADING  —  WASHINGTON ― With literally minutes left in his presidency, Joe Biden on Monday granted clemency … ",
    "url": "https://www.huffpost.com/entry/joe-biden-leonard-peltier-clemency_n_67608b04e4b0d06419ec6367"
  },
  {
    "text": "Trump to rename Gulf of Mexico, Denali  —  Donald Trump will rename the Gulf of Mexico and Alaska's Denali as part of his Day One actions, incoming White House press secretary Karoline Leavitt confirmed on X on Monday morning.  Trump will rename the Gulf of Mexico the “Gulf of America,” … ",
    "url": "https://www.politico.com/live-updates/2025/01/20/donald-trump-inauguration-day-news-updates-analysis/trump-rename-00199278"
  },
  {
    "text": "Norway cool on Trump's demand for a massive defense spending increase  —  OSLO — Norway is one of the world's richest countries, but isn't signing up for U.S. President Donald Trump's demand that NATO members increase their defense budgets to 5 percent of GDP.  —  “'I'm prepared for new discussions about targets.",
    "url": "https://www.politico.eu/article/norway-donald-trump-demand-defense-spending-increase/"
  },
  {
    "text": "It's ‘Just Begun’—Trump Meme Coin Suddenly Crashes Back As Melania Coin Shock Hits Crypto  —  Crypto markets have been rocked by the launch of an “official” Donald Trump memecoin this weekend—with traders braced for more mayhem this coming week.  —  Unlock over $3,000 in NFT, web3 and crypto perks — Apply now!",
    "url": "https://www.forbes.com/sites/digital-assets/2025/01/19/its-just-begun-trump-meme-coin-suddenly-crashes-back-as-melania-coin-shock-hits-crypto/"
  },
  {
    "text": "Statement from President Joe Biden  —  Our nation relies on dedicated, selfless public servants every day.  They are the lifeblood of our democracy.  —  Yet alarmingly, public servants have been subjected to ongoing threats and intimidation for faithfully discharging their duties.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/20/statement-from-president-joe-biden-15/"
  },
  {
    "text": "Everyone Who Was Supposed To Protect You From This Failed Miserably  —  Trump will now be president again.  It was a top-to-bottom collapse and failure by every major institution that got us here  —  Many of those same people and leaders are now cashing in, paying millions in protection money, or laughing about what has happened.",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-inauguration-2024-win-democrats-failed-1235241327/"
  }
]