[
  {
    "text": "Benjamin Netanyahu failed Israel  —  We can now be sure: His policy of repressing Palestinians doesn't make Israelis safe.  —  In the past 24 hours, two reports out of Israel have pointed to a striking conclusion: that the failure to prevent Hamas's murderous assault on southern Israel rests … ",
    "url": "https://www.vox.com/23910085/netanyahu-israel-right-hamas-gaza-war-history"
  },
  {
    "text": "Putin Offers Muted Response to Attack on Israel.  That Speaks Volumes.  —  Vladimir Putin has long projected friendly ties to Israel.  But his silence since Saturday's assault illustrates how the war in Ukraine has strained the relationship between the two countries.",
    "url": "https://www.nytimes.com/2023/10/10/world/europe/israel-hamas-russia-putin.html"
  },
  {
    "text": "Hamas Attack on Israel Deals Blow to Saudi Prince's Grand Vision  — Crown Prince had a goal of normalizing relations with Israel  — Escalating conflict between Israel, Palestine is major barrier  —  Saudi Arabia's Crown Prince Mohammed bin Salman had a vision for the Middle East … ",
    "url": "https://www.bloomberg.com/news/articles/2023-10-10/saudi-arabia-crown-prince-s-israel-alliance-upended-by-hamas-war"
  },
  {
    "text": "Hamas received weapons and training from Iran, officials say  —  Militant group that slaughtered hundreds of Israelis received crucial help from Tehran  —  The Palestinian militants behind the surprise weekend attack on Israel began planning the assault at least a year ago … ",
    "url": "https://www.washingtonpost.com/national-security/2023/10/09/iran-support-hamas-training-weapons-israel/"
  },
  {
    "text": "Biden faces a host of crises and a stress test for his theory of the presidency  —  The horrific attack in Israel has created new challenges for the president and his team.  They're keenly aware that they are under the microscope.  —  The White House is scrambling to react to a combination of crises that … ",
    "url": "https://www.politico.com/news/2023/10/10/joe-biden-steady-leadership-00120660"
  },
  {
    "text": "Former Dodgers star and Republican Steve Garvey enters U.S. Senate race  —  After nearly two decades of statewide Republican candidates being rejected by California's left-leaning electorate, former Dodger All-Star Steve Garvey hopes to drag the GOP back toward political relevance.",
    "url": "https://www.latimes.com/politics/story/2023-10-10/dodgers-star-steve-garvey-senate-race-feinstein-schiff-porter-lee"
  },
  {
    "text": "Gallego leads Lake, Sinema in Arizona Senate race: poll  —  Rep. Ruben Gallego (D-Ariz.) is leading both former Arizona gubernatorial candidate Kari Lake (R) and Sen. Krysten Sinema (I-Ariz.) in a hypothetical three-way race in the Arizona Senate race, according to a new poll.",
    "url": "https://thehill.com/homenews/campaign/4246848-gallego-leads-lake-sinema-in-arizona-senate-race-poll/"
  },
  {
    "text": "North Carolina Republicans Are Creating a ‘Secret Police Force’  —  The euphemistically named “Gov Ops” is a civil liberties disaster waiting to happen. … Republican state legislators In North Carolina are establishing a new investigative body that Democratic critics have aptly compared to a “secret police force.”",
    "url": "https://www.thedailybeast.com/north-carolina-republicans-are-creating-a-secret-police-force"
  },
  {
    "text": "GOP holds emotional meeting on next speaker — but fails to unite on one  —  The need for a new speaker to help respond to the attacks in Israel came up multiple times during the two-hour meeting.  —  House Republicans huddled Monday for an emotional venting session over the party's leadership crisis.",
    "url": "https://www.politico.com/news/2023/10/09/gop-speaker-meeting-israel-hamas-00120661"
  },
  {
    "text": "House Speaker chaos threatens GOP majority  —  The political chaos surrounding the vacant Speakership in the House threatens to upend Republican efforts to hold onto their slim majority in next year's elections.  —  Questions over who would succeed former House Speaker Kevin McCarthy … ",
    "url": "https://thehill.com/homenews/campaign/4246450-house-speaker-chaos-threatens-gop-majority/"
  },
  {
    "text": "Robert F. Kennedy Jr.'s Last Gasp  —  Three words told the story.  Robert F. Kennedy Jr.'s campaign had billed this afternoon's event in Philadelphia as a “much-anticipated announcement.”  Of course, that specific phrase may have been more true than intended.",
    "url": "https://www.theatlantic.com/politics/archive/2023/10/robert-f-kennedy-president-independent/675595/"
  },
  {
    "text": "Supreme Court turns away coal baron's defamation claim against news companies  —  The justices decline to consider overturning 1964 precedent that concluded there must be evidence of “actual malice” for a public figure to pursue a defamation claim.  —  WASHINGTON — The Supreme Court … ",
    "url": "https://www.nbcnews.com/politics/supreme-court-turns-away-coal-barons-defamation-claim-news-companies-rcna118036?taid=652559055b459d0001b020b2"
  },
  {
    "text": "Montana Sen. Jon Tester Raises Another $5M, Will Report $13M Cash On Hand  —  Tester is one of the GOP's top targets in 2024  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing an external link to share the article on Twitter … ",
    "url": "https://themessenger.com/politics/montana-sen-jon-tester-raises-another-5m-will-report-13m-cash-on-hand"
  },
  {
    "text": "Democrats support Palestinians over Israel, GOP overwhelmingly stands with US ally: 2023 poll  —  Republicans overwhelmingly support Israel with 78% supporting the Middle Eastern ally  —  More Democrats in the United States support Palestinians living in Gaza and the West Bank than Israel … ",
    "url": "https://www.foxnews.com/politics/democrats-support-palestinians-over-israel-gop-overwhelmingly-stands-us-ally-2023-poll"
  },
  {
    "text": "George Santos' $500K Campaign Loan Was Fake—Until It Wasn't  —  One of Santos' former campaign aides pleaded guilty to charges last week, and according to a source who spoke to The Daily Beast, Santos is in big trouble. … Last week, a former George Santos aide pleaded guilty to federal charges … ",
    "url": "https://www.thedailybeast.com/george-santos-dollar500k-campaign-loan-was-fakeuntil-it-wasnt"
  },
  {
    "text": "Trump Wildly Claims Forbes Is a ‘China Propaganda Machine’ After He's Removed from 400 Richest Americans List  —  ‘WOW!’  —  Donald Trump lashed out at Forbes on Monday after the magazine cut him from its list of the wealthiest 400 people in America last week.",
    "url": "https://www.thedailybeast.com/trump-wildly-claims-forbes-is-a-china-propaganda-machine-after-hes-removed-from-400-richest-americans-list"
  },
  {
    "text": "Polish election ‘debate’ descends into farce  —  Opposition leader Donald Tusk challenges PM Mateusz Morawiecki to a do-over before Sunday's general election.  —  Poland's highly anticipated — and only — election debate descended into farce on Monday as the format of the show on state TV ruled … ",
    "url": "https://www.politico.eu/article/polish-election-debate-descends-into-farce/"
  },
  {
    "text": "Mitt Romney and Paul Ryan host 2024 candidates at influential donor summit  —  Nikki Haley, Chris Christie, Mike Pence and Doug Burgum, all underdogs against Donald Trump, will address potential backers in closed-door sessions  —  The influential network of donors who joined forces to boost … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/10/romney-ryan-presidential-candidates-donors/"
  },
  {
    "text": "Dems' bad dream: Menendez taunts party with potential reelect  —  More than half of Senate Democrats have now called on the indicted senator to resign.  Beyond that, right now they're just hoping he doesn't run again.  —  Indicted Sen. Bob Menendez (D-N.J.) is torturing Democrats trying … ",
    "url": "https://www.politico.com/news/2023/10/10/senate-democrats-bob-menendez-primary-challengers-00120262"
  }
]