[
  {
    "text": "Stocks Mark Worst Month in Years as Trump's Tariffs Loom  —  Markets around the world have wavered as fear and uncertainty over tariffs and trade wars rattle investors.  The S&P 500 just recorded its worst month since 2022, shedding 5.8 percent in March.  —  The S&P 500 ended March … ",
    "url": "https://www.nytimes.com/2025/03/30/business/stocks-nikkei-sp500.html"
  },
  {
    "text": "Trump is plotting the biggest tax rise in global history  —  The burden for paying the bulk of the president's Liberation Day tariffs will fall on consumers, potentially at some $600 billion a year  —  We might think of him as a tax-cutter, an enemy of big government, and an instinctive ally … ",
    "url": "https://www.telegraph.co.uk/us/comment/2025/03/31/trump-plotting-biggest-tax-rise-global-history/"
  },
  {
    "text": "Trump's Tariff Agenda Bets on Americans Giving Up Cheap Goods  —  Treasury Secretary Scott Bessent argues that the American dream is about more than cheap televisions, but inflation-weary consumers might disagree.  —  President Trump's sweeping tariffs are expected to raise the cost of cars … ",
    "url": "https://www.nytimes.com/2025/03/31/business/trump-tariffs-higher-prices.html"
  },
  {
    "text": "An ‘Administrative Error’ Sends a Maryland Father to a Salvadoran Prison  —  The Trump administration acknowledged in a court filing Monday that it had grabbed a Maryland father with protected legal status and mistakenly deported him to El Salvador, but said that U.S. courts lack jurisdiction … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/03/an-administrative-error-sends-a-man-to-a-salvadoran-prison/682254/?gift=Tsjgy5hc-Y7tsZCY3EHYrWOoNzx9Xi-w5fH-zT91Z90&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "The Makeup Artist Donald Trump Deported Under the Alien Enemies Act  —  The President has invoked the law to send Venezuelans to prison in El Salvador without due process—and, in many cases, under false pretenses.  —  Throughout the fall and winter, Alexis Romero de Hernández struggled to accept a grim new routine.",
    "url": "https://www.newyorker.com/news/annals-of-immigration/the-makeup-artist-donald-trump-deported-under-the-alien-enemies-act"
  },
  {
    "text": "U.S. Senate  —  The Senate will vote to advance President Trump's nomination of Matthew Whitaker to be the U.S. Ambassador to NATO.  He previously served as Acting Attorney General during the first Trump Administration.",
    "url": "https://www.c-span.org/event/us-senate/us-senate/432077"
  },
  {
    "text": "Cory Booker launches marathon Senate speech  —  Sen. Cory Booker is planning to hold the Senate floor for as long as he can in an effort to protest actions by President Donald Trump and congressional Republicans.  The New Jersey Democrat took to the Senate floor on Monday evening … ",
    "url": "https://www.politico.com/live-updates/2025/03/31/congress/cory-booker-talk-a-thon-00262482"
  },
  {
    "text": "Inside Cory Booker's Plan To Disrupt ‘Business As Usual’ On The Senate Floor  —  A member of the U.S. Senate took the floor at 7:00 p.m. on Monday evening — and he doesn't plan on leaving it any time soon.  In a text message to TPM, Sen. Cory Booker (D-NJ) said he was about to begin speaking for as long as he could stand.",
    "url": "https://talkingpointsmemo.com/news/inside-cory-bookers-plan-to-disrupt-business-as-usual-on-the-senate-floor"
  },
  {
    "text": "Live: Speaking on Trump, Musk, and America's Moral Moment on the Senate Floor  —  Senator Cory Booker (D-NJ) has taken the Senate floor and is speaking as long as he is physically able to lift the voices of Americans who are being harmed a...",
    "url": "https://youtube.com/live/v2utlMxAwtE?feature=share"
  },
  {
    "text": "The Proud Boys and Militias Come to Tesla's Defense  —  After weeks of “Tesla Takedown” protests, extremist groups are showing up to back Elon Musk's beleaguered car company.  —  Over the weekend, thousands of people joined the “Tesla Takedown” protest movement at the company's showrooms across the country.",
    "url": "https://www.wired.com/story/proud-boys-and-militias-come-to-teslas-defense/"
  },
  {
    "text": "Trump Administration Will Review Billions in Funding for Harvard  —  The administration has already canceled hundreds of millions in federal grants and contracts at Columbia and the University of Pennsylvania.  —  The Trump administration said on Monday that it was reviewing roughly $9 billion … ",
    "url": "https://www.nytimes.com/2025/03/31/us/trump-administration-harvard-funding.html"
  },
  {
    "text": "Trump task force to review Harvard's funding after Columbia bows to federal demands  —  Harvard University has become the latest target in the Trump administration's approach to fight campus antisemitism, with the announcement of a new “comprehensive review” that could jeopardize billions of dollars for the Ivy League college.",
    "url": "https://apnews.com/article/harvard-investigation-antisemitism-trump-2ee1a2a9df6d09d155dac7a4e39b186c"
  },
  {
    "text": "DOGE Is Trying to Gift Itself a $500 Million Building, Court Filings Show  —  The documents reveal a DOGE affiliate is attempting to transfer the headquarters of an independent think tank, the United States Institute of Peace, to the government at no cost.  —  The DOGE-affiliated acting president … ",
    "url": "https://www.wired.com/story/doge-takes-control-usip-office-building/"
  },
  {
    "text": "Top Officials Placed on Leave After Denying DOGE Access to Federal Payroll Systems  —  DOGE demanded full access to a US Department of the Interior system that handles even the Supreme Court's paychecks.  When top staff asked questions, they were put on leave.",
    "url": "https://www.wired.com/story/doge-access-federal-payroll-systems-officials-leave-interior/"
  },
  {
    "text": "Republican Operative Nicholas Jacobs Locks Twitter After Elon Musk Check Controversy  —  Jacobs received a $1M check from Musk at a rally in support of Brad Schimel  —  Nicholas Jacobs, chair of the Wisconsin College Republicans and a rising GOP operative, has locked his Twitter account … ",
    "url": "https://meidasnews.com/news/republican-operative-nicholas-jacobs-locks-twitter-after-elon-musk-check-controversy"
  },
  {
    "text": "Democrats Sue to Block Trump Bid to Control Elections  —  The Democratic Party is suing President Donald Trump over his sweeping executive order last week that attempted to wrest control of elections from the states.  —  Filed Monday by Elias Law Group on behalf of Senate Minority Leader Chuck Schumer … ",
    "url": "https://www.democracydocket.com/news-alerts/democrats-sue-to-block-trump-bid-to-control-elections/"
  },
  {
    "text": "I'm tired of being mocked and hated because I'm a conservative woman  —  As a conservative woman living in Texas, I often feel like I'm living a dual reality.  I'm a mom and a writer, but that's not all.  I go to church, laugh with friends and wave at my neighbors while we are walking our dogs.",
    "url": "https://www.yahoo.com/news/im-tired-being-mocked-hated-090530234.html"
  },
  {
    "text": "Trump Commutes the Sentence of Another Hunter Biden Business Associate  —  Jason Galanis had pleaded guilty to his role in two fraud schemes before cooperating with Republican congressional investigations into the Bidens.  —  President Trump last week commuted the lengthy fraud sentence … ",
    "url": "https://www.nytimes.com/2025/03/31/us/politics/trump-hunter-biden-jason-galanis.html"
  },
  {
    "text": "Judge pauses Trump administration plans to end temporary legal protections for Venezuelans  —  A federal judge on Monday paused plans by the Trump administration to end temporary legal protections for hundreds of thousands of Venezuelans, a week before they were scheduled to expire.",
    "url": "https://apnews.com/article/trump-administration-venezuelans-tps-federal-judge-7a1e1f286bf8812475ff2f643c33a34c"
  },
  {
    "text": "How Biden's frailties hampered Harris  —  Democratic Party officials and White House staffers were well aware of former President Biden's frailties ahead of his choice to end his ill-fated reelection bid last summer, according to exclusive excerpts of a new book released to The Hill.",
    "url": "https://thehill.com/homenews/5223484-biden-age-concerns-election/amp/"
  },
  {
    "text": "Israel killed 15 Palestinian paramedics and rescue workers one by one, says UN  —  Workers on a mission to help colleagues were buried in mass grave in southern Gaza, says humanitarian office  —  Lorenzo Tondo in Jerusalem, Malak A Tantesh in Gaza, and Julian Borger",
    "url": "https://www.theguardian.com/world/2025/mar/31/israel-killed-15-palestinian-paramedics-and-rescue-workers-one-by-one-says-un"
  },
  {
    "text": "China, Japan, South Korea will jointly respond to US tariffs, Chinese state media says  —  China, Japan and South Korea agreed to jointly respond to U.S. tariffs, a social media account affiliated with Chinese state broadcaster CCTV said on Monday.  —  The comments came after the three countries held … ",
    "url": "https://www.reuters.com/world/china-japan-south-korea-will-jointly-respond-us-tariffs-chinese-state-media-says-2025-03-31/"
  },
  {
    "text": "How to Save a Democracy  —  Americans Can Learn From Opponents of Authoritarianism Elsewhere  —  The first few weeks of Donald Trump's second presidency have accelerated a process of democratic erosion in the United States.  In just two months, the president and his allies have issued executive orders … ",
    "url": "https://www.foreignaffairs.com/united-states/how-save-democracy-trump"
  },
  {
    "text": "The Pragmatic And Moral Case To Sell Your Tesla  —  If you were waiting for a sign, this is it.  It's time to sell.  —  When I tell strangers my job is to review cars for a living, the most common response is “What do you think of Tesla?”  For well over a decade, Tesla has been the strange … ",
    "url": "https://insideevs.com/features/755057/tesla-sell-victoria-scott-musk/"
  },
  {
    "text": "Marine Le Pen barred from running for French presidency in 2027  —  Far-right leader found guilty of embezzlement of European funds and immediately barred from running for office  —  The French far-right leader Marine Le Pen has been barred from running for president in 2027 after a court found … ",
    "url": "https://www.theguardian.com/world/2025/mar/31/marine-le-pen-barred-from-running-for-french-presidency-in-2027"
  },
  {
    "text": "Louisiana voters reject constitutional amendments championed by Republican governor  —  Louisiana voters soundly rejected four constitutional amendments championed by Republican Gov. Jeff Landry related to crime, courts and finances.  Voters said no to each amendment by margins exceeding 60% … ",
    "url": "https://apnews.com/article/louisiana-constitutional-amendments-landry-c9a48606790251bdddb84978eea382ea"
  },
  {
    "text": "John Roberts created a monster.  It's about to eat him.  —  ✍️ ⚖️ ✍️ With corporate outlets obeying in advance, supporting independent political media is more important right now than ever.  Public Notice is possible thanks to paid subscribers.",
    "url": "https://www.publicnotice.co/p/john-roberts-trump-supreme-court-2025"
  },
  {
    "text": "Voice of America Is Broken and Can't Be Reformed  —  The U.S. international broadcaster is politically biased, confused and ineffective.  Tear it down.  —  President Trump, in a March 14 executive order, called for the elimination of the U.S. Agency for Global Media to the extent possible by law.",
    "url": "https://www.wsj.com/opinion/voice-of-america-is-broken-and-cant-be-reformed-media-policy-c4781fb0?st=MGehGw&reflink=article_imessage_share"
  },
  {
    "text": "U.S. Has Spent $40 Million to Jail About 400 Migrants at Guantánamo  —  The disclosure of the tab so far came after five senators visited the offshore operation, which they condemned as a waste of resources.  —  Five senators who visited the U.S. base at Guantánamo Bay, Cuba … ",
    "url": "https://www.nytimes.com/2025/03/31/us/politics/migrants-guantanamo-costs.html?unlocked_article_code=1.8E4.VTsQ.o3UHGymiC55f&smid=url-share"
  },
  {
    "text": "Pennsylvania Must Count Undated Mail-In Ballots, Federal Court Rules  —  A federal judge ruled Monday that Pennsylvania must count undated or wrongly dated mail-in ballots, finding that a previous law rejecting such ballots violated the First and 14th Amendments.",
    "url": "https://www.democracydocket.com/news-alerts/pennsylvania-must-count-undated-mail-in-ballots-federal-court-rules/"
  }
]