[
  {
    "text": "A Battered Iran Signals It Wants to De-Escalate Hostilities With Israel and Negotiate  —  Messages passed by Tehran through intermediaries seek a return to talks if the U.S. stays out of the fight  —  DUBAI—Iran has been urgently signaling that it seeks an end to hostilities and resumption … ",
    "url": "https://www.wsj.com/world/middle-east/a-battered-iran-signals-it-wants-to-de-escalate-hostilities-with-israel-and-negotiate-9feab4ae?st=474Qou&reflink=article_copyURL_share"
  },
  {
    "text": "Israel bombs Iranian state TV during live broadcast  —  Iranian state television was broadcasting live on Monday when a massive explosion rocked the studio, with the anchor fleeing her desk amid smoke and rubble.  The broadcast then went dark.  —  The big picture: Israel's strike … ",
    "url": "https://www.axios.com/2025/06/16/iran-state-tv-bombed-israel-strike"
  },
  {
    "text": "Israel attacks Iran's state television, live on the air.  —  Israel expanded its attacks on Iran on Monday, striking the headquarters of state television after telling residents to leave part of Tehran, as the fiercest and deadliest confrontation in the history of the Israeli-Iranian conflict entered its fourth day.",
    "url": "https://www.nytimes.com/live/2025/06/16/world/iran-israel-news?unlocked_article_code=1.PU8.tJk2.2MCJzSHO9dRt&smid=url-share"
  },
  {
    "text": "Sean Duffy to withhold transportation funds from cities with anti-ICE protests  —  Transportation Secretary Sean Duffy said Monday his department would withhold funding from cities where anti-ICE demonstrations were allowed to take place.  —  In a Monday post on X, Duffy responded … ",
    "url": "https://www.rawstory.com/sean-duffy-withhold-dot-funding/"
  },
  {
    "text": "ICE's cash crisis deepens amid immigration crackdown  —  President Trump's immigration crackdown is burning through cash so quickly that the agency charged with arresting, detaining and removing unauthorized immigrants could run out of money next month.  —  Why it matters: Immigration … ",
    "url": "https://www.axios.com/2025/06/16/ice-cash-crisis-immigration-crackdown-trump"
  },
  {
    "text": "‘Extremely disturbing and unethical’: new rules allow VA doctors to refuse to treat Democrats, unmarried veterans  —  Department of Veterans Affairs says the changes come in response to a Trump executive order ‘defending women’  —  Doctors at Department of Veterans Affairs (VA) … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/16/va-doctors-refuse-treat-patients"
  },
  {
    "text": "I Tried Pre-Ordering the Trump Phone.  The Page Failed and It Charged My Credit Card the Wrong Amount  —  On Monday the Trump Organization announced its own mobile service plan and the “T1 Phone,” a customized all-gold mobile phone that its creators say will be made in America.",
    "url": "https://www.404media.co/trump-mobile-phone-preorder-fail/"
  },
  {
    "text": "Trump Organization announces mobile plan, $499 smartphone … Arrows pointing outwards",
    "url": "https://www.cnbc.com/2025/06/16/trump-mobile-phone-plan.html"
  },
  {
    "text": "The Bureaucrat and the Billionaire: Inside DOGE's Chaotic Takeover of Social Security … Elon Musk stood before a giant American flag at a Wisconsin political rally in March and rolled out an eye-popping allegation of rampant fraud at the Social Security Administration.",
    "url": "https://www.nytimes.com/2025/06/16/us/politics/doge-social-security.html?unlocked_article_code=1.PU8._ycH.u2Hz0TOdPxWv&smid=url-share"
  },
  {
    "text": "New poll: Trump and deportations unpopular, Dems up 8 in House vote  —  Summary:  —  Americans broadly disapprove of the job Donald Trump is doing as president and favor Democratic U.S. House candidates for the 2026 midterms by 8 points, a new Strength In Numbers/Verasight poll finds.",
    "url": "https://www.gelliottmorris.com/p/trump-approval-at-42-democrats-up"
  },
  {
    "text": "Friends say Minnesota shooting suspect was deeply religious and conservative  —  The man accused of assassinating the top Democrat in the Minnesota House held deeply religious and politically conservative views, telling a congregation in Africa two years ago that the U.S. was in a “bad place” where most churches didn't oppose abortion.",
    "url": "https://apnews.com/article/minnesota-shootings-lawmakers-suspect-21b2165404bc66f77dd5e0e36efeb065"
  },
  {
    "text": "Senate GOP tax bill would hit politically explosive Medicaid provision  —  Senate Republicans are seeking to ratchet up savings from a politically explosive policy within Medicaid to pay for their megabill, and it's already setting off shockwaves through Capitol Hill.",
    "url": "https://www.politico.com/live-updates/2025/06/16/congress/senate-gop-tax-bill-would-hit-politically-explosive-medicaid-provision-00408630"
  },
  {
    "text": "Terminated National Institute of Heath grants must be restored, judge orders  —  A federal judge Monday ordered the National Institutes of Health to restore grants that the agency cut based on gender ideology or diversity, equity and inclusion, calling the move illegal.",
    "url": "https://www.axios.com/local/boston/2025/06/16/nih-grants-ordered-restored"
  },
  {
    "text": "Our Advice to Voters in a Vexing Race for New York Mayor  —  Many longtime New Yorkers have had a sinking feeling at some point in the past decade.  They have worried that their city was heading back to the bad old days of the 1970s and '80s.  —  Subway trips can have a chaotic or even menacing quality.",
    "url": "https://www.nytimes.com/2025/06/16/opinion/new-york-mayor-election-advice.html"
  },
  {
    "text": "Trump administration slapped with ‘impoundment’ violation for freezing library, museum funding  —  For the second time this year, the federal government's top watchdog concluded Monday that the Trump administration violated the law by withholding funding Congress already approved.",
    "url": "https://www.politico.com/live-updates/2025/06/16/congress/trump-administration-slapped-with-impoundment-violation-for-freezing-library-museum-funding-00407686"
  },
  {
    "text": "Poll: Americans overwhelmingly want Trump to obey court rulings, but MAGA Republicans are split  —  Eight in 10 respondents believe the Trump administration shouldn't ignore a federal court ruling the White House doesn't like, per the new NBC News Decision Desk Poll.",
    "url": "https://www.nbcnews.com/politics/supreme-court/poll-americans-overwhelmingly-want-trump-obey-court-rulings-maga-repub-rcna212783"
  },
  {
    "text": "Tim Scott's video attacking CBO: Nine errors in 60 seconds  —  Every claim made by the Republican senator to ridicule the nonpartisan agency turns out to be false. … — Sen. Tim Scott (R-South Carolina), in a video posted on social media, June 12  —  As part of the GOP campaign attacking … ",
    "url": "https://www.washingtonpost.com/politics/2025/06/16/tim-scott-cbo-nine-errors/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwMDQ2NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUxNDI4Nzk5LCJpYXQiOjE3NTAwNDY0MDAsImp0aSI6IjhlNjNhZjYyLTMxM2UtNDhmYy1hNDEwLWQ1NmVmYTJjMTgzYSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA2LzE2L3RpbS1zY290dC1jYm8tbmluZS1lcnJvcnMvIn0.sCDDCh93XDslBGw4OknuHG9HzMF-aCVqRYNOaOjfG4U&itid=gfta"
  },
  {
    "text": "Trump's parade flopped.  No Kings Day was a hit.  —  Right now, images largely determine the outcome  —  America is no longer a full-fledged democracy.  We are currently living under a version of competitive authoritarianism — a system that (like Orban's Hungary or Erdogan's Turkey) … ",
    "url": "https://paulkrugman.substack.com/p/trumps-parade-flopped-no-kings-day"
  },
  {
    "text": "Minnesota Shooting Suspect Allegedly Attended a Bible College Popular Among Christian Nationalists  —  On Saturday, a gunman impersonating a police officer fatally shot Minnesota State Representative Melissa Hortman and her husband at their home, and wounded state Sen. Mark Hortman and his wife at their home.",
    "url": "https://www.motherjones.com/politics/2025/06/minnesota-shooting-suspect-allegedly-attended-a-bible-college-popular-among-christian-nationalists/"
  },
  {
    "text": "Why a professor of fascism left the US: ‘The lesson of 1933 is - you get out’  —  Marci Shore made news around the world when her family moved to Canada.  She discusses Trump, teaching history and how terror atomises society  —  She finds the whole idea absurd.",
    "url": "https://www.theguardian.com/us-news/2025/jun/16/why-a-professor-of-fascism-left-the-us-the-lesson-of-1933-is-you-get-out"
  },
  {
    "text": "‘This is the looting of America’: Trump and Co's extraordinary conflicts of interest in his second term  —  Bitcoin, internet, EVs, private dinners for hire - the list of pay-for-play and quid quo pro goes on, and on ... and on  —  The South Lawn of the White House had never seen anything like it.",
    "url": "https://www.theguardian.com/us-news/2025/jun/16/trump-conflict-of-interest"
  },
  {
    "text": "‘Truly Disgusting’: GOP Senator Slammed For ‘Depraved’ Tweets After Shootings  —  Mike Lee of Utah is facing calls to resign over the messages.  —  Sen. Mike Lee (R-Utah) is facing criticism over tweets mocking this weekend's deadly shootings in Minnesota targeting Democratic lawmakers.",
    "url": "https://www.huffpost.com/entry/mike-lee-shooting-tweet_n_684fc14fe4b07f75743a66ef"
  },
  {
    "text": "Emails Reveal the Casual Surveillance Alliance Between ICE and Local Police  —  This article was primarily reported using public records requests.  We are making it available to all readers as a public service.  FOIA reporting can be expensive, please consider subscribing to 404 Media to support this work.",
    "url": "https://www.404media.co/emails-reveal-the-casual-surveillance-alliance-between-ice-and-local-police/"
  },
  {
    "text": "Trump Sent Them To Hell.  Now He's Erasing Them Altogether.  —  Dozens of U.S. CECOT detainees' immigration cases have been dismissed - denying Trump's victims their day in court.  —  The only information Ysqueibel Yonaiquer Peñaloza Chirinos' family has received … ",
    "url": "https://www.huffpost.com/entry/cecot-detainees-us-immigration-court-asylum-dismissals_n_684c6a4be4b070091d777adc"
  },
  {
    "text": "America Is at a Terrifying Turning Point—and There's No Going Back  —  Saturday was a surreal day in American politics, in ways simultaneously horrifying and heartening.  The horrifying part was the news we all woke up to about the political assassinations (both attempted and consummated) in Minnesota.",
    "url": "https://newrepublic.com/article/196851/america-political-violence-terrifying-turning-point"
  },
  {
    "text": "Terry Moran Says He Doesn't Regret Posts Criticizing Trump Administration  —  In his first interview since losing his job at ABC News, the longtime TV correspondent, newly popular on Substack, says he does not regret his social media post criticizing the Trump administration.",
    "url": "https://www.nytimes.com/2025/06/16/business/media/terry-moran-abc-substack.html?unlocked_article_code=1.PU8.Fc6D.Qpc_gOFry2Ze&smid=url-share"
  }
]