[
  {
    "text": "Wisconsin Trump electors settle lawsuit, agree Biden won in 2020  —  MADISON, Wis. — In a legal settlement Wednesday, the 10 Republicans who signed official-looking paperwork falsely purporting Donald Trump won Wisconsin in 2020 have agreed to withdraw their inaccurate filings … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/06/wisconsin-trump-fake-electors-lawsuit/"
  },
  {
    "text": "‘This Is Grim,’ One Democratic Pollster Says  —  The predictive power of horse-race polling a year from the presidential election is weak at best.  The Biden campaign can take some comfort in that.  —  But what recent surveys do reveal is that the coalition that put Biden in the White House … ",
    "url": "https://www.nytimes.com/2023/12/06/opinion/biden-campaign-polls.html"
  },
  {
    "text": "‘Test case’ for America: Colorado's top court poised to weigh Trump's eligibility to run again  —  A Wednesday argument brings the question of Trump's eligibility under the 14th Amendment one step closer to the Supreme Court.  —  The most potent effort to disqualify Donald Trump … ",
    "url": "https://www.politico.com/news/2023/12/06/colorado-supreme-court-trump-insurrection-00130271"
  },
  {
    "text": "Trump is hiding his fascist plans in plain sight  —  Trump's nightmarish scheme was leaked to the New York Times — and yes, it was on purpose  —  Watching cable news is a frequent source of despair, but one especially fraught spiral occurred Monday while subjecting myself to “Morning Joe” on MSNBC.",
    "url": "https://www.salon.com/2023/12/06/is-hiding-his-fascist-plans-in-plain-sight/"
  },
  {
    "text": "Trump declines to rule out abusing power to seek retribution if he returns to the White House  —  Former President Donald Trump declined to rule out abusing power if he returns to the White House after Fox News Channel host Sean Hannity asked him Tuesday to respond to growing Democratic criticism of his rhetoric.",
    "url": "https://apnews.com/article/trump-hannity-iowa-town-hall-d9cad413851b60f6c0abd2a564d86338"
  },
  {
    "text": "Here are the top moments from Trump's ‘Hannity’ town hall  —  Trump touched on topics ranging from President Biden to dictatorships  —  Former President Trump joined Fox News' “Hannity” on Tuesday night for a town hall discussion on the GOP presidential primary, President Biden, dictatorships, and more.",
    "url": "https://www.foxnews.com/politics/top-moments-trumps-hannity-town-hall"
  },
  {
    "text": "Liz Cheney weighs third-party US presidential run, says Trump threatens democracy  —  Republican former U.S. Representative Liz Cheney, an outspoken critic of ex-President Donald Trump who co-chaired the congressional probe of the Jan. 6, 2021, attack on the Capitol, said she is weighing a third-party bid for the White House in 2024.",
    "url": "https://www.reuters.com/world/us/liz-cheney-weighs-third-party-us-presidential-run-says-trump-threatens-democracy-2023-12-05/"
  },
  {
    "text": "My Next Chapter  —  I'm leaving the House but not the fight.  —  I'm an optimist.  How could I not be?  I'm the son of a firefighter.  For 17 years I've served in the same congressional seat—the same office in which I was once denied an internship.  Only in America.",
    "url": "https://www.wsj.com/articles/kevin-mccarthy-my-next-chapter-house-gop-retirement-california-e4e593d7?mod=followamazon"
  },
  {
    "text": "Trump says he told son Eric not to testify at fraud trial  —  Former President Trump says he directed his second eldest son, Eric Trump, not to testify again in the New York fraud trial threatening the family's business empire.  —  “Eric has already testified, PERFECTLY … ",
    "url": "https://thehill.com/regulation/court-battles/4344914-donald-trump-eric-new-york-fraud-trial-testimony/"
  },
  {
    "text": "McCarthy plans to resign from Congress by end of year  —  “I have decided to depart the House at the end of this year to serve America in new ways.  I know my work is only getting started,” the ousted speaker wrote.  —  Kevin McCarthy is officially leaving Congress.",
    "url": "https://www.politico.com/news/2023/12/06/kevin-mccarthy-resignation-congress-00130359"
  },
  {
    "text": "Norman Lear, boundary-breaking TV master and progressive activist behind ‘All in the Family,’ dies at 101  —  Lear created or developed some of the most seminal comedies in television history, including “Sanford and Son,” “Maude,” “Good Times,” “The Jeffersons” and “One Day at a Time.”",
    "url": "https://www.nbcnews.com/pop-culture/tv/norman-lear-family-creator-dies-101-rcna42283"
  },
  {
    "text": "Dems assess wreckage of border talks: ‘They never should have started’  —  With a foreign aid package slated to go down on the Senate floor Wednesday, Democrats aren't hiding their frustration that border policies ever became linked to cash for Ukraine and Israel.",
    "url": "https://www.politico.com/news/2023/12/06/congress-border-ukraine-deal-00130225"
  },
  {
    "text": "America's White Evangelical Problem  —  When the journalist Tim Alberta's father unexpectedly died, another ordeal awaited Tim.  His father had pastored the Cornerstone Evangelical Presbyterian church in Michigan, where the Alberta family now gathered to honor his life alongside the congregation the father had nurtured.",
    "url": "https://nymag.com/intelligencer/2023/12/tim-alberta-book-review-americas-white-evangelical-problem.html"
  },
  {
    "text": "The report AT&T didn't want to produce  —  Last Friday, AT&T quietly published an extraordinary document.  For the first time ever, the company released a “political congruency report.”  The report, which covers the year 2022, looks at the “[s]tate and federal elected officials to whom AT&T … ",
    "url": "https://popular.info/p/the-report-at-and-t-didnt-want-to"
  },
  {
    "text": "Katie Britt: For a secure border, a strong homeland, and a safe world - President Trump is the choice in 2024  —  When I announced my candidacy for the United States Senate in 2021, I made my motivation clear: Wesley and I want to preserve the American Dream for our children - and for generations to come.",
    "url": "https://yellowhammernews.com/katie-britt-for-a-secure-border-a-strong-homeland-and-a-safe-world-president-trump-is-the-choice-in-2024/"
  },
  {
    "text": "George Santos is earning six figures from Cameo videos  —  The Scene  —  Just before 6 p.m. on Tuesday, George Santos was at Best Buy on Northern Boulevard in Queens.  —  Santos, whose biography on the celebrity video platform Cameo identifies him as a “Former congressional ‘Icon’!",
    "url": "https://www.semafor.com/article/12/06/2023/george-santos-is-earning-six-figures-from-cameo-videos"
  },
  {
    "text": "Israel advocacy groups outspend pro-Palestinian groups on social media  —  Organizations including AIPAC have vastly outspent pro-Palestinian groups on Facebook and Instagram even as young Americans grow more critical of Israel.  —  Advocacy organizations supporting Israel in its war … ",
    "url": "https://www.politico.com/news/2023/12/06/israel-palestinian-advocacy-groups-social-media-spending-00130118"
  },
  {
    "text": "Trump super PAC paints Biden as ‘dictator’ after remarks spark controversy  —  A super PAC supporting former President Trump called President Biden a “dictator” on Wednesday, seeking to turn the tables after Trump said in a town hall that he won't be a dictator if reelected “except for Day One.”",
    "url": "https://thehill.com/homenews/campaign/4345199-trump-super-pac-paints-biden-as-dictator-after-remarks-spark-controversy/"
  },
  {
    "text": "Hunter Biden got staggering $4.9M from ‘sugar brother’ Kevin Morris: IRS whistleblower  —  WASHINGTON — Hunter Biden received a whopping $4.9 million from Hollywood lawyer Kevin Morris in a three-year period, according to an IRS agent who investigated the president's son for alleged tax evasion.",
    "url": "https://nypost.com/2023/12/05/news/hunter-biden-got-staggering-4-9m-from-sugar-brother-kevin-morris-irs-whistleblower/"
  },
  {
    "text": "White House interns demand a Middle East cease-fire in letter to Biden  —  The letter, first shared with NBC News, is supported by more than 40 interns who work in the White House and other executive branch offices.  —  WASHINGTON — A group of White House interns joined the growing list … ",
    "url": "https://www.nbcnews.com/politics/white-house/white-house-interns-demand-middle-east-cease-fire-letter-biden-rcna128264"
  },
  {
    "text": "Biden team wary of retaliating against Houthi attacks at sea  —  Some current and former officials are frustrated with U.S. statements that they believe are downplaying the threat.  —  Senior Biden administration officials agree that striking Houthis in Yemen is the wrong course of action for now … ",
    "url": "https://www.politico.com/news/2023/12/06/biden-houthi-attacks-yemen-00130333"
  },
  {
    "text": "Senate confirms 425 military nominees after Sen. Tommy Tuberville drops his hold  —  Tuberville “has nothing to show for his 10 months of delay,” Senate Majority Leader Chuck Schumer said in a scathing speech after the nominees were confirmed.  Tuberville has retained his holds on roughly 11 other promotions.",
    "url": "https://www.nbcnews.com/politics/congress/sen-tommy-tuberville-drops-hold-hundreds-military-nominees-rcna128138"
  },
  {
    "text": "WATCH: MIT, Penn, Harvard Presidents Say Calls for Jewish Genocide Do Not Violate Code of Conduct  —  ‘If the speech turns into conduct, it can be harassment,’ Penn's Liz Magill said  —  The presidents of the Massachusetts Institute of Technology, the University of Pennsylvania … ",
    "url": "https://freebeacon.com/latest-news/watch-mit-penn-harvard-presidents-say-calls-for-jewish-genocide-do-not-violate-code-of-conduct/"
  },
  {
    "text": "Cheney blasts GOP for blurring faces in Jan. 6 tapes: Nothing ‘can change the facts’  —  Former Rep. Liz Cheney (R-Wyo.) on Tuesday criticized House Speaker Mike Johnson (R-La.) and House Republicans' decision to blur the faces of those who breached the Capitol on Jan. 6, 2021 in security tapes … ",
    "url": "https://thehill.com/homenews/house/4344270-cheney-gop-blurring-faces-in-jan-6-footage-suggests-tapes-would-change-facts/"
  }
]