[
  {
    "text": "New Orleans updates: 10 dead in ‘terrorist attack’ with pickup in New Orleans, local officials say  —  The driver remained at large after the Bourbon Street incident, police said.  —  Emergency vehicles are seen near Bourbon Street in New Orleans on Wednesday, Jan. 1, 2025.",
    "url": "https://abcnews.go.com/US/1-dead-vehicle-strikes-crowd-new-orleans-police/story?id=117246329"
  },
  {
    "text": "Man intentionally slams truck into crowd in New Orleans, killing 10 and injuring dozens; suspect dead  —  Ten people were killed and dozens injured early Wednesday when a man intentionally drove a pickup truck into a crowd on Bourbon Street in New Orleans' French Quarter as revelers were celebrating the new year, officials said.",
    "url": "https://www.cbsnews.com/news/new-orleans-vehicle-crash-bourbon-street-crowd-casualties-shooting/"
  },
  {
    "text": "Live updates 10 killed in New Orleans as driver plows truck into crowd  —  Ten people were killed and dozens injured when a man intentionally drove a pickup truck into a large crowd in the Bourbon Street area of New Orleans early Wednesday, officials said.  The FBI said that the driver is dead … ",
    "url": "https://www.washingtonpost.com/nation/2025/01/01/new-orleans-vehicle-crowd-bourbon-street/"
  },
  {
    "text": "10 Dead, 35 injured after driver targets Bourbon Street crowd  —  Suspect killed after driving truck into crowd; FBI confirms terrorism investigation.  —  NEW ORLEANS — The FBI has taken over the investigation into a mass casualty incident on Bourbon Street, now being treated as an act of terrorism.",
    "url": "https://www.wwltv.com/article/news/crime/nopd-responds-to-multiple-casualties-on-bourbon-street/289-62237b48-bdb7-4144-a939-355e7a497528"
  },
  {
    "text": "New Orleans attack suspect named, accused of killing at least 10, injuring dozens  —  The suspect accused of plowing a truck through a crowd on Bourbon Street early Wednesday morning has been identified by a law enforcement source as 42-year-old Shamsud Din Jabbar.",
    "url": "https://www.nola.com/news/crime_police/new-orleans-suspect-bourbon-street-attack/article_d90e3452-c85f-11ef-a68f-f30b3ad49828.html"
  },
  {
    "text": "Vehicle Used in New Orleans Terror Attack Crossed the Border Two Days Ago.  Trump Responds.  —  The vehicle used to plow through a crowd of people in New Orleans early Wednesday morning crossed the U.S.-Mexico border two days ago, Fox News is reporting.  —  Whether the suspect is the person … ",
    "url": "https://townhall.com/tipsheet/leahbarkoukis/2025/01/01/new-orleans-suspect-eagle-pass-tx-trump-statement-n2649842"
  },
  {
    "text": "Driver rams New Year's revelers in New Orleans, killing 10.  FBI investigating as ‘act of terrorism’  —  A driver wrought carnage on New Orleans' famed French Quarter early on New Year's Day, ramming a pickup truck into a crowd and killing 10 people before being shot to death by police, authorities said.",
    "url": "https://apnews.com/article/new-orleans-car-bourbon-street-63a1b43d615af365cb8ba6f5f0583eca"
  },
  {
    "text": "John Roberts attacks court criticism that he decides lacks a “credible basis” as “illegitimate”  —  Conflating violence against judges with broad criticism the court faces for its extremism, the chief justice ultimately sends a chilling end-of-year report.  —  Chief Justice John Roberts decided … ",
    "url": "https://www.lawdork.com/p/john-roberts-attacks-court-criticism"
  },
  {
    "text": "Elon Musk changes his name to Kekius Maximus on X  —  The world's richest man, Elon Musk, has sparked speculation after changing his name on his social media platform X to “Kekius Maximus”.  —  The tech mogul - and close confidant of US President-Elect Donald Trump - offered no immediate explanation … ",
    "url": "https://www.bbc.com/news/articles/cy53vz1qpx1o"
  },
  {
    "text": "‘Trump is a little guy, Musk is a big guy’: historian predicts trouble for president-elect  —  Timothy Snyder says world's richest man is likely to exert uncomfortable influence over White House  —  Allies and aides to Donald Trump should be increasingly concerned by Elon Musk's proximity … ",
    "url": "https://www.theguardian.com/books/2025/jan/01/elon-musk-donald-trump"
  },
  {
    "text": "Ukraine Forces a Halt to Flow of Natural Gas From Russia to Europe  —  A transnational pipeline was shut down on Wednesday after Kyiv refused to renew an agreement that allowed for the transit of Russian gas through its territory.  —  The flow of natural gas through a major pipeline from Russia … ",
    "url": "https://www.nytimes.com/2025/01/01/world/europe/russia-ukraine-natural-gas-europe.html"
  },
  {
    "text": "Stars Flee Jeff Bezos' Paper for Steve Jobs' Widow's Mag  —  OUT WITH THE OLD...  The Washington Post is taking more blows after losing 200,000 subscribers when its owner stopped it endorsing Kamala Harris.  —  SHOP WITH SCOUTED  —  J.Crew's Semi-Secret Factory Sale Is Not to Be Missed",
    "url": "https://www.thedailybeast.com/stars-flee-jeff-bezos-washington-post-for-steve-jobs-widows-the-atlantic/"
  },
  {
    "text": "Louisiana Congressman Mike Johnson expects to be re-elected as House Speaker after Trump's endorsement  —  Baton Rouge / louisianaradionetwork.com  —  Louisiana Republican Congressman Mike Johnson says President-elect Donald Trump's endorsement of him for House Speaker was supposed to come … ",
    "url": "https://louisianaradionetwork.com/2024/12/31/louisiana-republican-congressman-mike-johnson-anticipates-president-elect-donald-trumps-backing-for-house-speaker/"
  },
  {
    "text": "The Plot to Poison Children's Minds  —  Social media should be treated like alcohol.  But money got in the way.  —  This is going to be a post about social media, why it's often harmful, and the disgusting failure of Congress to do anything to mitigate the harm.",
    "url": "https://paulkrugman.substack.com/p/the-plot-to-poison-childrens-minds"
  },
  {
    "text": "Trump Voters Are in for a Rude Awakening  —  In his 1987 book, The Art of the Deal, Donald Trump let readers in on a promotional strategy of his.  “I play to people's fantasies,” the real estate developer wrote, by insisting that a project “is the biggest and the greatest and the most spectacular.”",
    "url": "https://newrepublic.com/article/189523/trump-voters-2025-rude-awakening"
  }
]