[
  {
    "text": "Colorado Supreme Court justices face a flood of threats after disqualifying Trump from the ballot  —  The latest round of threats fits a familiar pattern: Trump faces a legal setback, and officials face threats.  —  In the 24 hours since the Colorado Supreme Court kicked former President Donald Trump off … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/colorado-justices-face-flood-threats-disqualifying-trump-ballot-rcna130720"
  },
  {
    "text": "Trump Asks Supreme Court to Put Off Hearing Case on Immunity Claim  —  The former president urged the justices to move slowly in his federal election interference case, an apparent attempt to delay the trial, set for March.  —  Former President Donald J. Trump urged the Supreme Court … ",
    "url": "https://www.nytimes.com/2023/12/20/us/politics/trump-supreme-court-immunity.html"
  },
  {
    "text": "Colorado GOP threatens to withdraw from or ignore state's presidential primary if Trump isn't on the ballot  —  The Colorado GOP is threatening to try to withdraw from Colorado's Republican presidential primary in March — or ignore the results — if Donald Trump isn't on the ballot … ",
    "url": "https://coloradosun.com/2023/12/20/colorado-republican-presidential-primary-withdraw/"
  },
  {
    "text": "Trump Vows to Amp Up the Hitler Talk  —  Trump plans to keep using the “poisoning the blood” line attacking immigrants, sources tell Rolling Stone.  If anything, he thinks he was being “too nice” … In response to the Adolf Hitler comparisons, Trump has privately vowed to further amp … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-says-immigrants-poison-blood-nation-1234934092/"
  },
  {
    "text": "Colorado Secretary Of State ‘Extremely Concerned’ About Pro-Trump Violence  —  Jena Griswold received 64 death threats and more than 900 threats of abuse within three weeks of filing the case to keep Trump off the state ballot.  —  LOADING  —  Colorado Secretary of State Jena Griswold … ",
    "url": "https://www.huffpost.com/entry/colorado-secretary-of-state-jena-griswold-trump-ballot-violence_n_65832c31e4b03e698a11c794"
  },
  {
    "text": "Lieutenant Governor Eleni Kounalakis Calls for Secretary of State Weber to Explore Legal Options to Remove Former President Donald Trump from California's 2024 Presidential Primary Ballot  —  Contact: Press@ltg.ca.gov, (916) 803-2191  —  SACRAMENTO - Today, Lieutenant Governor Eleni Kounalakis sent … ",
    "url": "https://ltg.ca.gov/2023/12/20/lt-governor-kounalakis-calls-for-secretary-of-state-weber-to-explore-legal-options-to-remove-former-president-donald-trump-from-californias-2024-presidential-primary-ballot/"
  },
  {
    "text": "Federal judge blocks California law that would have banned carrying firearms in most public places  —  A federal judge on Wednesday temporarily blocked a California law that would have banned carrying firearms in most public places, ruling that it violates the Second Amendment of the U.S. Constitution … ",
    "url": "https://apnews.com/article/california-gun-laws-concealed-carry-c7ebb8506ed99f41b59455350647c0b6"
  },
  {
    "text": "California law that would ban guns from most public places blocked by federal judge  —  A California law that would ban guns from most public spaces has been blocked by a federal judge.  —  U.S. District Judge Cormac Carney granted a preliminary injunction for plaintiffs, ruling the law violated the Second Amendment.",
    "url": "https://www.washingtonexaminer.com/policy/courts/california-law-ban-guns-public-blocked-judge"
  },
  {
    "text": "Speaker Mike Johnson and daughter were profiled attending ‘purity ball’ in 2015 German TV news segment  —  The unearthed segment is the latest example of Johnson's deeply held views.  —  A still image from a 2015 German news segment featuring Mike Johnson and his family.",
    "url": "https://abcnews.go.com/US/speaker-mike-johnson-daughter-profiled-attending-purity-ball/story?id=105785626"
  },
  {
    "text": "Jan. 6 rioter nabbed in Bumble dating app sting pleads guilty to assaulting officers  —  Andrew Taake was turned in by a Bumble user who used the dating app to try to illicit confessions from Donald Trump supporters who took part in the Capitol attack.  —  WASHINGTON — Nearly three years ago … ",
    "url": "https://www.nbcnews.com/politics/justice-department/jan-6-rioter-nabbed-bumble-dating-app-sting-pleads-guilty-assaulting-o-rcna130593"
  },
  {
    "text": "Scoop: Warner Bros. Discovery in talks to merge with Paramount Global  —  Warner Bros. Discovery CEO David Zaslav met with Paramount Global CEO Bob Bakish on Tuesday in New York City to discuss a possible merger, Axios has learned from multiple sources.",
    "url": "https://www.axios.com/2023/12/20/warner-bros-paramount-merger-discovery-streaming"
  },
  {
    "text": "U.S. to free ally of Venezuela's Maduro in exchange for 36 prisoners -source  —  The government of Venezuelan President Nicolas Maduro plans to release up to 36 people, including up to 12 Americans, in exchange for the U.S. government's release of a Maduro ally, two Venezuelan sources said on Wednesday.",
    "url": "https://www.reuters.com/world/us/us-has-freed-close-ally-venezuela-president-swap-jailed-americans-ap-2023-12-20/"
  },
  {
    "text": "House Republicans land last-minute Ohio recruit for key House race  —  House Republicans launched a last-minute scramble to recruit state Rep. Derek Merrin.  —  House Republicans may have found a way to salvage their flailing prospects in a crucial swing seat.",
    "url": "https://www.politico.com/news/2023/12/20/derek-merrin-ohio-00132746"
  },
  {
    "text": "Robert De Niro's Number One Priority Is Getting Rid of Trump  —  Acting legend sat down with Rolling Stone to talk Killers of the Flower Moon, the 2024 election, 50 years with Scorsese, and so much more  —  OBERT DE NIRO has had a hell of a year.  In April, the screen icon welcomed a daughter, Gia, with his girlfriend Tiffany Chen.",
    "url": "https://www.rollingstone.com/tv-movies/tv-movie-features/robert-de-niro-interview-donald-trump-killers-of-the-flower-moon-martin-scorsese-1234932954/"
  },
  {
    "text": "Matt Gaetz fundraises off the possibility that the House will expel him like Santos  —  Following the expulsion of former New York Rep. George Santos, Rep. Matt Gaetz (R-FL) is fundraising off the possibility that the House might come after him next.  —  In a fundraising email sent Dec. 13 … ",
    "url": "https://www.washingtonexaminer.com/news/house/following-santos-expulsion-gaetz-fundraises-possibility-house-expel-him"
  },
  {
    "text": "Yes, it's okay to compare Trump to Hitler.  Don't let me stop you.  —  Mike Godwin is an attorney and author in Washington.  —  My very minor status as an authority on Adolf Hitler comparisons stems from having coined “Godwin's Law” about three decades ago.",
    "url": "https://www.washingtonpost.com/opinions/2023/12/20/godwins-law-trump-hitler-comparisons/"
  }
]