[
  {
    "text": "Robinson rejected offers of tech help to investigate posts on porn site, sources say  —  Lt. Gov. Mark Robinson's alleged rejection of the offers sowed doubt among some staff members, people familiar with the matter tell WRAL.  His response in the wake of the report likely played a role … ",
    "url": "https://www.wral.com/story/robinson-rejected-offers-of-tech-help-to-investigate-posts-on-porn-site-sources-say/21638904/"
  },
  {
    "text": "Newly unearthed data shows closer links to Robinson and porn, dating sites  —  Trump, who endorsed Robinson, has publicly remained silent about the embattled lieutenant governor.  —  Top Republican leaders in North Carolina have called on Mark Robinson to provide proof that he wasn't behind salacious posts … ",
    "url": "https://www.politico.com/news/2024/09/23/mark-robinson-porn-sites-00180545"
  },
  {
    "text": "Koch network touts Mark Robinson's policy positions with ‘thank you’ ads … The political network largely funded by billionaire industrialist Charles Koch has been quietly touting North Carolina Lt. Gov. Mark Robinson for his policy positions despite a litany of controversies, according to records uncovered by CNBC.",
    "url": "https://www.cnbc.com/2024/09/23/koch-mark-robinson-controversies.html"
  },
  {
    "text": "State Sen. Mike McDonnell deflates GOP hopes for Nebraska winner-take-all in 2024  —  State Sen. Mike McDonnell announces leaving the Democratic Party after he was censured by the state and Douglas County Democrats.  LINCOLN — The Republican push to change how Nebraska awards … ",
    "url": "https://nebraskaexaminer.com/2024/09/23/state-sen-mike-mcdonnell-deflates-gop-hopes-for-nebraska-winner-take-all-in-2024/"
  },
  {
    "text": "Texas jury clears most ‘Trump Train’ drivers in civil trial over 2020 Biden-Harris bus encounter  —  A federal jury in Texas on Monday rejected voter intimidation allegations against all but one of a group of former President Donald Trump supporters who surrounded a Biden-Harris campaign bus … ",
    "url": "https://apnews.com/article/trump-train-biden-texas-2020-election-trials-018e1c725e17ab0593835468db202666"
  },
  {
    "text": "Texas jury clears ‘Trump Train’ for surrounding 2020 Biden-Harris bus  —  Those onboard the bus had alleged they were ‘terrorised’ for over 90 minutes and calling 911 also did not yield any help  —  A federal jury in Texas on Monday cleared a group of Donald Trump's supporters and found … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/23/texas-court-clears-trump-train"
  },
  {
    "text": "X will let people you've blocked see your posts … X will now make your posts visible to users you've blocked.  In a reply on Monday, X owner Elon Musk said the “block function will block that account from engaging with, but not block seeing, public post.”",
    "url": "https://www.theverge.com/2024/9/23/24252438/x-blocked-users-view-public-posts"
  },
  {
    "text": "A Congressman Had an Affair.  Then He Put His Lover on the Payroll.  —  Representative Anthony D'Esposito, a New York Republican, gave part-time jobs to both his lover and his fiancée's daughter, in possible violation of House ethics rules.  —  As a proud son of Nassau County's … ",
    "url": "https://www.nytimes.com/2024/09/23/nyregion/anthony-desposito-affair-congress.html?unlocked_article_code=1.M04.6sdO.bAftmaRnv2Fq"
  },
  {
    "text": "Harris campaign weighs trip to the US southern border amid polling concerns  —  Campaign officials are weighing a potential visit by Vice President Kamala Harris to the US-Mexico border while in Arizona on Friday as the campaign tries to close the gap with former President Donald Trump … ",
    "url": "https://www.cnn.com/2024/09/23/politics/harris-campaign-possible-southern-border-trip/"
  },
  {
    "text": "National law enforcement group endorses Kamala Harris for president  —  Harris' presidential endorsement is the first for Police Leaders for Community Safety, coming after Trump was endorsed by the National Fraternal Order of Police earlier this month.  —  A group of national law enforcement leaders … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/09/23/kamala-harris-police-endorsement/75354660007/"
  },
  {
    "text": "Statement by President Donald J. Trump  —  BREAKING: The Kamala Harris/Joe Biden Department of Justice and FBI are mishandling and downplaying the second assassination attempt on my life since July.  The charges brought against the maniac assassin are a slap on the wrist.",
    "url": "https://www.donaldjtrump.com/news/f3f2934b-8e1b-4bd7-9540-2888b55b5ca4"
  },
  {
    "text": "California accuses ExxonMobil of lying about plastics being recyclable  —  The state alleges the oil company deceived “the public to convince us that plastic recycling could solve the plastic waste and pollution crisis.”  —  The state of California sued ExxonMobil on Monday … ",
    "url": "https://www.washingtonpost.com/climate-solutions/2024/09/23/california-sues-exxonmobil-plastics-recycling/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3MDY0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI4NDQ2Mzk5LCJpYXQiOjE3MjcwNjQwMDAsImp0aSI6ImEyZjFiYTVhLTU5NzctNGNmNy04MWFhLWQ3ZjVlZWJmMGYyOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9jbGltYXRlLXNvbHV0aW9ucy8yMDI0LzA5LzIzL2NhbGlmb3JuaWEtc3Vlcy1leHhvbm1vYmlsLXBsYXN0aWNzLXJlY3ljbGluZy8ifQ.D8PyVRTXs96JmEKIjHB6AlHsvDf5RuQ4vVO0QA7lqo4&itid=gfta"
  },
  {
    "text": "Scoop: Senate GOP privately predicts 52-seat majority … - But to expand a 2025 majority past 52 seats, Republicans will need more money — and a good showing from former President Trump.  — The swing states in the presidential race, except for Georgia and North Carolina, also have competitive Senate contests.",
    "url": "https://www.axios.com/2024/09/24/senate-republicans-mcconnell-nrsc-montana-ohio"
  },
  {
    "text": "Jill Stein paid $100,000 to a Republican consulting firm led by a suspected January 6 rioter  —  The Green Party leader has hired a GOP consulting firm and worked with Trump-affiliated lawyers  —  Allies of former President Donald Trump and others affiliated with the GOP are supporting … ",
    "url": "https://www.salon.com/2024/09/23/jill-stein-paid-100000-to-a-consulting-firm-led-by-a-suspected-january-6-rioter/"
  },
  {
    "text": "Trump listens during a farming event in rural Pennsylvania, then threatens John Deere with tariffs  —  Donald Trump sat in a large barn in rural Pennsylvania on Monday, asking questions of farmers and offering jokes but, in a rarity for his campaign events, mostly listening.",
    "url": "https://apnews.com/article/election-2024-trump-harris-china-dc1e402d7d829acc904a4326370ac04a"
  },
  {
    "text": "If landline phones are dying out, how do political polls work today?  —  (NEXSTAR) - As we draw closer to the 2024 presidential election, more political polls are being released, ranging from which candidate has an edge ahead of Nov. 5 to the top issues for voters.",
    "url": "https://thehill.com/homenews/4894892-if-landline-phones-are-dying-out-how-do-political-polls-work-today/"
  },
  {
    "text": "'I'm constantly being interrupted by you!'  Fed-up Dem strategist spars with Fox News host  —  Democratic strategist Kelly Hyman clashed with Fox News' Sandra Smith on Monday, as Smith tried to interrogate her about Vice President Kamala Harris' plan to ease inflation.",
    "url": "https://www.rawstory.com/fox-news-democratic-strategist/"
  },
  {
    "text": "Bernie Moreno says women are ‘single issue voters’ for abortion during Ohio town hall  —  LEBANON, Ohio (WCMH) — Ohio's Republican candidate for U.S. Senate questioned why a certain group of women would be concerned about abortion during an event in the state.",
    "url": "https://www.nbc4i.com/news/your-local-election-hq/bernie-moreno-says-women-are-single-issue-voters-for-abortion-during-ohio-town-hall/"
  },
  {
    "text": "Zelensky: Trump doesn't know how to end war and Vance is too radical  —  The president of Ukraine criticises the Republican nominees as he visits the US to share his plan for victory over Russia  —  Donald Trump doesn't know how to stop the war in Ukraine, despite claiming he could end … ",
    "url": "https://www.telegraph.co.uk/us/politics/2024/09/23/zelensky-trump-doesnt-know-how-to-end-war-and-vance-radical/"
  },
  {
    "text": "J.D. Vance Caught Lying About Egg Prices in Painfully Bad Video  —  J.D. Vance attempted to point out high prices in a recent campaign stunt at a grocery store, only to be caught with egg on his face.  —  On Saturday, the Trump War Room account on X posted a video of Vance visiting a grocery story … ",
    "url": "https://newrepublic.com/post/186233/jd-vance-caught-lying-egg-prices-video"
  },
  {
    "text": "Resurfaced video shows Kamala Harris protesting against deporting migrants with disgraced celebrity  —  Vice President Kamala Harris in now promising to secure the border, but when she was a senator of California, she was a staunch opponent of deporting illegal immigrants.",
    "url": "https://www.dailymail.co.uk/news/article-13881751/kamala-harris-deportation-jussie-smollett.html"
  },
  {
    "text": "Hogan allies make big move in Maryland Senate race  —  Larry Hogan just got some major reinforcements in his uphill Senate bid in the deep-blue state of Maryland.  Maryland's Future, a super PAC created to aid Hogan, placed $18.2 million worth of ad buys so far this week … ",
    "url": "https://www.politico.com/live-updates/2024/09/23/congress/hogan-super-pac-maryland-senate-race-00180596"
  },
  {
    "text": "She was accused of murder after losing her pregnancy.  SC woman now tells her story  —  Orangeburg, South Carolina , KFF Health News  —  Amari Marsh had just finished her junior year at South Carolina State University in May 2023 when she received a text message from a law enforcement officer.",
    "url": "https://www.cnn.com/2024/09/23/health/south-carolina-abortion-kff-health-news-partner/"
  },
  {
    "text": "Harris to skip, Trump to attend annual Al Smith dinner  —  Vice President Harris will not attend the annual Al Smith dinner in New York next month, while former President Trump said on Monday that he will be there.  —  The New York Catholic Charities fundraiser, which is scheduled for Oct. 17 … ",
    "url": "https://thehill.com/homenews/campaign/4894697-harris-trump-al-smith-dinner/"
  },
  {
    "text": "How to surveil a federal regulator  —  With help from Christine Mui and Derek Robertson  —  Commercially available location data has outed Planned Parenthood visitors and gay priests — and a newly published research paper shows that federal investigations are at risk of being tracked without their knowledge as well.",
    "url": "https://www.politico.com/newsletters/digital-future-daily/2024/09/23/tk-alfred-top-00180521"
  }
]