[
  {
    "text": "R.F.K. Jr. Says Doctors Found a Dead Worm in His Brain  —  The presidential candidate has faced previously undisclosed health issues, including a parasite that he said ate part of his brain.  —  Robert F. Kennedy Jr. has emphasized his vitality and relative youth compared with the leading Democratic … ",
    "url": "https://www.nytimes.com/2024/05/08/us/rfk-jr-brain-health-memory-loss.html"
  },
  {
    "text": "Stormy Daniels details Trump's sleazy contempt for women  —  It wasn't just “locker room talk.” … Adult actress and director Stormy Daniels testified yesterday about her sexual relationship with Donald Trump.  Trump is on trial for paying off Daniels to prevent her from going public … ",
    "url": "https://www.publicnotice.co/p/stormy-daniels-testimony-trump-access-hollywood"
  },
  {
    "text": "Georgia appeals court will review decision that kept Fani Willis on Trump case  —  A Georgia appeals court agreed Wednesday to review a lower court ruling in former President Trump's 2020 state-level election case allowing Fulton County District Attorney Fani Willis to continue overseeing it, per a filing.",
    "url": "https://www.axios.com/2024/05/08/georgia-trump-2020-election-case-fani-willis"
  },
  {
    "text": "Judge indefinitely delays Trump's classified documents trial in Florida  —  U.S. Judge Aileen M. Cannon said there are too many pre-trial issues to address to set a new trial date now  —  Donald Trump's Florida trial for allegedly mishandling classified documents and obstructing government efforts … ",
    "url": "https://www.washingtonpost.com/national-security/2024/05/07/trump-classified-documents-trial-delayed-cannon-florida/"
  },
  {
    "text": "How We Got to a Place Where Right Wingers Cheer Stealing Nuclear Documents  —  When Aileen Cannon issued her order delaying Trump's stolen documents trial indefinitely, I posted this on Xitter.  —  The post was factual.  Trump nominated Judge Cannon on 21, 2020.",
    "url": "https://www.emptywheel.net/2024/05/08/how-we-got-to-a-place-where-right-wingers-cheer-stealing-nuclear-documents/"
  },
  {
    "text": "World's top climate scientists expect global heating to blast past 1.5C target  —  Exclusive: Planet is headed for at least 2.5C of heating with disastrous results for humanity, poll of hundreds of scientists finds  —  Hundreds of the world's leading climate scientists expect global temperatures … ",
    "url": "https://www.theguardian.com/environment/article/2024/may/08/world-scientists-climate-failure-survey-global-temperature"
  },
  {
    "text": "RFK Jr.'s new hire who downplayed Jan. 6 appears to have been at the Capitol during the attack  —  Photos and videos from outside the Capitol on Jan. 6, 2021, uncovered by online sleuths and NBC News appear to show Zach Henry, a right-wing influencer now working for Kennedy's campaign.",
    "url": "https://www.nbcnews.com/politics/2024-election/rfk-jr-staffer-zach-henry-jan-6-downplay-capitol-attack-rcna150476"
  },
  {
    "text": "Unexpected warning signs for Trump in busy Indiana primary  —  There were a half-dozen consequential GOP primaries on Tuesday, but Nikki Haley's performance in the already concluded presidential race could be a sign of trouble for Trump in more competitive states.",
    "url": "https://www.politico.com/news/2024/05/07/indiana-primary-unexpected-warning-signs-donald-trump-00156750"
  },
  {
    "text": "U.S. pauses Israel arms shipment over Rafah assault fears as Biden pushes for a cease-fire deal  —  An Israeli official told NBC News there is deep frustration in the country's government over the decision, which comes as the Biden admin presses for a cease-fire deal that would head off … ",
    "url": "https://www.nbcnews.com/news/world/us-pauses-weapons-shipment-bombs-israel-rafah-assault-cease-fire-gaza-rcna151187"
  },
  {
    "text": "Does the public understand that “variant” means “vaccine resistant”?  —  Getting boosted is critical because the virus is changing.  Other forms of mitigation are critical to slow the rate of change.  —  Last week, the WHO announced that it will recommend creation of a new booster for the JN.1 variant of COVID-19.",
    "url": "https://www.thegauntlet.news/p/does-the-public-understand-that-variant"
  },
  {
    "text": "RFK Jr. Says Doctors Found a Dead Worm in His Brain: Report  —  YIKES  —  He said in a deposition that clinicians believed the parasite “got into my brain and ate a portion of it and then died.”  —  FAUX PAS  —  Macron had seemed to support the actor amid allegations of sexual assault.",
    "url": "https://www.thedailybeast.com/rfk-jr-says-doctors-found-a-dead-worm-in-his-brain-report"
  },
  {
    "text": "RFK Jr's ‘history lesson’ on Russia's invasion of Ukraine flunks the fact test  —  A line-by-line dissection shows he's often echoing Russian talking points.  —  The Fact Checker  —  A reader asked us to fact-check a four-minute “history lesson” posted by presidential candidate Robert F. Kennedy Jr. on YouTube.",
    "url": "https://www.washingtonpost.com/politics/2024/05/08/rfk-jrs-history-lesson-russias-invasion-ukraine-flunks-fact-test/"
  },
  {
    "text": "Accountants Don't Want To Help Rudy Giuliani In Bankruptcy Case, His Lawyers Say  —  The former attorney for Donald Trump has hit a snag in his bankruptcy filing.  —  LOADING  —  Rudy Giuliani is struggling to find an accountant to assist in his bankruptcy case after the previous one left, his lawyers said.",
    "url": "https://www.huffpost.com/entry/rudy-giuliani-accountants-bankruptcy_n_663b5a57e4b0ce3aef5165c0"
  },
  {
    "text": "New York Times editor Joe Kahn says defending democracy is a partisan act and he won't do it  —  He had an extraordinary opportunity, upon taking over from Dean Baquet, to right the ship: to recognize that the Times was not warning sufficiently of the threat to democracy presented by a second Trump presidency.",
    "url": "https://presswatchers.org/2024/05/new-york-times-editor-joe-kahn-says-defending-democracy-is-a-partisan-act-and-he-wont-do-it/"
  },
  {
    "text": "Biden hits Trump with major Microsoft announcement in Wisconsin … - He'll be taking a not-so-subtle shot at former President Trump in the same location where Trump touted a $10 billion Foxconn facility, which he called the “eighth wonder of the world” seven years ago.",
    "url": "https://www.axios.com/2024/05/08/biden-hits-trump-with-major-microsoft-announcement-in-wisconsin"
  },
  {
    "text": "Exclusive: In Tesla Autopilot probe, US prosecutors focus on securities, wire fraud  —  U.S. prosecutors are examining whether Tesla (TSLA.O) committed securities or wire fraud by misleading investors and consumers about its electric vehicles' self-driving capabilities, three people familiar with the matter told Reuters.",
    "url": "https://www.reuters.com/business/autos-transportation/tesla-autopilot-probe-us-prosecutors-focus-securities-wire-fraud-2024-05-08/"
  },
  {
    "text": "AUTHORITIES IDENTIFY SIXTH VICTIM RECOVERED IN THE COLLAPSE OF THE FRANCIS SCOTT KEY BRIDGE  —  BALTIMORE - Today, Unified Command salvage teams located the sixth victim and promptly notified the Maryland Department of State Police.  —  Maryland State Police investigators along with officers … ",
    "url": "https://www.keybridgeresponse2024.com/post/update-20-authorities-identify-sixth-victim-recovered-in-the-collapse-of-the-francis-scott-key-brid"
  },
  {
    "text": "Congressman Collins feels the heat  —  Last Friday, Congressman Mike Collins (R-GA) endorsed the conduct of student counterprotesters at the University of Mississippi.  Collins posted a video on X showing a counterprotester heckling a Black woman by imitating a monkey.",
    "url": "https://popular.info/p/update-congressman-collins-feels"
  },
  {
    "text": "Rep. André Carson easily wins primary, but GOP's 7th District choice died in March  —  In Indiana's 7th Congressional District, incumbent André Carson easily won the Democratic nomination Tuesday.  —  Carson had 91% of the vote with all ballots counted.",
    "url": "https://www.indystar.com/story/news/politics/elections/2024/05/07/indiana-7th-congressional-district-election-rep-andre-carson-pierre-pullins-curtis-godfrey/73450862007/"
  }
]