[
  {
    "text": "Smithsonian removes Trump from impeachment exhibit in American History Museum  —  The Smithsonian said it restored the display to an earlier version, which notes that “only three presidents have seriously faced removal.”  —  The Smithsonian's National Museum of American History … ",
    "url": "https://www.washingtonpost.com/entertainment/2025/07/31/trump-impeachment-smithsonian/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzOTM0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1MzE2Nzk5LCJpYXQiOjE3NTM5MzQ0MDAsImp0aSI6ImJkMDI5M2FmLTMzZDUtNDNiMC04YmVmLTk2Yzg5MzI0NzRhOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9lbnRlcnRhaW5tZW50LzIwMjUvMDcvMzEvdHJ1bXAtaW1wZWFjaG1lbnQtc21pdGhzb25pYW4vIn0.1O5MNBId47-CbznOfSi8hUNcZQNH2D6qeoyIhEyBlLU&itid=gfta"
  },
  {
    "text": "The White House Announces White House Ballroom Construction to Begin  —  Washington, D.C. — For 150 years, Presidents, Administrations, and White House Staff have longed for a large event space on the White House complex that can hold substantially more guests than currently allowed.",
    "url": "https://www.whitehouse.gov/briefings-statements/2025/07/the-white-house-announces-white-house-ballroom-construction-to-begin/"
  },
  {
    "text": "Trump's tariffs get frosty reception at federal appeals court … Judge Timothy Dyk, a Clinton appointee, said “it was hard for me to see” that Congress intended to give the president the authority to essentially rewrite the entire U.S. code when it passed the legislation.",
    "url": "https://www.politico.com/news/2025/07/31/trump-tariff-arguments-appeals-court-00486972"
  },
  {
    "text": "‘Clinton Plan’ Emails Were Likely Made by Russian Spies, Declassified Report Shows  —  An annex to a report by the special counsel John H. Durham was the latest in a series of disclosures about the Russia inquiry, as the Trump team seeks to distract from the Jeffrey Epstein files.",
    "url": "https://www.nytimes.com/2025/07/31/us/politics/trump-clinton-emails-russia-investigation.html?unlocked_article_code=1.a08.WmHr.TWoZEuTvFEKm&smid=url-share"
  },
  {
    "text": "Elon Musk gives millions to Republican super PACs ahead of the midterms  —  He's still directing big money to the GOP despite an acrimonious departure from the White House.  He also poured tens of millions into his own super PAC.  —  Billionaire Elon Musk may be gone from President Donald … ",
    "url": "https://www.nbcnews.com/politics/2026-election/elon-musk-gives-millions-republican-super-pacs-ahead-midterms-rcna222114"
  },
  {
    "text": "Further Modifying the Reciprocal Tariff Rates  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, including the International Emergency Economic Powers Act (50 U.S.C. 1701 et seq.)  (IEEPA), the National Emergencies Act … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/07/further-modifying-the-reciprocal-tariff-rates/"
  },
  {
    "text": "El Salvador approves indefinite presidential reelection and extends presidential terms to 6 years  —  The party of El Salvador President Nayib Bukele approved constitutional changes in the country's National Assembly on Thursday that will allow indefinite presidential reelection and extend presidential terms to six years.",
    "url": "https://apnews.com/article/el-salvador-nayib-bukele-reelection-f9efd1a08d3c9de2f886f7b911b9417d"
  },
  {
    "text": "Axelrod: Harris ‘setting herself up’ for 2028 presidential run  —  Democratic strategist David Axelrod on Wednesday said former Vice President Kamala Harris appears to be preparing for another White House bid after last year's November loss, following her announcement that she will not run for California governor.",
    "url": "https://thehill.com/homenews/campaign/5430397-axelrod-says-harris-setting-up-run/"
  },
  {
    "text": "‘Welcome to hell’: Inside the megaprison where the U.S. deported migrants  —  Interviews with 16 former detainees of El Salvador's Terrorism Confinement Center offer the most complete view yet of conditions at the notorious prison.  —  One detainee was beaten unconscious.",
    "url": "https://www.washingtonpost.com/world/2025/07/31/venezuelans-deported-us-el-salvador-prison-cecot/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzOTM0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1MzE2Nzk5LCJpYXQiOjE3NTM5MzQ0MDAsImp0aSI6IjQ0N2MyMTkyLWJjMWQtNDYxNy1iMjIwLTRlMGFkZjNhZmFiMCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI1LzA3LzMxL3ZlbmV6dWVsYW5zLWRlcG9ydGVkLXVzLWVsLXNhbHZhZG9yLXByaXNvbi1jZWNvdC8ifQ.Ka8mxc83STdLVgtmR8PWu1docguJWA2Aqq78hBgn_VQ&itid=gfta"
  },
  {
    "text": "Alan Dershowitz Takes on His Greatest Challenge Yet: A Farmers' Market  —  It was an unusually warm day on Martha's Vineyard on Wednesday, and Alan Dershowitz just wanted to enjoy some hot dumplings.  —  As he tells it, Dershowitz, the 86-year-old attorney for some of America's … ",
    "url": "https://nymag.com/intelligencer/article/alan-dershowitz-lawsuit-farmers-market-over-pierogi-denial.html"
  },
  {
    "text": "Scoop: Top Biden aide was promised $8 million for 2024 win  —  Former President Biden's top political aide Mike Donilon told congressional investigators Thursday that he was paid $4 million for his work on Biden's 2024 re-election campaign and would have made an additional $4 million if Biden had won … ",
    "url": "https://www.axios.com/2025/07/31/donilon-biden-2024-reelection-testimony-congress"
  },
  {
    "text": "Unnoticed Whistle-Blower Document Alarms Justice Department Veterans  —  A complaint concerning a top Justice Department official, Emil Bove III, went unnoticed for more than two months, raising worries that an internal watchdog has gone dormant.  —  The Justice Department's internal watchdog lost … ",
    "url": "https://www.nytimes.com/2025/07/31/us/politics/emil-bove-whistle-blower.html?unlocked_article_code=1.ak8.O-yj.dNlaN1BhnnNm&smid=url-share"
  },
  {
    "text": "Trump raises tariffs on Canada to 35 percent  —  President Trump announced Thursday that the U.S. would raise tariffs on certain Canadian goods from 25 percent to 35 percent beginning Friday.  —  Goods that are covered under the 2020 United States-Mexico-Canada Agreement will be exempt from the tariff rate, the White House said.",
    "url": "https://thehill.com/homenews/administration/5431181-trump-raises-tariffs-on-canada-to-35-percent/"
  },
  {
    "text": "Epstein abuse survivor Virginia Giuffre wanted files released before her death, family says  —  Her family urged President Donald Trump this week not to pardon Ghislaine Maxwell.  —  Virginia Giuffre, the woman who survived years of Jeffrey Epstein's abuse and died by suicide this year … ",
    "url": "https://www.nbcnews.com/news/us-news/epstein-abuse-survivor-virginia-giuffre-wanted-files-released-death-fa-rcna222375"
  },
  {
    "text": "Trump administration scolds allies over Palestinian statehood … Yet the Trump administration isn't wavering in its support for Israel.  —  “The president expressed his displeasure and his disagreement with the leaders of France, the United Kingdom and Canada,” White House press secretary Karoline Leavitt told reporters Thursday.",
    "url": "https://www.politico.com/news/2025/07/31/trump-palestinian-statehood-push-00487326"
  },
  {
    "text": "Blue-state Democrats want immigration agents to show their faces … “People wearing ski masks are grabbing people, throwing them into unmarked cars and sending them to Alligator Alcatraz or El Salvador or Libya,” said California state Sen. Scott Wiener, who authored a bill to ban certain kinds of face coverings for law enforcement.",
    "url": "https://www.politico.com/news/2025/07/31/blue-state-democrats-want-immigration-agents-to-show-their-faces-00487490"
  },
  {
    "text": "Gavin Newsom floats November special election for his anti-Trump redistricting push … It would be an enormously expensive and politically perilous campaign.  Newsom would be counting on Democrats' anti-Trump message overcoming voters' reluctance to return power to politicians for an explicitly partisan exercise.",
    "url": "https://www.politico.com/news/2025/07/31/gavin-newsom-november-special-election-redistricting-00487541"
  },
  {
    "text": "How Epstein and Maxwell Used Trump's Fame to Groom 13-Year-Old Girl  —  USERS AND ABUSERS  —  “Jane” revealed how the pair used Trump's name and a meeting with him as part of their twisted plan.  —  The first victim to testify in Ghislaine Maxwell's 2021 sex trafficking trial told the jury … ",
    "url": "https://www.thedailybeast.com/how-epstein-and-maxwell-used-trumps-fame-to-groom-13-year-old-girl/"
  },
  {
    "text": "Fox News since Monday: 85 minutes talking about Sydney Sweeney, 3 minutes talking about Epstein  —  RESEARCH CONTRIBUTIONS FROM TYLER MONROE & SAGE HODIL … Fox's focus on Sweeney over Epstein is a notable departure from the stories that other cable news networks have found to be newsworthy this week … ",
    "url": "https://www.mediamatters.org/fox-news/fox-news-monday-85-minutes-talking-about-sydney-sweeney-3-minutes-talking-about-epstein"
  },
  {
    "text": "The Columbia deal with Trump is a blueprint.  All of higher ed should fear what comes next.  —  One by one, elite universities are signing away some of their autonomy to the Trump administration after it has accused them of civil rights violations and withheld federal funding.",
    "url": "https://www.vox.com/politics/421954/columbia-brown-harvard-trump-settlement-antisemitism"
  },
  {
    "text": "The Boy Genius Who Killed 14 Million Poor People  —  1. Booksmart  —  On The Next Level yesterday Sarah, Tim, and I talked about this monster Bloomberg profile of Luke Farritor.  I cannot recommend it highly enough.  —  You probably have not heard Farritor's name before.",
    "url": "https://www.thebulwark.com/p/the-boy-genius-who-killed-14-million-luke-farritor-doge-elon-musk-trump"
  },
  {
    "text": "Navy chief confirmed after Alaska senator drops last-minute block … The last-minute drama had nothing to do with Caudle, whose confirmation seemed virtually assured.  Sullivan, a relentless booster for his home state, had objected to a speedy confirmation to put pressure on the Pentagon … ",
    "url": "https://www.politico.com/news/2025/07/31/sullivan-hold-senate-navy-chief-00487393"
  },
  {
    "text": "Biden takes aim at Trump as ‘existential’ threat to Black Americans in speech to lawyers group  —  The gala event also featured Supreme Court Justice Ketanji Brown Jackson and Rep Jasmine Crockett as speakers  —  Former President Joe Biden took a number of potshots at President Donald Trump addressing … ",
    "url": "https://www.foxnews.com/politics/biden-takes-aim-trump-existential-threat-black-americans-speech-lawyers-group"
  },
  {
    "text": "Senators Could Vote Imminently to Remove Their Homes, Travel Info From Internet  —  Watchdogs argue the legislation would block reporters from doing their jobs and limit efforts to hold lawmakers accountable  —  Senators could vote on a bill as soon as Thursday to allow members of Congress … ",
    "url": "https://www.rollingstone.com/politics/politics-features/senators-homes-travel-info-remove-internet-1235397818/"
  },
  {
    "text": "Washington Post talent exodus fuels speculation about its future  —  Dozens of journalists are taking buyouts and calling it quits at the Washington Post, fueling speculation about how the storied paper can survive while bleeding so much talent. … - CEO Will Lewis earlier this month encouraged staffers … ",
    "url": "https://www.axios.com/2025/07/31/washington-post-talent-exodus"
  },
  {
    "text": "Justice Brett Kavanaugh is probably reading this … Kavanaugh also made clear he closely follows press coverage, podcasts and social media posts about the Supreme Court, what he described as “an ocean of criticism and critiques out there.”  —  “I'm aware of it.  I definitely pay attention to it.",
    "url": "https://www.politico.com/news/2025/07/31/brett-kavanaugh-supreme-court-00487536"
  },
  {
    "text": "Republicans reject Democrats' amendment to block Trump from taking Qatari jet after presidency  —  Republicans on the Senate Appropriations Committee on Thursday rejected what they described as a “poison pill” amendment that Democrats say is intended to block President Trump from taking … ",
    "url": "https://thehill.com/business/budget/5431133-republicans-reject-democrats-amendment-aimed-at-blocking-trump-from-taking-qatari-jet-post-presidency/"
  }
]