[
  {
    "text": "Biden joins striking auto workers on picket line  —  DETROIT — President Joe Biden on Tuesday became the first sitting president to walk a picket line with striking workers, vividly demonstrating his commitment to labor and its central role in his reelection campaign.",
    "url": "https://www.politico.com/news/2023/09/26/biden-joins-striking-auto-workers-on-picket-line-00118171"
  },
  {
    "text": "Scoop: Biden team's don't-let-him-trip mission … - With a physical therapist, Biden has been doing exercises to improve his balance as far back as November 2021.  — Since his stumble in June, he has been wearing tennis shoes more often to avoid slipping — and using the short stairs on Air Force One … ",
    "url": "https://www.axios.com/2023/09/26/biden-trip-2024-campaign-sneakers"
  },
  {
    "text": "McCarthy says a meeting with Biden on the shutdown and border would be ‘important’  —  “The president can really come down to this and make sure the government stays open,” Speaker Kevin McCarthy said, after bailing on a prior spending deal with the White House.",
    "url": "https://www.nbcnews.com/politics/congress/mccarthy-calls-government-shutdown-meeting-biden-important-rcna117420"
  },
  {
    "text": "Cassidy Hutchinson's new book reveals a Trump White House even more chaotic than previously known  —  In her new book “Enough,” former White House aide Cassidy Hutchinson paints the closing days of the Trump White House as even more chaotic and lawless than she previously disclosed in her shocking televised testimony last summer.",
    "url": "https://www.cnn.com/2023/09/26/politics/cassidy-hutchinson-book-trump-white-house-chaos/"
  },
  {
    "text": "FTC Sues Amazon for Illegally Maintaining Monopoly Power  —  Amazon's ongoing pattern of illegal conduct blocks competition, allowing it to wield monopoly power to inflate prices, degrade quality, and stifle innovation for consumers and businesses  —  The Federal Trade Commission … ",
    "url": "https://www.ftc.gov/news-events/news/press-releases/2023/09/ftc-sues-amazon-illegally-maintaining-monopoly-power"
  },
  {
    "text": "Supreme Court rejects Alabama's bid to use congressional map with just one majority-Black district  —  The court's decision is in line with its June ruling in the same case that reaffirmed key protections for minority voters.  —  WASHINGTON — The Supreme Court on Tuesday handed a defeat … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rejects-alabamas-bid-use-congressional-map-just-one-majo-rcna105688"
  },
  {
    "text": "Supreme Court won't let Alabama use disputed House map for 2024  —  The Supreme Court on Tuesday refused Alabama's request to hold 2024 elections under a new congressional map judged to be an unlawful attempt to diminish the power of the state's Black voters.",
    "url": "https://www.washingtonpost.com/politics/2023/09/26/supreme-court-alabama-congressional-redistricting/"
  },
  {
    "text": "Booker Says Menendez Should Resign, Breaking Silence  —  The decision by Senator Cory Booker, a close ally, to condemn Senator Robert Menendez underscores the deepening crisis Mr. Menendez faces after his indictment.  —  Senator Cory Booker called on Senator Robert Menendez … ",
    "url": "https://www.nytimes.com/2023/09/26/nyregion/menendez-indictment-resignation-booker.html"
  },
  {
    "text": "Dam Breaks For Bob Menendez: Senate Democrats Pile On In Calls For Resignation  —  Jon Tester and Tammy Baldwin are among those up for reelection in 2024 and facing pressure to distance themselves from their indicted colleague.  —  LOADING  —  The dam broke open Tuesday morning … ",
    "url": "https://www.huffpost.com/entry/bob-menendez-resignation-jon-tester-tammy-baldwin_n_6512df4ee4b060f32d3b05be"
  },
  {
    "text": "Hunter Biden sues former Trump lawyer Rudy Giuliani over infamous laptop  — Hunter Biden sued former Trump lawyer Rudy Giuliani and another attorney over alleged violations of computer fraud and data access related to a laptop computer Biden is said to have left at a Delaware repair shop.",
    "url": "https://www.cnbc.com/2023/09/26/hunter-biden-sues-rudy-giuliani-over-infamous-laptop.html"
  },
  {
    "text": "What Is J.D. Vance's Angle?  —  J.D. Vance was trying to find his groove.  I had just shown up at his office last week to interview the Ohio Republican about his first nine months in the Senate, where he has proved curiously hard to pigeonhole.  As we sat down, Mr. Vance — at 39 … ",
    "url": "https://www.nytimes.com/2023/09/26/opinion/jd-vance-trump.html"
  },
  {
    "text": "Bending to far right, McCarthy pushes steep safety net cuts in shutdown battle  —  Republican House speaker embraces major spending reductions in trying to win conservative support for funding bill  —  Cutting housing subsidies for the poor by 33 percent as soaring rents drive a national affordability crisis.",
    "url": "https://www.washingtonpost.com/business/2023/09/26/mccarthy-conservatives-cut-spending/"
  },
  {
    "text": "Judge Cannon Enters a Minute Order  —  Today, Judge Aileen Cannon in the Southern District of Florida finally ruled on the special counsel's request to hold Garcia hearings to resolve potential conflicts of interest the lawyers for Trump's two co-defendants in the Mar-a-Lago case may have … ",
    "url": "https://joycevance.substack.com/p/judge-cannon-enters-a-minute-order"
  },
  {
    "text": "Republicans open probe into Biden's energy secretary after police called on her EV road trip  —  Granholm's EV road trip ‘illustrates yet again how out of touch the Biden Administration is,’ Republicans write  —  Republicans on the House Oversight and Accountability Committee … ",
    "url": "https://www.foxnews.com/politics/republicans-open-probe-bidens-energy-secretary-police-called-ev-road-trip"
  },
  {
    "text": "Florida school district orders librarians to purge all books with LGBTQ characters  —  Librarians in public schools in Charlotte County, Florida, were instructed by the school district superintendent to remove all books with LGBTQ characters or themes from school and classroom libraries.",
    "url": "https://popular.info/p/florida-school-district-orders-librarians"
  },
  {
    "text": "JPMorgan Settles Epstein Suits With U.S. Virgin Islands and James Staley  —  The bank agreed to pay $75 million to settle with the U.S. Virgin Islands and also reached a confidential settlement with a former top banker who pushed to keep the disgraced financier as a client.",
    "url": "https://www.nytimes.com/2023/09/26/business/jpmorgan-jeffrey-epstein-virgin-islands.html"
  },
  {
    "text": "The Coming Attack on an Essential Element of Women's Freedom  —  No-fault divorce has improved the lives of millions.  Now some extreme Republicans want to abandon it.  —  For the past half century, many women in America have enjoyed an unprecedented degree of freedom and legal protection … ",
    "url": "https://www.theatlantic.com/ideas/archive/2023/09/no-fault-divorce-laws-republicans-repeal/675371/"
  },
  {
    "text": "Donald Trump once backed 2012 privatization plans for Medicare, despite attacks on key 2024 rival for the same position  —  Former President Donald Trump has called his 2024 opponent Ron DeSantis a “wheelchair over the cliff kind of guy” for supporting then-Rep. Paul Ryan's 2012 plans … ",
    "url": "https://www.cnn.com/2023/09/26/politics/kfile-donald-trump/"
  }
]