[
  {
    "text": "Poll finds Biden damaged by debate; with Harris and Clinton best positioned to win  —  Vice President Kamala Harris is now running ahead of Trump, 42 percent to 41 percent, the survey found.  —  A top Democratic pollster has a new survey showing President Joe Biden still in contention against Donald Trump … ",
    "url": "https://www.politico.com/news/2024/07/09/biden-clinton-harris-democrat-poll-00166937"
  },
  {
    "text": "Playbook: The Democratic split to watch  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  DEPT. OF SHIT-STIRRING — “Poll finds Biden damaged by debate; with Harris and Clinton best positioned to win,” by Christopher Cadelago: “The national poll … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/09/the-democratic-split-to-watch-00166992"
  },
  {
    "text": "Black House Democrats embrace Biden at another critical juncture  —  “You've had my back, and I'll continue to have yours,” Biden told the Congressional Black Caucus on a Monday night call, echoing the 2020 race.  —  When the naysayers doubted that Joe Biden could win the 2020 presidential primary … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/08/black-house-democrats-cbc-biden-congressional-black-caucus/"
  },
  {
    "text": "Hill Dems brace for party reckoning over Biden  —  The party's panic over the president's electability has spiraled behind the scenes — and is likely to spill more into public view in the coming days.  —  President Joe Biden's outreach efforts to congressional Democrats haven't quelled … ",
    "url": "https://www.politico.com/news/2024/07/08/hill-dems-brace-for-fight-over-bidens-future-to-get-worse-00166950"
  },
  {
    "text": "Kamala Harris beats Donald Trump, new poll shows, performs better than Joe Biden  —  WASHINGTON — Vice President Kamala Harris could narrowly beat Donald Trump in November, according to a new national poll from a Democratic pollster.  —  Harris is ahead by 1 point in the poll conducted … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/09/harris-beat-trump-poll-biden/74333759007/"
  },
  {
    "text": "Biden Gets Unexpected Boost From ‘Squad’ Members He Once Battled  — Ocasio-Cortez, Omar stand behind president in debate aftermath  — Several other Democrats openly calling for Biden to step aside  —  Biden Tells Lawmakers to End Revolt Over Candidacy",
    "url": "https://www.bloomberg.com/news/articles/2024-07-09/biden-gets-unexpected-boost-from-squad-members-he-once-battled"
  },
  {
    "text": "The media has been breathlessly attacking Biden.  What about Trump?  —  The bigger story is Donald Trump's appalling unfitness for office.  He tried to overturn a legitimate election and is a felon  —  It's possible for two conflicting ideas to be true at once.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/09/biden-media-attacks-trump-felon"
  },
  {
    "text": "The Double Standard in Trump-Biden Coverage  —  It's real, and it's not going anywhere.  —  After President Joe Biden's disastrous recent public appearances, he and his supporters are attacking media outlets for a double standard in coverage of him and his opponent.",
    "url": "https://www.theatlantic.com/newsletters/archive/2024/07/the-double-standard-in-trump-biden-coverage/678943/"
  },
  {
    "text": "White House doctor offers explanation for Parkinson's expert's visits  —  The doctor held regular Neurology clinics at the White House, she said  —  In a letter released late Monday night by the president's physician, Dr. Kevin O'Connor, he confirmed that Dr. Kevin Cannard … ",
    "url": "https://abcnews.go.com/Politics/white-house-doctor-offers-explanation-parkinsons-experts-visits/story?id=111764565"
  },
  {
    "text": "Peter Baker Argues Joe Biden Is Unfit because Peter Baker Is Too Lazy to Read the Homework  —  The NYT and ABC have now joined the insane mob tying the White House visits of a neurologist who has written papers on topics that include Parkinson's, Dr. Kevin Cannard, to their wild brays that Joe Biden is unfit to stay in the race.",
    "url": "https://www.emptywheel.net/2024/07/08/peter-baker-argues-joe-biden-is-unfit-because-peter-baker-is-too-lazy-to-read-the-homework/"
  },
  {
    "text": "J.D. Vance Has a Problem on His Face  —  J.D. VANCE IS THE BEST BET on the predictive markets to be Donald Trump's running mate.  But an only-in-MAGAville issue might stand in the Ohio Republican's way: facial hair.  —  “J.D. has a beard.  But Trump is a clean-shaven guy.",
    "url": "https://www.thebulwark.com/p/jd-vance-has-a-problem-on-his-face"
  },
  {
    "text": "U.S. Officials Say Russia Is Unlikely to Take Much More Ukrainian Territory  —  Russian forces continue to inflict pain, but NATO leaders gathering in Washington can say that their efforts to strengthen Ukraine are working.  —  Russia is unlikely to make significant territorial gains … ",
    "url": "https://www.nytimes.com/2024/07/09/us/politics/russia-ukraine-nato.html"
  },
  {
    "text": "A Dangerous Double Standard  —  All our energies must go to defeating Trump  —  What a weekend.  You know I have seen some things in my seven decades covering American politics.  I have never seen anything quite like the wrangling, hand-wringing, and behind-the-scenes gamesmanship currently swirling around President Biden.",
    "url": "https://steady.substack.com/p/a-dangerous-double-standard"
  },
  {
    "text": "The alarming new power Trump will claim in a second term  —  Donald Trump says that if he returns to the White House in 2025, he will have the power to effectively cancel any federal program — or even an entire agency — by refusing to spend money appropriated by Congress.",
    "url": "https://popular.info/p/the-alarming-new-power-trump-will"
  },
  {
    "text": "Former Sen. Jim Inhofe, Prolific Climate Denier, Dies At 89  —  The longtime Oklahoma Republican leaves behind a long legacy of disinformation about the mounting threat of global warming.  —  Longtime former Oklahoma Republican Sen. Jim Inhofe, one of the most vehement climate change deniers … ",
    "url": "https://www.huffpost.com/entry/james-inhofe-oklahoma-climate-denier-dead_n_668d4d03e4b0a62057b85fc2"
  },
  {
    "text": "Project 2025's plans for the Justice Department  —  Dig in with me.  —  Project 2025 is a frightening, authoritarian missive with Christian nationalism values at its core that aims to dismantle large swaths of the federal government and transform that which remains into a politicized right-wing machine.",
    "url": "https://www.lawdork.com/p/project-2025-justice-department-plans"
  },
  {
    "text": "The Enormous Risks a Second Trump Term Poses to Our Economy  —  Not long ago, one of us was having lunch with someone who manages a multibillion-dollar fund when the subject turned to the prospect of a second Trump term.  —  This person was disturbed by many of Donald Trump's actions … ",
    "url": "https://www.nytimes.com/2024/07/08/opinion/economic-risks-second-trump-term.html"
  },
  {
    "text": "‘No one is picking up the phone’: Joe Biden's fundraising confronts new hurdles after debate … President Joe Biden's fundraising operation started showing cracks in its once formidable armor, almost 10 days after his disastrous presidential debate performance.",
    "url": "https://www.cnbc.com/2024/07/08/joe-biden-fundraising-debate.html"
  },
  {
    "text": "Trump plans to block hearings in January 6 case before 2024 election  —  Lawyers for ex-president preparing to shut down possibility of high-profile officials testifying at evidentiary hearings  —  Donald Trump is expected to launch a new legal battle to suppress any damaging evidence … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/09/trump-january-6-witnesses-election"
  },
  {
    "text": "FBI Probing Rape Allegations Against Star Real-Estate Brokers  —  Federal agents have interviewed women who say they were sexually assaulted by Oren, Alon and Tal Alexander  —  The Federal Bureau of Investigation is probing allegations of rape and sexual assault by three siblings … ",
    "url": "https://www.wsj.com/us-news/fbi-probing-rape-allegations-against-star-real-estate-brokers-482fbab9"
  }
]