[
  {
    "text": "Why I'm voting for Biden and other Republicans should, too  —  Donald Trump has disqualified himself through his conduct and his character,  —  It's disappointing to watch an increasing number of Republicans fall in line behind former president Donald Trump.",
    "url": "https://www.ajc.com/opinion/geoff-duncan-why-im-voting-for-biden-and-other-republicans-should-too/LFLE5YWCBBA6VDGJAJKMNPCDKQ/"
  },
  {
    "text": "Georgia Republican backs Biden, blasts those in party who ‘fall in line’ with Trump  —  Former Georgia Lt. Governor Geoff Duncan (R) revealed Monday he would be backing President Biden in November's election and criticized other Republicans who “fall in line” with former President Trump.",
    "url": "https://thehill.com/homenews/campaign/4646773-georgia-republican-backs-biden-blasts-those-in-party-who-fall-in-line-with-trump/"
  },
  {
    "text": "Hamas announces it has accepted an Egyptian-Qatari cease-fire proposal  —  Israel's army has told Palestinians to temporarily evacuate from parts of Rafah in southern Gaza, signaling that a ground invasion is imminent.  People were told to move to Muwasi, an Israeli-declared humanitarian area near the coast.",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-war-humanitarian-aid-8659eae6e0a7362504f0aa4aa4be53e0"
  },
  {
    "text": "Israel approved Rafah military operation and started striking Hamas targets  —  The decision by Israel's War Cabinet came hours after Hamas agreed to a cease-fire that Israel hadn't previously accepted.  —  Israel launched a volley of strikes in the Gazan city of Rafah and said it would … ",
    "url": "https://www.politico.com/news/2024/05/06/israel-rafah-hamas-00156372"
  },
  {
    "text": "Israel Steps Up Attacks on Rafah as Hamas Shifts Position on Cease-fire … Israel says it will send a delegation to talks on the proposal.  —  Israel stepped up attacks on Monday in the southern city of Rafah hours after Hamas said there was a cease-fire proposal, drawn from one put forth … ",
    "url": "https://www.nytimes.com/live/2024/05/06/world/israel-gaza-war-hamas"
  },
  {
    "text": "Ole Miss Student Kicked Out of Fraternity After Video Caught Racist Gestures Toward Protester  —  Video footage of a student making racist gestures, seemingly imitating a monkey, toward a Black woman who was part of a scheduled pro-Palestinian protest at the University of Mississippi … ",
    "url": "https://time.com/6974979/university-of-mississippi-protest-racist-monkey-gesture-fraternity/"
  },
  {
    "text": "GOP Rep. Collins responds to criticism of Ole Miss post  —  Rep. Mike Collins (R-Ga.) defended his decision to share a video of counterprotesters at the University of Mississippi harassing a Black woman at a pro-Palestinian protest last week, responding to criticism that he was endorsing racist conduct.",
    "url": "https://thehill.com/homenews/house/4646786-gop-rep-collins-responds-to-criticism-of-ole-miss-post/"
  },
  {
    "text": "Congressman praises racist heckling.  Will his corporate backers stand by him?  —  On Thursday, Jaylin Smith, a graduate student at the University of Mississippi, participated in a small, non-violent protest calling for a ceasefire in Gaza.  Smith and the other protesters were greeted … ",
    "url": "https://popular.info/p/congressman-praises-racist-heckling"
  },
  {
    "text": "The critical difference that could save Cuellar  —  Presented by With assists from POLITICO's Congress team  —  Rep. Henry Cuellar's indictment marks the third high-profile Hispanic lawmaker to have been indicted in recent months.  Critically, the influential Congressional Hispanic Caucus is coming to his defense.",
    "url": "https://www.politico.com/newsletters/inside-congress/2024/05/06/the-critical-difference-that-could-save-cuellar-00156382"
  },
  {
    "text": "Kristi Noem's Team Told Her to Nix the Dog Story 2 Years Ago  —  It would have violated the first rule of campaign memoirs: Do no harm.  —  Kristi Noem's story about killing her dog made headlines across America.  But it wasn't news to people who worked on her first book … ",
    "url": "https://www.politico.com/news/magazine/2024/05/06/kristi-noem-dog-killing-story-00156290"
  },
  {
    "text": "Jack Dorsey praises Twitter as ‘freedom technology’ as he leaves Bluesky board  —  Former Twitter CEO Jack Dorsey praised the platform he founded, now known as X, as “freedom technology” on Saturday, shortly after revealing he was no longer serving on the board of directors for Bluesky.",
    "url": "https://thehill.com/policy/technology/4646630-jack-dorsey-praises-twitter-as-freedom-technology-as-he-leaves-bluesky-board/"
  },
  {
    "text": "U.S. soldier detained in Russia, officials say  —  The soldier, who was stationed in Korea and traveled to Russia on his own, is accused of stealing from a woman.  —  A U.S. soldier was detained in Russia over the weekend, according to four U.S. officials.",
    "url": "https://www.nbcnews.com/politics/politics-news/us-soldier-detained-russia-officials-say-rcna150928"
  },
  {
    "text": "House Republicans plan to move forward with contempt against Attorney General Merrick Garland  —  The move comes after the DOJ declined House Republicans' requests to hand over audio of then-special counsel Robert Hur's interview with President Joe Biden.  —  WASHINGTON — The House Judiciary … ",
    "url": "https://www.nbcnews.com/politics/congress/house-republicans-plan-move-forward-contempt-attorney-general-merrick-rcna150937"
  },
  {
    "text": "MIT becomes first elite university to ban diversity statements  —  In what's likely to be a watershed moment, the Massachusetts Institute of Technology has ended the use of diversity statements for faculty hiring, making it the first elite private university to backtrack on the practice … ",
    "url": "https://unherd.com/newsroom/mit-becomes-first-elite-university-to-ban-diversity-statements/"
  },
  {
    "text": "EXCLUSIVE: “You Have Been Warned”: Republican Senators Threaten the ICC Prosecutor over Possible Israel Arrest Warrants  —  Read the full letter, obtained by Zeteo, which threatens sanctions in defense of Netanyahu.  —  Team Zeteo and Mehdi Hasan  —  A group of influential Republican senators … ",
    "url": "https://zeteo.com/p/exclusive-you-have-been-warned-republican"
  },
  {
    "text": "ProPublica Wins Pulitzer Prize for Supreme Court Coverage  —  The award marks ProPublica's 7th Pulitzer; Uvalde shooting investigation is named a Pulitzer finalist.  —  ProPublica won the prestigious public service Pulitzer Prize for what the judges described as “groundbreaking … ",
    "url": "https://www.propublica.org/article/pulitzer-prize-announcement-propublica-supreme-court"
  },
  {
    "text": "Scoop: Kristi Noem angled for top NRA job … - Late last fall, Noem called LaPierre to advocate to be the next executive vice president or CEO of the gun lobby.  — Noem is now in a heated PR cycle over passages in her book about shooting her dog and meeting with Kim Jong Un.",
    "url": "https://www.axios.com/2024/05/06/kristi-noem-south-dakota-nra-lapierre"
  },
  {
    "text": "Right-Wing Nonprofit Paid Millions to Companies With Ties to Insiders  —  The Conservative Partnership Institute's three highest-paid contractors had connections to the group's leaders or their relatives, raising concerns about self-dealing.  —  The Conservative Partnership Institute … ",
    "url": "https://www.nytimes.com/2024/05/06/us/politics/trump-conservative-partnership-institute-funds.html"
  },
  {
    "text": "‘We deserve more’: US workers' share of the pie dwindles  —  Bureau of Labor Statistics releases latest estimate of how much labor receives of national income, showing bleak decline  —  When Jesse Motte began working at a Starbucks inside a Target store in Columbia, South Carolina, more than two years ago, $15 an hour sounded great.",
    "url": "https://www.theguardian.com/us-news/article/2024/may/06/workers-income-labor-"
  },
  {
    "text": "Russia to Hold Drills on Tactical Nuclear Weapons in New Tensions With West  —  Russian officials claimed the order was in response to comments from the West about the possibility of more direct involvement in Ukraine.  NATO called Russia's announcement “irresponsible.”",
    "url": "https://www.nytimes.com/2024/05/06/world/europe/russia-tactical-nuclear-weapons-drills.html"
  },
  {
    "text": "Donald Trump Is “A Colossal A**hole,” Jeffrey Katzenberg Says; Hasn't Yet Reached Out To Taylor Swift To Endorse “Decent” Joe Biden  —  Jeffrey Katzenberg is a man known for choosing his words very carefully most of the time, and tonight the WndrCo boss was pretty candid when it came to Donald Trump and Joe Biden.",
    "url": "https://deadline.com/2024/05/donald-trump-jeffrey-katzenberg-interview-joe-biden-talyor-swift-1235905004/"
  },
  {
    "text": "Bitter pills: The Daily Wire suggests its new vitamins will boost sperm counts and fight “wokeness”  —  Marketing for The Daily Wire's latest venture tries to cash in on fear of trans people and drag queens  —  The Daily Wire announced the launch of a new “men's lifestyle” … ",
    "url": "https://www.mediamatters.org/daily-wire/bitter-pills-daily-wire-suggests-its-new-vitamins-will-boost-sperm-counts-and-fight"
  },
  {
    "text": "'RuPaul's Drag Race All Stars' strut stuff on National Mall  —  The cast of “RuPaul's Drag Race All Stars” took to a different kind of stage Monday morning, sashaying down Washington's National Mall to promote the ninth season of the Emmy-nominated reality series.",
    "url": "https://thehill.com/homenews/lgbtq/4647026-rupauls-drag-race-all-stars-strut-stuff-on-national-mall/"
  },
  {
    "text": "Hunter Biden's revenge  —  Smear campaigns have consequences.  —  ∙ Paid … Have you noticed that after years of saturation coverage, Fox News hosts have suddenly cooled it on the Hunter Biden stuff?  There's a reason for that.  —  Last week, Fox News pulled the six-part series … ",
    "url": "https://www.publicnotice.co/p/hunter-biden-sues-fox-news-explained"
  },
  {
    "text": "Johnson set to face Greene-led speakership ouster attempt this week  —  Support for Johnson from Democrats will open the speaker up to even more criticism from the right flank of his party.",
    "url": "https://www.politico.com/live-updates/2024/05/06/congress/johnson-ouster-attempt-speaker-house-gop-mtg-00156230"
  }
]