[
  {
    "text": "2028 POV on 2025 Dems  —  Just now … Good morning, Early Birds.  Allergy season seems to be starting in D.C. and especially these cities.  Send tips to earlytips@washpost.com.  Thanks for waking up with us.  —  In today's edition ... Analysis shows Republican tax cuts and benefit reductions … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/19/2028-pov-2025-dems/"
  },
  {
    "text": "Chuck Schumer clung to belief Republicans would ‘expel’ Trump, book says  —  Even as 2024 election loomed, reporters say, Democratic Senate leader was sure GOP would ‘expel the turd of Trump’  —  Chuck Schumer, the Democratic Senate minority leader, insisted Republicans would move on from Donald … ",
    "url": "https://www.theguardian.com/books/2025/mar/19/chuck-schumer-trump-book"
  },
  {
    "text": "Defiance and Threats in Deportation Case Renew Fear of Constitutional Crisis  —  Legal scholars say that the nation has reached a tipping point and that the right question is not whether there is a crisis, but rather how much damage it will cause.  —  Over the weekend, the Trump administration ignored … ",
    "url": "https://www.nytimes.com/2025/03/19/us/politics/trump-deportations-constitutional-crisis-impeachment.html"
  },
  {
    "text": "Emails Reveal Top IRS Lawyer Warned Trump Firings Were a “Fraud” on the Courts  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  On Feb. 20, nearly 7,000 probationary employees … ",
    "url": "https://www.propublica.org/article/trump-irs-firings-doge-fraud-law-job-performance"
  },
  {
    "text": "Turkey detains Erdogan's main rival in what opposition calls ‘coup’  —  Turkish authorities detained President Tayyip Erdogan's main political rival on Wednesday on charges including corruption and aiding a terrorist group in what the main opposition party called “a coup against our next president”.",
    "url": "https://www.reuters.com/world/middle-east/turkish-authorities-order-detention-istanbul-mayor-some-100-others-2025-03-19/"
  },
  {
    "text": "I'm the Canadian who was detained by Ice for two weeks.  It felt like I had been kidnapped  —  I was stuck in a freezing cell without explanation despite eventually having lawyers and media attention.  Yet, compared with others, I was lucky  —  There was no explanation, no warning.",
    "url": "https://www.theguardian.com/us-news/2025/mar/19/canadian-detained-us-immigration-jasmine-mooney"
  },
  {
    "text": "Trump Gets a Taste of Putin's Tactics  —  Vladimir Putin isn't going to make this easy for Donald Trump.  —  For weeks, Trump has bragged about his close relationship with his Russian counterpart and declared that Putin wanted to bring a quick end to the war that he, of course, started more than three years ago.",
    "url": "https://www.theatlantic.com/politics/archive/2025/03/putin-trump-ceasefire-proposal/682092/"
  },
  {
    "text": "Smears, Sadism and Social Security  —  Why Elon Musk wants to make seniors suffer  —  We often think of Social Security as a retirement program, which it is; most Social Security beneficiaries achieve that status simply by reaching retirement age.  But the program also helps Americans … ",
    "url": "https://paulkrugman.substack.com/p/smears-sadism-and-social-security"
  },
  {
    "text": "Exclusive: Trump fires both Democratic commissioners at FTC, sources say  —  President Donald Trump fired the two Democratic commissioners at the U.S. Federal Trade Commission on Tuesday, two sources familiar with the situation said, in another major test of the independence of regulatory agencies.",
    "url": "https://www.reuters.com/world/us/trump-fires-both-democratic-commissioners-ftc-sources-say-2025-03-18/"
  },
  {
    "text": "Trump's Sister Declared The Immigration Law He Used Unconstitutional  —  Stuart Anderson writes about immigration, business and globalization.  —  SaveComment  —  In a historical twist, Donald Trump's sister was the federal judge who ruled unconstitutional the immigration law … ",
    "url": "https://www.forbes.com/sites/stuartanderson/2025/03/19/trumps-sister-declared-the-immigration-law-he-used-unconstitutional/"
  },
  {
    "text": "The Trump Administration Goes To War With Health-Care Quality  —  Inside its plan to destroy a small agency that keeps you safe.  —  ∙ Paid  —  On March 14, the same day Senate Democratic leaders cast their fateful votes to fund the government, other Democrats were bracing for Donald … ",
    "url": "https://www.offmessage.net/p/the-trump-administration-goes-to"
  },
  {
    "text": "Minnesota lawmaker behind ‘Trump derangement syndrome’ bill accused of soliciting teen  —  Minnesota state Sen. Justin Eichorn (R) was arrested for soliciting a teen on Monday, authorities said, hours after he introduced a bill proposing “Trump derangement syndrome” (TDS) as a form of mental illness.",
    "url": "https://thehill.com/homenews/state-watch/5202706-minnesota-senator-justin-eichorn-arrested/"
  },
  {
    "text": "With Orders, Investigations and Innuendo, Trump and G.O.P. Aim to Cripple the Left  —  The president and his allies in Congress are targeting the financial, digital and legal machinery that powers the Democratic Party and much of the progressive political world.  —  Executive actions intended to cripple top Democratic law firms.",
    "url": "https://www.nytimes.com/2025/03/19/us/politics/trump-republicans-attack-democrats-actblue.html"
  },
  {
    "text": "NASA astronauts return after unexpected nine months in space  —  Problems with Boeing's Starliner capsule forced Suni Williams and Butch Wilmore to stay on the International Space Station far longer than planned.  They're finally home.  —  NASA astronauts Suni Williams and Butch Wilmore have finally returned to Earth.",
    "url": "https://www.nbcnews.com/science/space/live-blog/nasa-astronauts-boeing-starliner-spacex-splashdown-watch-live-updates-rcna196871"
  },
  {
    "text": "Trump Has Gone From Unconstitutional to Anti-Constitutional  —  Most of us know what it means for something to be unconstitutional.  An unconstitutional act is one that violates some aspect of the Constitution as understood by the courts, although the public and its representatives are also free … ",
    "url": "https://www.nytimes.com/2025/03/19/opinion/trump-musk-constitutional-unconstitutional.html?unlocked_article_code=1.5E4.ES9E.iQJkDbyhmvus&smid=url-share"
  },
  {
    "text": "Hill Republicans already hated the ‘idiotic’ call to impeach judges.  Then Trump jumped in.  —  The speaker has to deal with a new Trump-driven demand just as he moves to put the GOP's policy agenda into overdrive.  —  Hard-right House Republicans have a new project … ",
    "url": "https://www.politico.com/news/2025/03/19/mike-johnson-judge-impeachment-push-00236968"
  },
  {
    "text": "JFK Assassination Records - 2025 Documents Release  —  In accordance with President Donald Trump's directive of March 17, 2025, all records previously withheld for classification that are part of the President John F. Kennedy Assassination Records Collection are released.",
    "url": "https://www.archives.gov/research/jfk/release-2025"
  },
  {
    "text": "They're coming for immigrants first  —  And the Trump administration is signaling that no one else might be safe, either.  —  Just now  —  There is a long-standing divergence in how Americans view criminal justice.  While everyone agrees that those who commit crimes should be punished … ",
    "url": "https://www.washingtonpost.com/opinions/2025/03/19/trump-deportation-program-el-salvador/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyMzU2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzNzM5MTk5LCJpYXQiOjE3NDIzNTY4MDAsImp0aSI6ImRiODg0MWQ3LTVlZGEtNDA3Ny05NTc1LTkwZDExZTQ4ZDExMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzAzLzE5L3RydW1wLWRlcG9ydGF0aW9uLXByb2dyYW0tZWwtc2FsdmFkb3IvIn0.oBN-igi0p4cczsUHhh6UP6Mox7oB9T5VQmnk5NHBNfU&itid=gfta"
  },
  {
    "text": "The Cost of the Government's Attack on Columbia  —  American universities have given the country prosperity and security.  The Trump administration's attack on academic freedom endangers all of that.  —  The United States is home to the best collection of research universities in the world.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/03/columbia-academic-freedom/682088/?gift=U6ENXdMSx-3rXawTZ5-kgEAupFFXjAZTYpHwZULdBj4&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "‘We Finally Got You.’ Immigrant-Rights Advocate Arrested in Colorado.  —  Jeanette Vizguerra, who made national news evading deportation in a church basement, is the latest activist to be taken into custody by federal immigration agents.  —  An undocumented woman in Denver who became a symbol … ",
    "url": "https://www.nytimes.com/2025/03/18/us/immigrant-arrest.html"
  },
  {
    "text": "Kennedy's Alarming Prescription for Bird Flu on Poultry Farms  —  The health secretary has suggested allowing the virus to spread, so as to identify birds that may be immune.  Such an experiment would be disastrous, scientists say.  —  Robert F. Kennedy Jr., the nation's top health official … ",
    "url": "https://www.nytimes.com/2025/03/18/health/kennedy-bird-flu.html?unlocked_article_code=1.404.zYYP.HXW7t7VL8EuF&smid=url-share"
  },
  {
    "text": "Federal judge indefinitely blocks Trump's ban on transgender service members, saying it's ‘soaked in animus’  —  A federal judge has indefinitely blocked President Donald Trump's ban on transgender service members, dealing a major defeat to a controversial policy the president resurrected from his first term.",
    "url": "https://www.cnn.com/2025/03/18/politics/transgender-military-court-ruling/"
  },
  {
    "text": "Trump's cuts to US news outlets criticized for ceding ground to China, adversaries  —  U.S. lawmakers and rights advocates say the Trump administration's drive to dismantle U.S. government-funded news outlets, including Voice of America and Radio Free Asia, is a major blow … ",
    "url": "https://www.reuters.com/world/us/trumps-cuts-us-news-outlets-criticized-ceding-ground-china-adversaries-2025-03-19/"
  },
  {
    "text": "Judge says dismantling of USAID was unconstitutional, orders Musk to restore access for employees  —  The judge ordered a pause on any efforts to shut down USAID.  —  Elon Musk's attempt to unilaterally dismantle the U.S. Agency for International Development likely violated the United States Constitution … ",
    "url": "https://abcnews.go.com/Politics/judge-dismantling-usaid-unconstitutional-orders-musk-restore-access/story?id=119923733"
  },
  {
    "text": "Judge denies Trump administration's attempt to dismiss Mahmoud Khalil's challenge to his deportation - live  —  Judge also rules case of detained Palestinian activist should be heard in New Jersey, not Louisiana  —  Judge denies government's attempt to dismiss Mahmoud Khalil's challenge to his deportation",
    "url": "https://www.theguardian.com/us-news/live/2025/mar/19/us-politics-live-donald-trump-republicans-democrats-elon-musk-latest-news"
  }
]