[
  {
    "text": "How Trump's Verbal Slips Could Weaken His Attacks on Biden's Age  —  Donald Trump, 77, has relentlessly attacked President Biden, 80, as too old for office.  But the former president himself has had a series of gaffes that go beyond his usual freewheeling style.",
    "url": "https://www.nytimes.com/2023/10/30/us/politics/trump-biden-age.html"
  },
  {
    "text": "Judge reinstates Trump gag order in Jan. 6 case  —  The judge overseeing Trump's Jan. 6 case has reinstated a gag order.  —  The judge overseeing former President Donald Trump's Jan. 6 case has reinstated the gag order she imposed over Trump after temporarily halting the limited gag order earlier this month.",
    "url": "https://abcnews.go.com/Politics/judge-reinstates-trump-gag-order-jan-6-case/story?id=104466343"
  },
  {
    "text": "Trump Forgets Which City He Is in During Iowa Campaign Speech  —  WHO?  WHAT?  WHERE?  —  The correct name was eventually whispered into the former president's ear on stage.  —  Though Donald Trump often makes fun of Joe Biden for his old age, Trump himself apparently forgot … ",
    "url": "https://www.thedailybeast.com/trump-forgets-which-city-he-is-in-during-sioux-city-iowa-campaign-speech"
  },
  {
    "text": "Federal Judge Reinstates Gag Order on Trump in Election Case  —  Judge Tanya Chutkan ruled that her order should stay in effect while the former president's lawyers pursue an appeal.  —  A federal judge reinstated a gag order on former President Donald J. Trump on Sunday that had been temporarily placed … ",
    "url": "https://www.nytimes.com/2023/10/29/us/politics/trump-gag-order-chutkan.html"
  },
  {
    "text": "Trump maintains commanding lead in Iowa poll  —  Nikki Haley is tied with Ron DeSantis for second place in the NBC/Des Moines Register/Mediacom survey as Trump's backers remain the most committed.  —  Former President Donald Trump now leads his nearest Republican rivals by nearly 30 points in Iowa … ",
    "url": "https://www.nbcnews.com/meet-the-press/first-read/trump-maintains-commanding-lead-iowa-poll-rcna122410"
  },
  {
    "text": "Trump's Gag Order Reinstated in D.C.  —  A federal judge on Sunday put limits back in place prohibiting statements about prosecutors, defense lawyers, court staff, witnesses or the substance of their testimony  —  A federal judge on Sunday reinstated the gag order in Donald Trump's election … ",
    "url": "https://themessenger.com/politics/trumps-gag-order-reinstated-chutkan-jack-smith-dc"
  },
  {
    "text": "McConnell goes all out as Ukraine fight fractures GOP  —  His intense lobbying effort puts the Senate GOP leader at odds with his new House counterpart, Speaker Mike Johnson.  —  Mitch McConnell is abandoning his typically cautious style when it comes to aiding Ukraine … ",
    "url": "https://www.politico.com/news/2023/10/30/mcconnell-goes-all-out-as-ukraine-fight-fractures-gop-00123966"
  },
  {
    "text": "Mike Johnson's first big test  —  Good morning, Early Birds.  How many Barbies did you see at Halloween parties over the weekend?  We're okay with it.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2023/10/30/mike-johnsons-first-big-test/"
  },
  {
    "text": "Hundreds storm airport in Russia in antisemitic riot over arrival of plane from Israel  —  Hundreds of people stormed into the main airport in Russia's Dagestan region and onto the landing field Sunday, chanting antisemitic slogans and seeking passengers arriving on a flight from Tel Aviv … ",
    "url": "https://www.cbsnews.com/news/crowd-storms-russian-airport-to-protest-flight-from-israel-antisemitic-riot/"
  },
  {
    "text": "Clarence Thomas, his luxury R.V., and his magical mystery disappearing loan  —  The latest news on Justice Clarence Thomas's disregard for ethics is a remarkable affront to the Supreme Court, his colleagues, and the country.  —  The Senate Finance Committee announced this past week … ",
    "url": "https://www.lawdork.com/p/clarence-thomas-luxury-rv-loan"
  },
  {
    "text": "Donald Trump builds on big lead as Nikki Haley pulls even with Ron DeSantis in Iowa Poll  —  A Des Moines Register/NBC News/Mediacom Iowa Poll shows 43% of likely Republican caucusgoers pick Trump as their first choice for president, with DeSantis and Haley tied for second at 16%",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/caucus/2023/10/30/iowa-poll-donald-trump-leads-ron-desantis-nikki-haley-tied-presidential-candidates-gop-caucus/71342485007/"
  },
  {
    "text": "FACT SHEET: President Biden Issues Executive Order on Safe, Secure, and Trustworthy Artificial Intelligence  —  Today, President Biden issued a landmark Executive Order to ensure that America leads the way in seizing the promise and managing the risks of artificial intelligence (AI).",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/10/30/fact-sheet-president-biden-issues-executive-order-on-safe-secure-and-trustworthy-artificial-intelligence/"
  },
  {
    "text": "Speaker Mike Johnson's corporate backers  —  Last Wednesday, Republicans selected Congressman Mike Johnson (R-LA) as the next Speaker of the House.  Johnson is the most radical member ever selected as Speaker, championing a host of far-right causes.  Some experts describe Johnson's views … ",
    "url": "https://popular.info/p/speaker-mike-johnsons-corporate-backers"
  },
  {
    "text": "WATCH: Cori Bush's husband confronted over the thousands in cash he has received from her campaign  —  The husband of far-left “Squad” Rep. Cori Bush of Missouri was pressed late last week on the streets of Washington, D.C., over the thousands of dollars in cash he has received from his wife's campaign.",
    "url": "https://www.foxnews.com/politics/watch-cori-bushs-husband-confronted-over-thousands-cash-he-received-from-her-campaign"
  }
]