[
  {
    "text": "Trump's Motions to Dismiss Things That Aren't the Charges Against Him  —  Last night, Trump just met the deadline for filing motions to dismiss his January 6 indictment.  —  I'm going to lay out what he filed.  I'll review them at length in follow-ups.  Here's a handy table to understand them.",
    "url": "https://www.emptywheel.net/2023/10/24/trumps-motions-to-dismiss-things-that-arent-the-charges-against-him/"
  },
  {
    "text": "Trump's lawyers argue DC fed'l charges unconstitutional, should be tossed  —  The lawyers argue the indictment violates the First Amendment, due process, and double jeopardy protections in one of four late-night filings Monday.  —  In a late-night filing Monday, Donald Trump's lawyers argued … ",
    "url": "https://www.lawdork.com/p/trump-dc-case-constitutional-dismissal-motion"
  },
  {
    "text": "Fourth defendant negotiates plea deal with Fulton prosecutors  —  Attorney Jenna Ellis on Tuesday became the fourth defendant in the Fulton County election interference case to strike a deal with prosecutors.  —  In exchange for her cooperation, Ellis pleaded guilty to one count of aiding and abetting false statements and writings.",
    "url": "https://www.ajc.com/politics/fourth-defendant-negotiates-plea-deal-with-fulton-prosecutors/S3SO4MZ3MBGCJD6YD47ZE4MYQE/"
  },
  {
    "text": "Fourth Trump Co-Defendant Pleads Guilty: Jenna Ellis Takes Deal with Prosecutors in Georgia  —  Former Trump attorney Jenna Ellis, who was facing four felony counts in the Georgia election case, was sentenced to five years' probation after pleading guilty Tuesday to one felony count of aiding and abetting false statements and writings",
    "url": "https://themessenger.com/politics/trump-jenna-ellis-pleads-guilty-georgia"
  },
  {
    "text": "Former Trump campaign lawyer Jenna Ellis pleads guilty in Georgia case  —  Former Trump campaign lawyer Jenna Ellis pleaded guilty Tuesday in the Georgia election subversion case and will cooperate with Fulton County prosecutors - the third guilty plea in the past week.",
    "url": "https://www.cnn.com/2023/10/24/politics/jenna-ellis-fulton-county/"
  },
  {
    "text": "‘Netanyahu Got All the Warnings,’ Says Former Head of Israeli Military Intelligence  —  Former chief of Israeli military intelligence Amos Yadlin on where the war goes from here.  —  Israeli men pray during a rally calling for the return of more than 200 people captured by Hamas militants.",
    "url": "https://www.politico.com/news/magazine/2023/10/24/amos-yaldin-israeli-military-intelligence-netanyahu-qa-00123099"
  },
  {
    "text": "U.S. readies plans for mass evacuations if Gaza war escalates  —  Officials said that the more than 600,000 Americans living in Israel and Lebanon are of particular concern, but they stressed that an operation of such magnitude is a worst-case scenario  —  CORRECTION",
    "url": "https://www.washingtonpost.com/national-security/2023/10/23/us-evacuation-plans-israel-lebanon-hamas-war/"
  },
  {
    "text": "Playbook: The House's ‘Purge’ moment  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  DEBATE UPDATE — CHRIS CHRISTIE now says he has enough donors to qualify for the third GOP presidential debate, Natalie Allison scoops this morning.",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/24/the-houses-purge-moment-00123137"
  },
  {
    "text": "U.S. State Senator Arrested in Hong Kong After Carrying Gun Onto Flight  —  Jeff Wilson, who was released on bail, says he didn't realize it was in his bag and that baggage screeners in the U.S. hadn't detected it  —  A Washington state senator was on a flight from San Francisco to Hong Kong … ",
    "url": "https://www.wsj.com/world/asia/u-s-state-senator-arrested-in-hong-kong-after-carrying-gun-onto-flight-c2df0b9c?mod=followamazon"
  },
  {
    "text": "Republican Party of Virginia mails out thousands of explicit fliers about Susanna Gibson scandal  —  RICHMOND, Va. (WWBT) - Election Day in Virginia is two weeks away and Virginia's Republican Party is now taking further steps to warn voters of the online sex scandal surrounding 57th District House Candidate Susanna Gibson.",
    "url": "https://www.nbc12.com/2023/10/24/republican-party-virginia-mails-out-thousands-explicit-fliers-about-susanna-gibson-scandal/"
  },
  {
    "text": "Woman charged with homicide of Mika Westwolf  —  In the early morning of March 31, 2023, Mika Westwolf, a 22-year-old Indigenous woman, was walking on the shoulder of U.S. Highway 93, which passes through the Flathead reservation in Montana.  Westwolf was struck by a Cadillac Escalade and declared dead at the scene.",
    "url": "https://popular.info/p/update-woman-charged-with-homicide"
  },
  {
    "text": "Chinese Defense Minister Li Shangfu removed from position following disappearance  —  Chinese Defense Minister Li Shangfu was fired on Tuesday, becoming the second high-profile minister to lose his job without official reasons.  —  His removal marks two months after he disappeared from public view.",
    "url": "https://www.washingtonexaminer.com/policy/foreign/chinese-defense-minister-removed-from-position-following-disappearance"
  },
  {
    "text": "Christie Blasts GOP for Speaker Chaos: ‘Embarrassment to the Party’  —  Christie did put some blame on Democrats who ‘had no responsibility’ to save McCarty by voting to keep him as Speaker but ‘contributed to the problem’ by not doing so  —  GOP presidential hopeful and former New Jersey … ",
    "url": "https://themessenger.com/politics/christie-blasts-gop-for-speaker-chaos-embarrassment-to-the-party"
  },
  {
    "text": "‘I Mean, Is This My Party?’  —  A new book asks if even anti-Trumpers like Mitt Romney bear some blame for the rise of a man who has destroyed the GOP.  —  “I have learned through my life experience,” Mitt Romney said, “that it's human to rationalize what's in our best interest.”  J. Scott Applewhite/AP",
    "url": "https://www.politico.com/news/magazine/2023/10/24/mitt-romney-trump-rise-00123096"
  },
  {
    "text": "10/24/23 ☀️ Punchbowl News AM  —  THE TOP … So you think this is bad, the interminable House Republican race for speaker?  —  Just wait until we get to the other side of this crisis. … None of the eight candidates for the House's top job has extensive time in a senior leadership role … ",
    "url": "https://punchbowl.news/archive/102423-punchbowl-news-am/"
  },
  {
    "text": "Tucker Carlson media company signs its first ad deal  — Former Fox News host Tucker Carlson's new media company signed its first advertising deal.  — The agreement is with conservative-friendly marketplace app PublicSq., whose shares went public in July.",
    "url": "https://www.cnbc.com/2023/10/24/tucker-carlson-signs-first-ad-deal-since-fox-news-departure.html"
  },
  {
    "text": "Ted Cruz to be at Game 7 despite Astros fan opposition  —  Some Houston Astros fans are begging Sen. Ted Cruz (R-Texas.) to not attend the Game 7 of their American League Championship Series (ALCS) against state rival the Texas Rangers due to bad luck.  —  Fans of the defending World Series … ",
    "url": "https://thehill.com/blogs/in-the-know/4271705-ted-cruz-to-be-at-game-7-despite-astro-fan-opposition/"
  },
  {
    "text": "Exclusive: Paul Whelan told Blinken being left out of prisoner swap with Russia painted a target on his back  —  Paul Whelan, an American who has been imprisoned in Russia for nearly five years, pressed Secretary of State Antony Blinken in a phone call in August to ensure that he is not left behind again, Whelan told CNN.",
    "url": "https://www.cnn.com/2023/10/24/politics/paul-whelan-blinken-cnn-interview/"
  },
  {
    "text": "WHO chief scientist warns of endemic dengue in Europe, US  —  Jeremy Farrar, the World Health Organization's chief scientist, has warned that climate change will result in the infectious disease dengue becoming endemic in parts of Europe and the United States, in an opening interview at the POLITICO Health Summit.",
    "url": "https://www.politico.eu/article/who-chief-scientist-warns-of-endemic-dengue-in-europe-us/"
  }
]