[
  {
    "text": "Israel Knew Hamas's Attack Plan More Than a Year Ago  —  A blueprint reviewed by The Times laid out the attack in detail.  Israeli officials dismissed it as aspirational and ignored specific warnings.  —  Israeli officials obtained Hamas's battle plan for the Oct. 7 terrorist attack … ",
    "url": "https://www.nytimes.com/2023/11/30/world/middleeast/israel-hamas-attack-intelligence.html"
  },
  {
    "text": "Why Rep. Jared Moskowitz gave Biden a ‘10 out of 10’ on Israel  —  with research by Marisa Iati and Tobi Raji  —  Good morning, Early Birds.  Wow.  It's somehow December.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2023/12/01/why-rep-jared-moskowitz-gave-biden-10-out-10-israel/"
  },
  {
    "text": "Behind the Curtain — Scoop: The Trump job applications revealed  —  We told you in a “Behind the Curtain” column last month that Trump allies are pre-screening the ideologies of thousands of potential appointees and employees in case he wins back the White House.",
    "url": "https://www.axios.com/2023/12/01/trump-government-job-applications-2025"
  },
  {
    "text": "Biden Wants to Abolish the Fees Trump Charges at His Resorts  —  In going after Donald Trump's business practices, Joe Biden is combining a hit on his opponent with a boost of his own economic record. … Biden resorts to a fresh Trump attack  —  Ahead of the 2024 election … ",
    "url": "https://www.thedailybeast.com/joe-biden-wants-to-abolish-the-fees-donald-trump-charges-at-his-resorts"
  },
  {
    "text": "Trump's campaign thinks it's getting a surprise assist from Dean Phillips  —  Joe Biden's primary opponent is make the ex-president's electability argument for him.  —  Donald Trump's campaign believes it's getting a welcome boost from an unexpected source.",
    "url": "https://www.politico.com/news/2023/12/01/trump-surprise-assist-dean-phillips-00129427"
  },
  {
    "text": "Florida GOP Chair Christian Ziegler, husband of Moms For Liberty cofounder, accused of sexual assault by alleged menage a trois lover  —  Christian Ziegler, Florida's GOP chairman and husband of Sarasota County School Board member and Moms of Liberty co-founder Bridget Ziegler … ",
    "url": "https://flcga.org/florida-gop-chair-christian-ziegler-husband-of-a-moms-for-liberty-cofounder-accused-of-battery-by-alleged-menage-a-trois-lover/"
  },
  {
    "text": "Florida GOP chairman faces allegations of sexual battery  —  The allegations against Christian Ziegler are in a heavily redacted 14-page police report shared with NBC News on Thursday.  His attorney confirmed he is under investigation.  —  TALLAHASSEE, Fla. — Florida Republican Party … ",
    "url": "https://www.nbcnews.com/politics/politics-news/christian-ziegler-florida-gop-chairman-allegations-sexual-battery-rcna127430"
  },
  {
    "text": "Former U.S. Marine Pleads Guilty to Firebombing a Planned Parenthood Clinic in Orange County and Admits to Planning Additional Attacks  —  For Immediate Release  —  U.S. Attorney's Office, Central District of California  —  SANTA ANA, California - An Orange County man pleaded guilty today … ",
    "url": "https://www.justice.gov/usao-cdca/pr/former-us-marine-pleads-guilty-firebombing-planned-parenthood-clinic-orange-county-and"
  },
  {
    "text": "MSNBC cancels Mehdi Hasan's show  —  The News  —  MSNBC is canceling outspoken opinion host Mehdi Hasan's weekend program and show on the streaming service Peacock.  —  Two people familiar with the move, which MSNBC privately announced to staff Thursday morning, told Semafor that Hasan … ",
    "url": "https://www.semafor.com/article/11/30/2023/msnbc-cancels-mehdi-hasans-show"
  },
  {
    "text": "Playbook: Steve Scalise unpacks the House GOP  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  BREAKING OVERNIGHT — “War resumes in Gaza after truce collapses,” by Reuters' Nidal Al-Mughrabi and Suhaib Salem: “Israeli warplanes resumed pounding Gaza … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/12/01/steve-scalise-unpacks-the-house-gop-00129540"
  },
  {
    "text": "Steve Scalise reveals what's really happened since McCarthy's fall  —  The House Majority Leader illuminates what happened behind closed doors after Kevin McCarthy's ousting as well as what to expect next on impeachment; why he will vote against expelling George Santos; and how Speaker Mike Johnson … ",
    "url": "https://www.politico.com/news/2023/12/01/steve-scalise-house-majority-00129239"
  },
  {
    "text": "Welcome to Our New ‘Bespoke Realities’  —  I've known conspiracy theorists my entire life.  In fact, there's probably a little bit of conspiracy theorist in each of us, myself included.  (Don't get me started on Game 6 of the 2002 N.B.A. Western Conference Finals.)",
    "url": "https://www.nytimes.com/2023/11/30/opinion/political-reality-algorithms.html"
  },
  {
    "text": "Florida Democrats plan to cancel presidential primary, enraging Dean Phillips' campaign  —  The representative says the state party has deliberately moved to keep him off the ballot.  Florida Dems say he is acting “unbecoming.”  —  Florida appears poised to hold no presidential primary election … ",
    "url": "https://www.politico.com/news/2023/11/30/florida-democrats-dean-phillips-election-00129403"
  },
  {
    "text": "Biden lights the National Christmas Tree, taking his turn to bring holiday spirit to Washington  —  WASHINGTON (AP) — It was President Joe Biden 's turn to bring some holiday spirit to the U.S. capital.  —  The president and his wife, Jill, participated Thursday in the annual tradition … ",
    "url": "https://apnews.com/article/joe-biden-lighting-christmas-tree-national-730fb9076756772a664162b3a87c6261"
  },
  {
    "text": "Why Biden and Harris Merchandise Doesn't Sell  —  Liberals aren't buying political merchandise this season.  —  POLITICO illustration/Photos by Getty Images, AP, iStock  —  You know things are starting to look iffy when you get to the Janet Yellen novelty merch.  —  That's no slight on Yellen.",
    "url": "https://www.politico.com/news/magazine/2023/12/01/why-liberal-merchandise-doesnt-sell-00129355"
  },
  {
    "text": "Santos Relishes the Limelight Even as His Show Looks Likely to Close  —  Before the debate about his possible expulsion from Congress, George Santos seemed to embrace his starring role in a scandal of his own making.  —  It was likely to be his second-to-last day serving in Congress … ",
    "url": "https://www.nytimes.com/2023/11/30/us/politics/george-santos-expel-debate.html"
  },
  {
    "text": "Three US cities make list of most expensive in world  —  Story at a glance  — New York, Los Angeles and San Francisco are three of the most expensive cities on the planet to live in, according to a new report.  — New York tied with Geneva as the third most expensive city on earth … ",
    "url": "https://thehill.com/changing-america/respect/poverty/4335962-three-us-cities-make-list-of-most-expensive-in-world/"
  },
  {
    "text": "Former N.J. Trump golf club worker says she was sexually harassed, tricked into signing NDA  —  The allegations date back to 2021.  —  A former server at Trump National Golf Club in Bedminster alleges she was sexually harassed and coerced into sex by a supervisor, then tricked into signing … ",
    "url": "https://www.politico.com/news/2023/11/30/trump-golf-club-worker-sexually-harassment-lawsuit-00129307"
  },
  {
    "text": "Dave Chappelle makes surprise visit to the Capitol ahead of evening show at The Anthem  —  Comedian Dave Chappelle made a surprise visit to the Capitol late Thursday afternoon, gathering with friends ahead of his Washington show in the evening.  —  While in the Capitol, the comedy legend took photos with staffers and lawmakers alike.",
    "url": "https://www.washingtonexaminer.com/news/house/dave-chappelle-surprise-capitol-visit-dc-weekend"
  },
  {
    "text": "Statement from President Biden on the Passing of Henry Kissinger  —  I'll never forget the first time I met Dr. Kissinger.  I was a young Senator, and he was Secretary of State—giving a briefing on the state of the world.  Throughout our careers, we often disagreed.  And often strongly.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/11/30/statement-from-president-biden-on-the-passing-of-henry-kissinger/"
  },
  {
    "text": "The Bogus Historians Who Teach Evangelicals They Live in a Theocracy  —  A new book on the Christian right reveals how a series of unscrupulous leaders turned politics into a powerful and lucrative gospel.  —  POLITICO illustration/Photos by AP, Gage Skidmore, iStock",
    "url": "https://www.politico.com/news/magazine/2023/12/01/evangelicals-american-politics-tim-alberta-book-excerpt-00129319"
  },
  {
    "text": "Montana Judge Says TikTok Ban Likely Violates First Amendment  —  Social-media app sued after state passed law banning TikTok to protect residents' privacy  —  TikTok won a reprieve in Montana after a judge ruled a state law banning the app can't go into effect in January, saying it “likely violates the First Amendment.”",
    "url": "https://www.wsj.com/tech/tiktok-gets-montana-reprieve-after-federal-judge-blocks-ban-c617d72e?mod=followamazon"
  },
  {
    "text": "Mark Cuban says he's never running for elective office  —  Mark Cuban tells Axios that he never plans to run for any elective office, cooling off speculation that began after he struck a deal earlier this week to sell his majority stake in the Dallas Mavericks.",
    "url": "https://www.axios.com/2023/11/30/mark-cuban-president-not-running"
  }
]