[
  {
    "text": "No Labels Will Abandon 2024 Presidential Campaign Effort  —  The centrist group plans to announce it won't field a third-party ‘unity ticket’ after months of failing to find a candidate to lead its effort  —  WASHINGTON—No Labels, the centrist group which has sought to field a third-party presidential bid … ",
    "url": "https://www.wsj.com/politics/elections/no-labels-will-abandon-2024-presidential-campaign-effort-4b4e5121"
  },
  {
    "text": "No Labels abandons 2024 presidential effort  —  The bipartisan group No Labels won't put forward a third-party presidential ticket after failing to find a candidate, multiple outlets have reported.  —  No Labels will reportedly announce Monday that it hasn't been able to recruit … ",
    "url": "https://thehill.com/homenews/campaign/4575052-no-labels-party-passes-2024-election-candidate/"
  },
  {
    "text": "RFK Jr. disavows fundraising email boosting ‘J6 activists’  —  The statement was an “error,” Kennedy's campaign said.  —  Robert F. Kennedy Jr.'s presidential campaign walked back a line in a fundraising email sent to supporters Thursday afternoon, which described people detained for storming the Capitol in 2021 as “J6 activists.”",
    "url": "https://www.politico.com/news/2024/04/04/rfk-jr-january-6-00150681"
  },
  {
    "text": "Is Trump's $175 million civil fraud bond valid in New York?  —  When former President Donald Trump posted a $175 million bond in New York on Monday, it appeared that he had evaded a financial crisis.  He had paused enforcement of the more than $460 million judgment against him following a civil fraud trial, while his appeal is pending.",
    "url": "https://www.cbsnews.com/news/donald-trump-175-million-civil-fraud-bond-valid-new-york/"
  },
  {
    "text": "Jeffrey Clark's bid to aid Trump election scheme violated attorney rules, DC Bar panel finds  —  Disciplinary investigators who brought the charges against Clark say they intend to advocate for his disbarment.  —  A disciplinary panel in Washington has found that Jeffrey Clark … ",
    "url": "https://www.politico.com/news/2024/04/04/jeffrey-clark-ethics-rules-00150631"
  },
  {
    "text": "A blinking red light for Israel in American politics  —  The shift has come amid rising internal frustrations inside the administration about the war.  —  In notably blunt terms Thursday, top U.S. officials made a series of warnings to the Israeli government that they were nearly out of patience with its conduct of the war in Gaza.",
    "url": "https://www.politico.com/news/2024/04/04/biden-israel-palestine-warning-00150684"
  },
  {
    "text": "Ted Cruz Is Getting Nervous He's Going to Lose His Senate Seat  —  The Texas senator's questionable podcast deal with iHeartMedia is raising eyebrows amid his increasingly desperate fundraising efforts  —  THE WALLS ARE closing in around Ted Cruz, and the Republican senator is lashing out.",
    "url": "https://www.rollingstone.com/politics/politics-news/ted-cruz-nervous-lose-senate-seat-iheartmedia-1234998992/"
  },
  {
    "text": "Pluralistic: Too big to care (04 Apr 2024)  — Too big to care: Enshittification is a choice.  — Hey look at this: Delights to delectate.  — This day in history: 2009, 2014, 2019, 2023  — Upcoming appearances: Where to find me.  — Recent appearances: Where I've been.",
    "url": "https://pluralistic.net/2024/04/04/teach-me-how-to-shruggie/"
  },
  {
    "text": "Musk's X pivots again, restoring blue checks to popular accounts  —  The social network formerly known as Twitter is now gifting premium features to users with at least 2,500 verified followers  —  A year after his controversial decision to remove verification from popular Twitter accounts unless … ",
    "url": "https://www.washingtonpost.com/technology/2024/04/04/twitter-blue-check-restored-x/"
  },
  {
    "text": "Former President Donald Trump On Israel's War, 2024 And Much More  —  Former President Donald Trump joined me this morning:  —  Audio:  —  04-04hhs-trump  —  Transcript:  —  HH: Joined by our very special guest, former President Donald Trump.  Mr. President, welcome back.",
    "url": "https://hughhewitt.com/former-president-donald-trump-on-israels-war-2024-and-much-more"
  },
  {
    "text": "Reps. Andy Biggs, Paul Gosar subpoenaed in Arizona probe of Trump fake electors  —  The Arizona attorney general is nearing a decision on whether to charge Trump allies with crimes, but there is no indication Biggs or Gosar will face charges.  —  Arizona investigators probing Republicans' efforts … ",
    "url": "https://www.politico.com/news/2024/04/04/biggs-gosar-arizona-subpoenas-00150416"
  },
  {
    "text": "The Washington press corps doesn't have a freaking clue  —  I've been away for nearly two weeks, almost entirely unplugged, and let me tell you, a little distance makes the failure of the American political press even more horrifying and inexcusable.  —  The nation stands on the edge of a precipice … ",
    "url": "https://presswatchers.org/2024/04/the-washington-press-corps-doesnt-have-a-freaking-clue/"
  },
  {
    "text": "Biden Takes Aim at SpaceX's Tax-Free Ride in American Airspace  —  President Biden wants companies that use American airspace for rocket launches to start paying taxes into a federal fund that finances the work of air traffic controllers.  —  Every time a rocket soars into the sky carrying satellites … ",
    "url": "https://www.nytimes.com/2024/04/04/us/politics/spacex-biden-musk-taxes.html"
  },
  {
    "text": "Blinken says Ukraine will eventually ‘become a member of NATO’  —  Debate of Ukraine's membership to the 32-member alliance continues amid its war with Russia  —  Ukraine will eventually join NATO as support from its member countries remains “rock solid,” U.S. Secretary of State Antony Blinken said Thursday.",
    "url": "https://www.foxnews.com/politics/blinken-ukraine-will-eventually-become-member-nato"
  },
  {
    "text": "Louisiana HB 777 Would Criminalize Librarians and Libraries Who Join the American Library Association  —  Despite the fact that l ibrarians are among the most trusted professionals, per data acquired in several studies of parents on the perceptions of the profession, lawmakers across … ",
    "url": "https://bookriot.com/louisiana-hb-777/"
  },
  {
    "text": "Judge denies Trump bid to dismiss classified documents prosecution  —  A federal judge refused Thursday to throw out the classified documents prosecution against Donald Trump, rejecting a defense argument that the case should be tossed because he was entitled as a former president to retain the records after he left office.",
    "url": "https://apnews.com/article/donald-trump-jack-smith-classified-documents-b862ec627ac0070e5353ac324d8d333f"
  },
  {
    "text": "Let Me Rewrite That For You: NY Times Misinforms Readers About RFK & Biden  —  from the journalists-need-to-get-it-together dept  —  It's been a few years since I last did a “Let me rewrite that for you” post.  This idea was first suggested by the brilliant press critic Dan Froomkin.",
    "url": "https://www.techdirt.com/2024/04/04/let-me-rewrite-that-for-you-ny-times-misinforms-readers-about-rfk-biden/"
  },
  {
    "text": "Scoop: Johnson faces new pressure from Democrats on foreign aid … - “He's a bit boxed in,” one House Democrat said of Johnson. … - “No matter which path he walks down ... one's with alligators, one's with piranhas. … - In addition to Ukraine and Gaza, the letter calls for aid to Sudan … ",
    "url": "https://www.axios.com/2024/04/04/mike-johnson-ukraine-aid-bill-israel"
  },
  {
    "text": "Melania Trump is back, set to hold event for Log Cabin Republicans  —  The former first lady had been largely absent from the campaign trail.  —  Melania Trump, who has been largely absent from the campaign trail during her husband's presidential run, is back on the GOP fundraising circuit.",
    "url": "https://www.politico.com/news/2024/04/04/melania-trump-is-back-set-to-hold-event-for-log-cabin-republicans-00150717"
  },
  {
    "text": "Russian military ‘almost completely reconstituted,’ US official says  —  Russia has rebuilt its military after suffering enormous losses during its invasion of Ukraine, according to a U.S. State Department official.  —  “We have assessed over the course of the last couple of months that Russia … ",
    "url": "https://www.defensenews.com/pentagon/2024/04/03/russian-military-almost-completely-reconstituted-us-official-says/"
  },
  {
    "text": "Alyssa Farah Griffin rips RFK Jr. in op-ed: ‘Gaslighting and real-time pivoting’  —  Former Trump administration aide Alyssa Farah Griffin went after Robert F. Kennedy Jr. in an op-ed published in The Daily Beast, calling out the independent presidential candidate for “gaslighting and real-time pivoting” … ",
    "url": "https://thehill.com/homenews/campaign/4575111-alyssa-farah-griffin-rfk-jr-op-ed-2024/"
  },
  {
    "text": "Blinken warns: Israel risks becoming indistinguishable from Hamas if it doesn't protect Gaza civilians  —  US Secretary of State Antony Blinken warns that Israel risks becoming indistinguishable from Hamas if it continues to fail to protect civilians amid the Gaza war.",
    "url": "https://www.timesofisrael.com/liveblog_entry/blinken-warns-israel-risks-becoming-indistinguishable-from-hamas-if-it-doesnt-protect-gaza-civilians/"
  }
]