[
  {
    "text": "Democratic Leaders Tried to Crush Zohran Mamdani.  They Should Have Been Taking Notes.  —  On Tuesday night, Zohran Mamdani shocked the political establishment.  There are lessons that national Democrats should take from his strong showing in the Democratic primary for mayor of New York City.",
    "url": "https://www.nytimes.com/2025/06/25/opinion/zohran-mamdani-democratic-party.html?unlocked_article_code=1.Rk8.dJku.uzcolsc0QwnO&smid=url-share"
  },
  {
    "text": "Zohran delivered the Democratic establishment the thrashing it deserved  —  Zohran Mamdani, a previously obscure state assemblyman who polled at as little as 1 percent in early surveys of the race, became the Democratic nominee for mayor of New York City on Tuesday.",
    "url": "https://www.natesilver.net/p/zohran-delivered-the-democratic-establishment"
  },
  {
    "text": "Mamdani Stuns Cuomo in New York Mayoral Primary  —  Zohran Mamdani, a state assemblyman and democratic socialist, had a commanding lead over former Gov. Andrew M. Cuomo, who conceded in the Democratic primary.  —  Zohran Mamdani, a little-known state lawmaker whose progressive platform … ",
    "url": "https://www.nytimes.com/2025/06/25/nyregion/cuomo-mamdani-mayor-primary-nyc.html?unlocked_article_code=1.Rk8.BIdr.KtGQRbK9snyA&smid=url-share"
  },
  {
    "text": "Here's How Much New York City Mayoral Candidate Zohran Mamdani Is Worth  —  Despite his own privileged path to power, or perhaps because of it, the son of a Columbia University professor and a movie director is campaigning as a socialist intent on redistributing New York's wealth.  —  SaveComment",
    "url": "https://www.forbes.com/sites/kylemullins/2025/06/24/heres-how-much-new-york-city-mayoral-candidate-zohran-mamdani-is-worth/"
  },
  {
    "text": "Scoop: Trump to limit sharing classified info with Congress after leak on Iran bombing damage … - The FBI also is investigating the leak, the sources said. … - “We are declaring a war on leakers,” a senior White House official said Wednesday.  — “The FBI is investigating the leak,” the source said.",
    "url": "https://www.axios.com/2025/06/25/iran-bombing-intelligence-trump-congress"
  },
  {
    "text": "Pentagon launches probe into Iran strike intel leak  —  U.S. Defense Secretary Pete Hegseth confirmed the findings after others called it fake news.  —  THE HAGUE — The Pentagon has launched a criminal investigation into the leak of a classified Defense Intelligence Agency report assessing … ",
    "url": "https://www.politico.eu/article/us-pentagon-investigation-iran-intel-leak-pete-hegseth-donald-trump-rubio/"
  },
  {
    "text": "‘Talk about whiplash!’  CNN anchor shocked by dramatic Trump flip-flop  —  CNN's Dana Bash expressed her shock over President Donald Trump's latest flip-flop on the question of regime change in Iran.  —  Trump made his recent comments aboard Air Force One Tuesday, en route to the NATO summit in The Hague.",
    "url": "https://www.rawstory.com/regime-change-2672425922/"
  },
  {
    "text": "Iran ‘much further away’ from building nukes after US strike, Rubio says  —  The secretary of state dismissed media reports of new intel assessments as “false.”  —  THE HAGUE, Netherlands - Secretary of State Marco Rubio said on Wednesday that Iran is “much further away from a nuclear weapon” … ",
    "url": "https://www.politico.com/news/2025/06/25/marco-rubio-dasha-burns-interview-nato-00421760"
  },
  {
    "text": "Capitol agenda: Johnson warns about a Medicaid backlash  —  With President Donald Trump's July 4 deadline drawing near, Senate Majority Leader John Thune told POLITICO on Tuesday night he believes the Senate is “on a path” to start voting on the megabill Friday.  But he's got several fires to put out first.",
    "url": "https://www.politico.com/live-updates/2025/06/25/congress/thune-johnson-medicaid-megabill-backlash-salt-tax-cuts-00422588"
  },
  {
    "text": "RFK Jr. says US won't donate to global vaccine effort  —  Kennedy ripped into Gavi, the Vaccine Alliance, in a video address at its pledging summit.  —  The United States won't contribute anymore to Gavi, the Vaccine Alliance, until the global health organization has “re-earned the public trust … ",
    "url": "https://www.politico.com/news/2025/06/25/rfk-vaccine-donations-gavi-00422705"
  },
  {
    "text": "Lake's unsubstantiated attack on Voice of America … - USAGM, which includes both VOA and the Office of Cuba Broadcasting (OCB), as well as taxpayer-funded grantee organizations, Radio Free Asia (RFA), Radio Free Europe/Radio Liberty (RFE/RL), the Middle East Broadcasting Networks (MBN) … ",
    "url": "https://savevoa.com/fact-check/kari-lake-at-house-committee-on-foreign-affairs-june-25.html"
  },
  {
    "text": "DOJ Sues Every Federal District Judge in Maryland, Challenging Due Process Rights  —  President Donald Trump's Department of Justice (DOJ) Tuesday sued every federal district judge in Maryland to challenge a standing court order that temporarily bars the government from deporting people after they have filed a challenge.",
    "url": "https://www.democracydocket.com/news-alerts/justice-department-sues-maryland-federal-district-judges-due-process/"
  },
  {
    "text": "Emil Bove Avoids Telling the Senate Much of Anything About DOJ  —  Trump's former personal lawyer, up for a powerful judicial seat, was hammered by Senate Democrats over his role as the president's legal enforcer.  — Copy  —  The defining feature of Justice Department official Emil Bove's trip … ",
    "url": "https://www.notus.org/trump-white-house/emil-bove-senate-hearing-court"
  },
  {
    "text": "National Science Foundation to Be Requisitioned as Mansion for HUD Secretary (And Also HUD Office)  —  I'm still trying to find out more about this.  But as I do, I just wanted to put it on your radar because it's completely crazy and epitomizes the Trump presidency.",
    "url": "https://talkingpointsmemo.com/edblog/national-science-foundation-to-be-requisitioned-as-mansion-for-hud-secretary-and-also-hud-office"
  },
  {
    "text": "Jill Biden's top aide bails on House investigation in Biden fitness  —  Anthony Bernal, the top aide to Jill Biden, abruptly withdrew from his scheduled interview with the House Oversight Committee after President Trump's White House waived his ability to invoke executive privilege to protect private conversations.",
    "url": "https://www.axios.com/2025/06/25/joe-biden-mental-fitness-anthony-bernal-oversight-testimony"
  },
  {
    "text": "A Military Ethics Professor Resigns in Protest  —  Over the course of several months, Pauline Shanks Kaurin concluded she no longer had the academic freedom necessary for doing her job.  —  Seven years ago, Pauline Shanks Kaurin left a good job as a tenured professor at a university … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/06/academic-freedom-naval-war-college/683309/?gift=_IXYI0Wrwnxuvm7JZ0fMfDckvNPBk-LgBKXWRsnkcHo&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "First Reports Are Always Wrong.  The Iran Strike Is No Exception.  —  EARLY IN MY CAREER, AS A YOUNG LIEUTENANT, I made a mistake that still haunts me.  After a high-tempo mission, I rushed to assess the outcome and tell my boss about what I believed was our overwhelming success.  Without full intelligence.",
    "url": "https://www.thebulwark.com/p/first-reports-are-always-wrong-iran-strike-nuclear-dia-intelligence-assessment"
  },
  {
    "text": "This Is The Beginning of The End of The 9/11 Era  —  EVER SINCE I WROTE REIGN OF TERROR, people have asked me how we end the long 9/11 era.  Someone asked me a version of that question tonight, at my Anyone Comics signing.  I gave the answer I always give, the only answer I believe to be true: Organize.",
    "url": "https://www.forever-wars.com/this-is-the-beginning-of-the-end-of-the-9-11-era/"
  },
  {
    "text": "Trump administration is preparing to test budget law, U.S. officials say  —  Internal dissent among federal employees is coming to the surface as President Donald Trump's budget chief aims to rebalance spending authority.  —  The Trump administration is preparing to test a 1974 budget law … ",
    "url": "https://www.washingtonpost.com/business/2025/06/25/trump-budget-law-challenge/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwODI0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUyMjA2Mzk5LCJpYXQiOjE3NTA4MjQwMDAsImp0aSI6ImQ2ODE0NTEzLWMwMzMtNDhjZC04NjgzLWUyYTdjY2YyYzcyOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzA2LzI1L3RydW1wLWJ1ZGdldC1sYXctY2hhbGxlbmdlLyJ9.HGcNp4UXhp_Uz1DAllvQAY6WEDK0Kduz8RdN5cDvxPI&itid=gfta"
  },
  {
    "text": "A Word to the Weiss … Late last year, during a trip to New York City, David Ellison quietly made time for a meeting that said as much about his worldview as it did about his interest in media.  According to people familiar with the matter, the Hollywood scion set time aside on his busy calendar … ",
    "url": "https://www.status.news/p/bari-weiss-david-ellison-cbs-news"
  },
  {
    "text": "Man ‘refused entry into US’ as border control catch him with bald JD Vance meme  —  A 21-year-old tourist has described the horrendous treatment he allegedly received after being denied entry to the USA due to a meme depicting JD Vance as bald being found on his phone",
    "url": "https://www.dublinlive.ie/news/world-news/man-refused-entry-us-border-31925059"
  },
  {
    "text": "U.S. Department of Education Finds California Department of Education and California Interscholastic Federation in Violation of Title IX  —  Today, the U.S. Department of Education's Office for Civil Rights (OCR) announced the conclusion of its Title IX investigations into the California Department … ",
    "url": "https://www.ed.gov/about/news/press-release/us-department-of-education-finds-california-department-of-education-and-california-interscholastic-federation-violation-of-title-ix"
  },
  {
    "text": "Voters 51 - 42 Percent Oppose U.S. Joining Israel In Military Strikes On Iran's Nuclear Sites, Quinnipiac University National Poll Finds; Vast Majority Concerned U.S. Will Get Drawn Into A War With Iran  — mail_outline  —  Days after the United States military targeted nuclear sites inside Iran … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3925"
  },
  {
    "text": "Exclusive: New Trump administration plan could end asylum claims and speed deportations for hundreds of thousands of migrants  —  The Trump administration is planning to dismiss asylum claims for potentially hundreds of thousands of migrants in the United States and then make them immediately deportable … ",
    "url": "https://cnn.com/2025/06/25/politics/migrants-asylum-claims-deportations"
  },
  {
    "text": "Trump border czar Homan, wife ‘living separately’ because of death threats  —  President Trump's border czar Tom Homan said in a new interview that he and his wife are not currently living together because of death threats he has received for enforcing Trump's immigration crackdown and the amount of time he spends working.",
    "url": "https://thehill.com/homenews/administration/5368990-trump-homan-border-czar-death-threats/"
  },
  {
    "text": "Despite promise to remove ‘worst of the worst,’ ICE has arrested only 6% of known immigrant murderers  —  ICE told Congress in September that over 13,000 immigrants known to have committed murder remained at large.  Since then, only 752 have been arrested.  —  After six months … ",
    "url": "https://www.nbcnews.com/politics/national-security/promise-remove-worst-worst-ice-arrested-only-6-known-immigrant-murdere-rcna214817"
  },
  {
    "text": "‘Criminal immigrant’ means whatever the administration says it means  —  Trump's deportation goals are being met by targeting non-criminal immigrants.  —  President Donald Trump being President Donald Trump, it certainly seems possible that he believed that the Maryland resident … ",
    "url": "https://www.washingtonpost.com/opinions/2025/06/25/immigration-criminals-trump-invention/"
  }
]