[
  {
    "text": "Wisconsin Trump electors settle lawsuit, agree Biden won in 2020  —  MADISON, Wis. — In a legal settlement Wednesday, the 10 Republicans who signed official-looking paperwork falsely purporting Donald Trump won Wisconsin in 2020 have agreed to withdraw their inaccurate filings … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/06/wisconsin-trump-fake-electors-lawsuit/"
  },
  {
    "text": "Nevada GOP ‘fake electors’ indicted for falsely claiming Trump won state's 2020 election  —  A Nevada grand jury has indicted the six Republicans — including the chair of the Nevada Republican Party — who falsely pledged Nevada's electoral votes to Donald Trump following … ",
    "url": "https://thenevadaindependent.com/article/nevada-gop-fake-electors-indicted-for-falsely-claiming-trump-won-states-2020-election"
  },
  {
    "text": "Nevada grand jury indicts six pro-Trump fake electors  —  A Nevada grand jury has indicted six individuals who acted as fake electors in a scheme intended to overturn Joe Biden's 2020 election win, according to the state's attorney general.  —  The indictments make Nevada the third state … ",
    "url": "https://www.cnn.com/2023/12/06/politics/nevada-fake-electors-indicted/"
  },
  {
    "text": "Pro-Trump electors indicted in Nevada, the third state to issue charges  —  A Nevada grand jury on Wednesday charged six Republicans who claimed to be presidential electors in 2020 and submitted certificates to Congress falsely asserting that former president Donald Trump had won the election in their state.",
    "url": "https://www.washingtonpost.com/politics/2023/12/06/nevada-fake-electors-indictment-trump/"
  },
  {
    "text": "My Next Chapter  —  I'm leaving the House but not the fight.  —  I'm an optimist.  How could I not be?  I'm the son of a firefighter.  For 17 years I've served in the same congressional seat—the same office in which I was once denied an internship.  Only in America.",
    "url": "https://www.wsj.com/articles/kevin-mccarthy-my-next-chapter-house-gop-retirement-california-e4e593d7?mod=followamazon"
  },
  {
    "text": "Former speaker Kevin McCarthy will retire from Congress at end of year  —  Rep. Kevin McCarthy (R-Calif.), the former House speaker who was ousted from his position in October in a revolt by hard-right members, will not seek reelection to his congressional seat and will retire from Congress … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/06/kevin-mccarthy-retire/"
  },
  {
    "text": "Republicans Block Aid to Ukraine, Jeopardizing Its Fight Against Russia  —  The vote spotlighted waning support in Congress for backing Ukraine in the war, and left the fate of the effort uncertain.  —  Republicans on Wednesday blocked an emergency spending bill to fund the war in Ukraine … ",
    "url": "https://www.nytimes.com/2023/12/06/us/politics/senate-ukraine-aid-bill.html"
  },
  {
    "text": "Trump says he wouldn't be a dictator ‘except for Day One’  —  When asked during a Fox News town hall if he would seek retribution upon returning to office, the former president largely sidestepped the question  —  Former president Donald Trump said Tuesday that he would not be a dictator upon returning … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/06/trump-dictator-day-one-hannity/"
  },
  {
    "text": "Person of the Year  —  Taylor Swift  —  Taylor Swift is telling me a story, and when Taylor Swift tells you a story, you listen, because you know it's going to be good—not only because she's had an extraordinary life, but because she's an extraordinary storyteller.",
    "url": "https://time.com/6342806/person-of-the-year-2023-taylor-swift/"
  },
  {
    "text": "GOP Wife in Sex Scandal Erased From Conservative Site  —  Bridget Ziegler had a top position at the Leadership Institute.  She's reportedly out after her husband was accused of raping their threesome partner.  —  Moms for Liberty co-founder Bridget Ziegler appears to have departed her role … ",
    "url": "https://www.thedailybeast.com/bridget-ziegler-wife-of-florida-gop-boss-christian-ziegler-erased-from-leadership-instit"
  },
  {
    "text": "Michigan high court declines to immediately hear appeal of ruling allowing Trump on primary ballot  —  The Michigan Supreme Court refused Wednesday to immediately hear an appeal of a lower court's ruling that would allow former President Donald Trump's name to be on the state's presidential primary ballot.",
    "url": "https://apnews.com/article/trump-insurrection-14th-amendment-ballot-michigan-a183d62e622935422e1d8141adade0ae"
  },
  {
    "text": "Harvard's president answers backlash over response to calls for ‘genocide of Jews’  —  Threats to the Jewish community “have no place at Harvard,” Claudine Gay said.  —  Harvard University President Claudine Gay watches a video being played during a House Education and The Workforce Committee hearing titled … ",
    "url": "https://abcnews.go.com/Politics/harvards-president-answers-backlash-response-calls-genocide-jews/story?id=105433835"
  },
  {
    "text": "EXCLUSIVE: Fulton prosecutors list top Trump aides, Ga. officials as witnesses  —  Ex-Justice Department leaders, VP Pence and Gov. Brian Kemp could be called  —  Fulton County prosecutors could call several senior officials who served in the Trump administration and Georgia's top elected leaders … ",
    "url": "https://www.ajc.com/politics/exclusive-fulton-prosecutors-list-top-trump-aides-ga-officials-as-witnesses/FC4RPKGUIVCVRDGS3VP37L6UXY/"
  },
  {
    "text": "A Biden donor calls it quits  —  Welcome to POLITICO's West Wing Playbook, your guide to the people and power centers in the Biden administration.  With help from producer Raymond Rapada.  —  Democratic donor and humanitarian AMED KHAN is done with President JOE BIDEN.",
    "url": "https://www.politico.com/newsletters/west-wing-playbook/2023/12/06/a-biden-donor-calls-it-quits-00130478"
  },
  {
    "text": "A Black Texas student has been suspended once again for his natural hairstyle  —  A Black high school student in Texas who was suspended for more than a month for wearing a natural hairstyle returned to regular classes this week after spending more than a month at an alternative school.",
    "url": "https://www.npr.org/2023/12/06/1217580867/black-texas-student-returns-to-class-suspended-again-natural-hair"
  },
  {
    "text": "‘Squad’ member Ayanna Pressley calls for allowing ‘incarcerated citizens’ and 16-year-olds to vote  —  Ayanna Pressley introduced the Inclusive Democracy Act on Wednesday  —  Democrat Massachusetts Rep. Ayanna Pressley, a far-left ‘Squad’ member, called for allowing “incarcerated citizens” … ",
    "url": "https://www.foxnews.com/politics/squad-member-ayanna-pressley-calls-allowing-incarcerated-citizens-and-16-year-olds-to-vote"
  },
  {
    "text": "Statement from President Joe Biden on Another Nearly $5 Billion in Debt Relief for Over 80,000 Student Loan Borrowers  —  This brings total approved debt cancellation by the Biden-Harris Administration to $132 billion for over 3.6 million Americans  —  Today my Administration … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/12/06/statement-from-president-joe-biden-on-another-nearly-5-billion-in-debt-relief-for-over-80000-student-loan-borrowers/"
  },
  {
    "text": "Asst. Law Prof Politely Suggests Hamas Rape Victims Check Their Victimization  —  She seems nice.  In fact, she's almost too cute by half.  —  Now, before we get too deep in the argle-bargle weeds of elite academia here, maybe you're asking yourself (much as I did), “Vurt da furk is ‘sex exceptionalism’?”",
    "url": "https://hotair.com/tree-hugging-sister/2023/12/06/asst-law-prof-politely-suggests-hamas-rape-victims-check-their-victimization-n596957"
  },
  {
    "text": "Mike Johnson Compares Himself to Moses at Christian Nationalist Gala  —  The House Speaker alleges God directed his path to power through the “roiling sea”  —  IN A KEYNOTE speech to a gathering of Christian nationalist lawmakers Tuesday night, House Speaker Mike Johnson compared himself to Moses … ",
    "url": "https://www.rollingstone.com/politics/politics-news/mike-johnson-moses-christian-nationalist-gala-1234918565/"
  },
  {
    "text": "Chris Christie Savages Vivek Ramaswamy as ‘Obnoxious Blowhard’  —  “So, do everybody a favor, just walk yourself off that stage, enjoy a nice meal, and get the hell out of this place!”  Ramaswamy told his 2024 rival during Wednesday night's debate.  —  GOP presidential hopeful Chris Christie finally … ",
    "url": "https://www.thedailybeast.com/chris-christie-savages-vivek-ramaswamy-as-most-obnoxious-blowhard-in-america"
  },
  {
    "text": "Advanced Placement Program Releases Revised African American Studies Framework  —  Course to Officially Launch in 2024-25 School Year  —  Today, the Advanced Placement® Program delivers its revised framework for the AP® African American Studies course, which will officially launch in the 2024-25 school year.",
    "url": "https://newsroom.collegeboard.org/advanced-placement-program-releases-revised-african-american-studies-framework"
  },
  {
    "text": "‘This Is Grim,’ One Democratic Pollster Says  —  The predictive power of horse-race polling a year from the presidential election is weak at best.  The Biden campaign can take some comfort in that.  —  But what recent surveys do reveal is that the coalition that put Biden in the White House … ",
    "url": "https://www.nytimes.com/2023/12/06/opinion/biden-campaign-polls.html"
  },
  {
    "text": "Maryland AG reinstates hate crime task force member who claimed Israeli babies murdered by Hamas were ‘fake’  —  Anti-Israel activist Zainab Chaudry made numerous antisemitic social posts  —  Democrat Maryland Attorney General Anthony Brown on Tuesday reinstated a member … ",
    "url": "https://www.foxnews.com/politics/maryland-attorney-general-reinstates-hate-crime-task-force-member-claimed-israeli-babies-murdered-hamas-fake"
  },
  {
    "text": "Central Bucks' new school board president was sworn in on a stack of frequently banned books.  Here's what these books mean to her.  —  As she was sworn in to another term on the Central Bucks school board Monday night, Karen Smith placed her hand not on a Bible, but a stack of frequently banned books.Smith … ",
    "url": "https://www.inquirer.com/education/cbsd-new-school-board-karen-smith-president-swearing-in-20231205.html"
  }
]