[
  {
    "text": "RNC Moving to Declare Trump Its Presumptive Nominee  —  An RNC committeeman has submitted the proposal despite Nikki Haley's vow to stay in the race.  —  The Republican National Committee (RNC) is reviewing a draft resolution that, if approved, would declare Donald Trump … ",
    "url": "https://thedispatch.com/newsletter/dispatch-politics/rnc-moving-to-declare-trump-its-presumptive-nominee/"
  },
  {
    "text": "Republican National Committee considering move that would declare Trump the presumptive nominee  —  A draft resolution circulating among the Republican National Committee would formally declare Donald Trump the Republican Party's 2024 presumptive nominee.  —  While the former president … ",
    "url": "https://www.cnn.com/2024/01/25/politics/rnc-trump-presumptive-nominee-resolution"
  },
  {
    "text": "Inside Trump's Cutthroat Conquest of Iowa and New Hampshire  —  The former president's victories in Iowa and New Hampshire were the product of a win-or-else ethos, a fractured opposition and his power to make the party stand for whatever he stands for.  —  The former president's victories … ",
    "url": "https://www.nytimes.com/2024/01/25/us/politics/trump-iowa-new-hampshire.html"
  },
  {
    "text": "1/25/24 ☀️ Punchbowl News AM … Senate Minority Leader Mitch McConnell did four extraordinary things Wednesday afternoon, all of which we scooped in our PM edition Wednesday night. … McConnell told GOP senators that before border security talks began, immigration policy united Republicans and Ukraine aid divided them.",
    "url": "https://punchbowl.news/archive/12524-punchbowl-news-am/"
  },
  {
    "text": "GOP senators seethe as Trump blows up delicate immigration compromise  —  Senior Senate Republicans are furious that Donald Trump may have killed an emerging bipartisan deal over the southern border, depriving them of a key legislative achievement on a pressing national priority and offering … ",
    "url": "https://www.cnn.com/2024/01/25/politics/gop-senators-angry-trump-immigration-deal/"
  },
  {
    "text": "The duty to intervene: What news organizations need to do in 2024  —  It is not appropriate for news organizations to tell people who they should vote for.  —  But it is appropriate for them to actively strive to correct misinformation, clear up public misunderstandings of key issues in public policy, and advocate for democracy.",
    "url": "https://presswatchers.org/2024/01/the-duty-to-intervene-what-news-organizations-need-to-do-in-2024/"
  },
  {
    "text": "Ex-Trump adviser Peter Navarro sentenced to 4 months for contempt of Congress  —  Former Trump White House official Peter Navarro was sentenced Thursday to four months in prison for contempt of Congress for defying a subpoena from the House committee investigating the Jan. 6 U.S. Capitol attack.",
    "url": "https://www.npr.org/2024/01/25/1226836737/peter-navarro-sentence-contempt-congress"
  },
  {
    "text": "‘Preposterous’: Federal judge decries efforts to downplay Jan. 6 violence, label perpetrators ‘hostages’  —  Judge Royce Lamberth, who has handled dozens of Jan. 6 cases, lamented the false rhetoric spread by Donald Trump and his allies.  —  The longest-serving district judge on the federal bench … ",
    "url": "https://www.politico.com/news/2024/01/25/judge-lamberth-jan-6-trump-00137960"
  },
  {
    "text": "Reagan-appointed judge warns GOP's ‘preposterous’ claims about Jan. 6 could pose threat  —  Judge Royce Lamberth says he's “shocked” that “meritless justifications of criminal activity have gone mainstream,” as some Republican politicans defend Jan. 6 rioters.",
    "url": "https://www.nbcnews.com/politics/justice-department/reagan-appointed-judge-warns-gops-preposterous-claims-jan-6-pose-threa-rcna135754"
  },
  {
    "text": "Trump White House official convicted of defying Jan. 6 congressional subpoena will be sentenced  —  WASHINGTON (AP) — A Trump White House official convicted of contempt of Congress for refusing to cooperate with a congressional investigation into the Jan. 6, 2021 attack on the U.S. Capitol is set to be sentenced Thursday.",
    "url": "https://apnews.com/article/trump-navarro-white-house-contempt-jan-6-2d6efbc6e15e52eeaa1559d80e7e904c"
  },
  {
    "text": "Exclusive: China presses Iran to rein in Houthi attacks in Red Sea, sources say  —  Chinese officials have asked their Iranian counterparts to help rein in attacks on ships in the Red Sea by the Iran-backed Houthis, or risk harming business relations with Beijing, four Iranian sources and a diplomat familiar with the matter said.",
    "url": "https://www.reuters.com/world/middle-east/china-presses-iran-rein-houthi-attacks-red-sea-sources-say-2024-01-26/"
  },
  {
    "text": "Trump Spokesperson Steven Cheung Booted From Defamation Trial for Phone Alarm  —  U.S. District Judge Lewis Kaplan, notoriously strict about electronics in his courtroom, brought down the hammer when the alarm went off in the middle of witness testimony on Thursday",
    "url": "https://themessenger.com/politics/trump-spokesperson-steven-cheung-booted-defamation-trial-phone-alarm"
  },
  {
    "text": "EXCLUSIVE: Willis, Wade and others expected to be subpoenaed for hearing on Fulton County DA affair allegations  —  A current and former law partner to Nathan Wade, the special prosecutor leading the 2020 election subversion case in Georgia, have been told to expect a subpoena to testify … ",
    "url": "https://www.cnn.com/2024/01/25/politics/fulton-county-subpoenas-willis-wade-election-subversion/"
  },
  {
    "text": "Eagle Pass is today's Fort Sumter.  Biden must federalize the Texas National Guard.  —  The high-stakes game of Texas Hold 'Em taking place on the banks of the Rio Grande between the tin soldiers of that state's Republican Gov. Greg Abbott and the U.S. Border Patrol has reached a tension level … ",
    "url": "https://www.inquirer.com/opinion/texas-border-abbott-biden-national-guard-20240125.html"
  },
  {
    "text": "Vince McMahon Accused of Sex Trafficking by WWE Staffer He Paid to Keep Quiet  —  Janel Grant files lawsuit saying McMahon pressured her into sex with him and other men at wrestling business, raising questions about 2022 board probe into CEO's payouts  —  A woman who received a payout … ",
    "url": "https://www.wsj.com/business/vince-mcmahon-accused-of-sex-trafficking-by-wwe-staffer-he-paid-to-keep-quiet-0b19b21c?mod=followamazon"
  },
  {
    "text": "How Big Pharma Is Fueling a Radical MAGA Agenda  —  Republicans' Project 2025 blueprint is an assault on women's health care.  It would also end Biden's Medicare drug-pricing plan  —  Big Pharma has invested big money in the organizations planning what a MAGA policy agenda will look like in a new Trump administration.",
    "url": "https://www.rollingstone.com/politics/politics-features/big-pharma-fueling-maga-agenda-1234953950/"
  },
  {
    "text": "Trump's courtroom appearances force Arizona GOP to cancel ‘Freedom Fest’: report  —  The Arizona Republican Party has pulled the plug on their upcoming “Freedom Fest” event after former President Donald Trump, who was set to headline the gathering, ditched it to attend to legal matters in court.",
    "url": "https://www.rawstory.com/trump-freedom-fest-court/"
  },
  {
    "text": "Elon Musk Is Spreading Election Misinformation, but X's Fact Checkers Are Long Gone  —  Civil rights lawyers and Democrats are sounding alarms about Mr. Musk's claims about voting.  The Biden campaign called his posts “profoundly irresponsible.”  —  In the spring of 2020 … ",
    "url": "https://www.nytimes.com/2024/01/25/us/politics/elon-musk-election-misinformation-x-twitter.html"
  },
  {
    "text": "Larry Kudlow Agrees Biden Economy ‘Not as Bad’ as He's Been Saying  —  “So he gets his due.  If I were he, I would be out slinging that hash,” Kudlow declared on Thursday about the better-than-expected economic growth.  —  Former Trump economic adviser Larry Kudlow conceded on Thursday … ",
    "url": "https://www.thedailybeast.com/larry-kudlow-agrees-biden-economy-not-as-bad-as-hes-been-saying"
  },
  {
    "text": "Pennsylvania's governor says he wants to ‘get s— done.’ He's made it his slogan, profanity and all  —  Gov. Josh Shapiro has a new slogan for how he wants to run Pennsylvania.  And it's profane.  (Jan.25)  —  Photos  —  Gov. Josh Shapiro has a new slogan for how he wants to run Pennsylvania — and it's not fit for kids' ears.",
    "url": "https://apnews.com/article/josh-shapiro-pennsylvania-swear-word-slogan-45db6d5d09a3a1e39bd13f4af70d1e23"
  }
]