[
  {
    "text": "Senate confirms Trump lawyer Emil Bove for appeals court, pushing past whistleblower claims  —  The Senate confirmed former Trump lawyer Emil Bove 50-49 for a lifetime appointment as a federal appeals court judge Tuesday as Republicans dismissed whistleblower complaints about his conduct at the Justice Department.",
    "url": "https://apnews.com/article/emil-bove-confirmation-whistleblowers-trump-republicans-democrats-71f92822cb2e8d57387748c2451fa724"
  },
  {
    "text": "Trump says Epstein ‘stole’ Virginia Giuffre, a heartless and revealing admission  —  Virginia Giuffre died by suicide only three months ago, having lived much of her life as an advocate for survivors of sex trafficking.  Now the president is speaking about her like she's property.",
    "url": "https://www.usatoday.com/story/opinion/columnist/2025/07/29/trump-virginia-giuffre-epstein-mar-a-lago/85431490007/"
  },
  {
    "text": "Pete Hegseth has discussed running for political office in Tennessee, sources say  —  The defense secretary has talked privately about running a campaign in Tennessee, sources told NBC News.  The Pentagon said Hegseth's “focus remains solely on serving under” Trump.",
    "url": "https://www.nbcnews.com/politics/trump-administration/pete-hegseth-discussed-running-political-office-tennessee-rcna221681"
  },
  {
    "text": "U.S. Economy Slowed in First Half of 2025 as Tariffs Scrambled Data  —  Gross domestic product rebounded in the spring after contracting at the start of the year, but consumer spending remained weak.  —  Economic growth softened in the first half of the year, as tariffs … ",
    "url": "https://www.nytimes.com/2025/07/30/business/us-economy-grew-in-second-quarter-as-tariffs-scrambled-data.html"
  },
  {
    "text": "U.S. Economy Grew at 3.0% Rate in Second Quarter  —  Consumer spending rose 1.4% but was offset by weaker business spending  —  Created with Highcharts 9.0.1GDP, change from previous quarterSources: Commerce Department (actual); WSJ survey of economists (forecasts)Notes … ",
    "url": "https://www.wsj.com/economy/us-gdp-q2-2025-359c022b?st=ENJB6g"
  },
  {
    "text": "Trump Administration Puts New Chokehold on Billions in Health-Research Funding  —  The National Institutes of Health can't award grants to outside researchers under new White House restriction  —  The Trump administration is blocking all funding that flows to outside health researchers … ",
    "url": "https://www.wsj.com/politics/policy/trump-administration-puts-new-chokehold-on-billions-in-health-research-funding-19660215?st=YWVyJH&reflink=desktopwebshare_permalink"
  },
  {
    "text": "The Discourse Is Broken  —  That's not necessarily a good thing.  —  Sydney Sweeney is inexplicably reclining and also buttoning up her jeans.  She's wearing a jacket with nothing underneath.  She's attempting to sell some denim to women, and appears to be writhing while doing so.",
    "url": "https://www.theatlantic.com/technology/archive/2025/07/sydney-sweeney-american-eagle-ads/683704/?gift=bQgJMMVzeo8RHHcE1_KM0Rqh-RBCXaXmzfBoTU_lwXk&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Now That They're Free  —  Venezuelan men deported by the Trump administration say they endured months of physical and mental abuse inside a Salvadoran prison.  Though happy to be home, they say the fact that they were released is proof of how senseless their detentions were.  —  Reporting Highlights",
    "url": "https://www.propublica.org/article/venezuelan-men-cecot-interviews-trump"
  },
  {
    "text": "FDA vaccine chief leaving agency after less than 3 months  —  The Food and Drug Administration's polarizing vaccine chief is leaving the agency after a brief tenure that drew the ire of biotech companies, patient groups and conservative allies of President Donald Trump.",
    "url": "https://apnews.com/article/vinay-prasad-fda-vaccines-laura-loomer-83030ad6eb7651095e3c40444dd69f12"
  },
  {
    "text": "GOP House committee chair yet to issue a subpoena for Epstein files  —  The chairman is physically required to sign each subpoena, but there is no deadline by which Rep. James Comer must issue the subpoenas, according to House rules.  —  Just now  —  A week after a House Oversight subcommittee voted … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/30/house-oversight-subpoena-epstein-files-james-comer/"
  },
  {
    "text": "8.8-magnitude earthquake in Russia's Far East sets off tsunami warnings in Japan, Alaska and Hawaii  —  One of the world's strongest earthquakes struck Russia's Far East early Wednesday, an 8.8-magnitude temblor that set off a tsunami in the northern Pacific region and prompted warnings for Alaska, Hawaii and south toward New Zealand.",
    "url": "https://apnews.com/article/japan-russia-kamchatka-earthquake-tsunami-warning-a88cbe8a1e985cff54dc0ad849ea5ddb"
  },
  {
    "text": "Epstein grand jury transcripts include testimony from two witnesses, feds say  —  The disclosure raises questions on whether unsealing the transcripts would satiate the appetite for more information.  —  just now  —  The grand jury transcripts the Justice Department is seeking to make public … ",
    "url": "https://www.washingtonpost.com/national-security/2025/07/30/epstein-grand-jury-transcripts-include-testimony-two-witnesses-feds-say/"
  },
  {
    "text": "It's Not a Linguistic Debate, it's Man-Made Starvation  —  Horrific man-made starvation in Gaza afflicting everyone from civilian children, to doctors caring for the sick and dying, to journalists struggling to survive so they could cover the catastrophe could have been avoided.",
    "url": "https://contrarian.substack.com/p/its-not-a-linguistic-debate-its-man"
  },
  {
    "text": "As MAGA storm over Epstein calms, White House plans next steps  —  Officials concede the furor has hurt Trump's standing, but the White House believes they've survived the worst of the furor.  —  Three weeks ago, White House officials were battling a frenzy from President Donald Trump's supporters over the Jeffrey Epstein case.",
    "url": "https://www.washingtonpost.com/politics/2025/07/30/trump-epstein-maga-white-house/"
  },
  {
    "text": "Paramount deal thrusts David Ellison into Trump's war with US media  —  What began as a Hollywood studio merger has become a test of how far corporate America will bend to president's will  —  Anna Nicolaou and James Fontanella-Khan in New York, Christopher Grimes in Los Angeles and Daniel Thomas in London",
    "url": "https://www.ft.com/content/b0771100-9180-4a73-adb4-38595aa8c15c"
  },
  {
    "text": "Justice Department Finds the University of California-Los Angeles in Violation of Federal Civil Rights Law  —  For Immediate Release  —  Today, the U.S. Department of Justice's Civil Rights Division announced that the University of California, Los Angeles (UCLA) violated the Equal Protection Clause … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-finds-university-california-los-angeles-violation-federal-civil-rights"
  },
  {
    "text": "The antitrust war inside MAGA Powerful lobbyists are battling populist reformers  —  President Trump returned to the Oval Office thanks to massive support from working-class and low-income Americans.  During the transition, Trump telegraphed an intent to honor this realignment by nominating … ",
    "url": "https://unherd.com/2025/07/the-antitrust-war-inside-maga/?lang=us"
  },
  {
    "text": "Texas Sen. Ted Cruz files bill to target activist groups with anti-organized crime laws  —  Activist groups that fund and organize protests could be targeted by federal law enforcement under the same statute used to go after organized crime if U.S. Sen. Ted Cruz gets his way.",
    "url": "https://www.houstonchronicle.com/politics/article/ted-cruz-rico-rioting-20789917.php"
  },
  {
    "text": "AOC, Crockett, and Mamdani: The scary future of the Democrats is now  —  “Democratic voters have said they want a fighter, and Jasmine Crockett, a former attorney who represents the Dallas area, has spent two and a half years in Congress trying to be one.  Through her hearing-room quips … ",
    "url": "https://www.washingtonexaminer.com/in_focus/3485516/aoc-zohran-mamdani-jasmine-crockett-future-democrats/"
  },
  {
    "text": "Democrats Introduce Bill To Audit What DOGE Bros Did To Government Data Systems  —  Senate Democrats are introducing a bill Wednesday that would require a sweeping audit of the federal government's computer systems to figure out what, exactly, Elon Musk's team of unvetted workers did when they meddled … ",
    "url": "https://www.huffpost.com/entry/trump-tariffs-white-house-latest_n_686ec29fe4b09bd98fe4be7e/liveblog_688a2a7ce4b08681ba5f0ab1"
  },
  {
    "text": "Fossil Fool  —  How Europe took Trump for a ride  —  Like many U.S. institutions, the European Union has abysmally failed the Trump test.  The EU is an economic superpower and could have retaliated effectively against Trump's illegal tariffs — illegal under both U.S. and international law.",
    "url": "https://paulkrugman.substack.com/p/fossil-fool"
  },
  {
    "text": "Transcript: Krugman Wrecks Trump's Europe Deal: “Scam on His Voters”  —  The following is a lightly edited transcript of the July 30 episode of the  —  Daily Blast podcast.  Listen to it here.  —  Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network.",
    "url": "https://newrepublic.com/article/198586/transcript-krugman-wrecks-trump-europe-deal-scam-voters"
  }
]