[
  {
    "text": "How Trump's Verbal Slips Could Weaken His Attacks on Biden's Age  —  Donald Trump, 77, has relentlessly attacked President Biden, 80, as too old for office.  But the former president himself has had a series of gaffes that go beyond his usual freewheeling style.",
    "url": "https://www.nytimes.com/2023/10/30/us/politics/trump-biden-age.html"
  },
  {
    "text": "Trump maintains commanding lead in Iowa poll  —  Nikki Haley is tied with Ron DeSantis for second place in the NBC/Des Moines Register/Mediacom survey as Trump's backers remain the most committed.  —  Former President Donald Trump now leads his nearest Republican rivals by nearly 30 points in Iowa … ",
    "url": "https://www.nbcnews.com/meet-the-press/first-read/trump-maintains-commanding-lead-iowa-poll-rcna122410"
  },
  {
    "text": "Donald Trump builds on big lead as Nikki Haley pulls even with Ron DeSantis in Iowa Poll  —  A Des Moines Register/NBC News/Mediacom Iowa Poll shows 43% of likely Republican caucusgoers pick Trump as their first choice for president, with DeSantis and Haley tied for second at 16%",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/caucus/2023/10/30/iowa-poll-donald-trump-leads-ron-desantis-nikki-haley-tied-presidential-candidates-gop-caucus/71342485007/"
  },
  {
    "text": "Colorado Trial Will Consider Whether the 14th Amendment Disqualifies Trump  —  While some prominent constitutional experts argue that a clause in the amendment applies to former President Donald J. Trump after Jan. 6, that view is far from universal among legal scholars.",
    "url": "https://www.nytimes.com/2023/10/30/us/politics/trump-colorado-trial-14th-amendment-jan-6.html"
  },
  {
    "text": "DOJ seeks 10 years for Trump appointee who assaulted officers on Jan. 6  —  “Hell yea I'm going.  I'm a Trump appointee.  I better be there,” Federico Klein wrote ahead of the Capitol attack.  —  WASHINGTON — The Justice Department is seeking 10 years in federal prison … ",
    "url": "https://www.nbcnews.com/politics/justice-department/trump-appointee-federico-klein-jan-6-doj-10-years-sentence-memo-rcna122774"
  },
  {
    "text": "The Christofascism of Mike Johnson  —  The new House speaker is an opposition researcher's goldmine. … It took Mike Johnson just a couple days last week to rise from a relatively obscure Louisiana congressman to House speaker.  Suffice it to say his background and policy positions … ",
    "url": "https://www.publicnotice.co/p/mike-johnson-christofascism"
  },
  {
    "text": "McConnell goes all out as Ukraine fight fractures GOP  —  His intense lobbying effort puts the Senate GOP leader at odds with his new House counterpart, Speaker Mike Johnson.  —  Mitch McConnell is abandoning his typically cautious style when it comes to aiding Ukraine … ",
    "url": "https://www.politico.com/news/2023/10/30/mcconnell-goes-all-out-as-ukraine-fight-fractures-gop-00123966"
  },
  {
    "text": "Speaker Mike Johnson's corporate backers  —  Last Wednesday, Republicans selected Congressman Mike Johnson (R-LA) as the next Speaker of the House.  Johnson is the most radical member ever selected as Speaker, championing a host of far-right causes.  Some experts describe Johnson's views … ",
    "url": "https://popular.info/p/speaker-mike-johnsons-corporate-backers"
  },
  {
    "text": "The kids are not all right  —  Images from college campuses nationwide in the wake of Hamas's massacre of Israeli civilians are disturbing.  Marchers chanting, “From the river to the sea, Palestine will be free.”  The slogan “Divest from Zionist genocide now” illuminated on a college library.",
    "url": "https://www.washingtonexaminer.com/opinion/editorials/the-kids-are-not-all-right"
  },
  {
    "text": "Youngkin ‘purge’ removed nearly 3,400 legal Virginia voters from rolls  —  RICHMOND — Gov. Glenn Youngkin's elections team has admitted in the run-up to pivotal General Assembly elections that it removed nearly 3,400 qualified voters from the state's rolls, far higher than the administration's previous estimate of 270.",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/10/29/youngkin-virginia-elections-voter-rolls/"
  },
  {
    "text": "FACT SHEET: President Biden Issues Executive Order on Safe, Secure, and Trustworthy Artificial Intelligence  —  Today, President Biden is issuing a landmark Executive Order to ensure that America leads the way in seizing the promise and managing the risks of artificial intelligence (AI).",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/10/30/fact-sheet-president-biden-issues-executive-order-on-safe-secure-and-trustworthy-artificial-intelligence/"
  },
  {
    "text": "Antisemitic threats to our community  —  Dear members of the Cornell community,  —  Earlier today, a series of horrendous, antisemitic messages threatening violence to our Jewish community and specifically naming 104 West — the home of the Center for Jewish Living — was posted on a website unaffiliated with Cornell.",
    "url": "https://statements.cornell.edu/2023/20231029-antisemitic-threats.cfm"
  },
  {
    "text": "Joe Biden's Big New Hampshire Blunder  —  By attempting to reorder the primary calendar, the president set himself up for a rude awakening in January.  —  I'm reliably told it was Biden himself who wanted to reorder the party's nominating calendar to make South Carolina the leadoff state … ",
    "url": "https://www.politico.com/news/magazine/2023/10/30/joe-bidens-big-new-hampshire-blunder-00124145"
  },
  {
    "text": "Kelly Johnson, who is married to House Speaker Mike Johnson, practices an ancient form of Christian counseling that classifies people into ‘choleric’, ‘phlegmatic,’ and other personality types purportedly ordained by God  — Kelly Johnson, the wife of House Speaker Mike Johnson, was a Christian therapist.",
    "url": "https://www.businessinsider.com/mike-johnson-wife-kelly-johnson-christian-counseling-phlegmatic-2023-10?op=1"
  },
  {
    "text": "Hundreds storm airport in Russia in antisemitic riot over arrival of plane from Israel  —  Hundreds of people stormed into the main airport in Russia's Dagestan region and onto the landing field Sunday, chanting antisemitic slogans and seeking passengers arriving on a flight from Tel Aviv … ",
    "url": "https://www.cbsnews.com/news/crowd-storms-russian-airport-to-protest-flight-from-israel-antisemitic-riot/"
  },
  {
    "text": "Mike Johnson's first big test  —  Good morning, Early Birds.  How many Barbies did you see at Halloween parties over the weekend?  We're okay with it.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2023/10/30/mike-johnsons-first-big-test/"
  }
]