[
  {
    "text": "WATCH: Stephen Miller says Trump administration is ‘actively looking at’ suspending habeas corpus  —  Stephen Miller, a top White House adviser, said the administration is looking for ways to expand its legal power to deport migrants who are in the country illegally.  —  Watch Miller's remarks in the video player above.",
    "url": "https://www.pbs.org/newshour/politics/watch-stephen-miller-says-trump-administration-is-actively-looking-at-suspending-habeas-corpus"
  },
  {
    "text": "148. Suspending Habeas Corpus  —  Welcome back to “One First,” an (increasingly frequent) newsletter that aims to make the U.S. Supreme Court more accessible to all of us.  If you're not already a subscriber, I hope you'll consider becoming one (and, if you already are … ",
    "url": "https://www.stevevladeck.com/p/148-suspending-habeas-corpus"
  },
  {
    "text": "Stephen Miller Threatens to Suspend Habeas Corpus because He Got Caught Lying  —  You should know that the question to Stephen Miller about habeas corpus was a set up.  —  The male “journalist” who asked it after Miller called on him for the first question at a staged press event posed it in terms of … ",
    "url": "https://www.emptywheel.net/2025/05/10/stephen-miller-threatens-to-suspend-habeas-corpus-because-he-got-caught-lying/"
  },
  {
    "text": "Newark's Mayor Arrested at Protest Outside ICE Detention Center  —  Ras J. Baraka and city officials have said that the lockup is operating without a valid certificate of occupancy.  Three members of Congress from New Jersey were with Mr. Baraka when he was arrested.",
    "url": "https://www.nytimes.com/2025/05/09/nyregion/newark-ice-protest-arrest-ras-baraka.html"
  },
  {
    "text": "Live Updates: Trump Announces Truce Between India and Pakistan  —  Officials in both countries acknowledged a halt after several days of their most expansive fighting in decades.  —  Here's the latest.  —  President Trump announced Saturday that India and Pakistan had agreed to a cease-fire … ",
    "url": "https://www.nytimes.com/live/2025/05/10/world/pakistan-india-kashmir"
  },
  {
    "text": "A New Kind of Battle for Two Old Enemies  —  Pakistan accused India of launching air-to-surface missiles that targeted at least three bases.  Soon after, Pakistani officials said retaliatory action against Indian bases had begun.  —  The military conflict between India and Pakistan hit … ",
    "url": "https://www.nytimes.com/2025/05/09/world/asia/india-pakistan-kashmir-drones.html"
  },
  {
    "text": "Judge Temporarily Blocks Trump Plans for Mass Layoffs and Program Closures  —  An emergency ruling by a federal judge in California amounted to the broadest effort yet to halt the Trump administration's overhaul of the federal government.  —  A federal judge on Friday called for a two-week pause … ",
    "url": "https://www.nytimes.com/2025/05/09/us/politics/federal-layoffs-trump-ruling.html"
  },
  {
    "text": "Breaking: Federal judge temporarily blocks further Trump-backed mass firings across gov't  —  The Friday order from Judge Susan Illston is in effect for the next two weeks, with further arguments set for May 22.  [Update: DOJ is appealing.]  —  A federal judge issued a temporary restraining order … ",
    "url": "https://www.lawdork.com/p/-federal-judge-blocks-trump-mass-firings"
  },
  {
    "text": "Trump Promised to End Two Wars Quickly.  In Private, He Admits He's Frustrated.  —  The president has told donors resolving the conflicts has been more difficult than he thought  —  When President Trump spoke to a room of top donors at his Florida club last week, he described ending Russia's war … ",
    "url": "https://www.wsj.com/politics/trump-israel-gaza-russia-ukraine-war-f847b04a?st=iUVvCX"
  },
  {
    "text": "There are big, ugly problems at the center of the House budget bill  —  Republicans have created impossible restraints on their tax-and-budget package.  —  You might have heard the riddle about the man who must row a fox, a chicken and a sack of corn across a river one at a time.",
    "url": "https://www.washingtonpost.com/opinions/2025/05/10/republicans-trump-tax-spending-medicaid/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2ODQ5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4MjMxOTk5LCJpYXQiOjE3NDY4NDk2MDAsImp0aSI6IjU4MzYzMTUxLWM4OWEtNDY4MC05ZWQyLWEyYmU1YTY2YmM1ZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA1LzEwL3JlcHVibGljYW5zLXRydW1wLXRheC1zcGVuZGluZy1tZWRpY2FpZC8ifQ.pva4_2K8y_iHU9sWfpCnFnlfDxCoczEwWO55-96FMZU&itid=gfta"
  },
  {
    "text": "Tufts student detained by ICE in viral video is released, thanks supporters  —  Rumeysa Ozturk has been in Louisiana for over six weeks following an op-ed she co-wrote last year that criticized the school's response to Israel's war in Gaza  —  Tufts University student Rumeysa Ozturk … ",
    "url": "https://www.nbcboston.com/news/local/bail-hearing-tufts-student-rumeysa-ozturk-detained-in-louisiana/3708999/?at"
  },
  {
    "text": "Pentagon directs military to pull library books that address diversity, anti-racism, gender issues  —  The Pentagon has ordered all military leaders and commands to pull and review all of their library books that address diversity, anti-racism or gender issues by May 21",
    "url": "https://www.ajc.com/news/nation-world/pentagon-directs-military-to-pull-library-books-that-address-diversity-anti-racism-gender-issues/FQVSQPRGBJBR3BBAIC7HZHI2RE/"
  },
  {
    "text": "AOC Warns Republicans Are ‘Robbing People’ to Pay for Billionaire Tax Cuts  —  The congresswoman tells Rolling Stone Trump and Republicans are gutting “what is left of the health care and social safety net in the United States”  —  As Republicans and Democrats prepare to face off … ",
    "url": "https://www.rollingstone.com/politics/politics-features/aoc-trump-republicans-medicaid-health-billionaire-tax-cuts-1235336383/"
  },
  {
    "text": "'Don't get in my way,' the new acting head of federal disaster agency warns in call with staff  —  The new head of the federal agency tasked with responding to disasters across the country warned staff in a meeting Friday not to try to impede upcoming changes, saying that “I will run right over you” … ",
    "url": "https://apnews.com/article/emergency-disaster-fema-trump-richardson-hamilton-1a6c7ebc792f3628705298432ab06aa4"
  },
  {
    "text": "Zero ships from China are bound for California's top ports.  Officials haven't seen that since the pandemic  —  On Friday morning, West Coast port officials told CNN about a startling sight: Not a single cargo vessel had left China with goods for the two major West Coast ports in the past 12 hours.",
    "url": "https://cnn.com/2025/05/10/business/zero-ships-china-trade-ports-pandemic"
  },
  {
    "text": "Rep. Marjorie Taylor Greene says she won't run for U.S. Senate  —  Republicans, who are wary of Greene, have been looking for an alternative candidate after Georgia Gov. Brian Kemp said he wouldn't enter the Senate race.  —  Rep. Marjorie Taylor Greene, R-Ga., said definitively on Friday … ",
    "url": "https://www.nbcnews.com/politics/congress/rep-marjorie-taylor-greene-says-wont-run-us-senate-rcna205987"
  },
  {
    "text": "America's Richest Foundations Team Up Against Feared Trump Assault  —  Grantmakers are discussing legal and other strategies to help them avoid the recent fates of law firms and universities  —  Some of America's wealthiest and most powerful private foundations are informally banding together … ",
    "url": "https://www.wsj.com/politics/policy/nonprofit-foundations-prepare-trump-fight-884f6016?st=XEVcAX&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump Calls for 20,000 Extra Officers to Help With Deportation Efforts  —  The order, which would use state and local officers, among others, would represent an enormous expansion of immigration enforcement.  But it is unclear how it would be paid for.  —  President Trump ordered the Department … ",
    "url": "https://www.nytimes.com/2025/05/10/us/politics/dhs-deportation-extra-officers.html"
  },
  {
    "text": "Trove of documents unsealed in NYC mayor's criminal case offers a glimpse of thwarted investigation  —  Federal agents investigating New York City Mayor Eric Adams were still seizing phones and applying for search warrants days before Justice Department leaders ordered prosecutors to drop the corruption case … ",
    "url": "https://apnews.com/article/nyc-mayor-eric-adams-trump-6a76e9abeeb3ef6328e3195806aba663"
  },
  {
    "text": "Trump has sat for only 12 ‘daily’ intelligence briefings since taking office  —  The scarcity of the President's Daily Briefings comes as he pursues high-stakes diplomacy with America's friends and foes.  —  Since President Donald Trump was sworn into office in January … ",
    "url": "https://www.politico.com/news/2025/05/09/trump-intelligence-briefing-frequency-00338946"
  }
]