[
  {
    "text": "Trump Floats the Idea of Executing Joint Chiefs Chairman Milley  —  The former president is inciting violence against the nation's top general.  America's response is distracted and numb.  —  Late Friday night, the former president of the United States—and a leading candidate to be the next president … ",
    "url": "https://www.theatlantic.com/ideas/archive/2023/09/trump-milley-execution-incitement-violence/675435/"
  },
  {
    "text": "Trump pledges to investigate MSNBC parent company for ‘threatening treason’  —  Former President Trump pledged to investigate Comcast, the parent company for NBC and MSNBC, if he is elected in 2024, saying it “will be thoroughly scrutinized for their knowingly dishonest and corrupt coverage of people, things, and events.”",
    "url": "https://thehill.com/homenews/4221310-trump-pledges-to-investigate-msnbc-parent-for-threatening-treason/"
  },
  {
    "text": "Trump Tells Gun Store He'd Like to Buy a Glock, Raising Legal Questions  —  Officials have increasingly voiced concerns about threats of violence related to the former president's trials, as he faces charges that would make it illegal for a store to sell him a firearm.",
    "url": "https://www.nytimes.com/2023/09/25/us/politics/trump-glock-gun-south-carolina.html"
  },
  {
    "text": "Trump appears to remain worried that 2024 won't be rigged to his benefit  —  Former president Donald Trump has never been particularly adept at masking his true feelings.  He feels confident in his ability to close the deal, however robustly he's previously undermined his position.",
    "url": "https://www.washingtonpost.com/politics/2023/09/25/trump-pennsylvania-voting/"
  },
  {
    "text": "Trump doesn't buy gun after saying he wants to in South Carolina  — The Trump campaign walked back a claim that former President Donald Trump bought a Glock handgun in South Carolina.  — A since-deleted video posted on social media by Trump's spokesman, Steven Cheung … ",
    "url": "https://www.cnbc.com/2023/09/25/trump-says-he-is-buying-glock-handgun-at-south-carolina-event.html"
  },
  {
    "text": "History Offers Democrats a Way Out of the Menendez Problem  —  Oddly enough, it involves the very same seat the New Jersey senator refuses to resign.  —  Senator Robert Menendez had a bad week.  —  A New Jersey Democrat currently serving his third full term in the Senate … ",
    "url": "https://www.politico.com/news/magazine/2023/09/25/history-dept-bob-menendez-democrats-00117935"
  },
  {
    "text": "Fetterman Plans to Give Back Menendez Donation In Cash-Filled Envelopes (Exclusive)  —  Fetterman is the only Senate Democrat to call on Menendez to resign after a federal bribery indictment  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/fetterman-plans-to-give-back-menendez-donation-in-cash-filled-envelopes-exclusive"
  },
  {
    "text": "Second Senate Democrat calls for Menendez resignation  —  Sen. Sherrod Brown (D-Ohio) on Monday became the second Senate Democrat to call on Sen. Bob Menendez (D-N.J.) to resign after he was indicted on federal bribery charges late last week.  —  “Senator Menendez has broken the public trust … ",
    "url": "https://thehill.com/homenews/senate/4222340-second-senate-democrat-calls-for-menendez-resignation/"
  },
  {
    "text": "Could a discharge petition keep the government open?  —  Good morning, Early Birds.  If you observe Yom Kippur, have an easy fast.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.  —  In today's edition ...  Sen. Bob Menendez holds … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/25/could-discharge-petition-keep-government-open/"
  },
  {
    "text": "Fox News Announces a Newsom and DeSantis Debate in November  —  It's highly unusual for governors who are not running for the same office to debate, but the two have clashed repeatedly as they seek national attention.  —  Fox News announced on Monday that it was hosting a debate … ",
    "url": "https://www.nytimes.com/2023/09/25/us/politics/newsom-desantis-debate.html"
  },
  {
    "text": "Asa Hutchinson misses out as seven candidates qualify for second GOP debate  —  Former President Donald Trump is skipping another debate, while Hutchinson is the only candidate who made the first debate to miss the second one.  —  Former Arkansas Gov. Asa Hutchinson fell short of qualifying … ",
    "url": "https://www.nbcnews.com/politics/2024-election/who-qualified-second-republican-debate-participants-rcna111370"
  },
  {
    "text": "RNC announces candidates for another Trump-less debate  —  Seven candidates made the cut, but former President Donald Trump is counterprogramming another of the Republican National Committee's marquee events.  —  The stage is set for the second GOP presidential primary debate — and once again, the frontrunner is nowhere to be seen.",
    "url": "https://www.politico.com/news/2023/09/25/rnc-announces-candidates-for-another-trump-less-debate-00118087"
  },
  {
    "text": "Majority of Americans continue to favor moving away from Electoral College  —  How we did this  —  The Electoral College has played an outsize role in some recent U.S. elections.  And a majority of Americans would welcome a change to the way presidents are elected, according to a new Pew Research Center survey.",
    "url": "https://www.pewresearch.org/short-reads/2023/09/25/majority-of-americans-continue-to-favor-moving-away-from-electoral-college/"
  },
  {
    "text": "Leader of Canada's House of Commons apologizes for honoring man who fought for Nazis  —  The speaker of Canada's House of Commons apologized Sunday for recognizing a man who fought for a Nazi military unit during World War II.  Just after Ukrainian President Volodymyr Zelenskyy delievered … ",
    "url": "https://apnews.com/article/canada-parliament-apology-ukraine-nazi-eedc22e1d810011c412953168a4cee46"
  },
  {
    "text": "Barreling toward shutdown, McCarthy scrambles to get even one spending win  —  The speaker's latest plan is to advance four spending bills on Tuesday.  But it's unclear that he has the votes.  And it still won't keep the government open.",
    "url": "https://www.politico.com/live-updates/2023/09/25/congress/mccarthys-career-deciding-week-00118006"
  },
  {
    "text": "‘Missing witness’ in Biden corruption probe offers dirt on Hunter FBI ‘mole’ who tipped him off  —  Gal Luft, the fugitive “missing witness” of the Biden corruption investigation, has offered new evidence to the House impeachment inquiry about an FBI mole who tipped off Hunter Biden … ",
    "url": "https://nypost.com/2023/09/25/offering-dirt-on-hunter-bidens-fbi-mole/"
  },
  {
    "text": "8 hospitalized after ‘sudden severe turbulence’ on Florida-bound flight  —  FORT LAUDERDALE, Fla. (WFLA) — Eight people were hospitalized Monday after being injured during rough skies on a flight to Florida.  —  Passengers and crew aboard the JetBlue flight experienced “sudden severe turbulence” … ",
    "url": "https://thehill.com/policy/transportation/4222399-8-hospitalized-after-sudden-severe-turbulence-on-florida-bound-flight/"
  }
]