[
  {
    "text": "5th Circuit finds Biden White House, CDC likely violated First Amendment  —  The three judge panel found that contacts with tech companies by officials from the White House, the surgeon general's office, the CDC and the FBI likely amounted to coercion  —  The U.S. Court of Appeals … ",
    "url": "https://www.washingtonpost.com/technology/2023/09/08/5th-circuit-ruling-covid-content-moderation/"
  },
  {
    "text": "Appeals court reverses much of judge's order blocking Biden administration officials from communicating with social media companies  —  A federal appeals court narrowed a judge's order that blocked Biden administration officials from communicating with social media companies.",
    "url": "https://www.cnn.com/2023/09/08/politics/biden-administration-social-media-lawsuit/"
  },
  {
    "text": "Appeals Court Rules White House Overstepped 1st Amendment on Social Media  —  A Fifth Circuit panel partly upheld restrictions on the Biden administration's communications with online platforms about their content.  —  A federal appeals court ruled on Friday that the Biden administration … ",
    "url": "https://www.nytimes.com/2023/09/08/business/appeals-court-first-amendment-social-media.html"
  },
  {
    "text": "Appeals court scales back order squelching Biden administration contact with social media platforms  —  The administration has 10 days to seek a Supreme Court review.  —  NEW ORLEANS — A federal appeals court Friday significantly whittled down a lower court's order curbing Biden administration … ",
    "url": "https://www.politico.com/news/2023/09/08/appeals-court-biden-social-media-00114857"
  },
  {
    "text": "Judge denies Mark Meadows effort to move Georgia case to federal court  —  The ruling is a blow to Meadows's efforts in federal court to dismiss his case and could influence former president Donald Trump as he decides whether to seek removal himself.  —  A federal judge denied a request Friday … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/08/mark-meadows-court-decision-georgia/"
  },
  {
    "text": "Judge refuses to move prosecution of Mark Meadows to federal court  —  Meadows' role in efforts to challenge the 2020 election results fell outside the scope of his official duties, so his case should remain in state court, the judge said.  —  The prosecution of former White House chief … ",
    "url": "https://www.politico.com/news/2023/09/08/judge-refuses-to-move-prosecution-of-mark-meadows-to-federal-court-00114817"
  },
  {
    "text": "A reminder of how one juror could save Trump  —  The big news from the newly released Fulton County, Ga., special grand jury report is that the panel recommended charges for many more than the 19 people (including Donald Trump) who were ultimately indicted.  Among them: a sitting U.S. senator … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/08/reminder-how-one-juror-could-save-trump/"
  },
  {
    "text": "Fulton County special grand jury recommended charges against Lindsey Graham, David Perdue and Kelly Loeffler  —  The special grand jury in Fulton County investigating the 2020 presidential election in Georgia recommended charges against Republican Sen. Lindsey Graham of South Carolina … ",
    "url": "https://www.cnn.com/2023/09/08/politics/fulton-county-special-grand-jury-report/"
  },
  {
    "text": "Trump leads, followed by second tier of four candidates in ISU/Civiqs poll  —  AMES, IA — Donald Trump far outpaces other Republican presidential nominees in an Iowa State University/Civiqs poll, which surveyed 1,128 registered voters from Sept. 2-7.  The results are the first in a five-part … ",
    "url": "https://www.news.iastate.edu/news/2023/09/08/24caucus-poll1"
  },
  {
    "text": "New tapes reveal MyPillow CEO Mike Lindell meltdown in 2020 election deposition  — The clips of the depositions show Mike Lindell snapping and ripping attorneys who are leading a lawsuit against him.  — Eric Coomer, former director of product strategy and security at Dominion Voting Systems, has sued Lindell for defamation.",
    "url": "https://www.cnbc.com/2023/09/08/my-pillow-ceo-mike-lindell-melts-down-in-trump-2020-deposition.html"
  },
  {
    "text": "Newsom on a potential 2024 run: Not going to happen  —  “We need to move past this notion that [Joe Biden is] not going to run,” Newsom said.  —  California Gov. Gavin Newsom has a message to voters who think President Joe Biden won't run again.  —  “We need to move past this notion … ",
    "url": "https://www.politico.com/news/2023/09/08/newsom-biden-harris-2024-00114684"
  },
  {
    "text": "Trump Is Said to Have Told Blake Masters He'd Lose Senate Primary to Kari Lake  —  Neither potential candidate has entered the race to unseat Senator Kyrsten Sinema in Arizona.  —  Former President Donald J. Trump on Sunday called Blake Masters, the failed Arizona Senate candidate considering … ",
    "url": "https://www.nytimes.com/2023/09/08/us/politics/trump-blake-masters-kari-lake-primary-arizona.html"
  },
  {
    "text": "US likely to send long-range ATACMS missiles to Ukraine for the first time: Officials  —  “They are coming,” one U.S. official told ABC News.  —  The Biden administration is likely to send Ukraine long-range Army Tactical Missile Systems, or ATACMS, to help in its fight to repel … ",
    "url": "https://abcnews.go.com/Politics/us-send-long-range-atacms-missiles-ukraine-time/story?id=103031722"
  },
  {
    "text": "California Assembly passes bill adding gender acceptance to list of considerations in determining child custody  —  The California Assembly has passed a bill that, if signed, will add gender identity acceptance to the list of considerations for determining child custody.  —  Assembly Bill 957 passed 57 to 16 on Friday.",
    "url": "https://www.washingtonexaminer.com/news/california-assembly-bill-gender-acceptance-determining-child-custody"
  },
  {
    "text": "Alito rejects call to recuse in tax case  —  The conservative justice granted a series of interviews to a lawyer working with The Wall Street Journal.  —  Justice Samuel Alito is emphatically rejecting calls for him to recuse himself from a closely watched tax case because he sat for interviews … ",
    "url": "https://www.politico.com/news/2023/09/08/alito-rejects-call-to-recuse-in-tax-case-00114735"
  },
  {
    "text": "FAA orders Musk's SpaceX to take 63 corrective actions on Starship, keeps rocket grounded  — The Federal Aviation Administration said Elon Musk's SpaceX must keep its Starship Super Heavy rocket grounded.  — The federal agency had been probing the April launch, which saw SpaceX's Starship explode in mid-flight.",
    "url": "https://www.cnbc.com/2023/09/08/faa-starship-grounded-corrective-action.html"
  },
  {
    "text": "DOJ and Mifepristone maker ask Supreme Court to make ultimate decision on abortion drug in 2024  —  The Supreme Court is once again being asked to make a major ruling on abortion in an election year.  —  The Department of Justice and a manufacturer of the widely used abortion drug mifepristone asked … ",
    "url": "https://www.cnn.com/2023/09/08/politics/mifepristone-supreme-court-appeal/"
  },
  {
    "text": "‘Zip Tie Guy’ and His Mom Get Prison Time Despite Pleas for Mercy  —  Eric Munchel's attorneys insisted his alarming attire during the Capitol riot was “evidence of nothing, save a certain fashion taste.”  —  Once the Jan. 6 rioter known as “Zip-Tie Guy” discovered he was going to be a dad … ",
    "url": "https://www.thedailybeast.com/zip-tie-guy-and-his-mom-get-prison-time-for-capitol-riot-despite-pleas-for-mercy"
  },
  {
    "text": "New Mexico Gov. Issues Public Health Order Suspending Carry Of Guns In Albuquerque  —  The Democratic governor said she is expecting legal challenges but felt compelled to act in response to a spate of gun violence.  —  LOADING  —  New Mexico Gov. Michelle Lujan Grisham on Friday issued … ",
    "url": "https://www.huffpost.com/entry/albuquerque-new-mexico-gun-ban_n_64fbb4d9e4b02beef75cdce9"
  },
  {
    "text": "‘How am I in this war?’:  The untold story of Elon Musk's support for Ukraine  —  Walter Isaacson is a professor of history at Tulane University, former editor of Time magazine and author of several biographies.  This op-ed is excerpted from his latest book, “Elon Musk.”",
    "url": "https://www.washingtonpost.com/opinions/2023/09/07/elon-musk-starlink-ukraine-russia-invasion/"
  }
]