[
  {
    "text": "Supreme Court rules Trump cannot be kicked off ballot  —  The decision swiftly ended the legal fight over whether states could bar Trump from state ballots based on the Constitution's 14th Amendment.  —  WASHINGTON — The Supreme Court on Monday handed a sweeping win to former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rules-trump-cannot-kicked-colorado-ballot-rcna132291"
  },
  {
    "text": "Supreme Court keeps Trump on ballot, rejects Colorado voter challenge  —  Decision comes a day before Super Tuesday and as justices weigh other key cases affecting Donald Trump  —  The Supreme Court on Monday unanimously sided with Donald Trump, allowing the former president to remain … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/04/supreme-court-trump-ballot-decision/"
  },
  {
    "text": "The Supreme Court saves Trump's bacon  —  This free edition of PN is made possible by paid subscribers.  If you aren't one already, hit the button and sign up to support our independent journalism.  —  ⚖️ Subscribe to Public Notice ⚖️",
    "url": "https://www.publicnotice.co/p/supreme-court-trump-immunity-explained"
  },
  {
    "text": "Joe Biden's Last Campaign  —  Trailing Trump in polls and facing doubts about his age, the President voices defiant confidence in his prospects for reëlection.  —  “I'll show you where Trump sat and watched the revolution,” Joe Biden said, stepping out from behind his desk in the Oval Office.",
    "url": "https://www.newyorker.com/magazine/2024/03/11/joe-bidens-last-campaign?currentPage=all"
  },
  {
    "text": "What the Information Operation about Joe Biden's Age Looks Like  —  One reason Joe Biden is behind in the polls, I'm fairly convinced, is because Democrats relentlessly participate in an organized campaign to use Biden's age to dehumanize him.  —  Whether it involves making reasonable critiques … ",
    "url": "https://www.emptywheel.net/2024/03/04/what-the-information-operation-about-joe-bidens-age-looks-like/"
  },
  {
    "text": "Across the Board, Voters Give Better Marks to Trump's Policies Than Biden's  —  Times/Siena polls highlight how comparatively well-regarded Donald J. Trump's policies are, even by groups that were affected by policies that Democrats hope will be motivating issues in 2024.",
    "url": "https://www.nytimes.com/2024/03/04/us/politics/trump-biden-policies-help-hurt.html"
  },
  {
    "text": "Trump supporters target black voters with faked AI images  —  Donald Trump supporters have been creating and sharing AI-generated fake images of black voters to encourage African Americans to vote Republican.  —  BBC Panorama discovered dozens of deepfakes portraying black people as supporting the former president.",
    "url": "https://www.bbc.com/news/world-us-canada-68440150"
  },
  {
    "text": "AI-generated images of Trump with Black voters being spread by supporters  —  No evidence to tie fake images, including one created by Florida radio host, to Trump campaign, BBC Panorama investigation finds  —  Dozens of fake, artificial intelligence-generated photos showing Donald Trump … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/04/trump-ai-generated-images-black-voters"
  },
  {
    "text": "Pro-Trump lawyers central to alternate-elector plot settle Wisconsin lawsuit  —  Two attorneys who advanced a strategy to try to overturn the 2020 presidential election by organizing rosters of Republicans to falsely portray Donald Trump as the winner of several states, have reached … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/04/wisconsin-trump-fake-electors-chesebro-troupis-settlement/"
  },
  {
    "text": "Settlement in Wisconsin fake elector case offers new details on the strategy by Trump lawyers  —  Two attorneys for then-President Donald Trump orchestrated a plan for fake electors to file paperwork falsely saying the Republican won Wisconsin in a strategy to overturn Joe Biden's 2020 victory … ",
    "url": "https://apnews.com/article/electors-trump-settlement-ballot-2020-wisconsin-f416cd04adfa9f92c382b7c9e8a94ce7"
  },
  {
    "text": "Key Figure in Trump's Business Pleads Guilty to Felony Perjury  —  Allen H. Weisselberg, the former Trump Organization finance chief, has already spent time at the Rikers Island jail complex.  The perjury plea will send him back.  —  Allen H. Weisselberg, a longtime lieutenant … ",
    "url": "https://www.nytimes.com/2024/03/04/nyregion/weisselberg-guilty-trump-business.html"
  },
  {
    "text": "Another GOP senator announces she won't vote for Trump in 2024  —  And then there were two: Lisa Murkowski and Mitt Romney are incumbent Republican senators who've publicly said they won't vote for Donald Trump in 2024.  —  After launching her Republican presidential campaign in February 2023 … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/another-gop-senator-announces-wont-vote-trump-2024-rcna141606"
  },
  {
    "text": "Opill, first over-the-counter birth control pill, will go on sale later this month  —  The pill was cleared by the FDA for use without a prescription last July.  —  Opill a daily oral contraceptive.  —  Opill, the first over-the-counter birth control pill that can be purchased without a prescription … ",
    "url": "https://abcnews.go.com/Health/opill-counter-birth-control-pill-sale-month/story?id=107775263"
  },
  {
    "text": "Trump's White House Was ‘Awash in Speed’ — and Xanax  —  Under Trump, the White House Medical Unit was “like the Wild West,” and staffers had easy access to powerful stimulants and sedatives, sources tell Rolling Stone  —  IF YOU EVER looked at the actions of the Trump White House and wondered, ‘Are they on drugs?’",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-white-house-drugs-speed-xanax-1234979503/"
  },
  {
    "text": "Iran elections: Record low turnout in polls as hardliners win  —  Hardliners have won a majority of the seats in the parliamentary elections in Iran, which saw a record low turnout of 41% after calls for a boycott.  —  Most moderate and reformist figures were disqualified from standing in Friday's polls … ",
    "url": "https://www.bbc.com/news/world-middle-east-68467595"
  },
  {
    "text": "Lauren Boebert missed a campaign stop because she was busy working out if her ex had thrown her stuff into a pond: report  — Lauren Boebert missed a campaign event at a Colorado coffee shop last month.  — Boebert traveled to her home in another district to find out if her ex had discarded her belongings.",
    "url": "https://www.businessinsider.com/lauren-boebert-skipped-campaign-event-ex-threw-stuff-into-pond-2024-3"
  },
  {
    "text": "Mitch McConnell is the arsonist who set America on fire and ran away  —  The lyrics to Kenny Rogers' “The Gambler” are branded onto my brain.  In the summer of 1979, I was a 20-year-old so eager to break into journalism I took a job at a tiny paper in Peoria, Ill., and lived there with my grandparents.",
    "url": "https://www.inquirer.com/opinion/commentary/mitch-mcconnell-destroyed-america-runs-away-20240303.html"
  }
]