[
  {
    "text": "Falling inflation, rising growth give U.S. the world's best recovery  —  The European economy, hobbled by unfamiliar weakness in Germany, is barely growing.  China is struggling to recapture its sizzle.  And Japan continues to disappoint.  —  But in the United States, it's a different story.",
    "url": "https://www.washingtonpost.com/business/2024/01/28/global-economy-gdp-inflation/"
  },
  {
    "text": "Biden offers fresh assurances he would shut down border ‘right now’ if Congress sends him a deal  —  Bidding to salvage a border deal in Congress that also would unlock money for Ukraine, President Joe Biden offered fresh assurances Saturday night that he would be willing to close … ",
    "url": "https://apnews.com/article/biden-border-deal-mexico-migration-south-carolina-b83f83ed39e59ebb38b7ff093da14706"
  },
  {
    "text": "Trump's $50 Million Mystery Debt Looks Like ‘Tax Evasion’  —  Donald Trump has long claimed he personally owed tens of millions to an obscure entity related to his Chicago tower.  But court docs claim Trump Org. now says it never existed.  —  Always read the footnotes.",
    "url": "https://www.thedailybeast.com/trumps-dollar50-million-mystery-debt-looks-like-tax-evasion"
  },
  {
    "text": "Biden administration discussing slowing some weaponry deliveries to Israel to pressure Netanyahu  —  U.S. officials are considering pausing or slowing some U.S. arms shipments to Israel to convince the government to heed U.S. calls to scale back its military assault in Gaza,",
    "url": "https://www.nbcnews.com/politics/white-house/biden-administration-discussing-slowing-weaponry-deliveries-israel-pre-rcna136035"
  },
  {
    "text": "E. Jean Carroll Vows to ‘Do Something Good’ With Trump's $83.3 Million  —  ‘WOMEN WON THIS ONE’  —  E. Jean Carroll says the historic $83.3 million defamation verdict against Donald Trump earlier this week “bodes well for the future” and gives women a win when it's needed most.",
    "url": "https://www.thedailybeast.com/e-jean-carroll-vows-to-do-something-good-with-trumps-dollar833-million"
  },
  {
    "text": "Key Network of G.O.P. Megadonors to Meet With Trump and Haley Camps  —  Assessing the presidential race, the American Opportunity Alliance has invited representatives from both the Trump and Haley campaigns to make their pitches at a meeting next week.  —  A network of Republican megadonors … ",
    "url": "https://www.nytimes.com/2024/01/27/us/politics/republican-megadonors-trump-haley.html"
  },
  {
    "text": "Nikki Haley targeted in ‘swatting’ incident at her South Carolina home  —  Authorities responded to a fake emergency at the South Carolina home of Republican presidential candidate Nikki Haley last month after a man claimed to have shot a woman and threatened to harm himself at her home, according to town records obtained by Reuters.",
    "url": "https://www.reuters.com/world/us/republican-presidential-candidate-nikki-haley-targeted-swatting-incident-2024-01-27/"
  },
  {
    "text": "The world's biggest meat processor — a major polluter — is coming to Wall Street  —  JBS wants to join the New York Stock Exchange.  The move could lead to rapid deforestation, critics say.  —  An unusual collection of Senate leaders, British lords, environmentalists and a secretive lobbying group … ",
    "url": "https://www.politico.com/news/2024/01/28/meat-giant-deforestation-jbs-00137084"
  },
  {
    "text": "Former senator says new film shows ‘how close’ we came to losing democracy on Jan. 6  —  Former Alabama Sen. Doug Jones (D) said that the new film “War Game” shows “how close” the U.S. came to losing democracy on Jan. 6, 2021.  —  During his appearance on CNN Saturday … ",
    "url": "https://thehill.com/blogs/in-the-know/4433751-former-senator-new-film-losing-democracy-jan-6/"
  },
  {
    "text": "US historians sign brief to support Colorado's removal of Trump from ballot  —  Twenty-five civil war and Reconstruction scholars support invoking 14th amendment to bar Trump from ballot over January 6  —  Twenty-five historians of the civil war and Reconstruction filed a US supreme court brief … ",
    "url": "https://www.theguardian.com/law/2024/jan/28/us-historians-sign-brief-to-support-colorados-removal-of-trump-from-ballot"
  },
  {
    "text": "First-of-its-kind campaign fundraiser in the works with Bill Clinton, Barack Obama and Biden  —  The Biden campaign is planning a spring fundraiser for the president to appear with his two Democratic predecessors.  —  WASHINGTON — President Joe Biden's campaign is trying to organize … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-campaign-fundraiser-president-bill-clinton-barack-obama-rcna136020?taid=65b655122fcc0f0001ff2a9b"
  },
  {
    "text": "Ohio, Michigan Republicans In Released Audio: “Endgame” Is To Ban Trans Care “For Everyone”  —  In audio released Friday evening, senators and representatives from Ohio and Michigan revealed the “endgame” is to ban transgender care “for everyone.” … Audio from a small Twitter Space featuring legislators … ",
    "url": "https://www.erininthemorning.com/p/ohio-michigan-republicans-in-released"
  },
  {
    "text": "Texas' Border Stunt Is Based on the Same Legal Theory Confederate States Used to Secede  —  Gov. Greg Abbott says the federal government has “broken the compact between the United States and the States” with its immigration policies. … A clash between Texas and the Biden administration … ",
    "url": "https://www.thedailybeast.com/texas-border-stunt-is-based-on-a-confederate-legal-theory"
  },
  {
    "text": "Negotiators Close In on Hostage Deal That Would Halt Fighting in Gaza for Weeks  —  A written draft agreement calls for the phased release of captives held by Hamas in exchange for a cessation in Israel's military offensive for about two months.  —  American-led negotiators are edging closer … ",
    "url": "https://www.nytimes.com/2024/01/27/us/politics/hostage-deal-cease-fire-hamas-gaza.html"
  }
]