[
  {
    "text": "Maybe Stealing Womens' Rights Wasn't the Best Election Plan  —  Abortion initiatives have gone seven for seven at the ballot box since the Supreme Court killed Roe.  Democrats are pressing the advantage  —  It's abortion, stupid.  —  Across the country on Tuesday night … ",
    "url": "https://www.rollingstone.com/politics/politics-features/abortion-wins-big-kentucky-ohio-virginia-2023-elections-1234872518/"
  },
  {
    "text": "Fox & Friends Blast Governor Glenn Youngkin's ‘Epic Failure’ in Virginia Election One Day After Going ALL IN On Him  —  One day after featuring Governor Glenn Youngkin and co-hosting Tuesday's show from Manassas, Virginia, Fox & Friends piled on following Tuesday's election results.",
    "url": "https://www.mediaite.com/tv/fox-friends-blast-governor-glenn-youngkins-epic-failure-in-virginia-election-one-day-after-going-all-in-on-him/"
  },
  {
    "text": "GOP strategists urge congressional candidates to campaign against a national abortion ban  —  Disturbed by tough election losses on Tuesday, Republicans say the party needs to make clear to voters, in speeches and TV ads, that it doesn't favor banning all abortions.",
    "url": "https://www.nbcnews.com/politics/congress/republicans-urge-congress-candidates-oppose-national-abortion-ban-rcna124253"
  },
  {
    "text": "Three Arrested for Operating High-End Brothel Network  —  For Immediate Release  —  U.S. Attorney's Office, District of Massachusetts  —  Interested sex buyers were allegedly required to provide employer information and references before booking appointments",
    "url": "https://www.justice.gov/usao-ma/pr/three-arrested-operating-high-end-brothel-network"
  },
  {
    "text": "DOJ announces arrests in ‘high-end brothel network’ used by elected officials, military officers and others  —  Three individuals have been arrested on charges of operating a “high-end brothel network” in Massachusetts and Virginia with a clientele that included elected officials … ",
    "url": "https://www.cnn.com/2023/11/08/politics/high-end-brothel-network-arrests/"
  },
  {
    "text": "Feds charge 3 with running high-end brothels allegedly frequented by politicians  —  Brothels were allegedly located in Fairfax and Tysons, Va.  —  The Justice Department said Wednesday it is investigating politicians, military officers and government contractors for buying sex through … ",
    "url": "https://www.politico.com/news/2023/11/08/feds-brothel-investigation-politicians-00126153"
  },
  {
    "text": "Republican debate: Haley calls Ramaswamy ‘scum’ in dustup over TikTok  —  Former U.N. Ambassador Nikki Haley and entrepreneur Vivek Ramaswamy swung at each other during the third Republican primary presidential debate over their use of TikTok, with Haley calling her opponent scum.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/republican-debate-haley-calls-ramaswamy-scum-dustup-tiktok"
  },
  {
    "text": "Fatalism creeps in around DeSantis  —  In the shadow of polls showing DeSantis hasn't cut into former Trump's lead at the national level or in early state contests, there is a sense of growing fatalism around the Florida governor.  —  “It feels like in July I'll be wearing a f—",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/third-republican-debate-live-updates-rcna121790/rcrd24990?canonicalCard=true"
  },
  {
    "text": "SAG-AFTRA committee approves deal with studios to end historic strike  —  SAG-AFTRA's negotiating committee has approved a tentative deal with the major studios that would end a nearly four month-long strike that has sidelined thousands of workers.  —  “In a unanimous vote this afternoon … ",
    "url": "https://www.latimes.com/entertainment-arts/business/story/2023-11-08/actors-strike-sag-aftra-amptp-contract-deal-ai-streaming"
  },
  {
    "text": "Behind Hamas's Bloody Gambit to Create a ‘Permanent’ State of War  —  Hamas leaders say they waged their Oct. 7 attack on Israel because they believed the Palestinian cause was slipping away, and that only violence could revive it.  —  Thousands have been killed in Gaza, with entire families wiped out.",
    "url": "https://www.nytimes.com/2023/11/08/world/middleeast/hamas-israel-gaza-war.html"
  },
  {
    "text": "U.S. officials pick Greenbelt, Md., for new FBI national headquarters  —  Prince George's suburb selected despite concerns from FBI leaders over the decision-making process, a person familiar with the situation said  —  Federal officials have decided the FBI will leave its iconic … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/11/08/fbi-headquarters-chosen-greenbelt/"
  },
  {
    "text": "Ramaswamy calls Zelensky a ‘Nazi’ at GOP debate  —  Presidential candidate Vivek Ramaswamy described Ukrainian President Volodymyr Zelensky as a “Nazi” during the GOP debate Wednesday, during remarks in which he also called the Ukrainian government “undemocratic.”  —  “Ukraine is not a paragon of democracy,” Ramaswamy said.",
    "url": "https://thehill.com/homenews/campaign/4300935-ramaswamy-calls-zelensky-a-nazi/"
  },
  {
    "text": "Comer Issues Subpoenas to Biden Family & Associates  —  WASHINGTON—House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) today issued subpoenas to President Joe Biden's son, Hunter Biden, brother, James Biden, and Biden family associate, Rob Walker, to appear for depositions.",
    "url": "https://oversight.house.gov/release/comer-issues-subpoenas-to-biden-family-associates%EF%BF%BC/"
  },
  {
    "text": "Emotions are running high at the White House as some aides' frustration with Israel is growing  —  Washington and Tokyo CNN  —  Angst, unease and outrage are spreading through corners of the Biden administration as Israeli forces show no signs of letting up their relentless attacks inside Gaza … ",
    "url": "https://www.cnn.com/2023/11/08/politics/biden-administration-israel-hamas-war/"
  },
  {
    "text": "Ronna McDaniel believes Americans can reach ‘consensus’ on abortion  —  NBC News' Craig Melvin spoke to Republican National Committee chairwoman Ronna McDaniel ahead of the third Republican presidential debate and asked about how her party could approach abortion issues in 2024.",
    "url": "https://www.nbcnews.com/video/ronna-mcdaniel-discusses-gop-approach-to-abortion-in-2024-197416005798"
  },
  {
    "text": "Jim Jordan Sniffs Dick Pics While Rome Burns  —  Yesterday, David Weiss, the US Attorney turned Special Counsel leading an investigation into Hunter Biden that has entered a sixth year, testified to the House Judiciary Committee.  —  His written statement debunked Gary Shapley's claims … ",
    "url": "https://www.emptywheel.net/2023/11/08/jim-jordan-sniffs-dick-pics-while-rome-burns/"
  },
  {
    "text": "Mississippi's Election Day Voting Failures Simply Should Not Be Happening in 2023  —  Polling places ran out of ballots in heavily Black communities.  This is unacceptable and can't be allowed to happen again. … What happened in Mississippi on election day simply cannot be considered OK in the United States of America in 2023.",
    "url": "https://www.thedailybeast.com/mississippis-election-day-voting-failures-shouldnt-be-happening-in-2023"
  },
  {
    "text": "Ten Members and Associates of the Gambino Crime Family Arrested in Coordinated U.S.-Italian Takedown  —  For Immediate Release  —  U.S. Attorney's Office, Eastern District of New York  —  Defendants Charged in Brooklyn Federal Court with Racketeering Conspiracy Involving Violent Extortions, Assaults, Arson, and Union-Related Crimes",
    "url": "https://www.justice.gov/usao-edny/pr/ten-members-and-associates-gambino-crime-family-arrested-coordinated-us-italian"
  },
  {
    "text": "County flips and statewide shifts: Here are the numbers behind Kentucky Gov. Andy Beshear's reelection victory  —  Kentucky Gov. Andy Beshear won a second term Tuesday by a comfortable margin, as the incumbent Democrat defeated Republican Attorney General Daniel Cameron by roughly five percentage points and 67,174 votes.",
    "url": "https://www.lpm.org/news/2023-11-08/county-flips-and-statewide-shifts-here-are-the-numbers-behind-kentucky-gov-andy-beshears-reelection-victory"
  },
  {
    "text": "'I'm calling from Israeli intelligence.  We have the order to bomb.  You have two hours'  —  The call to Mahmoud Shaheen came at dawn.  —  It was Thursday 19 October at about 06:30, and Israel had been bombing Gaza for 12 days straight.  —  He'd been in his third-floor … ",
    "url": "https://www.bbc.com/news/world-middle-east-67327079"
  },
  {
    "text": "Minnesota Supreme Court dismisses effort to block Trump from state's primary ballot  —  A group of voters have been trying to ban Trump from the 2024 GOP primary and general election ballots based on 14th Amendment grounds.  —  The Minnesota Supreme Court on Wednesday dismissed an effort … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/minnesota-supreme-court-dismisses-effort-block-trump-states-primary-ba-rcna124291"
  }
]