[
  {
    "text": "As the World Smolders, the New Speaker Trolls Biden  —  It didn't take long for the new House speaker, Mike Johnson, to demonstrate to the world that he will not be a serious partner for American allies or for those who still believe that governing is not a petty little game.",
    "url": "https://www.nytimes.com/2023/11/01/opinion/mike-johnson-israel-ukraine.html"
  },
  {
    "text": "White House Warns Biden Would Veto House GOP Standalone Israel Funding Bill  —  House Speaker Mike Johnson's bill is a $14 billion Israel aid package that he says is.  more urgent need than others  —  The White House on Tuesday warned that President Joe Biden would veto a bill … ",
    "url": "https://themessenger.com/politics/white-house-warns-biden-would-veto-house-gop-standalone-israel-funding-bill"
  },
  {
    "text": "Israel strikes Gaza's Jabalya refugee camp  —  An Israeli strike targeting a Hamas commander in the densely populated Jabalya refugee camp in northern Gaza has left catastrophic damage and killed a large number of people, according to eyewitnesses and medics in the enclave.",
    "url": "https://www.cnn.com/2023/10/31/middleeast/jabalya-blast-gaza-intl/"
  },
  {
    "text": "Colleges braced for antisemitism and violence.  It's happening.  —  ‘I had Jewish blood on my hands,’ a Tulane student said after aiding a classmate who was assaulted at a pro-Palestinian rally  —  Recent days have witnessed what Jewish students and watchdog groups describe as a raft of antisemitic incidents on college campuses.",
    "url": "https://www.washingtonpost.com/education/2023/10/31/antisemitism-college-campuses-jewish-hamas-gaza/"
  },
  {
    "text": "Does New Speaker of the House Mike Johnson Have a Bank Account?  —  Speaker Mike Johnson has never listed a bank account on his financial disclosure.  In fact, on his newest disclosure he doesn't list a single asset at all. … Newly elected Speaker of the House Mike Johnson (R-LA) does not have a bank account.",
    "url": "https://www.thedailybeast.com/does-new-speaker-of-the-house-mike-johnson-have-a-bank-account"
  },
  {
    "text": "The GOP voter suppression jamboree comes to North Carolina  —  The state's extreme gerrymander represents the latest Republican effort to secure permanent rule. … Republican policies are not broadly popular.  Rather than alter those policies to win elections, Republicans have chosen to alter elections.",
    "url": "https://www.publicnotice.co/p/north-carolina-gerrymandered-congressional-maps"
  },
  {
    "text": "Democrats launch attack ads against vulnerable Republicans over election of Speaker Johnson  —  EXCLUSIVE — House Democrats are targeting vulnerable Republicans over their decision to elect Mike Johnson (R-LA) as their newest speaker, accusing GOP lawmakers of appointing a “MAGA Republican extremist” … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/democrats-attack-vulnerable-republicans-over-speaker-johnson"
  },
  {
    "text": "New House speaker once partnered with so-called ‘ex-gay’ conversion group  —  Speaker of the House Mike Johnson closely collaborated with a group in the mid-to-late 2000s that promoted “conversion therapy,” a discredited practice that asserted it could change the sexual orientation of gay and lesbian individuals.",
    "url": "https://www.cnn.com/2023/11/01/politics/mike-johnson-kfile-invs/"
  },
  {
    "text": "RFK Jr.'s 2024 bid is a threat to Republicans — and donor data shows it  —  A POLITICO analysis of his donor base reveals a lot about who is powering this unconventional candidate.  —  Robert F. Kennedy Jr. is collecting checks from past Donald Trump donors at a much higher rate … ",
    "url": "https://www.politico.com/news/2023/11/01/rfk-jr-2024-campaign-donors-00124621"
  },
  {
    "text": "Home schooling's rise from fringe to fastest-growing form of education  —  A district-by-district look at home schooling's explosive growth, which a Post analysis finds has far outpaced the rate at private and public schools  —  Home schooling has become — by a wide margin … ",
    "url": "https://www.washingtonpost.com/education/interactive/2023/homeschooling-growth-data-by-district/"
  },
  {
    "text": "The Virginia voter purge  —  Election officials working under Virginia Governor Glenn Youngkin (R) have admitted to removing “nearly 3,400 qualified voters from the state's rolls.”  The Youngkin administration originally discovered the mistake at the beginning of October but grossly underestimated the number of voters affected.",
    "url": "https://popular.info/p/the-virginia-voter-purge"
  },
  {
    "text": "Trump's Allies Want a New Style of Lawyer if He Returns to Power  —  Politically appointed lawyers sometimes frustrated Donald J. Trump's ambitions.  His allies are planning to install more aggressive legal gatekeepers if he regains the White House.  —  Close allies of Donald J. Trump … ",
    "url": "https://www.nytimes.com/2023/11/01/us/politics/trump-2025-lawyers.html"
  },
  {
    "text": "Trump visits secure facility to view evidence in classified documents case: Sources  —  It's Trump's first known review of classified evidence shared by Jack Smith.  —  This image contained in a court filing by the Department of Justice on Aug. 30, 2022, and partially redacted by the source … ",
    "url": "https://abcnews.go.com/US/trump-scheduled-visit-secure-facility-view-evidence-classified/story?id=104515489"
  },
  {
    "text": "Powerful Granger not running again for Congress, sources say  —  U.S. Rep. Kay Granger, R-Fort Worth, won't run for reelection, five well-placed sources who know the longtime congresswoman's plans told the Fort Worth Report and KERA News.  —  “I think she's tired,” said one source.",
    "url": "https://fortworthreport.org/2023/10/31/powerful-granger-not-running-again-for-congress-sources-say/"
  },
  {
    "text": "Some Hamas killers were high on amphetamine, officials say  —  The Scoop  —  Some of the Hamas militants who attacked southern Israel on October 7 were fueled by a synthetic amphetamine called Captagon, which U.S. and Israeli officials believe was used to suppress fear and anxiety during … ",
    "url": "https://www.semafor.com/article/10/31/2023/hamas-killers-were-high-on-amphetamine-officials-say"
  },
  {
    "text": "Christian Nationalism ‘Is No Longer Operating Beneath the Surface’  —  Mike Johnson is the first person to become speaker of the House who can be fairly described as a Christian nationalist, a major development in America history in and of itself.  Equally important, however … ",
    "url": "https://www.nytimes.com/2023/11/01/opinion/mike-johnson-christian-nationalism-speaker.html"
  },
  {
    "text": "Home Sellers Win $1.8 Billion as Jury Finds Realtors Inflated Commissions  —  Future homebuyers could be paying smaller commissions following the decision by a federal jury in Missouri  —  In a verdict that's roiling the real estate world, an eight-person jury in a federal Missouri court found … ",
    "url": "https://themessenger.com/business/realtors-found-liable-for-1-8-billion-for-keeping-commissions-artificially-high"
  },
  {
    "text": "House Ethics says update on Santos investigation coming as possible expulsion vote looms  —  Washington — The House Ethics Committee said Tuesday it will announce its “next course of action” in its investigation into embattled Rep. George Santos by Nov. 17.",
    "url": "https://www.cbsnews.com/news/george-santos-house-ethics-committee-investigation-update/"
  }
]