[
  {
    "text": "Biden's family starts discussing his exit plan from the 2024 race  —  The president's family members have discussed how he would want to end his re-election bid on his own timing and with a carefully calculated plan in place.  —  WASHINGTON — Members of President Joe Biden's family … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/bidens-family-starts-discussing-exit-plan-2024-race-rcna162658"
  },
  {
    "text": "Rep. Sean Casten: It's time for Joe Biden to pass the torch  —  Our country faces an existential threat this November.  —  On the one hand, we have Joe Biden.  A man who passed the biggest climate and infrastructure bills in our nation's history; expanded NATO; has overseen record-breaking economic growth … ",
    "url": "https://www.chicagotribune.com/2024/07/19/opinion-joe-biden-presidential-candidacy-pass-the-torch/"
  },
  {
    "text": "Why the big boot-Biden House Dem wave isn't here yet  —  With assists from POLITICO's Congress team  —  In the last 24 hours, Chuck Schumer, Nancy Pelosi and, now, Barack Obama, have essentially given political cover to any congressional Democrat who wishes to speak out against Joe Biden.",
    "url": "https://www.politico.com/newsletters/inside-congress/2024/07/18/why-the-big-boot-biden-house-dem-wave-isnt-here-yet-00169487"
  },
  {
    "text": "Top Biden ally says president is weighing options for November  —  Sen. Chris Coons said Biden is “weighing ... who is the best candidate to win in November.”  —  One of the national co-chairs of President Joe Biden's reelection campaign acknowledged Friday that the president is evaluating … ",
    "url": "https://www.politico.com/news/2024/07/19/top-biden-ally-options-november-00169789"
  },
  {
    "text": "This Crew Is Totally Beatable  —  At the climax of the Republican National Convention last night, former President Donald Trump's nomination-acceptance speech was a disheveled mess, endless and boring.  He spoke for 93 minutes, the longest such speech on record.",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/donald-trump-republican-party-nomineee/679109/"
  },
  {
    "text": "Excruciating!  Trump's Endlessly Long, Wildly Dishonest RNC Speech  —  Donald Trump briefly tried a “new tone” — before pivoting to Hannibal Lecter, “crazy” Pelosi, insurrection lies and more of his greatest hits.  —  LOADING  —  MILWAUKEE — Not four years after Donald Trump's eldest son boasted … ",
    "url": "https://www.huffpost.com/entry/donald-trump-republican-takeover_n_66998a0ae4b047588a4b2aac"
  },
  {
    "text": "Trump tramples unity theme in two-act convention speech … - Inside the Fiserv Forum, the ebullient mood gave way to rapt silence. … - “I stand before you in this arena only by the grace of Almighty God,” he said, echoing a long list of GOP convention speakers who had cited divine intervention for Trump's survival.",
    "url": "https://www.axios.com/2024/07/19/trump-convention-speech-unity-biden"
  },
  {
    "text": "Global cyber outage grounds flights, hits banks, telecoms, media  —  A software update wreaked havoc on computer systems globally on Friday, grounding flights, forcing some broadcasters off air and hitting services from banking to healthcare.  —  An update to a product offered … ",
    "url": "https://www.reuters.com/technology/global-cyber-outage-grounds-flights-hits-media-financial-telecoms-2024-07-19/"
  },
  {
    "text": "Elon Musk's X adds pro-Trump icons for Trump hashtags  —  The move comes after Musk publicly endorsed Trump  —  Over the weekend, Elon Musk made his support for Donald Trump official by publicly endorsing the former-president shortly after Trump was wounded in the ear by a would-be assassin during a campaign rally in Pennsylvania.",
    "url": "https://mashable.com/article/elon-musk-x-twitter-pro-trump-custom-hashtag-icon"
  },
  {
    "text": "The Zeal of a Convert  —  Much of the coverage of JD Vance presents has implied, if not outright stated, that Vance is a hypocrite and opportunist.  How else do you explain someone who denounced Trump in a myriad of ways, and then jumped onto Trump bandwagon when struggling in his primary race?",
    "url": "https://donmoynihan.substack.com/p/the-zeal-of-a-convert"
  },
  {
    "text": "Horny for fascism  —  You ever have one of those days where nothing surprises you but the sheer volume of things not surprising you is kind of overwhelming?  —  Here's Politico reporter Natalie Allison with an extremely unsurprising yet deeply stupid bit of not-journalism:",
    "url": "https://www.findinggravity.net/p/horny-for-fascism"
  },
  {
    "text": "July 18, 2024  —  Paul Manafort walking onto the floor of the Republican National Convention yesterday illustrated that the Republican Party under Trump has become thoroughly corrupted into an authoritarian party aligned with foreign dictators.  —  Manafort first advised and then managed Trump's 2016 campaign.",
    "url": "https://heathercoxrichardson.substack.com/p/july-18-2024"
  },
  {
    "text": "Zuckerberg Calls Trump's Response to Shooting ‘Badass’  —  Meta CEO doesn't endorse Trump or Biden for president  —  Mark Zuckerberg said that former President Donald Trump's immediate reaction after being shot was “badass” and inspiring, and helps explain his appeal to voters.",
    "url": "https://www.bloomberg.com/news/articles/2024-07-19/mark-zuckerberg-calls-donald-trump-badass-without-endorsing-for-president"
  },
  {
    "text": "Rudy Giuliani can't even fall out of bankruptcy right  —  His tumble at the RNC was bad.  His legal problems are even worse. … If Rudy Giuliani simply would've walked into the sunset after his 2008 presidential bid, he'd probably have airports named after him by now.",
    "url": "https://www.publicnotice.co/p/rudy-giuliani-bankruptcy-rnc-2024-moss-freeman"
  },
  {
    "text": "AOC goes live on Instagram saying many who want Joe Biden to drop out of race also want to remove Kamala  —  ‘A lot of them are not just interested in removing the president.  They are interested in removing the whole ticket,’ congresswoman says … Support truly  —  independent journalism",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/alexandria-ocasio-cortez-replace-joe-biden-b2582412.html"
  },
  {
    "text": "Election denialism front and center at Republican national convention  —  Doubts about 2020 and fears of another ‘stolen’ election persist - while Trump has beseeched attendees to ‘protect the vote’  —  The fight for democracy is supported by  —  “Don't fuck us,” Lara Logan, the former CBS News anchor turned to me and said.",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/19/election-denialism-republican-convention"
  }
]