[
  {
    "text": "Haitian nonprofit in Springfield files criminal charges against Donald Trump, JD Vance  —  Affidavit uses state statute allowing private citizens to file charges  —  The leader of the nonprofit Haitian Bridge Alliance filed charges against former president Donald Trump and his running mate … ",
    "url": "https://www.news5cleveland.com/news/local-news/haitian-nonprofit-in-springfield-files-criminal-charges-against-donald-trump-jd-vance"
  },
  {
    "text": "Haitian group in Springfield, Ohio, files citizen criminal charges against Trump and Vance  —  The leader of a nonprofit representing the Haitian community invoked a private-citizen right to file charges Tuesday against former President Donald Trump and his running mate, JD Vance … ",
    "url": "https://apnews.com/article/haitian-immigrants-springfield-charges-trump-vance-012af00a8677da5caed55d03e8779774"
  },
  {
    "text": "Presidential Race Tight in Nevada  —  Generic Vote Tilts Blue  —  Just weeks out from Election Day, the race to the White House is dead heat among Nevada likely voters.  According to recent public opinion polling data from Noble Predictive Insights' (NPI) latest Nevada Public Opinion Pulse … ",
    "url": "https://www.noblepredictiveinsights.com/post/presidential-race-tight-in-nevada"
  },
  {
    "text": "Missouri executes Marcellus Williams despite prosecutors and the victim's family asking that he be spared  —  Marcellus Williams, whose murder conviction was questioned by a prosecutor, died by lethal injection Tuesday evening in Missouri after the US Supreme Court denied a stay.",
    "url": "https://www.cnn.com/2024/09/24/us/marcellus-williams-scheduled-execution-date/"
  },
  {
    "text": "Man charged with attempted assassination of Trump at Florida golf course as case is assigned to Judge Aileen Cannon  —  Prosecutors on Tuesday filed the charge of attempted assassination of a major presidential candidate against Ryan Wesley Routh, the man they say camped outside … ",
    "url": "https://www.cnn.com/2024/09/24/politics/ryan-routh-additional-charges-trump-assassination-attempt/"
  },
  {
    "text": "Aileen Cannon set to oversee apparent Trump assassination attempt case in Florida  —  Ryan Routh has been charged in the case.  —  The federal judge who presided over — and threw out — the criminal classified documents case the Justice Department brought against Donald Trump is now set … ",
    "url": "https://www.politico.com/news/2024/09/24/ryan-routh-aileen-cannon-charged-00180836"
  },
  {
    "text": "Pelosi says CNN shouldn't air Trump remarks on Harris's ‘cognitive problems’: ‘Why would you even cover that?’  —  Rep. Nancy Pelosi (D-Calif.) fired back at Former President Trump, condemning media coverage of his shots at the Vice President during a CNN appearance on Tuesday after he said Harris had … ",
    "url": "https://thehill.com/homenews/4897751-pelosi-cnn-trump-harris-cognitive-problems/"
  },
  {
    "text": "Trump mixes up the name of Charlottesville, Virginia, during his speech in Georgia  —  Donald Trump flubbed the name of Charlottesville, Virginia, while going off script during a speech on Tuesday otherwise focused on economic policy, slamming Vice President Kamala Harris for lying about “Charlottestown.”",
    "url": "https://apnews.com/article/trump-charlottesville-flub-georgia-economic-speech-a9bc57710091fc0194bc072229d146f4"
  },
  {
    "text": "Manchin won't endorse Harris over vow to gut filibuster to codify abortion rights: ‘Shame on her’  —  Vice President Kamala Harris' vow to gut the Senate's filibuster rule to pass a bill codifying abortion rights has cost her an endorsement from a leading Senate moderate: Joe Manchin.",
    "url": "https://www.cnn.com/2024/09/24/politics/joe-manchin-not-endorse-harris-filibuster"
  },
  {
    "text": "Johnson spikes top Democrats' anxiety about a Jan. 6 redux … - House Minority Leader Hakeem Jeffries (D-N.Y.) has been conferring with deputies to prepare for next January's joint session, sources familiar with the discussions told Axios.  — “I've talked to him just generally about preparations … ",
    "url": "https://www.axios.com/2024/09/24/johnson-spikes-top-democrats-anxiety-about-a-jan-6-redux"
  },
  {
    "text": "Special counsel can present ‘substantial’ new evidence against Trump in January 6 case, judge rules  —  Special counsel Jack Smith this week will be allowed to file hundreds of pages of legal arguments and evidence gathered in the 2020 election subversion and January 6 US Capitol attack criminal case … ",
    "url": "https://www.cnn.com/2024/09/24/politics/special-counsel-trump-substantial-evidence"
  },
  {
    "text": "Several states are making late changes to election rules, even as voting is set to begin  —  In Georgia, election workers will have to hand count the number of ballots cast after voting is completed.  In North Carolina, some students and university staff can use their digital IDs to vote.",
    "url": "https://apnews.com/article/election-2024-voting-ballots-certification-state-laws-c6d5a339503771596758a733851bfeae"
  },
  {
    "text": "DOJ sues Visa for monopolizing debit card market … - This case could result in the market being opened up for more players, depending on what remedy DOJ seeks. … - Using that ubiquity as leverage, DOJ claims that Visa effectively forced merchants to send almost all of their payments through its network … ",
    "url": "https://www.axios.com/2024/09/24/visa-antitrust-debit-card-monopoly-lawsuit"
  },
  {
    "text": "The New York Times is washed  —  SFGATE columnist Drew Magary is done with caring about the Times, and you should be, too  —  We're just over a month away from the presidential election and, if you ask the New York Times, the race between Vice President Kamala Harris and former president … ",
    "url": "https://www.sfgate.com/sf-culture/article/new-york-times-washed-19780600.php"
  },
  {
    "text": "Docket Watch: Trump Prosecuted in DC  —  United States of America v. Donald J. Trump  —  On Aug. 1, 2023, a federal grand jury voted to indict former President Donald Trump in connection with the Jan. 6 attack on the U.S. Capitol and his alleged attempts to overturn the results of the 2020 election.",
    "url": "https://www.lawfaremedia.org/current-projects/the-trump-trials/trump-prosecuted-in-the-district-of-columbia/docket-watch-trump-prosecuted-in-dc"
  },
  {
    "text": "Noticias Univision Announces 2024 Townhalls with Former President Donald Trump & Vice President Kamala Harris  —  Presidential Candidates Will Engage with Undecided Hispanic Voters to Discuss Important Issues Facing the Community and Nation  —  Enrique Acevedo to Moderate Townhalls … ",
    "url": "https://corporate.televisaunivision.com/press/2024/09/24/noticias-univision-announces-townhalls-with-former-president-donald-trump-vice-president-kamala-harris/"
  },
  {
    "text": "Judge to approve auctions liquidating Alex Jones' Infowars to help pay Sandy Hook families  —  Conspiracy theorist Alex Jones ' Infowars media platform and its assets will be sold off piece by piece in auctions this fall to help pay the more than $1 billion he owes relatives of victims … ",
    "url": "https://apnews.com/article/alex-jones-infowars-bankruptcy-sandy-hook-shooting-9052caad16dcdfd3bff0697454394d9f"
  },
  {
    "text": "Harris campaign office damaged by gunfire in Arizona  —  No one was present or injured at the office, a state Democratic Party spokesperson said.  Tempe, Arizona, police said they are investigating it as a property crime.  —  TEMPE, Arizona — Tempe, Arizona, police are investigating … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-campaign-office-damaged-gunfire-arizona-rcna172463"
  },
  {
    "text": "Scoop: Senate Democrats prepare Florida and Texas offensives … - But Democrats are signaling they want to expand the playing field and be in a position to steal Republican seats in states like Florida. … - They are also eyeing Texas, where a recent poll has Sen. Ted Cruz (R-Texas) … ",
    "url": "https://www.axios.com/2024/09/25/senate-democrats-florida-rick-scott-mucarsel-powell"
  },
  {
    "text": "Mark Zuckerberg's Political Evolution … It was only a little more than a decade ago that Mark Zuckerberg had few qualms about airing his politics.  —  Earnest and optimistic — perhaps naïvely so — he rushed onto the national stage to discuss issues he cared about: immigration, social justice, inequality, democracy in action.",
    "url": "https://www.nytimes.com/2024/09/24/technology/mark-zuckerberg-trump-politics.html"
  },
  {
    "text": "Teens Say Trump's Former Personal Aide and Project 2025 Higher-Up Made Them Uncomfortable in Chats  —  Two women tell WIRED that when they were 18-year-old college freshmen, John McEntee, a former Trump administration official and co-founder of a Peter Thiel-backed dating app … ",
    "url": "https://www.wired.com/story/teens-john-mcentee-trump-aide-project-2025-chats/"
  },
  {
    "text": "Trump scapegoats migrants again at Georgia event meant to discuss economy  —  Republican nominee spews falsehoods about undocumented immigrants to Savannah crowd's delight  —  At an event intended to tout economic policies that would usher what his campaign calls a “new age of American industrialism” … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/24/election-trump-georgia-rally"
  },
  {
    "text": "Comcast, a Backer of Reproductive Rights, Donates to DeSantis's Anti-Abortion PAC  —  AFTER THE U.S. SUPREME COURT'S DOBBS DECISION in 2022, telecommunications giant Comcast announced it would give employees seeking to terminate a pregnancy as much as $10,000 to travel from states … ",
    "url": "https://www.thebulwark.com/p/comcast-donation-to-desantis-anti-abortion-pac"
  },
  {
    "text": "Trump briefed on “threats from Iran to assassinate him,” his campaign says … - U.S. officials see Iran as the biggest nation-state threat to November's elections. … - “Intelligence officials have identified that these continued and coordinated attacks have heightened in the past few months … ",
    "url": "https://www.axios.com/2024/09/25/trump-iran-assassinate-threats-intelligence-briefing-odi"
  }
]