[
  {
    "text": "Chief Financial Officer Of Multinational Media Company Charged With Participating In Scheme To Launder At Least $67 Million In Fraud Proceeds  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of New York  —  Damian Williams, the United States Attorney for the Southern District … ",
    "url": "https://www.justice.gov/usao-sdny/pr/chief-financial-officer-multinational-media-company-charged-participating-scheme"
  },
  {
    "text": "Feds Indict Far-Right Media Exec in Massive Money Laundering Scheme  —  Bill Guan, the chief financial officer of the far-right Epoch Times, was indicted Monday on charges of allegedly participating in a massive money laundering scheme.  —  The Southern District of New York released a statement saying … ",
    "url": "https://www.mediaite.com/news/just-in-feds-indict-far-right-media-exec-in-massive-money-laundering-scheme/"
  },
  {
    "text": "Feds Accuse Far-Right Newspaper of Being a Money Laundering Operation  —  $67 MILLION!  —  The indictment alleges the conspiracy-fueled paper's massive revenue growth in recent years was tied to the chief financial officer's fraudulent “Make Money Online” team.",
    "url": "https://www.thedailybeast.com/feds-accuse-far-right-newspaper-epoch-times-of-being-a-money-laundering-operation"
  },
  {
    "text": "DOJ Says Epoch Times Newspaper Is an Epic Money-Laundering Operation  —  One of the strangest stories in media over the past decade is the Epoch Times, a formerly free newspaper distributed on the streets of New York that focuses on conspiracist, right-wing takes and reports that are extremely critical of the Chinese Communist Party.",
    "url": "https://nymag.com/intelligencer/article/doj-says-epoch-times-is-an-epic-money-laundering-operation.html"
  },
  {
    "text": "Epoch Times Executive Accused of Laundering $67 Million  —  Weidong Guan was charged with three counts in a scheme that the Justice Department said caused revenue to surge for the company, which has promoted Donald Trump and conspiracy theories.  —  A top executive at The Epoch Times … ",
    "url": "https://www.nytimes.com/2024/06/03/us/politics/epoch-times-money-laundering-doj.html"
  },
  {
    "text": "The ‘big mistake’ Republican senators want to avoid after Trump's conviction  —  On both sides of the Capitol, most Republicans say former President Donald Trump's criminal conviction in New York is politically motivated rather than a substantive case.  And the GOP racked in fundraising after Trump was found guilty.",
    "url": "https://www.politico.com/live-updates/2024/06/03/congress/post-verdict-mistake-gop-hopes-to-avoid-trump-senate-2024-00161353"
  },
  {
    "text": "Trump's Second Term Would Be Even More Corrupt and Vindictive Than His First  —  A truism of the Trump era is that every accusation is a confession.  When Donald Trump hurls wild charges at his opponents, he is telegraphing what he plans to do to them, preemptively justifying the breaking … ",
    "url": "https://www.nytimes.com/2024/06/03/opinion/trumps-weaponized-justice-system.html"
  },
  {
    "text": "Congress braces for “large” boycott, disruptions of Netanyahu speech … - Netanyahu's 2015 speech to Congress, which was a major snub of the Obama administration, was skipped by 58 Democratic lawmakers.  — Many Democrats this year argued against inviting Netanyahu in the first place … ",
    "url": "https://www.axios.com/2024/06/04/democrats-boycott-benjamin-netanyahu-speech-congress"
  },
  {
    "text": "Dems in tight races spurn Biden border event … - The White House invited all Democratic senators to join Biden at an event announcing the new executive actions. … - Some cited scheduling conflicts.  — The Biden order is expected to mirror the bipartisan border deal … ",
    "url": "https://www.axios.com/2024/06/03/dems-in-tight-races-spurn-biden-border-event"
  },
  {
    "text": "Big Media Ignoring the Who What When Why of GOP Apology for Trump's Crimes  —  Even before and especially in the wake of Trump's guilty verdict, members of the MAGAt Party has stumbled over themselves to declare fealty to Donald Trump, and in the process to demean rule of law.  —  Video",
    "url": "https://www.emptywheel.net/2024/06/03/big-media-ignoring-the-who-what-when-why-of-gop-apology-for-trumps-crimes/"
  },
  {
    "text": "‘So totally sketchy’: New report on Trump criminal case witnesses stuns legal experts  —  It isn't unusual for an expert witness to be paid for testimony, but a new report that former President Donald Trump's media company and campaign have delivered major financial benefits to nine witnesses in his criminal trials is raising concerns.",
    "url": "https://www.rawstory.com/trump-payoffs-propublica-analysts/"
  },
  {
    "text": "New York Tosses Rep. Stefanik's Trump Court Complaint in Bank Fraud Civil Suit  —  NY CONFIDENTIAL  —  Stefanik supported the former president by complaining about a judge and his clerk in Trump's bank fraud civil suit.  The Daily Beast can reveal it was rejected as groundless.",
    "url": "https://www.thedailybeast.com/new-york-tosses-rep-stefaniks-trump-court-complaint-in-bank-fraud-civil-suit"
  },
  {
    "text": "Russia Gave Millions to Far-Right Politicians Via Fake News Site: Report  —  ‘VOICE OF EUROPE’  —  Russia gave European far-right politicians large amounts of cash through a propaganda operation intended to sow division on the continent, according to a report.",
    "url": "https://www.thedailybeast.com/russia-gave-millions-to-politicians-via-fake-news-site-voice-of-europe"
  },
  {
    "text": "Fraud trial juror reports getting bag of $120,000 and promise of more if she'll acquit  —  A juror was dismissed Monday after reporting that a woman dropped a bag of $120,000 in cash at her home and offered her more money if she would vote to acquit seven people charged with stealing … ",
    "url": "https://apnews.com/article/minnesota-feeding-our-future-pandemic-fraud-73610b59bb60bf33f2aa06063bb592d2"
  },
  {
    "text": "Trump's appeal hearing on Fani Willis set for October, likely pushing trial past election  —  Trump is appealing the ruling that led DA Fani Willis stay on his election case.  —  Former President Donald Trump attends UFC 302 at Prudential Center on June 1, 2024, in Newark, N.J.",
    "url": "https://abcnews.go.com/Politics/georgia-court-tentatively-sets-donald-trumps-appeal-hearing/story?id=110788890"
  },
  {
    "text": "RFK Jr.'s VP Pick Nicole Shanahan Admits She and Tucker Are ‘on Same Page’  —  BFFS  —  Shanahan's comment is another instance of the supposed “anti-establishment” campaign showing its right-wing ties.  —  Nicole Shanahan, independent presidential candidate Robert F. Kennedy Jr's running mate … ",
    "url": "https://www.thedailybeast.com/rfk-jrs-vp-pick-nicole-shanahan-admits-she-and-tucker-carlson-are-on-same-page"
  },
  {
    "text": "Transcript: Mayor Adams Visits Officers Shot In 115th Precinct And Briefs Media With NYPD Commissioner Caban  —  Deputy Commissioner Tarik Sheppard, Public Information, Police Department: All right, good morning, everybody.  As you know we're here to talk about another senseless shooting of two of our officers this morning.",
    "url": "https://www.nyc.gov/office-of-the-mayor/news/440-24/transcript-mayor-adams-visits-officers-shot-115th-precinct-briefs-media-nypd"
  },
  {
    "text": "Sen. Bob Menendez of New Jersey to seek independent reelection bid amid federal corruption trial  —  U.S. Sen. Bob Menendez, a New Jersey Democrat who is on trial on federal bribery charges in New York, has filed to run as an independent candidate for reelection.",
    "url": "https://apnews.com/article/menendez-new-jersey-independent-bribery-trial-e216825389acdb2c55b634e196f0f083"
  },
  {
    "text": "Michael Cohen's family doxed after Trump guilty verdict in porn star hush money case  —  The latest doxing attempt fits into a pattern of threats against individuals who speak out against former President Donald Trump.  —  WASHINGTON — The addresses and phone numbers of former Trump lawyer … ",
    "url": "https://www.nbcnews.com/politics/2024-election/michael-cohens-family-doxed-trump-guilty-verdict-porn-star-hush-money-rcna155268"
  },
  {
    "text": "Animal Breeder Pleads Guilty to Animal Welfare and Pollution Crimes and Will Pay More than $35M, Including Record Fine in an Animal Welfare Case  —  For Immediate Release  —  In 2022, Justice Department Secured Surrender of Over 4,000 Beagles from Envigo's Cumberland, Virginia, Facility",
    "url": "https://www.justice.gov/opa/pr/animal-breeder-pleads-guilty-animal-welfare-and-pollution-crimes-and-will-pay-more-35m"
  },
  {
    "text": "Louisiana lawmakers approve surgical castration option for those guilty of sex crimes against kids  —  Louisiana judges could order surgical castration for people convicted of sex crimes against young children under legislation approved Monday, and if Republican Gov. Jeff Landry signs it into law … ",
    "url": "https://apnews.com/article/louisiana-surgical-castration-sex-crime-offender-234cdd9da804382d90dec409756dc445"
  },
  {
    "text": "The Texas Republican Party has gone off the deep end  —  Even before the release of an outrageous new platform, the party had become an embarrassment to itself.  —  Looking for something really hair-raising to read?  Check out the 50-page platform that was just adopted by the Texas Republican Party.",
    "url": "https://www.washingtonpost.com/opinions/2024/06/03/texas-republican-party-new-platform/"
  },
  {
    "text": "Trump's Most Audacious Lie Yet  —  When someone lies as prodigiously as Donald Trump—The Washington Post stopped counting at more than 30,000, around the time he left office—handing out superlatives is challenging.  Even so, the former president might have told his most audacious lie yet this weekend.",
    "url": "https://www.theatlantic.com/politics/archive/2024/06/trump-most-audacious-lie/678583/"
  }
]