[
  {
    "text": "A Polling Risk for Trump  —  His advantage may not be as stable as it looks.  —  The polls have shown Donald Trump with an edge for eight straight months, but there's a sign his advantage might not be quite as stable as it looks: His lead is built on gains among voters who aren't paying close attention … ",
    "url": "https://www.nytimes.com/2024/05/24/briefing/a-polling-risk-for-trump.html"
  },
  {
    "text": "Robert De Niro Narrates an Anti-Trump Ad for Biden  —  The ad uses the actor's distinctive voice to try to remind voters of the chaos of Donald Trump's presidency and warn them about a second Trump term.  —  President Biden's campaign released a new ad on Friday narrated by the actor Robert De Niro … ",
    "url": "https://www.nytimes.com/2024/05/24/us/politics/robert-deniro-trump-biden-ad.html"
  },
  {
    "text": "Trump Pressures Republicans to Pass a Law to Keep Him Out of Jail Forever  —  The former president is convinced state prosecutors will target him again after a second term, and wants the GOP to solve that problem for him  —  Donald Trump likes to tell anyone who will listen … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-republicans-pass-law-jail-1235027139/"
  },
  {
    "text": "Scoop: Blackstone's Steve Schwarzman backs Trump … Schwarzman, a billionaire and lifelong moderate Republican, was one of Trump's most visible business supporters when he was in the White House.  — But ahead of this year's GOP primaries, Schwarzman called for “a new generation of leaders.”",
    "url": "https://www.axios.com/2024/05/24/trump-2024-stephen-schwarzman-blackstone"
  },
  {
    "text": "Trump's fascist talk is what's ‘poisoning the blood of our country’  —  No, Trump isn't Hitler.  But his copycat words lead nowhere good.  —  As you've probably heard, Donald Trump has once again raised a führer.  —  The former president's Truth Social account posted a video posing the question … ",
    "url": "https://www.washingtonpost.com/opinions/2024/05/24/trump-fascist-rhetoric-reich-policy/"
  },
  {
    "text": "What If Trump Is Right About America?  —  1. Donny from the Bronx  —  One of the Trump campaign's beliefs about 2024 is that the the former president's criminal indictments will help him with black voters.  The theory is, since Trump is an (alleged) criminal, many black people who are also criminals(?), will begin to support him.",
    "url": "https://www.thebulwark.com/p/what-if-trump-is-right-about-america"
  },
  {
    "text": "Even Donald Trump has trouble getting New York's attention  —  The former president came to the Bronx on Thursday night for an unusual campaign rally.  The Bronx didn't take much notice.  —  NEW YORK — You could hear Donald Trump sporadically through the trees.",
    "url": "https://www.washingtonpost.com/politics/2024/05/24/even-donald-trump-has-trouble-getting-new-yorks-attention/"
  },
  {
    "text": "‘Sedition Panda’ convicted of assaulting officer on Jan. 6 after judge calls defense argument ‘absurd’  —  Jesse James Rumson, dubbed “Sedition Panda” because of the costume head he wore on Jan. 6, will be sentenced in September.  —  WASHINGTON — A Jan. 6 rioter dubbed “Sedition Panda” … ",
    "url": "https://www.nbcnews.com/politics/justice-department/sedition-panda-convicted-assaulting-officer-jan-6-judge-calls-defense-rcna153920"
  },
  {
    "text": "Trump's Apparent VP Contender Proudly Flies Jan. 6-Linked Flag  —  IN A FLUTTER  —  Tom Cotton is showing his true colors.  —  Sen. Tom Cotton (R-AR), who is reportedly a top contender for Donald Trump's vice presidential pick, has jumped on the bandwagon of flying the Christian nationalist “Appeal To Heaven” flag.",
    "url": "https://www.thedailybeast.com/trumps-apparent-vp-contender-tom-cotton-proudly-flies-jan-6-linked-flag"
  },
  {
    "text": "U.S. Announces $275 Million Weapons Package To Ukraine Amid Calls To Loosen Limits  —  Ukraine wants a green light to strike inside Russia with American weapons.  So do some key members of Congress.  —  LOADING  —  The Pentagon announced a $275 million package of weaponry for Ukraine … ",
    "url": "https://www.huffpost.com/entry/us-announces-military-aid-package-ukraine_n_6650fd08e4b07f5ea74825d2"
  },
  {
    "text": "Republican Rep's Daughter and Son-in-Law Killed in Haiti Gang Attack  —  ‘MY HEART IS BROKEN’  —  “I've never felt this kind of pain,” Ben Baker wrote on Facebook on Friday.  —  Missouri state Rep. Ben Baker said Friday that his “heart is broken in a thousand pieces” … ",
    "url": "https://www.thedailybeast.com/missouri-state-rep-ben-bakers-daughter-son-in-law-killed-in-haiti"
  },
  {
    "text": "Defense Secretary Lloyd Austin to undergo surgery … - “The Secretary has determined he will be temporarily unable to perform his functions and duties during the procedure,” Pentagon spokesperson Maj. Gen. Pat Ryder said in a statement, adding that Deputy Secretary of Defense Kathleen Hicks will assume his post.",
    "url": "https://www.axios.com/2024/05/24/lloyd-austin-surgery-bladder-walter-reed"
  },
  {
    "text": "Exclusive: Putin wants Ukraine ceasefire on current frontlines  —  Russian President Vladimir Putin is ready to halt the war in Ukraine with a negotiated ceasefire that recognises the current battlefield lines, four Russian sources told Reuters, saying he is prepared to fight on if Kyiv and the West do not respond.",
    "url": "https://www.reuters.com/world/europe/putin-wants-ukraine-ceasefire-current-frontlines-sources-say-2024-05-24/"
  },
  {
    "text": "They brick you because they can (permalink)  —  In “The Scorpion and the Frog,” a trusting frog gives a scorpion a ride across a brook, only to be stung to death by his passenger upon arrival.  The dying frog gasps “why?” and the scorpion replies, “I am sorry, but I couldn't resist the urge.",
    "url": "https://pluralistic.net/2024/05/24/record-scratch/#autoenshittification"
  },
  {
    "text": "Jailed Trump Adviser Peter Navarro Says He Doesn't Want a Pardon: ‘I Have No Regrets’  —  From a federal prison, former aide plots new MAGA agenda  —  Peter Navarro, a former top White House adviser to Donald Trump, isn't interested in a pardon should “the boss” return to power.",
    "url": "https://www.wsj.com/politics/policy/peter-navarro-pardon-donald-trump-presidency-2024-56ec0426"
  },
  {
    "text": "As ‘The Apprentice’ Seeks Cannes Sale, Trump Team Sends Cease and Desist Letter to Block Film's Release (EXCLUSIVE)  —  Attorneys for Donald Trump have sent a cease and desist letter to the filmmakers behind “The Apprentice” in an effort to block its U.S. sale and release.",
    "url": "https://variety.com/2024/film/news/apprentice-donald-trump-team-cease-and-desist-letter-sebastian-stan-jeremy-strong-1236015819/"
  },
  {
    "text": "Israel ordered to immediately halt Rafah offensive by top U.N. court  —  Israel is unlikely to comply with the order, which the International Court of Justice has no power to enforce, but the landmark ruling will pile pressure on the increasingly isolated U.S. ally.",
    "url": "https://www.nbcnews.com/news/world/israel-halt-rafah-offensive-international-court-of-justice-ruling-rcna153867"
  },
  {
    "text": "At least 66 members of far-right group in rural Oregon standing for office  —  Revealed: anti-government People's Rights Network, founded by Ammon Bundy, appearing to follow ‘entryism’ strategy  —  At least 66 members of an anti-government group founded by far-right militia figure Ammon Bundy … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/24/people-rights-network-oregon-elections"
  },
  {
    "text": "Elon Musk Ramps Up Anti-Biden Posts on X  —  The billionaire owner of X has increasingly been using his social media platform to criticize President Biden for his health and immigration policies, according to a New York Times analysis.  —  Last month, Elon Musk posted on X that President Biden “obviously barely knows what's going on.”",
    "url": "https://www.nytimes.com/2024/05/24/technology/elon-musk-x-biden.html"
  }
]