[
  {
    "text": "Read: Historians rank Trump as worst president … - Lincoln.  — F.D. Roosevelt.  — Washington.  — T. Roosevelt.  — Jefferson.  — Truman.  — Obama.  — Eisenhower.  — L.B. Johnson.  — Kennedy.",
    "url": "https://www.axios.com/2024/02/19/presidents-survey-trump-ranks-last-biden-14th"
  },
  {
    "text": "Trump's Final Hours in Office Were Consumed With Fury at Snoop Dogg  —  Trump's rage at Snoop Dogg created “chaos” in his administration's last moments — and nearly killed clemency for Harry-O … The source of the then-outgoing president's anger had nothing to do with his failed attempts … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trumps-snoop-dogg-pardon-final-hours-president-1234969914/"
  },
  {
    "text": "Biden's reset moment … Officials close to him, needing a repeat triumph, will spend hours on everything from the text to his physical preparation to exploit the prime-time moment.  — “Everyone around him is well aware — well aware — of the need to jack this campaign up,” a source close to Biden said.",
    "url": "https://www.axios.com/2024/02/19/biden-trump-age-state-union-election"
  },
  {
    "text": "It's time for the White House to put up or shut up  —  If you'd asked me a year ago, I would have told you that Joe Biden was a reasonably clear favorite in the event of a rematch against Donald Trump.  —  Not an overwhelming favorite, mind you.  But perhaps a 65:35 favorite.",
    "url": "https://www.natesilver.net/p/its-time-for-the-white-house-to-put"
  },
  {
    "text": "Trump Must Pay Half a Billion Dollars Before He Can Appeal New York Decision  —  Former President Donald Trump must pay nearly half a billion dollars as a bond to New York State before he can appeal the ruling by Judge Arthur Engoron last week that he must pay $354 million in fines — over $450 million, with interest — for fraud.",
    "url": "https://www.breitbart.com/politics/2024/02/19/trump-must-pay-half-a-billion-dollars-before-he-can-appeal-new-york-decision/"
  },
  {
    "text": "Measles erupts in Florida school where 11% of kids are unvaccinated  —  Over 100 children at the school are susceptible to virus.  —  Florida health officials on Sunday announced an investigation into a cluster of measles cases at an elementary school in the Fort Lauderdale area with a low vaccination rate … ",
    "url": "https://arstechnica.com/science/2024/02/measles-erupts-in-florida-school-where-11-of-kids-are-unvaccinated/"
  },
  {
    "text": "New York Times publisher A. G. Sulzberger: “Our industry needs to think bigger”  —  In this exclusive interview, he discusses his role in shaping the paper and preserving its values  —  In early January 1996 journalist Kevin McKenna presented the New York Times' first website to three generations … ",
    "url": "https://reutersinstitute.politics.ox.ac.uk/news/new-york-times-publisher-g-sulzberger-our-industry-needs-think-bigger"
  },
  {
    "text": "NYT publisher: White House ‘extremely upset’ on Biden age coverage  —  “We are going to continue to report fully and fairly,” A.G. Sulzberger said.  —  The New York Times Publisher A.G. Sulzberger said Monday that the White House is “extremely upset” about its coverage on President Joe Biden's age … ",
    "url": "https://www.politico.com/news/2024/02/19/nyt-white-house-upset-biden-age-coverage-00142098"
  },
  {
    "text": "Wisconsin governor signs new state legislative maps into law, ending a GOP gerrymander  —  The new lines will all but certainly loosen Republicans' grip on power in the swing state's government after more than a decade of dominance.  —  Wisconsin Democratic Gov. Tony Evers on Monday signed … ",
    "url": "https://www.nbcnews.com/politics/elections/wisconsin-new-state-legislative-maps-rcna139477"
  },
  {
    "text": "Pelosi: Trump comments on Navalny's death ‘beneath the dignity of a human being’  —  Former Speaker Nancy Pelosi (D-Calif.) went after former President Trump on Monday for his response to the death of Russian opposition leader Alexei Navalny, calling Trump's comments “'beneath the dignity of a human being.”",
    "url": "https://thehill.com/homenews/campaign/4477550-pelosi-trump-comments-on-navalnys-death-beneath-the-dignity-of-a-human-being/"
  },
  {
    "text": "John Oliver Offers Supreme Court Justice Clarence Thomas $1 Million a Year to Resign  —  John Oliver made Justice Clarence Thomas an offer too good to refuse, but he has 30 days to take a cool million a year — plus a sweet bus — or it goes away.  —  Oliver made the stunning offer at the end … ",
    "url": "https://www.mediaite.com/tv/john-oliver-offers-supreme-court-justice-clarence-thomas-1-million-a-year-to-resign/"
  },
  {
    "text": "Trump musical about ex-wives, Stormy Daniels debuts in New York  —  A parody musical centered on former President Trump and some of the well-known women in his life is hitting the off-Broadway stage in New York City this month.  —  The musical, titled “Five: The Parody Musical,” … ",
    "url": "https://thehill.com/blogs/in-the-know/4477302-trump-musical-five-ex-wives-stormy-daniels-ivanka-melania-debuts-new-york/"
  },
  {
    "text": "Trump allies prepare to infuse ‘Christian nationalism’ in second administration  —  Spearheading the effort is Russell Vought, president of The Center for Renewing America, part of a conservative consortium preparing for Trump's return to power.  —  Russell Vought is president of The Center … ",
    "url": "https://www.politico.com/news/2024/02/20/donald-trump-allies-christian-nationalism-00142086"
  },
  {
    "text": "The 17th-Century Heretic We Could Really Use Now  —  The Enlightenment philosopher Baruch Spinoza almost died for his ideals one day in 1672.  —  Spinoza, a Sephardic Jew born in Amsterdam in 1632, was a passionate and outspoken defender of freedom, tolerance and moderation.",
    "url": "https://www.nytimes.com/2024/02/20/opinion/baruch-spinoza-free-thought.html"
  },
  {
    "text": "White House is distributing $5.8B from the infrastructure law for water projects  —  The Biden administration says it is distributing another $5.8 billion for water infrastructure projects around the country, paid for by one of its key legislative victories  —  WASHINGTON — The Biden … ",
    "url": "https://abcnews.go.com/US/wireStory/white-house-distributing-58-billion-infrastructure-law-water-107358948"
  },
  {
    "text": "Bipartisan House members unveil new border, foreign aid proposal  —  It's not yet clear if House GOP leadership would consider the proposal.  —  Representative Brian Fitzpatrick, a Republican from Pennsylvania, pauses while speaking during the American Federation of Government Employees … ",
    "url": "https://abcnews.go.com/Politics/bipartisan-house-members-unveil-new-border-foreign-aid/story?id=107348740"
  }
]