[
  {
    "text": "Judge warns Trump: ‘Inflammatory’ statements about election case could speed trial  —  ‘The more a party makes inflammatory statements about this case ... the greater the urgency will be that we proceed to trial quickly.’  —  U.S. District Judge Tanya Chutkan warned Donald Trump … ",
    "url": "https://www.politico.com/news/2023/08/11/judge-warns-trump-speed-trial-00110870"
  },
  {
    "text": "Judge Limits Trump's Ability to Share Jan. 6 Evidence  —  During a 90-minute hearing in Washington, Judge Tanya S. Chutkan also warned the former president against any attempt to intimidate witnesses or prejudice potential jurors.  —  The federal judge overseeing former President Donald J … ",
    "url": "https://www.nytimes.com/2023/08/11/us/politics/trump-judge-protective-order.html"
  },
  {
    "text": "Judge Chutkan says Trump's right to free speech in January 6 case is ‘not absolute’  —  US District Judge Tanya Chutkan set the tone for how she would preside over the election subversion against Donald Trump in a hearing Friday focused on what limits would be placed on how the former president … ",
    "url": "https://www.cnn.com/2023/08/11/politics/trump-protective-order-chutkan-hearing/"
  },
  {
    "text": "GOP lawmaker warns of ‘civil war’ at fundraiser for indicted Trump electors  —  Michigan state Rep. Matt Maddock (R) warned supporters at a recent fundraiser at his home that a “civil war” would break out or that people would get shot if the government continued to target conservatives … ",
    "url": "https://www.washingtonpost.com/national-security/2023/08/11/michigan-civil-war-gop-fundraiser/"
  },
  {
    "text": "Biden world resigned to a campaign shadowed by Hunter drama  —  The White House was privately frustrated by the appointment of a special counsel.  But Republicans were, too.  —  The appointment on Friday of a special counsel to investigate Hunter Biden likely ensured that the probe of the president's son … ",
    "url": "https://www.politico.com/news/2023/08/11/biden-2024-campaign-hunter-probe-00110923"
  },
  {
    "text": "Police stage ‘chilling’ raid on Marion County newspaper, seizing computers, records and cellphones  —  Eric Meyer, publisher of the Marion County Record, answers questions in his newspaper office Friday after police seized computers, servers, cellphones and other items.",
    "url": "https://kansasreflector.com/2023/08/11/police-stage-chilling-raid-on-marion-county-newspaper-seizing-computers-records-and-cellphones/"
  },
  {
    "text": "FTX's Bankman-Fried headed for jail after judge revokes bail  —  A U.S judge on Friday revoked Sam Bankman-Fried's bail, after finding probable cause that the indicted founder of the bankrupt FTX cryptocurrency exchange tampered with witnesses at least twice.",
    "url": "https://www.reuters.com/legal/ftxs-bankman-fried-seeking-avoid-jail-due-back-court-2023-08-11/"
  },
  {
    "text": "DeSantis Has Law Enforcement Block Iowa Journalist From Event  —  Gov. Ron DeSantis' campaign team today contacted law enforcement in an attempt to prohibit Iowa Starting Line reporters from covering his campaign in the Hawkeye State, according to Shelby County Sheriff's deputies.",
    "url": "https://iowastartingline.com/2023/08/11/desantis-has-law-enforcement-block-iowa-journalist-from-event/"
  },
  {
    "text": "Illinois Supreme Court upholds state's ban on semiautomatic weapons  —  SPRINGFIELD, Ill. — The Illinois Supreme Court has upheld the state's ban on the sale or possession of the type of semiautomatic weapons used in hundreds of mass killings nationally.  —  In a 4-3 decision Friday … ",
    "url": "https://www.usatoday.com/story/news/nation/2023/08/11/illinois-supreme-court-upholds-gun-bans/70576641007/"
  },
  {
    "text": "Judge gives former Tennessee state senator 21-month sentence over campaign finance crime  —  A former Tennessee state senator was given a 21-month prison sentence Friday for violating campaign finance laws.  —  Brian Kelsey, 45, pleaded guilty to concealing the transfer of $91,000 … ",
    "url": "https://www.washingtonexaminer.com/news/tennessee-senator-21-month-sentence-campaign-finance"
  },
  {
    "text": "Growing Segregation by Sex in Israel Raises Fears for Women's Rights  —  Ultra-Orthodox members of Prime Minister Benjamin Netanyahu's far-right coalition want to expand the powers of all-male rabbinical courts, and to bar women and men from mixing in many public arenas.  —  Reporting from Tel Aviv",
    "url": "https://www.nytimes.com/2023/08/12/world/middleeast/israel-women-rights.html"
  },
  {
    "text": "3-year-old migrant child dies on Texas' border bus  —  AUSTIN (KXAN) — A child died on one of the buses that Operation Lone Star has been using to move migrants from the Texas border to other parts of the country, the Texas Division of Emergency Management (TDEM) said Friday.",
    "url": "https://www.kxan.com/news/texas/migrant-child-dies-on-border-bus-in-texas/"
  },
  {
    "text": "Sheriff: Ronny Jackson threatened to ‘beat’ state trooper after being handcuffed at rodeo  —  Aide to ex-White House physician says he wasn't drinking and shouldn't have been detained while trying to help a teen suffering a seizure.  —  Update:  —  8:20 p.m. with response from Jackson.",
    "url": "https://www.dallasnews.com/news/politics/2023/08/11/sheriff-ronny-jackson-threatened-to-beat-state-trooper-after-being-handcuffed-at-rodeo/"
  },
  {
    "text": "Fox's Top Lawyer, Viet Dinh, Will Depart  —  Viet Dinh advised the company through its landmark $787.5 million settlement with Dominion Voting Systems.  —  Fox Corporation's chief legal officer, Viet Dinh, will depart at the end of the year, in a major shake-up at the company … ",
    "url": "https://www.nytimes.com/2023/08/11/business/media/viet-dinh-fox-departing.html"
  },
  {
    "text": "It's Even Worse Than We Thought With Clarence Thomas  —  Every week seems to bring a new, stunning story about the rampant corruption of Justice Clarence Thomas.  ProPublica, which has been at the forefront of reporting on Thomas's misdeeds and scandals, was out yesterday with, yes, another new, stunning story.",
    "url": "https://statuskuo.substack.com/p/its-even-worse-than-we-thought-with"
  },
  {
    "text": "DeSantis torches Trump for refusing to sign GOP candidate pledge: 'You don't take your ball and go home'  —  GOP candidates are required to sign the pledge to be allowed on the debate stage  —  Republican presidential candidate and Florida Gov. Ron DeSantis torched former President Donald Trump … ",
    "url": "https://www.foxnews.com/politics/desantis-torches-trump-refusing-sign-gop-candidate-pledge-dont-take-ball-go-home"
  }
]