[
  {
    "text": "Mike Pence Simplifies the Gag Order Dispute  —  If my Irish Daylight Savings calculation and PACER operations are correct, Donald Trump submitted his reply to DOJ's opposition to a stay on the gag Judge Tanya Chutkan imposed at around 8:50PM ET last night. … The filing includes the kind of sophistry John Lauro excels at.",
    "url": "https://www.emptywheel.net/2023/10/29/mike-pence-simplifies-the-gag-order-dispute/"
  },
  {
    "text": "Judge reinstates Trump gag order in Jan. 6 case  —  The judge overseeing Trump's Jan. 6 case has reinstated a gag order.  —  The judge overseeing former President Donald Trump's Jan. 6 case has reinstated the gag order she imposed over Trump after temporarily halting the limited gag order earlier this month.",
    "url": "https://abcnews.go.com/Politics/judge-reinstates-trump-gag-order-jan-6-case/story?id=104466343"
  },
  {
    "text": "Federal Judge Reinstates Gag Order on Trump in Election Case  —  Judge Tanya Chutkan ruled that her order should stay in effect while the former president's lawyers pursue an appeal.  —  A federal judge reinstated a gag order on former President Donald J. Trump on Sunday that had been temporarily placed … ",
    "url": "https://www.nytimes.com/2023/10/29/us/politics/trump-gag-order-chutkan.html"
  },
  {
    "text": "Trump's Gag Order Reinstated in D.C.  —  A federal judge on Sunday put limits back in place prohibiting statements about prosecutors, defense lawyers, court staff, witnesses or the substance of their testimony  —  A federal judge on Sunday reinstated the gag order in Donald Trump's election … ",
    "url": "https://themessenger.com/politics/trumps-gag-order-reinstated-chutkan-jack-smith-dc"
  },
  {
    "text": "Trump Forgets Which City He Is in During Iowa Campaign Speech  —  WHO?  WHAT?  WHERE?  —  The correct name was eventually whispered into the former president's ear on stage.  —  Though Donald Trump often makes fun of Joe Biden for his old age, Trump himself apparently forgot … ",
    "url": "https://www.thedailybeast.com/trump-forgets-which-city-he-is-in-during-sioux-city-iowa-campaign-speech"
  },
  {
    "text": "Israel's Netanyahu says wasn't shown intel of planned Hamas attack  —  Israeli Prime Minister Benjamin Netanyahu on Sunday took a jab at his intelligence chiefs on the X platform, saying they never warned him Hamas was planning its wide-scale attack on Oct. 7, but later retracted his comments and issued an apology.",
    "url": "https://www.reuters.com/world/middle-east/israels-netanyahu-says-wasnt-shown-intel-planned-hamas-attack-2023-10-29/"
  },
  {
    "text": "After Fury, Netanyahu Deletes, Apologizes for Post Blaming Security Chiefs for Hamas Attack  —  In a post overnight Saturday, Netanyahu asserted that he never received forewarning about Hamas' deadly attack.  He earlier said ‘After the war everyone will have to answer to hard questions...Right now, my task is to save the country’",
    "url": "https://www.haaretz.com/israel-news/2023-10-29/ty-article/after-drawing-fury-netanyahu-deletes-tweet-blaming-security-chiefs-for-hamas-attack/0000018b-7a77-d4a8-a3cf-feff35d20000"
  },
  {
    "text": "Clarence Thomas, his luxury R.V., and his magical mystery disappearing loan  —  A justice who cared about ethics would want to resolve the questions surrounding the loan immediately — particularly if there were an answer.  —  The latest news on Justice Clarence Thomas's disregard for ethics … ",
    "url": "https://www.lawdork.com/p/clarence-thomas-luxury-rv-loan"
  },
  {
    "text": "Russians storm airport in attempt to attack passengers of Israeli flight  —  No Israelis were injured, but about 20 people have been injured and are currently receiving medical treatment, according to local health officials.  —  A swarm of local residents in Makhachkala in the Russian Republic … ",
    "url": "https://www.jpost.com/breaking-news/article-770738"
  },
  {
    "text": "Hundreds storm airport in Russia in antisemitic riot over arrival of plane from Israel  —  Hundreds of people stormed into the main airport in Russia's Dagestan region and onto the landing field Sunday, chanting antisemitic slogans and seeking passengers arriving on a flight from Tel Aviv … ",
    "url": "https://www.cbsnews.com/news/crowd-storms-russian-airport-to-protest-flight-from-israel-antisemitic-riot/"
  },
  {
    "text": "After setback, antiabortion forces struggle before key Ohio vote  —  CINCINNATI — Students hoping to get others to vote “no” on an upcoming Ohio amendment to ensure abortion rights took the soft approach at a recent event at the University of Cincinnati.  —  The signs in their booth were alarmist … ",
    "url": "https://www.washingtonpost.com/nation/2023/10/29/ohio-issue-1-election-abortion/"
  },
  {
    "text": "Tuberville says he will keep blocking military promotions despite Israel's war  —  Republican Sen. Tommy Tuberville, who has held up military promotions for nine months, slammed a proposal being floated to change the chamber's rules to allow a vote on many of the nominations en masse and attacked … ",
    "url": "https://www.cnn.com/2023/10/29/politics/tommy-tuberville-military-nominations-middle-east"
  },
  {
    "text": "“Lord of the Flies”: The House's chaotic next era, explained  —  New House Speaker Mike Johnson faces a long to-do list and a caucus with short patience for compromise.  —  On Wednesday, Congress finally reopened.  After more than three weeks without a speaker, the elevation … ",
    "url": "https://www.vox.com/politics/2023/10/29/23935362/mike-johnson-house-speaker-ukraine-israel-immigration"
  },
  {
    "text": "Erdogan threatens to declare war on Israel and send military to Gaza in chilling warning  —  The Turkish president suggested in a speech at a pro-Palestine rally this afternoon that Turkey can “come at any night unexpectedly”.  —  President Erdogan threatens to get involved in Israel war",
    "url": "https://www.express.co.uk/news/world/1829092/Erdogan-Turkey-Israel-war-Gaza"
  }
]