[
  {
    "text": "Scorched-earth summer: Biden, Sunak and Macron go negative  —  Struggling leaders in America, Britain and France are bombarding their political opponents, some of whom are testing the bounds of the mainstream.  —  Even at a glittering Hollywood fundraiser, President Joe Biden's message was dark.",
    "url": "https://www.politico.com/news/2024/06/20/biden-sunak-macron-scare-attacks-00164106"
  },
  {
    "text": "Trump Tries to Set Expectations, and Floats Excuses, for His Debate With Biden  —  The former president has set a low bar for President Biden's performance at next week's matchup.  Now, he is preparing supporters for the possibility that Mr. Biden clears it.",
    "url": "https://www.nytimes.com/2024/06/19/us/politics/trump-biden-debate-expectations.html"
  },
  {
    "text": "New law requires all Louisiana public school classrooms to display the Ten Commandments  —  Louisiana has become the first state to require that the Ten Commandments be displayed in every public school classroom, the latest move from a GOP-dominated Legislature pushing a conservative agenda under a new governor.",
    "url": "https://apnews.com/article/louisiana-ten-commandments-displayed-classrooms-571a2447906f7bbd5a166d53db005a62"
  },
  {
    "text": "Putin Once Tried to Curb North Korea's Nuclear Program.  That's Now Over.  —  Vladimir Putin promised unspecified technological help to North Korea, which could allow it to advance its nuclear weapons program.  —  阅读.体中文.閱讀.體中文.",
    "url": "https://www.nytimes.com/2024/06/19/us/politics/putin-kim-russia-nuclear.html"
  },
  {
    "text": "Putin, Kim Agree to Immediately Offer Military Aid If Attacked  — Mutual defense deal signed after Putin-Kim talks in Pyongyang  — Pact similar to a 1961 deal signed during the Cold War  —  Russian President Vladimir Putin and North Korean leader Kim Jong Un agreed … ",
    "url": "https://www.bloomberg.com/news/articles/2024-06-20/putin-kim-agree-to-immediately-offer-military-aid-if-attacked"
  },
  {
    "text": "The Supreme Court's approach on ‘history and tradition’ is irking Amy Coney Barrett  —  On a Supreme Court where the conservative supermajority increasingly leans on history as a guide, a dispute may be simmering over how many modern cases can be resolved by looking to the nation's past.",
    "url": "https://www.cnn.com/2024/06/19/politics/amy-coney-barrett-clarence-thomas-originalism"
  },
  {
    "text": "The deceptive Biden G7 video was quickly debunked, but it kept going viral anyway  —  Despite fact-checks online, Big Tech platforms continued to spread a misleading video of President Joe Biden.  —  Misleading videos and false claims that President Joe Biden wandered off aimlessly … ",
    "url": "https://www.nbcnews.com/tech/misinformation/biden-g7-video-joe-cheapfake-kept-going-viral-rcna157591"
  },
  {
    "text": "Washington Post publisher alleged to have advised Boris Johnson to ‘clean up’ phone during Partygate Covid scandal  —  Sources' claim suggests advice by Will Lewis, an informal adviser to then prime minister, contradicted instructions to staff  —  Will Lewis, the Washington Post publisher … ",
    "url": "https://www.theguardian.com/media/article/2024/jun/19/will-lewis-washington-post-publisher-boris-johnson-partygate"
  },
  {
    "text": "Biden's busting budget  —  It has been a while since President Joe Biden claimed his policies have reduced the federal deficit.  The contention has always been false to the point of absurdity.  But the most recent Congressional Budget Office report on the government's fiscal health … ",
    "url": "https://www.washingtonexaminer.com/opinion/3051724/bidens-busting-budget/"
  },
  {
    "text": "ERO Baltimore arrests unlawfully present Salvadoran convicted of sexually assaulting Maryland minor  —  ELLICOTT CITY, Md. — Enforcement and Removal Operations Baltimore apprehended an unlawfully present 39-year-old Salvadoran national convicted of sexually assaulting a minor in Baltimore.",
    "url": "https://www.ice.gov/news/releases/ero-baltimore-arrests-unlawfully-present-salvadoran-convicted-sexually-assaulting"
  },
  {
    "text": "Trump VP Hopeful Calls Biden Administration a ‘Dictatorship’  —  HMM...  “The Democrats seem to have two strategies,” North Dakota Gov. Doug Burgum said.  “One is, ‘be afraid,’ and the second strategy is, ‘be even more afraid.’”  —  North Dakota Gov. Doug Burgum (R) is gunning hard … ",
    "url": "https://www.thedailybeast.com/trump-vp-hopeful-doug-burgum-calls-biden-administration-a-dictatorship"
  },
  {
    "text": "Indiana Republican says US attorney ‘declined’ to prosecute threat against his daughters and wife  —  Rep. Jim Banks, R-Ind., suggests double standard after US attorney declines to prosecute man who made threats  —  Rep. Jim Banks, R-Ind., is questioning why a federal prosecutor declined … ",
    "url": "https://www.foxnews.com/politics/indiana-republican-says-us-attorney-declined-prosecute-threat-against-his-daughters-wife?intcmp=tw_fnc"
  },
  {
    "text": "How the NFL's ‘Worst-Ever’ Owner is Blocking Movie Showing ‘Rapist’ Trump  —  OF COURSE HE IS  —  Former Washington Commanders owner Dan Snyder might be able to stop “The Apprentice” from hitting screens thanks to a bizarre twist: He helped finance the movie.",
    "url": "https://www.thedailybeast.com/how-dan-snyder-is-trying-to-block-trump-biopic-the-apprentice-from-theaters"
  },
  {
    "text": "Boeing committed ‘the deadliest corporate crime in US history’ and should be fined $24 billion, victims' families say  —  New York CNN  —  Families that lost loved ones in two Boeing 737 Max crashes said on Wednesday that the company committed the “deadliest corporate crime in US history” … ",
    "url": "https://www.cnn.com/2024/06/19/business/boeing-families-lawsuit/"
  },
  {
    "text": "Stonehenge covered in powder paint by Just Stop Oil  —  Part of Stonehenge has been covered in orange powder paint by protesters.  —  Two Just Stop Oil campaigners sprayed the powder paint on the historic site near Salisbury, Wiltshire, at about 12:00 BST on Wednesday.",
    "url": "https://www.bbc.com/news/articles/cw44mdee0zzo"
  }
]