[
  {
    "text": "Texas files first lawsuit against out-of-state abortion provider  —  This case sets up a legal battle between Texas' near-total abortion ban and New York's shield law that protects doctors from out-of-state prosecution.  —  Texas Attorney General Ken Paxton has filed a lawsuit accusing … ",
    "url": "https://www.texastribune.org/2024/12/13/texas-paxton-abortion-pill-mail-lawsuit/"
  },
  {
    "text": "Texas Attorney General Sues New York Doctor for Mailing Abortion Pills  —  The lawsuit appeared to be among the first attempts to stop doctors from mailing the medication to states that ban abortions.  —  The Texas attorney general opened a new front in the contentious battle over access … ",
    "url": "https://www.nytimes.com/2024/12/13/us/texas-new-york-abortion-pills-lawsuit.html"
  },
  {
    "text": "Texas' abortion pill lawsuit against New York doctor marks new challenge to interstate telemedicine  —  Texas has sued a New York doctor for prescribing abortion pills to a woman near Dallas, launching one of the first challenges in the U.S. to shield laws that Democrat-controlled states passed … ",
    "url": "https://apnews.com/article/abortion-pills-lawsuit-shield-laws-texas-telemedicine-74c9b7d5c3c152e4c8f199b29132daec"
  },
  {
    "text": "McConnell Defends Polio Vaccine, an Apparent Warning to Kennedy  —  “Efforts to undermine public confidence in proven cures are not just uninformed — they're dangerous,” said the former Republican leader, who is a polio survivor.  —  Senator Mitch McConnell, the former Republican leader … ",
    "url": "https://www.nytimes.com/2024/12/13/us/politics/mcconnell-polio-vaccine-rfk-jr.html?unlocked_article_code=1.hU4.LTJL.KTBX1EbeSUzA&smid=url-share"
  },
  {
    "text": "Polio survivor Mitch McConnell criticizes efforts to undermine vaccine  —  The statement is the first time the Senate minority leader has publicly weighed in on the nomination process beyond acknowledging meeting with some of Trump's picks for his administration.",
    "url": "https://www.washingtonpost.com/politics/2024/12/13/mcconnell-polio-vaccine-trump-cabinet/"
  },
  {
    "text": "Trump to Dine With Apple's Tim Cook at Mar-A-Lago Friday  — Cook skirted tariff threats on Apple in Trump's first term  — President-elect also plans meeting with Amazon's Bezos … Cook and Trump will dine at the president-elect's Mar-a-Lago club in Palm Beach, the people said … ",
    "url": "https://www.bloomberg.com/news/articles/2024-12-14/trump-to-dine-with-apple-s-tim-cook-at-mar-a-lago-friday"
  },
  {
    "text": "Trump says GOP will push to eliminate daylight saving time  —  President-elect Trump on Friday said Republicans would push to eliminate daylight saving time, calling it “inconvenient” and “costly.”  —  “The Republican Party will use its best efforts to eliminate Daylight Saving Time … ",
    "url": "https://thehill.com/homenews/campaign/5039673-trump-gop-daylight-saving-time/"
  },
  {
    "text": "Pelosi Hospitalized in Luxembourg After Falling  —  A person familiar with the incident said the former House speaker, 84, had tripped going down stairs at a palace.  She was taken to a hospital for treatment and evaluation.  —  Former Speaker Nancy Pelosi was hospitalized on Friday … ",
    "url": "https://www.nytimes.com/2024/12/13/us/politics/nancy-pelosi-hospitalized-luxembourg-falling.html?unlocked_article_code=1.hE4.jKTg.9wwGQwbJ_TnY&smid=bs-share"
  },
  {
    "text": "The Memo: Trump revels as establishment figures pay homage at home and abroad  —  The second time's a charm for President-elect Trump — at least when it comes to an election win getting him the establishment recognition he has always sought.  —  Trump has received a display of homage at home … ",
    "url": "https://thehill.com/homenews/5040234-the-memo-trump-revels-as-establishment-figures-pay-homage-at-home-and-abroad/"
  },
  {
    "text": "BBC complains to Apple over misleading shooting headline  —  The BBC has complained to Apple after the tech giant's new iPhone feature generated a false headline about a high-profile murder in the United States.  —  Apple Intelligence, launched in the UK earlier this week, uses artificial intelligence … ",
    "url": "https://www.bbc.com/news/articles/cd0elzk24dno"
  },
  {
    "text": "Patel Distorts Justice Dept. Benghazi Inquiry, Inflating His Role  —  Donald J. Trump's pick to be the next F.B.I. director has both exaggerated his importance in the government's criminal inquiry into the 2012 attack and misleadingly distorted its conduct and results.",
    "url": "https://www.nytimes.com/2024/12/13/us/politics/kash-patel-benghazi-investigation-doj.html"
  },
  {
    "text": "Exclusive: Trump transition wants to scrap crash reporting requirement opposed by Tesla  —  The Trump transition team wants the incoming administration to drop a car-crash reporting requirement opposed by Elon Musk's Tesla (TSLA.O), according to a document seen by Reuters … ",
    "url": "https://www.reuters.com/business/autos-transportation/trump-transition-recommends-scrapping-car-crash-reporting-requirement-opposed-by-2024-12-13/"
  },
  {
    "text": "Vance invites Daniel Penny, acquitted in chokehold death, to Army-Navy game  —  Penny, a former Marine, was asked to accompany President-elect Donald Trump in his suite at the game Saturday.  —  Vice President-elect JD Vance has invited Daniel Penny, a former Marine who was acquitted … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/13/vance-daniel-penny-army-navy-football-trump/"
  },
  {
    "text": "Trump calls for mystery drones to be shot down  —  President-elect Trump on Friday evening called for authorities to shoot down the mysterious drones that have been seen in the skies of New Jersey and around the country.  —  He also suggested the government must know more about the mysterious sightings.",
    "url": "https://thehill.com/homenews/state-watch/5039992-trump-drones-shot-down/"
  },
  {
    "text": "The Week CEOs Bent the Knee to Trump  —  Companies abandoned him after the Jan. 6, 2021, riot.  Now, they are rushing to curry favor with the president-elect as he prepares to return to the White House.  —  When Donald Trump arrived at the New York Stock Exchange this week for a postelection victory lap … ",
    "url": "https://www.wsj.com/politics/policy/donald-trump-ceos-corporate-influence-second-term-df1455f7?st=841ksg&reflink=article_copyURL_share"
  },
  {
    "text": "Bringing Elon to a knife fight  —  DOGE has made it both impossible not to talk about government reform, and impossible to talk about it.  The topic is everywhere, but the subject is now entirely eclipsed on the left by the horror of who has been assigned the task and the need to decry DOGE as a bad faith effort.",
    "url": "https://www.eatingpolicy.com/p/bringing-elon-to-a-knife-fight"
  },
  {
    "text": "Survey: Most voters disapprove of RFK Jr.'s nomination after learning his views  —  Most Americans disapprove of Robert F. Kennedy Jr. potentially leading the Department of Health and Human Services once they hear about his positions and beliefs, according to a survey from Democratic-aligned groups Protect … ",
    "url": "https://thehill.com/policy/healthcare/5039407-rfk-nomination-survey-disapproval/"
  },
  {
    "text": "Donald Trump ‘eyes deal’ to save failing DC Waldorf-Astoria, turn it back into Trump International Hotel  —  President-elect Donald Trump is weighing a bid to save the failing Waldorf-Astoria hotel in Washington, DC - and rebrand it once more as a Trump International Hotel, The Post has learned.",
    "url": "https://nypost.com/2024/12/13/business/donald-trump-eyes-deal-for-waldorf-astoria-dc-hotel/"
  },
  {
    "text": "'I wish I didn't pull that damn fire alarm': Rep. Bowman reflects on his time in Congress, primary loss  —  “I wish I didn't pull that damn fire alarm, you know what I'm saying?”  —  A candid admission by New York Congressman Jamaal Bowman about a moment that made him the butt of jokes … ",
    "url": "https://ny1.com/nyc/all-boroughs/politics/2024/12/13/i-wish-i-didn-t-pull-that-damn-fire-alarm---rep--bowman-reflects-on-time-in-congress--primary-loss"
  },
  {
    "text": "Gillibrand Presses Biden to Amend the Constitution to Enshrine Sex Equality  —  Senator Kirsten Gillibrand of New York is leading the charge for Democrats to persuade President Biden to adopt the Equal Rights Amendment, which would invite a Supreme Court battle.",
    "url": "https://www.nytimes.com/2024/12/13/us/politics/gillibrand-biden-equal-rights-amendment.html"
  },
  {
    "text": "Biden Administration Is Said to Allow California to Ban New Gas-Powered Cars  —  California and 11 other states want to halt the sale of new gas-powered cars by 2035.  President-elect Donald Trump is expected to try to stop them.  —  The Biden administration is expected in the coming days … ",
    "url": "https://www.nytimes.com/2024/12/13/climate/california-ban-gas-cars-electric-biden-trump.html"
  },
  {
    "text": "Assad's final hours in Syria: Deception, despair and flight  —  Bashar al-Assad confided in almost no one about his plans to flee Syria as his reign collapsed.  Instead, aides, officials and even relatives were deceived or kept in the dark, more than a dozen people with knowledge of the events told Reuters.",
    "url": "https://www.reuters.com/world/middle-east/assads-final-hours-syria-deception-despair-flight-2024-12-13/"
  },
  {
    "text": "HFC backs two-pronged reconciliation plan, urges focus on border  —  The House Freedom Caucus is throwing its weight behind a two-step, party-line policy push, with the ultra-conservative bloc calling for an initial bill to address border security that's fully paid for and a second push for tax and other policy priorities.",
    "url": "https://www.politico.com/live-updates/2024/12/13/congress/hfc-backs-two-pronged-reconciliation-plan-00194331"
  }
]