[
  {
    "text": "MAGA Bros Are Freaking Out Because So Many Women Are Voting  —  'IT'S OVER'  —  “Unless this changes, Kamala Harris takes PA and it's over,” tweeted right wing gadfly Mike Cernovich.  —  Two of former president Donald Trump's most prominent backers in the right wing influencer sphere fretted Wednesday … ",
    "url": "https://www.thedailybeast.com/maga-bros-are-freaking-out-because-so-many-women-are-voting/"
  },
  {
    "text": "Conservatives in furor over Julia Roberts ad  —  A new Harris-Walz campaign ad voiced by actor Julia Roberts encourages women to vote for Vice President Harris in the presidential election, even if their husbands are backing former President Trump.  —  The Roberts ad also alludes to abortion rights … ",
    "url": "https://thehill.com/homenews/campaign/4964265-kamala-harris-ad-julia-roberts/"
  },
  {
    "text": "Why are so many women hiding their voting plans from their husbands?  —  A lot of households are not democracies; they're dictatorships.  This may mean voter intimidation and suppression  —  Lots of memes and tweets and posts and videos are popping up, assuring women that they can keep … ",
    "url": "https://www.theguardian.com/commentisfree/2024/oct/31/why-are-so-many-women-hiding-their-voting-plans-from-their-husbands"
  },
  {
    "text": "‘Not healthy and weird’: Fox News host roasted for threatening wife with ‘D-Day’ over vote  —  A Fox News host who threatened his wife with marital “D-Day” if she did not vote for former President Donald Trump faced swift backlash from viewers who swiftly roasted the controversial conservative pundit.",
    "url": "https://www.rawstory.com/jesse-watters-comment-about-harris/"
  },
  {
    "text": "Full transcript: Vice President Kamala Harris interviewed by NBC News' Yamiche Alcindor  —  With just days to go before the 2024 elections, Harris spoke to NBC News on Thursday afternoon ahead of a rally in Phoenix.  —  NBC News' Yamiche Alcindor interviewed Vice President Kamala Harris … ",
    "url": "https://www.nbcnews.com/politics/2024-election/full-transcript-president-kamala-harris-interviewed-nbc-news-yamiche-a-rcna178222"
  },
  {
    "text": "Trump sues CBS for $10B over Harris's ‘60 Minutes’ interview  —  Former President Trump is suing CBS News over a “60 Minutes” interview it broadcast with Vice President Harris earlier this month that he and his allies have claimed was edited to cast her in a positive light.",
    "url": "https://thehill.com/homenews/media/4964816-trump-sues-cbs-news-60-minutes/"
  },
  {
    "text": "Why I'm Voting for Kamala Harris  —  When it comes to the candidates' policy positions and personal integrity, there's a clear choice. … I do not agree with Vice President Kamala Harris on every issue, but earlier this week, I voted for her without hesitation.",
    "url": "https://www.bloomberg.com/opinion/articles/2024-10-31/michael-bloomberg-why-i-m-voting-for-kamala-harris?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczMDM5NTE5MCwiZXhwIjoxNzMwOTk5OTkwLCJhcnRpY2xlSWQiOiJTTThBT0ZEV1gyUFMwMCIsImJjb25uZWN0SWQiOiIyQjUzMzlCNDU0MUM0NkZGOEJGRkVGOEQzNUM3RjAyOCJ9.AVkgjFyIF0zMUucberOGYD4aGf8IIntjrTC0HhwR9q0"
  },
  {
    "text": "The stock market's surprising bet on who will win the presidency  —  Voters are clamoring for any hints of clarity about the neck-and-neck presidential race, so some are looking beyond public opinion polls.  —  Wall Street executives, political gamblers and cryptocurrency traders are piling … ",
    "url": "https://www.politico.com/news/2024/10/31/stock-market-betting-kamala-harris-win-00185818"
  },
  {
    "text": "Scoop: What Trump is being told … The memo, addressed to “TEAM TRUMP,” has the subject line: “PRESIDENT TRUMP IS ON THE VERGE.”  — Fabrizio draws on Real Clear Politics polling averages to argue that Trump's “position nationally and in every single Battleground State is SIGNIFICANTLY better today than it was 4 years ago.”",
    "url": "https://www.axios.com/2024/10/31/trump-2024-election-polls-memo"
  },
  {
    "text": "Video of Donald Trump ‘Struggling’ to Enter Garbage Truck Goes Viral  —  Social media commentators have raised concerns over  —  's health after footage emerged of the  —  presidential candidate climbing into a campaign-branded garbage truck.  —  In Wisconsin on Wednesday, Trump was",
    "url": "https://www.newsweek.com/video-donald-trump-struggling-enter-garbage-truck-goes-viral-1977750"
  },
  {
    "text": "Trump transition official says RFK Jr. wants to force vaccines off the market  —  Howard Lutnick, co-chair of the Trump-Vance transition team, said in a Wednesday interview that former presidential candidate Robert F. Kennedy Jr., who is backing former President Trump, is seeking the federal data … ",
    "url": "https://thehill.com/homenews/campaign/4963677-trump-transition-rfk-jr-vaccines-hhs/"
  },
  {
    "text": "Elon Musk Could Have US Citizenship Revoked If He Lied on Immigration Forms  —  The richest man in the world appears to have worked in the US without authorization.  According to experts, if he did so and lied about it as part of the immigration process, he could be denaturalized.",
    "url": "https://www.wired.com/story/elon-musk-citizenship-revoked-denaturalized/"
  },
  {
    "text": "‘January 6th is going to be pretty fun’: How MAGA activists are preparing to undermine the election if Trump loses  —  Before Election Day has even arrived, the “Stop the Steal” movement has reemerged in force, with some of the same activists who tried to overturn former President Donald … ",
    "url": "https://www.cnn.com/2024/10/31/politics/maga-activists-preparing-undermine-election-if-trump-loses/"
  },
  {
    "text": "She Saw Jan. 6 Coming.  Here's What Worries Her Now.  —  The founder of a private intelligence firm says far-right extremists are ramping up — before the election.  —  Rioters loyal to Donald Trump protest at the Capitol on Jan. 6, 2021.  Rita Katz said the threats in the 2024 election season … ",
    "url": "https://www.politico.com/news/magazine/2024/10/31/rita-katz-january-6-prediction-00186090"
  },
  {
    "text": "5 Days Out I Would Much Rather Be Us Than Them - New 2024 Election Analysis and Video With Tom Bonier  —  Welcome New Subscribers!  /When We Vote, We Win!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!  —  Transcript  —  Happy Thursday all. 5 days of hard work left until victory.  I ask two things of you today:",
    "url": "https://www.hopiumchronicles.com/p/i-would-much-rather-be-us-than-them-aec"
  },
  {
    "text": "The Next President Inherits a Remarkable Economy  —  The high quality of recent economic growth should put a wind at the back of the White House's next occupant  —  Whoever wins the White House next week will take office with no shortage of challenges, but at least one huge asset: an economy that is putting its peers to shame.",
    "url": "https://www.wsj.com/economy/the-next-president-inherits-a-remarkable-economy-7be2d059"
  },
  {
    "text": "A Brief History of Trump's Violent Remarks  —  Here are 40 instances in which the former president incited or praised violence against his fellow citizens.  —  After the second attempt on his life, Donald Trump accused his political opponents of inspiring the attacks against him with their rhetoric.",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/trump-violent-rhetoric-timeline/680403/?gift=mBLCHcnsd_Gd3EecvWSKTRHJyRSh4e6cpG5nsanEcr0&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Vance suggests upper- and middle-class kids ‘become trans’ for college admissions, says Trump may earn ‘normal gay guy vote’  —  Republican vice presidential candidate JD Vance suggested in an interview with podcast host Joe Rogan that aired Thursday that White upper- and middle-class children … ",
    "url": "https://www.cnn.com/2024/10/31/politics/vance-transgender-college-admissions/"
  },
  {
    "text": "Donald Trump Is Bored  —  Have you heard that Donald Trump is unraveling?  His use of profanity has become increasingly casual, in rallies that stretch almost twice as long as they did in the past.  His references to Vice President Kamala Harris have gone from dismissive to vicious.",
    "url": "https://www.nytimes.com/2024/10/31/opinion/donald-trump-speech-aging.html"
  },
  {
    "text": "Judge declines to block Elon Musk $1 million voter giveaway  —  A Pennsylvania state judge said on Thursday he would not immediately move forward with a lawsuit that seeks to stop Elon Musk's $1 million voter giveaway ahead of the Nov. 5 U.S. presidential election.",
    "url": "https://www.reuters.com/legal/musk-due-court-1-million-voter-giveaway-faces-courtroom-test-2024-10-31/"
  }
]