[
  {
    "text": "Kilmar Abrego Garcia on way back to US to face criminal charges: Sources  —  Sources say he faces charges of illegally transporting migrants within the U.S.  —  Undated photo provided by Murray Osorio PLLC shows Kilmar Abrego Garcia.  —  Murray Osorio PLLC via AP",
    "url": "https://abcnews.go.com/US/mistakenly-deported-kilmar-abrego-garcia-back-us-face/story?id=121333122"
  },
  {
    "text": "Abrego Garcia indictment led top federal prosecutor in Tennessee to resign: Sources  —  The decision to pursue the indictment against Kilmar Abrego Garcia led to the abrupt departure of Ben Schrader, a high-ranking federal prosecutor in Tennessee, sources briefed on Schrader's decision told ABC News.",
    "url": "https://abcnews.go.com/Politics/live-updates/trump-admin-live-updates/?id=122407456&entryId=122591572"
  },
  {
    "text": "Kilmar Abrego Garcia has been returned to the United States to face criminal charges  —  Kilmar Abrego Garcia, the Maryland man mistakenly deported to El Salvador in March, has been returned to the United States to face federal criminal charges, Attorney General Pam Bondi said Friday.",
    "url": "https://cnn.com/2025/06/06/politics/kilmar-abrego-garcia"
  },
  {
    "text": "Kilmar Abrego Garcia is back in US custody after being illegally deported and will now face criminal charges  —  The courts ordered the administration to facilitate his return after he was deported to El Salvador in violation of a court order.  —  Kilmar Abrego Garcia … ",
    "url": "https://www.politico.com/news/2025/06/06/abrego-garcia-return-00392791"
  },
  {
    "text": "Democratic congressman steps up his work to pull Musk toward his party for the midterms  —  Rep. Ro Khanna, D-Calif., talked with one of Elon Musk's “senior confidants” on Thursday about whether the ex-DOGE leader, now feuding with Donald Trump, might want to help the Democratic Party in the midterms.",
    "url": "https://www.semafor.com/article/06/06/2025/khanna-steps-up-his-work-to-pull-musk-toward-democrats"
  },
  {
    "text": "The Alarming Part of the Musk-Trump Dispute  —  The Alarming Part of the Musk-Trump Dispute  —  At the height of the juvenile flame war on Thursday between the world's richest man and its most powerful one, Donald Trump posted a barely veiled threat on his website Truth Social.",
    "url": "https://www.nytimes.com/live/2025/06/02/opinion/thepoint"
  },
  {
    "text": "Trump Has Options to Punish Musk Even if His Federal Contracts Continue  —  The president could tighten federal oversight of the tech titan's businesses, even if heavy reliance by the Pentagon and NASA on them makes terminating Mr. Musk's contracts less feasible.",
    "url": "https://www.nytimes.com/2025/06/06/us/politics/trump-musk-spacex-contracts.html?unlocked_article_code=1.M08.mPqO.ohUbKK54gTLd"
  },
  {
    "text": "Trump preparing large-scale cancellation of federal funding for California, sources say  —  The Trump administration is preparing to cancel a large swath of federal funding for California, an effort which could begin as soon as Friday, according to multiple sources.",
    "url": "https://cnn.com/2025/06/06/politics/trump-california-federal-funding"
  },
  {
    "text": "Newsom floats withholding federal taxes as Trump threatens California  —  His comments came amid reports Trump is weighing “large-scale” funding cancellations for the Golden State.  —  SACRAMENTO, California — Gov. Gavin Newsom on Friday suggested California consider withholding tens … ",
    "url": "https://www.politico.com/news/2025/06/06/newsom-floats-withholding-federal-taxes-00393386"
  },
  {
    "text": "Supreme Court allows DOGE to access Social Security data  —  The dispute concerns efforts by the Department of Government Efficiency, largely led by Elon Musk, to access sensitive data, including Social Security numbers.  —  WASHINGTON — The Supreme Court on Friday allowed members … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-trump-doge-social-security-data-access-elon-musk-rcna206515"
  },
  {
    "text": "Justices Grant DOGE Access to Social Security Data and Let the Team Shield Records  —  As Elon Musk leaves Washington, the team he formed to ferret out waste and abuse won dual victories in the Supreme Court.  —  The Supreme Court on Friday let members of the Department of Government Efficiency … ",
    "url": "https://www.nytimes.com/2025/06/06/us/politics/supreme-court-doge-social-security.html?unlocked_article_code=1.M08.N1mJ.2_cKK1NkMc2j&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "SEIU California President David Huerta Injured, Detained at ICE Raid in Los Angeles  —  Los Angeles - David Huerta, President of SEIU California and SEIU- United Service Workers West was injured and detained at an ICE raid in Los Angeles today while exercising his First Amendment right to observe and document law enforcement activity.",
    "url": "https://seiuca.org/press-releases/2025/06/06/seiu-california-president-david-huerta-injured-detained-at-ice-raid-in-los-angeles/"
  },
  {
    "text": "Trump can bar The Associated Press from some White House events for now, appeals court rules  —  The AP sued after the White House restricted its access over continued references to the Gulf of Mexico in its coverage despite Trump renaming the body of water the Gulf of America.",
    "url": "https://www.nbcnews.com/politics/white-house/trump-bar-associated-press-white-house-events-now-appeals-court-rules-rcna211543"
  },
  {
    "text": "Fact Sheet: President Donald J. Trump Takes Action to Lead the World in Supersonic Flight  —  LEADING THE WORLD IN SUPERSONIC FLIGHT: Today, President Donald J. Trump signed an Executive Order to promote supersonic aviation in the United States.  — America once led the world in supersonic aviation … ",
    "url": "https://www.whitehouse.gov/fact-sheets/2025/06/fact-sheet-president-donald-j-trump-takes-action-to-lead-the-world-in-supersonic-flight/"
  },
  {
    "text": "Exclusive: ADL chief compares student protesters to ISIS and al-Qaeda in address to Republican officials  —  Jonathan Greenblatt also said protests against Israel were driven by ‘same kind of nihilists’ who participated in Black Lives Matter  —  Jonathan Greenblatt, the Anti-Defamation League CEO … ",
    "url": "https://forward.com/news/726133/greenblatt-adl-protesters-terrorists/"
  },
  {
    "text": "The Real Reason for the Trump-Musk Feud is Uglier Than You Think  —  As the war between Donald Trump and Elon Musk worsens, what's truly odd about this whole spectacle is that the actual substantive disagreement between them seems to be of little interest to media observers.",
    "url": "https://newrepublic.com/article/196246/real-reason-trump-musk-feud-uglier"
  },
  {
    "text": "Proud Boys Leaders Sue U.S. Over Jan. 6 Prosecutions  —  Lawsuit seeks $100 million in damages after their conviction, imprisonment for roles in Capitol attack  —  Five members of the Proud Boys, once convicted of masterminding the Jan. 6 breach of the U.S. Capitol, are accusing … ",
    "url": "https://www.wsj.com/us-news/law/proud-boys-leaders-sue-u-s-over-jan-6-prosecutions-90f9f4ce?st=qbdV5i&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Buyer With Ties to Chinese Communist Party Got V.I.P. Treatment at Trump Crypto Dinner … He Tianying outside the White House on May 23.  Mr. He is a member of an advisory body that seeks to broaden the Communist Party's influence and solicit support from influential people in Chinese society.Jason Andrew for The New York Times",
    "url": "https://www.nytimes.com/2025/06/06/us/politics/trump-crypto-dinner-china-he-tianying.html"
  },
  {
    "text": "The Pentagon Disinformation That Fueled America's UFO Mythology  —  U.S. military fabricated evidence of alien technology and allowed rumors to fester to cover up real secret-weapons programs  —  A tiny Pentagon office had spent months investigating conspiracy theories about secret Washington UFO programs … ",
    "url": "https://www.wsj.com/politics/national-security/ufo-us-disinformation-45376f7e?st=kEAaJz&reflink=desktopwebshare_permalink"
  },
  {
    "text": "He's a Master of Outrage on X. The Pay Isn't Great. … Visuals by Martina Tuaty  —  Dominick McGee was walking into the White House in April and couldn't believe his luck.  He was a self-proclaimed “nobody” just three years ago when he started working alone from his apartment … ",
    "url": "https://www.nytimes.com/2025/06/06/technology/x-right-wing-influencer.html?unlocked_article_code=1.M08.RjD3.BsNcPp9EcYQn"
  }
]