[
  {
    "text": "Trump says it's ‘very unlikely’ he'd pardon himself if elected  —  In an interview with NBC's “Meet the Press,” former President Donald Trump said that in his final days in office, he told people, “The last thing I'd ever do is give myself a pardon.”  —  Trump: ‘I could have had a pardon’ before leaving office",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-unlikely-pardon-convicted-presidency-meet-the-press-rcna104779"
  },
  {
    "text": "Biden weighed by economic concerns, age in potential 2024 rematch with Trump, Reuters/Ipsos poll shows  —  U.S. President Joe Biden's chances of re-election are being jeopardized by voters' concerns over his age, the economy and crime, according to a Reuters/Ipsos poll, creating an opportunity … ",
    "url": "https://www.reuters.com/world/us/biden-weighed-by-economic-concerns-age-potential-2024-rematch-with-trump-2023-09-15/"
  },
  {
    "text": "“Meet the Press” booking Trump for first show with new host is how FASCISM is normalized  —  Please call NBC to tell them this is wrong!  —  NBC's “Meet the Press” could've booked any political person for the debut this Sunday of the show's new moderator, Kristen Welker.",
    "url": "https://deanobeidallah.substack.com/p/meet-the-press-booking-trump-for"
  },
  {
    "text": "Trump says he'd testify under oath he never ordered Mar-a-Lago security video deleted  —  In a wide-ranging interview with NBC's “Meet the Press with Kristen Welker,” Trump said, “They were my tapes.  I could have fought them.”  —  Former President Donald Trump said Thursday that he did not order … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-mar-lago-staffer-delete-security-footage-tapes-false-rcna104781"
  },
  {
    "text": "‘They did it to me’: Trump says Biden impeachment inquiry might be motivated by revenge  —  Trump told former Fox and NBC host Megyn Kelly that GOP attempts to indict Joe Biden could be next.  —  Former President Donald Trump has “no idea” whether Republicans will vote to impeach President Joe Biden.",
    "url": "https://www.politico.com/news/2023/09/14/trump-biden-impeachment-revenge-00116027"
  },
  {
    "text": "Congress is in crisis.  There's no clear escape.  —  “We've been seeing this coming ... I just didn't think we were dumb enough to get there,” Rep. Mike Simpson (R-Idaho) said.  —  The government is barreling toward a shutdown.  House Republicans threaten to impeach the president — though some of them don't see the evidence.",
    "url": "https://www.politico.com/news/2023/09/15/government-shutdown-congress-gop-00116066"
  },
  {
    "text": "Trump's New York Fraud Trial in Limbo After His Legal Gambit Works  —  Trump's lawyers are going after Judge Arthur F. Engoron, saying he's overstepped his bounds. … An appellate judge has taken the remarkable step of hitting pause on the New York Attorney General's upcoming bank fraud trial … ",
    "url": "https://www.thedailybeast.com/trump-turns-new-york-ag-case-against-judge-arthur-f-engoron"
  },
  {
    "text": "Judge temporarily halts NY fraud trial against Trump, pending appeal  —  A New York state appeals court judge on Thursday temporarily halted the scheduled Oct. 2 trial in New York Attorney General Letitia James' fraud lawsuit against Donald Trump and his family business, a spokesman for the court said.",
    "url": "https://www.reuters.com/world/us/judge-temporarily-halts-ny-fraud-trial-against-trump-pending-appeal-2023-09-14/"
  },
  {
    "text": "Double blow of inquiry and son's indictment create tough stretch for Biden  —  Hunter Biden was charged two days after launch of impeachment process, creating political and personal challenges for the president  —  In just over 48 hours this week, President Biden faced a double-barreled onslaught … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/14/biden-indictment-impeachment-double-blows/"
  },
  {
    "text": "Ukrainian President Volodymyr Zelensky to visit Washington next week  —  Zelensky's visit was coordinated with the Biden administration in a joint push to Congress to provide $24 billion in aid  —  Ukrainian President Volodymyr Zelensky is set to travel to Washington next week after a gathering … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/14/zelensky-washington-visit-ukraine-aid/"
  },
  {
    "text": "UAW to target strikes at Ford, GM and Stellantis at midnight if no deal reached  —  United Auto Workers President Shawn Fain on Thursday night said the union will strike all the Big Three automakers - GM, Ford and Stellantis - at the same time as of midnight if the companies do not reach tentative labor deals with the auto workers.",
    "url": "https://www.cnn.com/2023/09/14/business/auto-workers-strike-deadline/"
  },
  {
    "text": "How a shutdown could blindfold the Fed  —  The Bureau of Labor Statistics won't collect or publish data such as unemployment numbers and the Consumer Price Index in the event of a shutdown, a spokesperson said.  —  Government funding gridlock is threatening to deprive the Federal Reserve … ",
    "url": "https://www.politico.com/news/2023/09/15/how-shutdown-could-blindfold-fed-00116076"
  },
  {
    "text": "With democracy on the ballot, the mainstream press must change its ways  —  US news organizations have turned Biden's age into a scandal and continue to cover Trump as an entertaining side show  —  Christiane Amanpour has reported all over the world, so she recognizes a democracy on the brink when she sees one.",
    "url": "https://www.theguardian.com/commentisfree/2023/sep/15/trump-biden-mainstream-politics-news-coverage"
  },
  {
    "text": "‘It will take years to recover’ from Tuberville blockade, top Navy nominee says  —  Adm. Lisa Franchetti, the Navy's No. 2 officer, has been leading the service on an acting basis because of the impasse.  —  President Joe Biden's nominee to be the Navy's top officer, Adm. Lisa Franchetti … ",
    "url": "https://www.politico.com/news/2023/09/14/tuberville-blockade-franchetti-00115936"
  },
  {
    "text": "Wisconsin Republicans vote to fire elections director, who may not leave the job  —  The vote creates a dispute over who is in charge of overseeing elections in a state that is expected to play a critical role in next year's presidential campaign  —  MADISON, Wis. — Republicans … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/14/wisconsin-republicans-fire-election-director/"
  },
  {
    "text": "Judge severs Trump's Georgia election interference case, and 16 others, from trial starting in October  —  Kenneth Chesebro and Sidney Powell will be tried starting Oct. 23.  —  The judge overseeing the Georgia election interference case has severed the case, ordering that 17 defendants … ",
    "url": "https://abcnews.go.com/US/judge-severs-17-defendants-including-trump-oct-23/story?id=103185589"
  },
  {
    "text": "‘You sell yourself so cheap?’  Romney's stark indictment of GOP cowardice.  —  The headline Wednesday was that Sen. Mitt Romney of Utah is retiring — another Trump-critical GOP lawmaker heading for the exits in a party that is, relatedly, still dominated by Donald Trump.",
    "url": "https://www.washingtonpost.com/politics/2023/09/14/you-sell-yourself-so-cheap-romneys-stark-indictment-gop-cowardice/"
  },
  {
    "text": "Republican David McCormick plans to run for US Senate again in Pennsylvania, sources tell AP  —  Republican David McCormick is expected to announce his second bid for U.S. Senate in Pennsylvania, according to people familiar with his plans, taking on Democratic Sen. Bob Casey after narrowly losing … ",
    "url": "https://apnews.com/article/pennsylvania-senate-gop-mccormick-versus-casey-0b8e5e494e429e9e5c4f0a75ff12c5e4"
  },
  {
    "text": "Alex Jones spent over $93,000 in July.  Sandy Hook families who sued him have yet to see a dime  —  As Alex Jones continues telling his Infowars audience about his money problems and pleads for them to buy his products, his own documents show life is not all that bad … ",
    "url": "https://apnews.com/article/alex-jones-sandy-hook-shooting-bankruptcy-34192bd7d89ed786f64580682f6ea89e"
  }
]