[
  {
    "text": "The Memo: Former Trump White House lawyer predicts crushing defeat at Supreme Court  —  A former attorney for the Trump White House predicts that the Supreme Court will rule unanimously against the 45th president on his claims to be immune from criminal prosecution.",
    "url": "https://thehill.com/regulation/court-battles/4451952-trump-immunity-ty-cobb-predicts-crushing-defeat-supreme-court/"
  },
  {
    "text": "Inside Donald Trump's Incredible Cash Crunch  —  Two New York laws are about to smack Trump in the face, no matter if he plans to appeal two massive civil judgments that could wipe out all the cash in his pocket. … Donald Trump is just days away from getting slammed with a court judgment … ",
    "url": "https://www.thedailybeast.com/inside-donald-trumps-incredible-cash-crunch"
  },
  {
    "text": "Trump plans to press immunity defense in classified documents case despite defeat in appeals court  —  Donald Trump's legal team is outlining how he intends to fight the classified documents case against him in Florida, including by claiming presidential immunity, despite a significant defeat … ",
    "url": "https://www.cnn.com/2024/02/07/politics/trump-immunity-defense-classified-documents/"
  },
  {
    "text": "Epic double debacle stings House GOP  —  It's 10 minutes of humiliation that will live in House lore. … - Speaker Mike Johnson lost by one vote — a Republican vote! — the first impeachment of a Cabinet official in 148 years. … - GOP lawmakers openly criticized leaders for bringing … ",
    "url": "https://www.axios.com/2024/02/07/house-republicans-mike-johnson-impeachment-israel"
  },
  {
    "text": "Senate Republicans block bipartisan border package, scuttling deal they had demanded from Democrats  —  Senate Republicans blocked a bipartisan border package Wednesday, scuttling months of negotiations with Democrats on legislation intended to cut back record numbers of illegal border crossings.",
    "url": "https://apnews.com/article/congress-ukraine-aid-border-security-386dcc54b29a5491f8bd87b727a284f8"
  },
  {
    "text": "Chuck Schumer to push stripped-down Israel and Ukraine aid package after GOP blocks Senate border bill  —  The vote comes after Republican senators made clear there isn't enough support for a bipartisan border security bill that included foreign aid to Ukraine, Israel and Taiwan.",
    "url": "https://www.nbcnews.com/politics/congress/chuck-schumer-push-stripped-israel-ukraine-aid-package-gop-blocks-sena-rcna137661"
  },
  {
    "text": "Putin interview with Tucker Carlson shows Kremlin outreach to Trump's GOP  —  MOSCOW — As Russian state television propagandists salivated over Tucker Carlson's interview with President Vladimir Putin, the first of Carlson's falsehoods about his visit to Moscow was punctured, fittingly enough … ",
    "url": "https://www.washingtonpost.com/world/2024/02/07/tucker-carlson-putin-russia-ukraine/"
  },
  {
    "text": "Kremlin: We Reject All Western Media but Tucker Carlson Is Different  —  He's just not like those other Western journalists in one very important way, the Russian president's spokesman said.  —  The Kremlin confirmed Wednesday that an interview between Tucker Carlson and Vladimir Putin … ",
    "url": "https://www.thedailybeast.com/kremlin-we-reject-all-western-media-but-tucker-carlson-is-different"
  },
  {
    "text": "Behind the border mess: Open GOP rebellion against McConnell  —  The Republican leader told POLITICO that his critics “had their shot” already.  But conservatives are not done whacking him over the immigration-for-Ukraine aid implosion.  —  Conservative hardliners once celebrated Mitch McConnell … ",
    "url": "https://www.politico.com/news/2024/02/07/mcconnell-gop-rebellion-border-deal-00139972"
  },
  {
    "text": "Playbook: Two leaders in trouble  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  OUCH — “Worse than you can imagine: Haley loses to ‘none of these candidates’ in Nevada,” by Chris Cadelago: “[NIKKI] HALEY's second-place drubbing to the disembodied alternative … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/02/07/two-leaders-in-trouble-00140077"
  },
  {
    "text": "Democrats have a once-in-a-lifetime chance to win the border fight — will they take it?  —  2024 is looking to be the year America's most durable political alliances come unglued.  —  The Trump era is driving a deep rethink of what makes a Democrat and what makes a Republican.",
    "url": "https://thehill.com/opinion/immigration/4453139-democrats-have-a-once-in-a-lifetime-chance-to-win-the-border-fight-will-they-take-it/"
  },
  {
    "text": "Al Green, in Hospital Garb, Delivers Vote to Kill Mayorkas Impeachment  —  The Democrat from Texas had undergone abdominal surgery but rushed to the Capitol because he said the vote was “personal.”  —  With the final minutes for the vote dwindling, the House watched intently on Tuesday night … ",
    "url": "https://www.nytimes.com/2024/02/06/us/politics/al-green-mayorkas-impeachment.html"
  },
  {
    "text": "The Road to the General Election  —  NPR/PBS NewsHour/Marist National Poll  —  Biden Competitive with Trump, Haley... Biden Opens Up Lead if Trump is Convicted  —  President Joe Biden and former President Donald Trump remain in a statistical tie among registered voters nationally.",
    "url": "https://maristpoll.marist.edu/polls/the-road-to-the-general-election/"
  },
  {
    "text": "After Libs of TikTok posted, at least 21 bomb threats followed  —  The FBI and local law enforcement said bomb threats across the country have tied up government resources even when they turn out to be hoaxes.  —  Last March, police in Coralville, Iowa, investigated a bomb threat targeting a junior high school.",
    "url": "https://www.nbcnews.com/tech/internet/libs-tiktok-x-chaya-raichik-bomb-threat-twitter-of-libsoftiktok-rcna102784"
  },
  {
    "text": "Trump, on eve of fundraiser with Anheuser-Busch lobbyist, defends company  —  “Perhaps,” he asked, the beer giant deserves a “second chance?”  —  Former President Donald Trump offered an olive branch to Anheuser-Busch on Tuesday, issuing a post on his social media platform calling … ",
    "url": "https://www.politico.com/news/2024/02/06/donald-trump-bud-light-fundraiser-00140009"
  },
  {
    "text": "Nikki Haley loses to ‘none of these candidates’ in the Nevada GOP primary  —  NBC News projects that more voters chose not to pick a candidate at all than back Haley.  Trump wasn't on the ballot, since he's participating in Thursday's caucus, instead.  —  Nikki Haley faced no major challenger Tuesday in Nevada's presidential primary.",
    "url": "https://www.nbcnews.com/politics/2024-election/haley-loses-nevada-republican-primary-without-trump-rcna137367"
  },
  {
    "text": "Exclusive: Hamas proposes three-stage ceasefire over 135 days, leading to end of war  —  Hamas has proposed a ceasefire plan that would quiet the guns in Gaza for four-and-a-half months leading to an end to the war, in response to a proposal sent last week by Qatari and Egyptian mediators and backed by the United States and Israel.",
    "url": "https://www.reuters.com/world/middle-east/hamas-seeks-prisoner-hostage-exchange-withdrawal-israeli-forces-ceasefire-2024-02-07/"
  },
  {
    "text": "Durbin calls for Thomas recusal in SCOTUS case on Trump ballot eligibility  —  “Justice Thomas should recuse himself so there's no question of bias,” Durbin posted on social media.",
    "url": "https://www.politico.com/live-updates/2024/02/07/congress/durbin-thomas-scotus-trump-2024-ballot-eligibility-00140147"
  },
  {
    "text": "Alleged aspiring militia “sniper” with plans to attack agents at border arrested  —  A Tennessee militia member who told an undercover federal agent that the U.S. is “being invaded” by migrants was planning to travel to the southern border with a stockpile of weapons and commit acts of violence … ",
    "url": "https://www.cbsnews.com/news/militia-sniper-paul-faye-southern-border-attack-federal-agents/"
  },
  {
    "text": "Jeanine Pirro Stuns Fox News Co-Hosts by Calling Black Colleague an ‘Oreo’  —  During a Fox News segment on how New York Mayor Eric Adams applauded his “chocolate” administration, things got a bit awkward.  —  Fox News host Jeanine Pirro called her Black colleague an “Oreo” … ",
    "url": "https://www.thedailybeast.com/jeanine-pirro-calls-black-colleague-an-oreo-during-fox-segment"
  },
  {
    "text": "Right-Wing Congressman to Run for Senate in Montana, Igniting G.O.P. Fight  —  As Republicans try to take down Senator Jon Tester, a Democrat, and win back control of the chamber, Representative Matt Rosendale is set to enter the race and start a primary clash.",
    "url": "https://www.nytimes.com/2024/02/07/us/politics/matt-rosendale-montana-senate-race.html"
  },
  {
    "text": "Chip Roy knocks Trump over border claim: 'That didn't happen'  —  Rep. Chip Roy (R-Texas) took a dig at former President Trump in a House floor speech on Tuesday, denying the former president's claim that any executive could unilaterally close the southern border.",
    "url": "https://thehill.com/homenews/house/4452898-chip-roy-donald-trump-border/"
  },
  {
    "text": "Russia Is Boosting Calls for ‘Civil War’ Over Texas Border Crisis  —  An all-encompassing Russian disinformation campaign is using everything from bots to lifestyle influencers to powerful state-run media to sow division in the United States.  —  A Russian disinformation campaign … ",
    "url": "https://www.wired.com/story/russia-disinformation-campaign-civil-war-texas-border/"
  },
  {
    "text": "Inside the deadly new GOP plan to rapidly privatize Medicare  —  Want to invest in a scam that lets you make billions with virtually no risk?  If you're morbidly rich, all you have to do is to open or buy an insurance company that's offering Medicare Advantage plans.",
    "url": "https://www.rawstory.com/raw-investigates/medicare-advantage-2667187728/"
  },
  {
    "text": "Military helicopter with 5 Marines on board goes missing en route to California  —  The helicopter was en route from Nevada to California Tuesday night.  —  A CH-53E Super Stallion is seen here in an undated file photo.  —  California search and rescue crews are looking for a missing helicopter … ",
    "url": "https://abcnews.go.com/US/military-helicopter-5-marines-board-missing-en-route/story?id=107021601"
  }
]