[
  {
    "text": "Voters don't have a clue about how much worse Trump's second term would be  —  Gameli Fenuku, a 22-year-old Black college student in Richmond, Va. is exactly the demographic you'd think would never vote for Donald Trump in November — and indeed he may not.  But Fenuku told the New York Times … ",
    "url": "https://www.inquirer.com/columnists/trump-47-second-term-dangers-authoritarianism-20240314.html#loaded"
  },
  {
    "text": "Judge appears skeptical of Trump's bid to dismiss his classified documents prosecution  —  A federal judge appeared reluctant Thursday to dismiss the classified documents prosecution of Donald Trump after his lawyers argued for hours that the case trampled on the former president's rights.",
    "url": "https://apnews.com/article/trump-classified-documents-maralago-presidential-records-200d4c73d7c7dd75d9c9d878b77d05ce"
  },
  {
    "text": "“That is frightening”: Legal analyst thinks Judge Cannon signaling she may “get rid” of Trump case  —  It “makes me think maybe she thinks she can get rid of this case without setting a trial date,” Lisa Rubin says  —  U.S. District Judge Aileen Cannon on Thursday is expected to hear … ",
    "url": "https://www.salon.com/2024/03/14/that-is-frightening-legal-analyst-thinks-cannon-signaling-she-may-get-rid-of-case/"
  },
  {
    "text": "There is only one thing that matters about Donald Trump — and it's not his crimes or mental decline  —  Donald Trump must never return to the White House  —  I don't know about anyone else, but I'm already tired of the presidential election campaign and it's just mid-March.  And I like politics.",
    "url": "https://www.salon.com/2024/03/14/there-is-only-one-thing-that-matters-about-donald--and-its-not-his-or-mental-decline/"
  },
  {
    "text": "“Experts are desperate to warn the public”: Hundreds sign Dr. John Gartner's Trump dementia petition  —  “They see the signs of Trump's cognitive decline through the eyes of years of training and experience”  —  Since at least 2016, a brave, determined, and stalwart group of psychologists … ",
    "url": "https://www.salon.com/2024/03/14/experts-are-desperate-to-warn-the-public-hundreds-sign-dr-john-gartners-dementia-petition/"
  },
  {
    "text": "Manhattan D.A. Offers to Delay Trump Hush-Money Trial for Review of Records  —  The proposal by the Manhattan district attorney's office came in response to Donald J. Trump's request for a 90-day delay to allow his lawyers time to review a new batch of records.",
    "url": "https://www.nytimes.com/2024/03/14/nyregion/alvin-bragg-trump-trial-delay.html"
  },
  {
    "text": "Ex-Trump White House official convicted of contempt must report to prison, appeals court finds  —  An appeals court denied Trump White House official Peter Navarro 's bid to stave off his jail sentence on contempt of Congress charges Thursday.  Navarro has been ordered to report to a federal prison by March 19.",
    "url": "https://apnews.com/article/trump-white-house-official-jan-6-contempt-8c28224fcde49e784708a1b9444076d7"
  },
  {
    "text": "Rep. Matt Gaetz subpoenaed in defamation suit by woman he allegedly had sex with as minor: Sources  —  Gaetz could be asked under oath about the allegations involving a minor.  —  Rep. Matt Gaetz asks questions during a House Judiciary Committee hearing on Capitol Hill in Washington, D.C., on July 13, 2023.",
    "url": "https://abcnews.go.com/US/rep-matt-gaetz-subpoenaed-defamation-suit-woman-allegedly/story?id=108098265"
  },
  {
    "text": "US firm that paid indicted FBI informant tied to Trump associates, records reveal  —  Alexander Smirnov was paid $600,000 in 2020 - the same year he allegedly began lying to FBI about Bidens' role in Ukraine business  —  An American company that paid the now indicted FBI informant Alexander Smirnov … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/14/company-paying-fbi-informant-trump-connections"
  },
  {
    "text": "A Third Tie between Trump World and Alexander Smirnov  —  Before I point to a report on third known link between Alexander Smirnov — the FBI informant whose allegedly false claims about Joe Biden were laundered through a process Bill Barr set up for Rudy Giuliani in 2020 — and Donald Trump … ",
    "url": "https://www.emptywheel.net/2024/03/14/a-third-tie-between-trump-world-and-alexander-smirnov/"
  },
  {
    "text": "Harris visits Planned Parenthood clinic: ‘We have to be a nation that trusts women’  —  Vice President Harris visited a Planned Parenthood clinic in Minnesota on Thursday, a significant and symbolic stop as she advocated for reproductive health care access for women in the wake of the Supreme Court's decision to overturn Roe v. Wade.",
    "url": "https://thehill.com/homenews/administration/4532651-harris-visits-planned-parenthood-clinic-we-have-to-be-a-nation-that-trusts-women/"
  },
  {
    "text": "2024 Michigan: Trump Leads Biden In 5-Way Race, On Upside Of Too-Close-To-Call 2-Way Race, Quinnipiac University Michigan Poll Finds; 79% Of Dems Want Gov. Whitmer To Run For President In The Future  —  mail_outline  —  With the 2024 general election campaigns underway … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3893"
  },
  {
    "text": "Trump's MAGA movement is causing Republicans in Congress to hate each other  —  Fewer than half of House Republicans bothered to attend Speaker Mike Johnson's retreat  —  It's wild what a few short months of actually getting to know a person can do to your opinion of them.",
    "url": "https://www.salon.com/2024/03/14/maga-movement-is-causing-in-congress-to-hate-each-other/"
  },
  {
    "text": "GOP nominee to run North Carolina public schools called for violence against Democrats, including executing Obama and Biden  —  The Republican nominee for superintendent overseeing North Carolina's public schools and its $11 billion budget has a history marked by extreme and controversial comments … ",
    "url": "https://www.cnn.com/2024/03/14/politics/kfile-gop-nominee-north-carolina-public-schools-michele-morrow-executing-democrats/"
  },
  {
    "text": "Bernie Sanders tangles with reporter over question on 32-hour workweek: ‘I can yell as loud as you’  —  Sanders snaps at FOX Business correspondent Hillary Vaughn over a question about his new ‘Thirty-Two Hour Workweek Act’  —  Sen. Bernie Sanders, I-Vt., lashed out at FOX Business correspondent … ",
    "url": "https://www.foxbusiness.com/politics/bernie-sanders-tangles-reporter-question-32-hour-workweek-yell-loud-you"
  },
  {
    "text": "Republicans Can't Screw This Up...Right?  —  On this full episode of LARRY, we discuss Joe Biden's gaffe-riddled false claims about the economy, White House gaslighting, the beef between Elon Musk and former CNN Anchor Don Lemon, CNN's disgusting hit piece on Aaron Rodgers … ",
    "url": "https://hotair.com/videos/2024/03/14/republicans-cant-screw-this-upright-n3784730"
  },
  {
    "text": "Schumer to call for ‘new election’ in Israel in scathing speech on Netanyahu  —  “Israel cannot hope to succeed as a pariah opposed by the rest of the world,” the Senate majority leader is expected to say.  —  Senate Majority Leader Charles E. Schumer (D-N.Y.) will call for the Israeli government … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/14/israel-elections-netanyahu-charles-schumer/"
  },
  {
    "text": "X Removes Graphic Video Elon Musk Shared Over Rules Violation  — Move is rare case of company taking action involving its owner  — Musk's posts are increasingly focused on immigration issues  —  Elon Musk's X took down a post its billionaire owner shared in response to a news report critical … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-14/x-removes-graphic-video-elon-musk-shared-over-rules-violation"
  },
  {
    "text": "Democrat says green pin ditched by GOP had hidden message … House Republican leaders spent a reported $40,000 in January to replace the official pin given to all members to show they had been sworn into the 118th Congress — a midterm expense driven by a confluence of factors … ",
    "url": "https://www.eenews.net/articles/democrat-says-green-pin-ditched-by-gop-had-hidden-message/"
  },
  {
    "text": "Former Treasury Secretary Mnuchin is putting together an investor group to buy TikTok  — Former Treasury Secretary Steven Mnuchin said he is putting together an investor group to try to buy TikTok.  — “I think the legislation should pass and I think it should be sold,” Mnuchin told CNBC's “Squawk Box” on Thursday.",
    "url": "https://www.cnbc.com/2024/03/14/former-treasury-secretary-mnuchin-is-putting-together-an-investor-group-to-buy-tiktok.html"
  }
]