[
  {
    "text": "With Jan. 6 Rioters Sentenced, Prosecuting Trump Will Be a Different Challenge  —  With leaders of the far-right groups that helped drive the attack on the Capitol sentenced to long prison terms, attention is shifting to the fraught process of prosecuting Donald Trump.",
    "url": "https://www.nytimes.com/2023/09/06/us/politics/enrique-tarrio-trump-jan-6.html"
  },
  {
    "text": "Judge Shoots Down Trump's Attempt at Trial Delay in 9 Words  —  HOW 'BOUT NO?  —  A New York judge—unmoved by the incessant pleas from Donald Trump's legal team to delay trial—made quick work of the former president's last-minute request Tuesday night to push back his first big upcoming trial for bank and tax fraud.",
    "url": "https://www.thedailybeast.com/judge-shoots-down-trumps-attempt-at-a-new-york-trial-delay-in-9-words"
  },
  {
    "text": "Witness in Trump documents case reached deal with prosecutors, ex-attorney says  —  A key witness in the case accusing former U.S. President Donald Trump of mishandling classified documents after leaving office has entered into a deal with prosecutors to provide testimony, his former attorney said in a Wednesday court filing.",
    "url": "https://www.reuters.com/legal/witness-trump-documents-case-reached-deal-with-prosecutors-ex-attorney-says-2023-09-06/"
  },
  {
    "text": "Senate Confirmation Still in Limbo for 301 Military Leaders  —  The Senate has returned to work, and there is still no resolution in sight of confirmation of general and flag officers by the body.  —  Alabama Sen. Thomas H. Tuberville has put holds on the nominations of 301 senior military leaders … ",
    "url": "https://www.defense.gov/News/News-Stories/Article/Article/3515996/senate-confirmation-still-in-limbo-for-301-military-leaders/"
  },
  {
    "text": "Tommy Tuberville's Hissy Fit Shows McConnell Has Lost His Hold on the GOP  —  The ex-football coach-turned-junior senator is holding up vital military promotions and brazenly thumbing his nose at the longest serving Republican Senate leader. … It should be a national embarrassment … ",
    "url": "https://www.thedailybeast.com/tommy-tubervilles-hissy-fit-shows-mitch-mcconnell-lost-his-hold-on-the-gop"
  },
  {
    "text": "The Giuliani aide who ‘vanished’  —  Documents reviewed by POLITICO — and also in the hands of federal prosecutors — offer new details about Rudy Giuliani's ill-fated efforts to reverse the 2020 election.  —  In December 2020, an adviser to Rudy Giuliani circulated a draft email addressed … ",
    "url": "https://www.politico.com/news/2023/09/06/giuliani-aide-vanished-trump-election-00114307"
  },
  {
    "text": "I Can't Keep Trump Off the Ballot  —  Voters should decide elections: That's the simple lesson of Georgia in 2018 and 2020.  —  Atlanta  —  Some legal scholars are arguing that secretaries of state should remove Donald Trump from the 2024 presidential ballot under Section 3 of the 14th Amendment … ",
    "url": "https://www.wsj.com/articles/i-cant-keep-trump-off-the-ballot-georgia-sec-state-14th-amendment-c1017ede?mod=followamazon"
  },
  {
    "text": "‘A Big Circle Jerk’: John Fetterman Dares Republicans To Impeach Joe Biden  —  “Go ahead.  Do it, I dare you,” said the Democratic senator.  “It's a loser.”  —  LOADING  —  Sen. John Fetterman (D-Pa.) had some blunt words for Republicans who are pushing to impeach President Joe Biden: It'll bite you in next year's elections.",
    "url": "https://www.huffpost.com/entry/joe-biden-impeachment-john-fetterman_n_64f8df8de4b0d44852edd611"
  },
  {
    "text": "Prosecutors will seek Hunter Biden indictment by end of September  —  Special counsel David Weiss will seek to indict Hunter Biden before the end of this month, the prosecutor said in a court filing updating a judge on his investigation into the president's son's failure to pay taxes.",
    "url": "https://thehill.com/regulation/court-battles/4190614-prosecutors-will-seek-hunter-biden-indictment-by-end-of-september/"
  },
  {
    "text": "Mexico decriminalizes abortion, extending Latin American trend of widening access to procedure  —  Mexico's Supreme Court threw out all federal criminal penalties for abortion Wednesday, ruling that national laws prohibiting the procedure are unconstitutional and violate women's rights … ",
    "url": "https://apnews.com/article/mexico-abortion-decriminalize-d87f6edbdf68c2e6c8f5700b3afd15de"
  },
  {
    "text": "Newly obtained George Santos “vulnerability report” spotted red flags long before embattled Rep. was elected  —  When an outside firm hired by then-congressional hopeful George Santos in 2021 delivered a secret internal report detailing aspects of the candidate's checkered background, several of his aides found it too much to stomach.",
    "url": "https://www.cbsnews.com/news/george-santos-vulnerability-report-red-flags-long-before-embattled-rep-was-elected/"
  },
  {
    "text": "Scoop: Trump privately urged to support Biden's Saudi mega-deal  —  Sen. Lindsey Graham (R-S.C.) told Axios he has urged former President Trump to support the mega-deal President Biden is negotiating with Saudi Arabia, which could pave the way for a historic peace agreement between the kingdom and Israel.",
    "url": "https://www.axios.com/2023/09/06/biden-saudi-mega-deal-israel-trump"
  },
  {
    "text": "Judge Orders Texas to Move Barrier From Middle of the Rio Grande  —  A federal judge ordered the state to move the barrier, placed to discourage illegal crossings from Mexico, to the banks of the river.  —  A federal judge ordered Gov. Greg Abbott on Wednesday to move a barrier of floating buoys … ",
    "url": "https://www.nytimes.com/2023/09/06/us/texas-border-rio-grande-lawsuit.html"
  },
  {
    "text": "Texas AG Ken Paxton's Affair Explains Illegal Acts, Former Aide Testifies  —  An impeachment trial for the suspended Republican began in the state Senate Tuesday.  —  LOADING  —  An extramarital affair Texas Attorney General Ken Paxton had with a donor's employee helped connect the dots … ",
    "url": "https://www.huffpost.com/entry/ken-paxton-impeachment-trial-texas-affair_n_64f8eb9ce4b08f6e30ea12a5"
  },
  {
    "text": "America's Authoritarian Exceptionalism  —  Demagogues usually arise in times of chaos and privation.  In America, our demagogues have become powerful during a period of peace and prosperity.  —  ∙ Paid  —  1. Decadence  —  We're going to keep doing this and I'm sorry.",
    "url": "https://thetriad.thebulwark.com/p/americas-authoritarian-exceptionalism"
  },
  {
    "text": "QAnon-embraced film pulled from screening on-base at SOUTHCOM  —  U.S. Southern Command planned, and then canceled, two showings of the Christian-faith-based thriller “Sound of Freedom” at its headquarters this summer.  The movie's been a runaway hit, grossing more than $200 million … ",
    "url": "https://www.militarytimes.com/flashpoints/extremism-disinformation/2023/09/05/qanon-embraced-film-pulled-from-screening-on-base-at-southcom/"
  },
  {
    "text": "The car brands we researched are terrible at privacy and security  —  Why are cars we researched so bad at privacy?  And how did they fall so far below our standards?  Let us count the ways!  —  1. They collect too much personal data (all of them)  —  We reviewed 25 car brands in our research … ",
    "url": "https://foundation.mozilla.org/en/privacynotincluded/articles/its-official-cars-are-the-worst-product-category-we-have-ever-reviewed-for-privacy/"
  },
  {
    "text": "Biden rejects conditions of plea deal for Sept. 11 attacks defendants  —  U.S. President Joe Biden has rejected several conditions sought by five Guantanamo Bay prisoners as part of a deal with federal prosecutors that would see them plead guilty to conspiring in the Sept. 11, 2001, attacks, the New York Times reported on Wednesday.",
    "url": "https://www.reuters.com/world/us/biden-rejects-conditions-plea-deal-sept-11-attacks-defendants-2023-09-07/"
  }
]