[
  {
    "text": "Harvard president's resignation highlights new conservative weapon against colleges: plagiarism  —  (Jan 02) (AP video by Rodrique Ngowi) (AP production by Javier Arciga)  —  American higher education has long viewed plagiarism as among the most serious of offenses.",
    "url": "https://apnews.com/article/harvard-president-plagiarism-claudine-gay-3b048da1f2ee17b5edec3680b5828e8f"
  },
  {
    "text": "Powerful donors managed to push out Harvard's Claudine Gay.  But at what cost?  —  Not until now have major donors so brazenly used their financial influence to hound presidents out of office  —  Amid accusations of plagiarism and continuing outrage among Harvard's major donors … ",
    "url": "https://www.theguardian.com/commentisfree/2024/jan/03/powerful-donors-managed-to-push-out-harvards-claudine-gay-but-at-what-cost"
  },
  {
    "text": "State Capitols evacuated after bomb threats  —  The state Capitol complexes in Georgia, Kentucky, Mississippi and Michigan were evacuated Wednesday after bomb threats were made, officials said.  —  At least four state capitol complexes across the U.S. were forced to evacuate Wednesday morning due … ",
    "url": "https://www.nbcnews.com/politics/politics-news/state-capitol-buildings-evacuated-bomb-threats-rcna132096"
  },
  {
    "text": "Bomb threats force evacuations in a half-dozen state capitols  —  Bomb threats were reported in at least a half-dozen state capitols Wednesday morning, forcing evacuations from statehouse buildings and interrupting court proceedings, according to officials and local news outlets.",
    "url": "https://www.washingtonpost.com/politics/2024/01/03/bomb-threats-state-capitols/"
  },
  {
    "text": "Jack Smith Keeps Telegraphing Some Seriously Scandalous Trump Crimes  —  Did Donald Trump accept a bribe?  Order his FBI director to fake evidence?  Tell the National Guard to kill critics?  Sell nuclear secrets?  Jack Smith is being awfully suggestive.  —  As Special Counsel Jack Smith makes … ",
    "url": "https://www.thedailybeast.com/jack-smith-keeps-telegraphing-some-seriously-scandalous-trump-crimes"
  },
  {
    "text": "Biden Could Kill Donald Trump And Not Be Prosecuted, Under Trump's Own Legal Theory  —  Lawyers, including special counsel Jack Smith, warn that Trump's theory of “presidential immunity” would allow presidents to be unaccountable tyrants.  —  LOADING  —  WASHINGTON ― … ",
    "url": "https://www.huffpost.com/entry/biden-trump-presidential-immunity_n_65943b0fe4b0f27b6e356793"
  },
  {
    "text": "1/3/24 ☀️ Punchbowl News AM … The first hearing will take place on Jan. 10, with a possible second hearing to be held the following week. … Green accused Mayorkas of misusing taxpayer dollars and purposefully ignoring border security measures.",
    "url": "https://punchbowl.news/archive/1324-punchbowl-news-am/"
  },
  {
    "text": "More than 100 killed in blasts at memorial for top Iranian general Soleimani  —  Gen. Qassem Soleimani was killed by a U.S. drone strike in January 2020, sparking angry protests in Iran and across the region.  —  Two explosions rocked a memorial event for Iranian Gen. Qassem Soleimani … ",
    "url": "https://www.nbcnews.com/news/world/iran-explosions-qassem-soleimani-memorial-quds-force-us-drone-strike-rcna132039"
  },
  {
    "text": "At least 103 dead in bomb blasts near Iran general Qasem Soleimani's tomb - state TV  —  Watch: Moment crowds disperse after deadly bomb blasts in Iran  —  At least 103 people have been killed by two bomb explosions near the tomb of Iranian general Qasem Soleimani on the fourth anniversary … ",
    "url": "https://www.bbc.com/news/world-middle-east-67872281"
  },
  {
    "text": "Anti-abortion OB-GYNs react to court victory in Texas case  —  The anti-abortion physicians group that sued the Biden administration over abortion restrictions in Texas praised a ruling from the United States Court of Appeals for the 5th Circuit on Tuesday that found that federal regulations do not grant an absolute right to abortion.",
    "url": "https://www.washingtonexaminer.com/policy/healthcare/anti-abortion-ob-gyns-react-court-victory-texas"
  },
  {
    "text": "Sununu tells Christie he can ‘be the hero,’ help Nikki Haley beat Trump in New Hampshire  —  Gov Chris Sununu says he is not telling Chris Christie to drop out, but says he could help Haley ‘deliver Trump that loss’  —  RYE, N.H - Republican New Hampshire Gov. Chris Sununu says he is not calling … ",
    "url": "https://www.foxnews.com/politics/sununu-tells-christie-be-hero-help-nikki-haley-beat-trump-new-hampshire"
  },
  {
    "text": "A Joint Statement from the Governments of the United States, Australia, Bahrain, Belgium, Canada, Denmark, Germany, Italy, Japan, Netherlands, New Zealand, Singapore, and the United Kingdom  —  Recognizing the broad consensus as expressed by 44 countries around the world on December 19, 2023 … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/03/a-joint-statement-from-the-governments-of-the-united-states-australia-bahrain-belgium-canada-denmark-germany-italy-japan-netherlands-new-zealand-and-the-united-kingdom/"
  },
  {
    "text": "Former Rep Says it Wasn't Her ‘Intention to Mislead’ by Posting Stolen Food Pics  —  Mayra Flores, a Republican seeking to win back her old seat in the Rio Grande Valley, is accused of routinely stealing photos of Mexican cooking to pass off as her own.  —  The ex-congresswoman Mayra Flores … ",
    "url": "https://www.thedailybeast.com/ex-rep-mayra-flores-says-it-wasnt-her-intention-to-mislead-by-posting-stolen-food-pics"
  },
  {
    "text": "A right-wing tale of Michigan election fraud had it all - except proof  —  Gateway Pundit, a favorite news source of former president Donald Trump's, has pushed false claims of a stolen election even as others have pulled back in the face of consequences  —  The story had all the elements … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/03/gateway-pundit-conservative-news-election-fraud/"
  },
  {
    "text": "Michigan GOP committee plans meeting to remove Kristina Karamo.  She says it's illegal.  —  LANSING — Members of the Michigan Republican Party's state committee have scheduled a special meeting Saturday to consider the removal of Kristina Karamo, though the embattled state party chair … ",
    "url": "https://www.freep.com/story/news/politics/elections/2024/01/02/migop-special-meeting-removal-kristina-karamo/72086061007/"
  },
  {
    "text": "Hezbollah leader promises response to Hamas official's killing  —  Hezbollah's leader Hassan Nasrallah said the alleged Israeli assassination of a top Hamas official in a Beirut suburb Tuesday would not go unanswered.  —  On Wednesday, Nasrallah addressed the killing of Saleh al-Arouri … ",
    "url": "https://thehill.com/policy/international/4387465-hezbollah-leader-nasrallah-hamas-killing/"
  },
  {
    "text": "Immigrants are overwhelming us; I will control the border  —  The border has been a persistent problem my entire adult life, and that is unacceptable.  I will bring this issue to a conclusion once and for all.  —  We are at war, and in crisis.  —  The war is being waged on us by Mexican drug cartels … ",
    "url": "https://www.desmoinesregister.com/story/opinion/columnists/caucus/2024/01/03/ron-desantis-border-chaos-immigrants-reclaim-sovereignty/72093159007/"
  },
  {
    "text": "Michael Cohen can't hold Trump liable for retaliatory imprisonment, appeals court says  —  A three-judge panel concluded Cohen already obtained relief.  —  NEW YORK — Michael Cohen can't hold his former boss, former President Donald Trump, liable because he was jailed for what he claimed … ",
    "url": "https://www.politico.com/news/2024/01/02/michael-cohen-cant-hold-trump-liable-for-retaliatory-imprisonment-appeals-court-says-00133525"
  },
  {
    "text": "First on Fox: Haley more than doubles her fundraising with a $24 million haul the past three months  —  Haley's fundraising haul the past three months appears to be the latest sign of her recent momentum in the race for the Republican presidential nomination",
    "url": "https://www.foxnews.com/politics/first-on-fox-haley-more-than-doubles-her-fundraising-with-24-million-haul-past-three-months.amp"
  }
]