[
  {
    "text": "Trump's real Project 2025 was written for him in Moscow by Vladimir Putin's men  —  Unless you work on the politics desk of the New York Times or Washington Post, it's getting harder and harder not to notice the increasingly incoherent yet also dangerously unhinged nature … ",
    "url": "https://www.inquirer.com/opinion/commentary/gop-trump-campaign-russia-propaganda-20240908.html"
  },
  {
    "text": "The mistakes of 2019 could cost Harris the election  —  Voters think she's too far to the left — but there's plenty of room to define Trump as radical.  —  For the second time this weekend, I'm upending previously laid plans to cover a more time-sensitive story: the New York Times/Siena College poll that came out this morning.",
    "url": "https://www.natesilver.net/p/the-mistakes-of-2019-could-cost-harris"
  },
  {
    "text": "Harris falling behind among male voters in key states  —  New polls show Vice President Harris has a major challenge in winning over male voters and is losing men by a bigger margin than she's winning women in key states such as Pennsylvania, Nevada and North Carolina.",
    "url": "https://thehill.com/homenews/campaign/4866756-harris-trump-male-voters/"
  },
  {
    "text": "September 7, 2024  —  By rights, tonight's post should be a picture, but Trump's behavior today merits a marker because it feels like a dramatic escalation of the themes we've seen for years.  Please feel free to ignore—as I often say, I am trying to leave notes for a graduate student in 150 years … ",
    "url": "https://heathercoxrichardson.substack.com/p/september-7-2024"
  },
  {
    "text": "Trump's Latest Problem?  Republicans for Harris  —  High-profile GOPers aren't just planning to vote for the Democrat, they're organizing and working to convince others.  —  Michael Brodkorb, former deputy chair of the Minnesota Republican Party, finds himself part of an unlikely yet growing wave … ",
    "url": "https://www.bloomberg.com/opinion/articles/2024-09-08/more-republicans-are-leaving-trump-to-vote-for-kamala-harris"
  },
  {
    "text": "Nikki Haley Dismisses Misogyny In Support Of Trump  —  She argued that her focus as a voter is on Trump's policies, not writer E. Jean Carroll's sexual assault case against him or his general “communication.”  —  LOADING  —  Former Republican presidential candidate Nikki Haley prioritized … ",
    "url": "https://www.huffpost.com/entry/nikki-haley-dismisses-misogyny-trump_n_66de3088e4b0850940b52819"
  },
  {
    "text": "Translating the Crazy  —  UPDATES: I got COVID sixteen days ago and, though I am substantially better, I'm still exhausted.  I know every case is different, but is this normal?  Anyway, with my book coming out on Tuesday, there will be no rest for the weary any time soon.  More book news after today's piece.",
    "url": "https://www.marytrump.org/p/translating-the-crazy"
  },
  {
    "text": "Trump, lying about migrants and crime, says mass deportations “will be a bloody story”  —  The former president has claimed he would use police and soldiers to deport at least 12 million undocumented people  —  Donald Trump is threatening that a proposed mass deportation of undocumented immigrants … ",
    "url": "https://www.salon.com/2024/09/08/trump-lying-about-migrants-and-crime-says-mass-deportations-will-be-a-bloody-story/"
  },
  {
    "text": "Cooper says he's ‘tired of seeing texts’ from students telling parents they're afraid of school shootings.  ‘We cannot normalize this.’  —  North Carolina Gov. Roy Cooper (D) said in an interview Sunday that he is “tired of seeing texts from children in a school telling their parents … ",
    "url": "https://thehill.com/homenews/education/4868568-cooper-says-hes-tired-of-seeing-texts-from-students-telling-parents-theyre-afraid-of-school-shootings/"
  },
  {
    "text": "Kimberly Guilfoyle Channels Jeb Bush While Bombing at GOP Event  —  ‘YOU CAN CLAP’  —  Kimberly Guilfoyle had to ask a group of Republicans for applause while delivering a speech on Saturday.  —  Kimberly Guilfoyle, a conservative activist, former prosecutor, and the fiancée to Donald Trump Jr. … ",
    "url": "https://www.thedailybeast.com/kimberly-guilfoyle-channels-jeb-bush-at-florida-gop-victory-dinner"
  },
  {
    "text": "Florida voters who oppose the state's 6-week abortion ban say they are being visited by police  —  Critics accuse Gov. Ron DeSantis of seeking to intimidate supporters of a pro-choice referendum  —  Florida voters who signed a petition to place a pro-choice abortion referendum on the ballot … ",
    "url": "https://www.salon.com/2024/09/08/florida-oppose-the-states-6-week-abortion-ban-say-they-are-being-visited-by-police/"
  },
  {
    "text": "Donald Trump's Camp Is Literally Praying He Won't Blow Prez Debate  —  LIVIN' ON A PRAYER  —  When the president finally faces off against Vice President Kamala Harris on Sept. 10, his Republican allies are hoping he stays on script.  —  Donald Trump's Sept. 10 debate against Vice President Kamala Harris … ",
    "url": "https://www.thedailybeast.com/donald-trumps-camp-is-literally-praying-he-wont-blow-debate-with-vp-kamala-harris"
  },
  {
    "text": "Mysterious influencer network pushed sexual smears of Harris  —  The Scoop  —  The organizers of a mysterious network paid influencers to promote sexual smears of Vice President Kamala Harris as Democrats rallied around her to be their presidential candidate in late July.",
    "url": "https://www.semafor.com/article/09/08/2024/mysterious-influencer-network-pushed-sexual-smears-of-harris"
  },
  {
    "text": "A New Way Forward  —  Together, we can finish the job for the American people.  Are you with us?  Join our campaign to re-elect Joe Biden today!",
    "url": "https://kamalaharris.com/issues/"
  },
  {
    "text": "Wrecked rain gauges.  Whistleblowers.  Million-dollar payouts and manhunts.  Then a Colorado crop fraud got really crazy.  —  Storm clouds roil in this time-lapse video taken over Baca County in southeastern Colorado, where rain is scarce and where for years a criminal enterprise damaged rain gauges … ",
    "url": "https://coloradosun.com/2024/09/08/patrich-esch-ed-dean-jagers-ranchers-fraud-insurance/"
  },
  {
    "text": "GOP plots Pennsylvania onslaught as Democrats battle to keep ‘really difficult’ Senate seat  —  For more on CNN's coverage of the US Senate race in Pennsylvania, watch CNN's “Inside Politics with Manu Raju” on Sunday at 8 a.m. ET and 11 a.m. ET.﻿  —  Pen Argyl, Pennsylvania CNN  —",
    "url": "https://www.cnn.com/2024/09/08/politics/pennsylvania-senate-race-bob-casey/"
  }
]