[
  {
    "text": "Scoop: Trump personally squeezes senators on Matt Gaetz … - “He clearly wants Matt Gaetz,” said Sen. Kevin Cramer (R-N.D.), who received a call from Trump. … - “One thing about Donald Trump, people should never confuse his support for one of his nominees as a tactical or strategic tool for somebody else,” Cramer said.",
    "url": "https://www.axios.com/2024/11/18/trump-gaetz-confirmation-senate"
  },
  {
    "text": "Negative signs for Gaetz as senators brush off questions amid Trump pressure  —  A negative sign looms for Matt Gaetz: Nearly a dozen GOP senators won't commit to confirming him for attorney general, saying they want to let the process play out.  And many, even if they aren't insisting … ",
    "url": "https://www.politico.com/live-updates/2024/11/18/congress/gop-senators-on-gaetz-ethics-report-00190295"
  },
  {
    "text": "Gaetz May Not Be Confirmed, Trump Admits.  He's Pushing Him and Others Anyway.  —  The president-elect is taking a flood-the-zone approach to his cabinet nominations, betting that the Senate won't dare to turn them all down.  —  In his private conversations over the past few days … ",
    "url": "https://www.nytimes.com/2024/11/18/us/politics/trump-cabinet.html"
  },
  {
    "text": "Mace introduces bill to bar trans women from Capitol restrooms  —  Rep. Nancy Mace (R-S.C.) on Monday introduced a bill to bar transgender women from facilities on Capitol Hill that match their gender identity.  —  The resolution, which would prohibit members, officers and employees … ",
    "url": "https://thehill.com/homenews/house/4997024-mace-introduces-bill-transgender/"
  },
  {
    "text": "Transgender women to be banned from Capitol Hill female bathrooms under new House GOP proposal  —  Rep Nancy Mace wants provision included in next House rules package  —  FIRST ON FOX: Rep. Nancy Mace, R-S.C., is introducing a resolution to ban transgender women from using women's restrooms at the U.S. Capitol.",
    "url": "https://www.foxnews.com/politics/transgender-women-banned-from-capitol-hill-female-bathrooms-under-new-house-gop-proposal"
  },
  {
    "text": "Lawyer tells ABC News his 2 clients told House Ethics Committee that Gaetz paid them for sex  —  Trump has tapped Gaetz, a former congressman, to be the new attorney general.  —  Rep. Matt Gaetz departs after speaking during the Conservative Political Action Conference, CPAC 2024 … ",
    "url": "https://abcnews.go.com/US/lawyer-tells-abc-news-2-clients-told-house/story?id=115863675"
  },
  {
    "text": "Two women testified that Matt Gaetz paid them for sex, lawyer says  —  An attorney representing two witnesses in the House Ethics Committee investigation goes public  —  A woman testified to the House Ethics Committee that former Rep. Matt Gaetz paid her for sex and that she witnessed … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/18/matt-gaetz-ethics-report-allegations/"
  },
  {
    "text": "Trump nominates former Rep. Sean Duffy as transportation secretary  —  President-elect Donald Trump nominated former Rep. Sean Duffy as transportation secretary.  —  After appearing on several reality TV shows, on which he met his wife, Duffy served as a district attorney in Wisconsin from 2002 to 2010.",
    "url": "https://www.washingtonexaminer.com/news/white-house/3234060/trump-nominates-sean-duffy-transportation-secretary/"
  },
  {
    "text": "‘Kissing the ring?’  MSNBC ‘Morning Joe’ hosts meet with Trump to reopen lines of communication  —  MSNBC hosts Joe Scarborough and Mika Brzezinski, fierce critics of President-elect Donald Trump, say they traveled to Mar-a-Lago for a meeting with him to reopen lines of communication that would better serve their morning show viewers.",
    "url": "https://apnews.com/article/morning-joe-trump-meeting-ring-cf4816dd28372a4c942d256df2e440ae"
  },
  {
    "text": "For Minority Working-Class Voters, Dismay in Democrats Led to Distrust  —  In scores of interviews throughout 2024, Latino, Black and Asian American voters, many of whom voted for Donald Trump, said they no longer trusted Democrats to improve the economy.  —  The working-class voters Vice … ",
    "url": "https://www.nytimes.com/2024/11/19/us/politics/trump-working-class-voters.html"
  },
  {
    "text": "Dan Osborn Wants to Help the Working Class Run for Office  —  Mr. Osborn, the industrial mechanic who turned a long-shot Senate bid in red Nebraska into an unexpectedly tight race, is starting a PAC aimed at recruiting more blue-collar candidates like himself.",
    "url": "https://www.nytimes.com/2024/11/19/us/politics/dan-osborn-working-class-pac.html"
  },
  {
    "text": "Pennsylvania Dem Gov. Josh Shapiro sides with state supreme court ruling not to count certain mail-in ballots  —  The ruling is a victory for GOP officials in an effort to keep the party's narrow Senate victory  —  Join Fox News for access to this content  —  Pennsylvania Gov. Josh Shapiro … ",
    "url": "https://www.foxnews.com/politics/pennsylvania-dem-gov-josh-shapiro-sides-state-supreme-court-ruling-not-count-certain-mail-in-ballots"
  },
  {
    "text": "RFK Jr. is a massive public health threat  —  Dems like Jared Polis shouldn't pretend pretend otherwise.  —  ∙ Paid … Donald Trump, in his vacuous orange wisdom, has nominated vaccine denier, crank, and champion of disease Robert F. Kennedy Jr. to be the Secretary of Health and Human Services (HHS).",
    "url": "https://www.publicnotice.co/p/rfk-jr-public-health-threat-vaccines"
  },
  {
    "text": "Trump Reminds Everyone: He Wants US Soldiers in US Streets  —  At 4:03 a.m. ET, the President-elect was online.  He was thinking about “military assets” and mass deportations.  —  Tom Fitton, the right-wing activist and Judicial Watch leader, had written a post on the incoming President's … ",
    "url": "https://talkingpointsmemo.com/news/trump-reminds-everyone-he-wants-us-soldiers-in-us-streets"
  },
  {
    "text": "Leak it like Sam Alito  —  What is obviously a very damning report about Matt Gaetz is now available for everyone on the Ethics Committee to view: … Guest's claims to be free of influence from leadership are the antithesis of credible.  But it shouldn't matter.",
    "url": "https://www.lawyersgunsmoneyblog.com/2024/11/leak-it-like-sam-alito"
  },
  {
    "text": "The first task for Musk's Department of Government Efficiency  —  President-elect Donald Trump has appointed Elon Musk and former presidential candidate Vivek Ramaswamy to head the Department of Government Efficency.  Despite the name, it is not a government department.  In fact, it is not part of the government at all.",
    "url": "https://popular.info/p/the-first-task-for-musks-department"
  },
  {
    "text": "Ken Martin, a Minnesotan With Deep Democratic Ties, Joins the D.N.C. Race  —  The chairman of Minnesota Democrats, he has longstanding connections to many of the Democratic National Committee members who will choose their next leader.  —  The race for chair of the Democratic National Committee … ",
    "url": "https://www.nytimes.com/2024/11/19/us/politics/ken-martin-dnc-race.html"
  },
  {
    "text": "Judge strikes down Wyoming abortion laws, including an explicit ban on pills to end pregnancy  —  Cheyenne, Wyoming AP  —  A state judge on Monday struck down Wyoming's overall ban on abortion and its first-in-the-nation explicit prohibition on the use of medication to end pregnancy.",
    "url": "https://www.cnn.com/2024/11/18/politics/wyoming-abortion-laws-struck-down"
  },
  {
    "text": "Corporate America Touts Funding Employee ‘Abortion Travel’ But Is Largely Silent On Child Care Benefits, Report Finds  —  Many Fortune 100 companies offer paid “abortion travel” benefits but do not openly share childcare benefits, a report released Tuesday found.",
    "url": "https://ijr.com/corporate-america-touts-funding-employee-abortion-travel-but-is-largely-silent-on-child-care-benefits-report-finds/"
  },
  {
    "text": "Recess appointments complicate Republican honeymoon  —  The Washington Post's essential guide to power and influence in D.C.  —  Sign upfor Early Brief newsletter  —  Good morning, Early Birds.  Former first lady Rosalynn Carter died one year ago today.  Rest in peace.  Send tips to earlytips@washpost.com.",
    "url": "https://www.washingtonpost.com/politics/2024/11/19/recess-appointments-complicate-republican-honeymoon/"
  },
  {
    "text": "‘Ready for prime time’: Trump trots out once-scorned economic plans  —  The new world of policy debate reflects Trump's towering influence over a GOP that he has transformed, boosting ideas once considered quixotic or ill-advised in Washington.  —  Donald Trump has been president before … ",
    "url": "https://www.politico.com/news/2024/11/19/trump-unusual-economic-ideas-00189559"
  }
]