[
  {
    "text": "Trump's Puerto Rico fallout is ‘spreading like wildfire’ in Pennsylvania  —  Evidence of the backlash was immediate on Monday.  —  Donald Trump has a serious Puerto Rico problem — in Pennsylvania.  —  Many Puerto Rican voters in the state are furious about racist and demeaning comments delivered at a Trump rally.",
    "url": "https://www.politico.com/news/2024/10/28/trump-rally-puerto-rico-pennsylvania-fallout-00185935"
  },
  {
    "text": "Trump claims to ABC's Scott he didn't hear comedian's Puerto Rico comment, doesn't denounce it  —  The former president denied knowing the comedian who made a slew of racist, sexist and vulgar comments at his rally at Madison Square Garden, ABC News Senior Congressional Correspondent Rachel Scott reports.",
    "url": "https://abcnews.go.com/Politics/live-updates/2024-election-updates-harris-make-closing-argument-amid?id=115252538&entryId=115254897"
  },
  {
    "text": "Trump denies knowing comedian who made Puerto Rico joke at his rally … - People Trump claims not to have known include rapper Lil Jon, who was a contestant on Celebrity Apprentice; Prince Andrew; Rudy Giuliani associate Lev Parnas, who was part an effort to pressure Ukraine to investigate President Biden … ",
    "url": "https://www.axios.com/2024/10/29/trump-comment-puerto-rico-rally-tony-hinchcliffe"
  },
  {
    "text": "‘Racist, sexist, crude’: Media outlets use strong language to describe Trump rally  —  The tone of Sunday's Madison Square Garden rally was angry and offensive, and that's how many major news organizations chose to describe it  —  Who would've guessed that the October surprise … ",
    "url": "https://www.poynter.org/commentary/2024/racist-comments-at-trump-rally-media-coverage/"
  },
  {
    "text": "That Revolting Rally Was a Sign of Weakness  —  Donald Trump's rally at Madison Square Garden on Sunday night was supposed to be the capstone event of his campaign, a triumphant celebration of authoritarian strength.  With millions watching, he would march into the final week of the contest … ",
    "url": "https://www.nytimes.com/2024/10/29/opinion/that-revolting-rally-was-a-sign-of-weakness.html"
  },
  {
    "text": "The hard truth: Americans don't trust the news media  —  A note from our owner.  —  Jeff Bezos is the owner of The Washington Post.  —  In the annual public surveys about trust and reputation, journalists and the media have regularly fallen near the very bottom, often just above Congress.",
    "url": "https://www.washingtonpost.com/opinions/2024/10/28/jeff-bezos-washington-post-trust/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMwMDg4MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxNDczOTk5LCJpYXQiOjE3MzAwODgwMDAsImp0aSI6IjE5ZGQxMWNiLWNjNjItNDA4Ni05YjM1LTA5MTYxYWQwMDliMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzEwLzI4L2plZmYtYmV6b3Mtd2FzaGluZ3Rvbi1wb3N0LXRydXN0LyJ9.3bGpycf0p1iM1CkeklMNEzduE_s3yEK9Zk0jtEYt0Uk&itid=gfta"
  },
  {
    "text": "Steve Bannon Is Getting Out Of Prison — And Heading Right Back To Court  —  The longtime Trump ally went to prison after refusing to comply with the Jan. 6 congressional committee.  Now he's facing conspiracy, fraud and money laundering charges.  —  Former Trump White House strategist Steve Bannon … ",
    "url": "https://www.huffpost.com/entry/steve-bannon-prison-release-trial_n_671bf93ee4b0fdf4fef4622a"
  },
  {
    "text": "Steve Bannon is released from prison in time for the last-week push to Election Day  —  Steve Bannon was released from federal prison Tuesday, according to a source with knowledge, emerging just a week before Election Day to retake the helm of his weakened right-wing media platform.",
    "url": "https://www.cnn.com/2024/10/29/politics/steve-bannon-released-prison/"
  },
  {
    "text": "George W. Bush's Daughter Barbara Breaks Silence on Election to Campaign for Kamala Harris (Exclusive)  —  Barbara Pierce Bush tells PEOPLE she's “hopeful” that voters will back Harris on Nov. 5 to “move our country forward and protect women's rights”  —  Barbara Pierce Bush … ",
    "url": "https://people.com/george-w-bush-s-daughter-barbara-breaks-silence-on-election-to-campaign-for-kamala-harris-exclusive-8735810"
  },
  {
    "text": "Trump Betrayed America.  My Fellow Republicans Must Put Country Above Party.  —  We Americans live in faith with our Constitution and with the past generations of Americans who swore to protect it and fought to defend it.  One week from today, we will decide whether Donald Trump is fit to be President of the United States again.",
    "url": "https://www.nytimes.com/2024/10/29/opinion/donald-trump-oath.html?unlocked_article_code=1.V04.XaMn.AdZJxeNuANua&smid=url-share"
  },
  {
    "text": "How to Prevent the Worst From Happening … Many republicans would say that it is one thing, and quite an awful thing, to withhold a vote from Donald Trump—but that voting for Kamala Harris, a “San Francisco Democrat,” is nothing short of a betrayal, an act of apostasy, impossible for any true conservative to justify.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/10/conservative-argument-against-trump/680438/"
  },
  {
    "text": "The most misogynistic ad in the history of politics  —  Elon Musk created America PAC to help Donald Trump win the presidential election.  Through the end of September, Musk spent $75 million to fund the PAC's activities.  More recently, Musk began giving away $1 million per day to registered voters … ",
    "url": "https://popular.info/p/the-most-misogynistic-ad-in-the-history"
  },
  {
    "text": "Burning Ballots  —  It's not what we normally expect in American elections, but it was all too predictable in this election cycle.  —  This morning in Portland, Oregon, an incendiary device attached to the outside of a ballot drop box started a fire inside of it.",
    "url": "https://joycevance.substack.com/p/burning-ballots"
  },
  {
    "text": "Poop artist strikes again with neo-Nazi tiki torch statue for Trump  —  The statue's plaque recalls the former president and the white supremacists who rallied in Charlottesville in 2017.  —  Mysterious political art is having a moment in the heart of Washington.",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/10/28/tiki-torch-statue-poop-artist-freedom-plaza-white-supremacists-charlottesville/"
  },
  {
    "text": "A vote for Donald Trump is a vote for school shootings and measles  —  An endorsement of democracy, solving problems, and Kamala Harris. … Donald Trump is a dangerous maniac who can barely complete a sentence, and it is lunacy to believe he can even recognize the existentially threatening … ",
    "url": "https://www.theverge.com/24282022/kamala-harris-endorsement-presidential-election-2024"
  },
  {
    "text": "Elon Musk Bought a Texas Compound for His 11 Kids and Their Mothers … On a quiet, leafy street of multimillion-dollar properties, one stands out: a 14,400-square-foot mansion that looks like a villa plucked from the hills of Tuscany and transplanted to Austin, Texas.",
    "url": "https://www.nytimes.com/2024/10/29/business/elon-musk-children-compound.html?unlocked_article_code=1.V04.UATk.-c9h3lGvBo8r&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "She Supports Trump's Anti-Immigration Policies.  Texas Incorrectly Flagged Her as a “Noncitizen” on Its Voting Rolls.  —  Mary Howard-Elley is the 10th U.S. citizen identified by ProPublica, The Texas Tribune and Votebeat whose registration was canceled after her citizenship was questioned.",
    "url": "https://www.propublica.org/article/texas-noncitizen-voter-roll-removal-mary-howard-elley"
  },
  {
    "text": "PhD student finds lost city in Mexico jungle by accident  —  A huge Maya city has been discovered centuries after it disappeared under jungle canopy in Mexico.  —  Archaeologists found pyramids, sports fields, causeways connecting districts and amphitheatres in the southeastern state of Campeche.",
    "url": "https://www.bbc.com/news/articles/crmznzkly3go"
  },
  {
    "text": "Trump identifies a scapegoat in case he loses … - Under Whatley — and at Trump's insistence — Republicans say they've amassed 200,000 poll watchers and poll workers across the country.  — It's an unprecedented program that's partly aimed at collecting evidence of voter fraud … ",
    "url": "https://www.axios.com/2024/10/29/trump-scapegoat-republicans-campaign"
  },
  {
    "text": "Trump Media shares halted repeatedly as DJT whipsaws in volatile trading … Trading of Trump Media shares was halted for volatility multiple times Tuesday morning as the company majority-owned by Donald Trump ricocheted in early trading.  —  The company, which trades as DJT on the Nasdaq … ",
    "url": "https://www.cnbc.com/2024/10/29/trump-media-shares-halted-for-volatility-as-djt-rally-accelerates.html"
  },
  {
    "text": "Political ads boost local TV … - While streaming ads make it easier for campaigns to target niche voting demographics, they often lack the scale necessary to persuade large amounts of voters in a particular region.  — Regulations around local broadcast ads meant to prevent bias also benefit campaigns … ",
    "url": "https://www.axios.com/2024/10/29/political-ads-boost-local-tv"
  },
  {
    "text": "Secret Documents!  The Ten Month Privilege Fight Whingers Claim Didn't Happen  —  As always happens when people who don't bother to check the public record get afraid, folks are complaining about Merrick Garland again, both that they didn't notice the number of times Garland explained publicly … ",
    "url": "https://www.emptywheel.net/2024/10/29/secret-documents-the-ten-month-privilege-fight-whingers-claim-didnt-happen/"
  },
  {
    "text": "Elon Musk's “illegal” past doesn't feel like hypocrisy to MAGA — Trump's hate rally in NYC shows why  —  Attacks on Puerto Ricans and other native-born citizens made it clear: this is about race, not immigration  —  Last week, the Washington Post reported that Tesla CEO … ",
    "url": "https://www.salon.com/2024/10/29/elon-musks-illegal-past-doesnt-feel-like-hypocrisy-to-maga--hate-rally-in-nyc-shows-why/"
  },
  {
    "text": "Nato says North Korean troops deployed to Russia's Kursk region  —  North Korean troops have been deployed to Russia and are operating in the Kursk border region where Ukrainian troops have a foothold, Nato has said for the first time.  —  The alliance's Secretary General, Mark Rutte … ",
    "url": "https://www.bbc.com/news/articles/cyv737vy376o"
  }
]