[
  {
    "text": "Trump Administration Live Updates: Johnson Shutting Down House Early to Block Epstein Vote  —  Where Things Stand  — Epstein case: Speaker Mike Johnson said he would shut the House down early for its summer recess to head off Democratic demands for votes on calling for the release of files … ",
    "url": "https://www.nytimes.com/live/2025/07/22/us/trump-news?unlocked_article_code=1.YU8.XvZe.Uq4wam0YefJ6&smid=url-share"
  },
  {
    "text": "Outraged Trump supporters not placated by DOJ's actions on Epstein … Even Bondi's announcement on Tuesday that the Justice Department would seek to interview Epstein's co-conspirator Ghislaine Maxwell - who is serving a 20-year prison sentence for child sex trafficking and other crimes - was met with disdain.",
    "url": "https://www.politico.com/news/2025/07/22/trump-maga-supporters-epstein-doj-00467887"
  },
  {
    "text": "House cancels its last day of votes before summer break as Epstein consumes Capitol Hill  —  Speaker Mike Johnson expressed unusual frustration with fellow Republican Rep. Thomas Massie, who is working with Democrats to force the release of the Epstein files.",
    "url": "https://www.nbcnews.com/politics/congress/house-cancels-votes-fight-jeffrey-epstein-files-rcna220238"
  },
  {
    "text": "Bypassing Habba, Judges in New Jersey Name New Top Federal Prosecutor  —  Alina Habba's term as interim U.S. attorney was set to expire on Tuesday.  New Jersey's two Democratic senators had accused her of pursuing “frivolous and politically motivated prosecutions.”",
    "url": "https://www.nytimes.com/2025/07/22/nyregion/alina-habba-nj-us-attorney.html?unlocked_article_code=1.YU8.xiUk.VhXWrRUwYs2C&smid=url-share"
  },
  {
    "text": "Judges vote to oust Trump pick Alina Habba as U.S. attorney in New Jersey  —  The state's U.S. district court judges made the announcement in a brief order that did not offer any explanation for their decision.  —  New Jersey's federal judges declined Tuesday to appoint Alina Habba … ",
    "url": "https://www.washingtonpost.com/national-security/2025/07/22/trump-lawyer-alina-habba-nj-us-attorney/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzMTU2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU0NTM5MTk5LCJpYXQiOjE3NTMxNTY4MDAsImp0aSI6IjE4ZTBhYmRhLTM1ZWUtNGViNC1iNWY3LWY1YzQzODRkYWMxMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA3LzIyL3RydW1wLWxhd3llci1hbGluYS1oYWJiYS1uai11cy1hdHRvcm5leS8ifQ.BphElPTMKa8bj56BBMNgBsUAWWYS8dHo5_4cjj1_Ghs&itid=gfta"
  },
  {
    "text": "Trump Goes Full Fascist: 'Whether It's Right or Wrong, It's Time to Go After People'  —  The president is desperate to turn the nation's attention away from his ties to Jeffrey Epstein … He spent the weekend suggesting prominent Democrats should be prosecuted over bogus right-wing conspiracy theories … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-fascist-doj-go-after-obama-1235391240/"
  },
  {
    "text": "Republicans propose naming Kennedy Center Opera House after Melania Trump  —  The House Appropriations committee passed an amendment that would rename the theater, months after President Donald Trump took over the performing arts center.  —  The Kennedy Center's Opera House could soon be called the … ",
    "url": "https://www.washingtonpost.com/entertainment/theater/2025/07/22/melania-trump-kennedy-center-opera-house-appropriations-bill/"
  },
  {
    "text": "Exclusive: Newly discovered photos and video shed fresh light on Trump's ties to Jeffrey Epstein  —  Newly uncovered archived video footage and photos reveal fresh details about Donald Trump's past relationship with Jeffrey Epstein.  —  Photos from 1993 confirm for the first time that Epstein … ",
    "url": "https://cnn.com/2025/07/22/politics/kfile-trump-epstein-photos-footage"
  },
  {
    "text": "NPR news chief announces she's leaving days after Congress kills federal funding  —  NPR's editor in chief and acting chief content officer Edith Chapin told colleagues Tuesday morning that she has decided to step down.  —  The veteran news leader's announcement comes just days … ",
    "url": "https://www.npr.org/2025/07/22/nx-s1-5476192/npr-news-chief-edith-chapin-to-step-down-congress-funding-trump"
  },
  {
    "text": "Bari Weiss seeks more than $200mn for media start-up The Free Press  —  ‘Anti-woke’ journalist holds talks with incoming CBS owner David Ellison over sale of new media venture  —  Ivan Levingston and Daniel Thomas in London, James Fontanella-Khan and Anna Nicolaou in New York",
    "url": "https://www.ft.com/content/0f1ce3d6-35bc-461f-9685-13e2dfddb08d"
  },
  {
    "text": "U.S. Olympic Officials Bar Transgender Women From Women's Competitions  —  The United States Olympic & Paralympic Committee changed its eligibility rules on Monday to comply with President Trump's executive order on the issue, taking the decision away from national governing bodies for each sport.",
    "url": "https://www.nytimes.com/2025/07/22/us/politics/us-olympics-trans-women-athletes-ban-trump.html"
  },
  {
    "text": "Hunter Biden Really Needs to Shut It  —  QUIET TIME  —  Why is he talking?  Why is he still talking?  —  OPINION  —  Let's establish a few quick facts about Hunter Biden: He has never been elected to anything, ever.  His business acumen appears to amount, largely, to having the last name “Biden.”",
    "url": "https://www.thedailybeast.com/hunter-biden-really-needs-to-shut-it/"
  },
  {
    "text": "‘Those days are over’: Trump books draw lackluster sales … “Everyone is desperately looking for the next Michael Wolff or James Comey for next year, but it's not clear there could ever be one again,” said one concerned publisher, referencing two of the authors with biggest book successes of Trump's first term.",
    "url": "https://www.politico.com/news/2025/07/22/donald-trump-books-nonfiction-sales-00466907"
  },
  {
    "text": "Trump Told Park Workers to Report Displays That ‘Disparage’ Americans.  Here's What They Flagged.  —  Descriptions and displays at scores of parks and historic sites have been flagged for review in connection with an executive order from President Trump.  —  At Cape Hatteras National Seashore … ",
    "url": "https://www.nytimes.com/2025/07/22/climate/trump-national-park-service-history-changes.html"
  },
  {
    "text": "Self-proclaimed Catholic fascist fired after Jubilee appearance  —  The self-proclaimed Catholic fascist who recently appeared on an episode of Surrounded by the popular YouTube channel Jubilee has lost his job following the programme's release.  The debate, which first aired on Sunday … ",
    "url": "https://thecatholicherald.com/article/self-proclaimed-catholic-fascist-fired-after-jubilee-appearance"
  },
  {
    "text": "FEMA Urban Search and Rescue Chief Resigns, Citing Agency ‘Chaos’, Colleagues Said  —  Ken Pagurek had told colleagues the Trump administration was causing ‘chaos’ inside FEMA and creating dangerous delays in disaster response.  —  The head of the Federal Emergency Management Agency's urban search … ",
    "url": "https://www.nytimes.com/2025/07/22/climate/fema-urban-search-rescue-chief-resigns.html?unlocked_article_code=1.YU8.mVWB.gPbabybsR3SL&smid=url-share"
  },
  {
    "text": "Rent Prices Are Falling Fast in America's Most Pro-Housing Cities  —  Rental prices in some of the country's largest cities are falling—some by almost 45 percent, according to new data from Five Star Cash Offer, a real estate investment firm that operates as a direct cash homebuyer.",
    "url": "https://reason.com/2025/07/22/rent-prices-are-falling-fast-in-americas-most-pro-housing-cities/"
  },
  {
    "text": "GOP Confirms Anti-Abortion Judge With Help From An Independent Senator  —  Senate Republicans handed Trump a win on Tuesday with confirmation of one his first judicial nominees, Joshua Divine.  —  Divine, 35, will now hold a lifetime seat on a U.S. district court in Missouri.",
    "url": "https://www.huffpost.com/entry/trump-tariffs-white-house-latest_n_686ec29fe4b09bd98fe4be7e/liveblog_687febe6e4b05e47c5b83536"
  },
  {
    "text": "US Nuclear Weapons Agency Breached in Microsoft SharePoint Hack  —  The US agency responsible for maintaining and designing the nation's cache of nuclear weapons was among those breached by a hack of Microsoft Corp.'s SharePoint document management software, according to a person with knowledge of the matter.",
    "url": "https://www.bloomberg.com/news/articles/2025-07-23/us-nuclear-weapons-agency-breached-in-microsoft-sharepoint-hack"
  },
  {
    "text": "Military Says It Will ‘Continuously’ Monitor Bathrooms to Comply With Anti-Trans Order  —  This article was primarily reported using public records requests.  We are making it available to all readers as a public service.  FOIA reporting can be expensive, please consider subscribing to 404 Media to support this work.",
    "url": "https://www.404media.co/pentagon-says-it-will-continuously-monitor-bathrooms-to-comply-with-anti-trans-order/"
  },
  {
    "text": "There's No Safe Place for Legal Immigrants in Trump's America  —  As Trump's deportation gangs continue snatching people after scheduled court hearings, more are opting to stay home.  But that comes with its own dangers.  —  Federal immigration officers continue to target noncitizens … ",
    "url": "https://prospect.org/justice/2025-07-22-no-safe-place-for-legal-immigrants-trumps-america/"
  },
  {
    "text": "A Manhattan Institute Manifesto Would Give this President Sweeping Power to Force University Compliance with Right-Wing Demands  —  Many persons I'd think would know better have affixed their names to a new and highly illiberal set of demands on colleges and universities.",
    "url": "https://www.theunpopulist.net/p/a-manhattan-institute-manifesto-would"
  },
  {
    "text": "Revealed: Harvard publisher cancels entire journal issue on Palestine shortly before publication  —  As Harvard's feud with Trump escalated, so did tensions over an ‘education and Palestine’ issue of a prestigious journal.  Scholars blame the ‘Palestine exception’ to academic freedom",
    "url": "https://www.theguardian.com/education/2025/jul/22/harvard-educational-review-palestine-issue-cancelled"
  },
  {
    "text": "Trump Expects $20 Million More in Ad Dollars From ‘60 Minutes’ Settlement  —  President posts on social media that he will receive more than the already agreed to $16 million payment  —  President Trump said that he anticipates receiving advertising and public service ad commitments worth $20 million … ",
    "url": "https://www.wsj.com/business/media/trump-60-minutes-cbs-settlement-5e3f1ce0"
  },
  {
    "text": "Columbia finally punishes anti-Israel rioters over violent library takeover, slaps dozens of students with suspensions, expulsions  —  Dozens of anti-Israel rabble-rousers were slapped with hefty suspensions and a handful were fully expelled after they took part in the recent violent takeover … ",
    "url": "https://nypost.com/2025/07/22/us-news/columbia-finally-punishes-anti-israel-rioters-over-violent-library-takeover-slaps-students-with-multi-year-suspensions-expulsions/"
  },
  {
    "text": "Deaf, mute and terrified: ICE arrests DACA recipient and ships him to Texas  —  “I was shocked at what was happening to me,” Javier Diaz Santana, 32, said of his arrest by immigration agents.  He has no criminal history.  —  He was on his way to wash a car when he glanced up and saw co-workers sprinting off.",
    "url": "https://www.latimes.com/california/story/2025-07-22/ice-arrests-daca-recipient-at-california-car-wash"
  }
]