[
  {
    "text": "What Biden *really* says about Trump behind closed doors  —  Welcome to POLITICO's West Wing Playbook, your guide to the people and power centers in the Biden administration.  With help from producer Raymond Rapada.  —  President JOE BIDEN has a reputation for salty language behind closed doors.",
    "url": "https://www.politico.com/newsletters/west-wing-playbook/2024/02/01/what-biden-really-says-about-trump-behind-closed-doors-00139178"
  },
  {
    "text": "Special counsel questioned witnesses about 2 rooms FBI didn't search inside Trump's Mar-a-Lago residence: Sources  —  The FBI missed the rooms in their search for classified documents, said sources.  —  In this June 9, 2017, file photo, President Donald Trump is shown at the White House in Washington, D.C.",
    "url": "https://abcnews.go.com/US/special-counsel-questioned-witnesses-2-rooms-fbi-search/story?id=106826552"
  },
  {
    "text": "Republicans' plotting to block a Democratic president goes public  —  A bill under consideration in the House would, among other things, expand the child tax credit to the benefit of parents earning $40,000 a year or less.  —  In the 2022 General Social Survey, over two-thirds of people … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/01/grassley-republicans-biden-border-deal/"
  },
  {
    "text": "House Democrats continue to do the legislative heavy lifting  —  When the House passed a $78 billion tax package, it was members of the Democratic minority who provided most of the votes.  This keeps happening.  —  As awful as the current Congress is, it would be an overstatement to argue … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/house-democrats-continue-legislative-heavy-lifting-rcna136749"
  },
  {
    "text": "Trump's Former Finance Chief in Negotiations to Plead Guilty to Perjury  —  Allen H. Weisselberg would admit to lying on the stand during the former president's civil fraud trial, according to people familiar with the talks.  —  Allen H. Weisselberg, a longtime lieutenant to Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/02/01/nyregion/weisselberg-perjury-trump-fraud.html"
  },
  {
    "text": "Oregon high court says 10 GOP state senators who staged long walkout can't run for reelection  —  Last year's boycott lasted six weeks — the longest in state history — and paralyzed the legislative session, stalling hundreds of bills.  —  SALEM, Oregon — The Oregon Supreme Court said Thursday … ",
    "url": "https://www.politico.com/news/2024/02/01/oregon-supreme-court-gop-walkout-00139079"
  },
  {
    "text": "Trump NY fraud verdict now expected by mid-February: Court  —  A New York judge is expected to issue an “early to mid-February” ruling in the $370 million civil fraud case brought against former President Trump by the New York attorney general's office, a court spokesperson said Thursday.",
    "url": "https://thehill.com/regulation/court-battles/4443327-trump-ny-fraud-verdict-now-expected-by-mid-february-court/"
  },
  {
    "text": "Christian Ziegler Told His Wife to ‘Hunt’ For Sex Partners  —  New police records also show Ziegler's Google searches for “OnlyFans” and the average settlement amount for sexual battery.  —  Former Florida GOP chair Christian Ziegler and his wife, Bridget—known for promoting “family values” … ",
    "url": "https://www.thedailybeast.com/christian-ziegler-told-his-wife-to-hunt-for-sex-partners"
  },
  {
    "text": "Early election-year polls can be dead on.  But you can't tell which.  —  At the end of January 2020, The Washington Post and our partners at ABC News released one of the most accurate presidential election polls in recent history.  In a head-to-head contest against Joe Biden … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/01/presidential-election-polls-results/"
  },
  {
    "text": "Sorry Appin, We're Not Taking Down Our Article About Your Attempts To Silence Reporters  —  Back in December, we wrote about Appin.  We were not writing about the reports (of which there have been many) that the organization that started as a sort of cybersecurity training school … ",
    "url": "https://www.techdirt.com/2024/02/01/sorry-appin-were-not-taking-down-our-article-about-your-attempts-to-silence-reporters/"
  },
  {
    "text": "MAGA World Is About to Meet Taylor Swift's Fandom.  It Won't Go Well.  —  Swift expert Brian Donovan on why the political right is targeting a rich, heteronormative pop star.  —  A lot of Swifties take their cues from Taylor Swift, they listen to her statements about politics and absorb them and act on them.",
    "url": "https://www.politico.com/news/magazine/2024/02/01/the-twisted-logic-of-the-taylor-swift-backlash-it-seems-like-political-suicide-00138924"
  },
  {
    "text": "Republicans smeared Ilhan Omar over a faulty translation.  Here's what she really said.  —  (L-R) Rep. Rashida Tlaib (D-MI), Rep. Ilhan Omar (D-MN) and Rep. Jamaal Bowman (D-NY) take questions during a news conference about Islamophobia on Capitol Hill on November 30, 2021 in Washington, DC.",
    "url": "https://minnesotareformer.com/2024/02/01/republicans-smeared-ilhan-omar-over-a-faulty-translation-heres-what-she-really-said/"
  },
  {
    "text": "Ex-CIA hacker who leaked secrets to WikiLeaks gets 40 years in prison  —  A former CIA software engineer who was convicted of carrying out the largest data breach in the agency's history was sentenced to 40 years in prison on Thursday, the Department of Justice announced.",
    "url": "https://www.axios.com/2024/02/02/cia-hacker-wikileaks-joshua-schulte-sentenced"
  },
  {
    "text": "RFK Jr. blames young campaign staffer for TikTok thirst trap comment  —  “The TikTok comment in question was made in 2022 long before I ever had a TikTok account,” the presidential hopeful posted on social media.  —  Robert F. Kennedy Jr. denied accusations Thursday that he left a comment … ",
    "url": "https://www.politico.com/news/2024/02/01/rfk-jr-tiktok-thirst-trap-00139139"
  },
  {
    "text": "Pass the Immigration Bill  —  There's high drama unfolding on the southern border.  Even as undocumented immigrants are flooding across at an extraordinary pace, the governor of Texas is pretending to defy the Supreme Court, and other Republican governors are threatening to send National Guard units … ",
    "url": "https://www.nytimes.com/2024/02/01/opinion/america-immigration-asylum.html"
  },
  {
    "text": "First on CNN: House Ethics Committee reached out to Rep. Matt Gaetz's ex-girlfriend amid ongoing investigation  —  The House Ethics Committee investigating Rep. Matt Gaetz has reached out to an ex-girlfriend who was a key witness in the federal investigation into the Florida lawmaker … ",
    "url": "https://www.cnn.com/2024/02/01/politics/matt-gaetz-ethics-committee"
  },
  {
    "text": "Iowa lawmakers decline to advance bill that would remove gender identity from the state's civil rights law  —  Iowa lawmakers declined to advance a bill Thursday that would remove gender identity from the state's civil rights law.  —  All three members of a subcommittee voted to not advance the bill Wednesday.",
    "url": "https://thehill.com/homenews/lgbtq/4443564-iowa-lawmakers-decline-advance-bill-removing-gender-identity-state-civil-rights-law/"
  },
  {
    "text": "123 passengers sickened aboard cruise ship: CDC  —  More than 100 passengers and crew aboard a Queen Victoria cruise ship have fallen sick with a gastrointestinal illness, the Centers for Disease Control and Prevention (CDC) reported.  —  The Cunard Cruise Line ship departed on Jan. 22 … ",
    "url": "https://thehill.com/policy/healthcare/4443658-123-passengers-sickened-aboard-cruise-ship-cdc/"
  },
  {
    "text": "Among Black adults, those with higher incomes are most likely to say they are happy  —  More than eight-in-ten Black adults say they are at least somewhat happy these days, according to a spring 2023 Pew Research Center survey of Black Americans.  However, Black adults with upper family incomes … ",
    "url": "https://www.pewresearch.org/short-reads/2024/02/01/among-black-adults-those-with-higher-incomes-are-most-likely-to-say-they-are-happy/"
  },
  {
    "text": "US intelligence officials estimate Tehran does not have full control of its proxy groups  —  Washington wants to avoid a direct confrontation with Tehran.  —  Intelligence officials have calculated that Tehran does not have full control over its proxy groups in the Middle East … ",
    "url": "https://www.politico.com/news/2024/02/01/iran-proxies-intel-houthis-00139099"
  },
  {
    "text": "Secret Recording: Black Candidate Can't Win in Texas  —  A recording obtained by The Daily Beast captured Senate candidate Roland Gutierrez saying Rep. Colin Allred (D-TX) can't beat Ted Cruz because he's not Hispanic. … In the contested race for the Democratic nomination for Texas Senate … ",
    "url": "https://www.thedailybeast.com/secret-recording-hispanic-candidate-roland-gutierrez-says-black-candidate-colin-allred-cant-win-in-texas"
  }
]