[
  {
    "text": "Trump Says Little on Gaza, and Nothing About What He'd Do Differently  —  Donald Trump's approach to the bloody Mideast conflict reflects the anti-interventionist shift he has brought about in Republican politics — and his personal feelings about the Israeli prime minister.",
    "url": "https://www.nytimes.com/2024/03/01/us/politics/donald-trump-israel-gaza.html"
  },
  {
    "text": "University of Florida eliminates all DEI positions due to new state rules  —  The memo cites recent state restrictions on the use of public funds.  —  University of Florida Century Tower and University Auditorium, Gainesville, Florida.  —  The University of Florida has eliminated all diversity … ",
    "url": "https://abcnews.go.com/Politics/university-florida-eliminates-dei-positions-due-new-state/story?id=107728253"
  },
  {
    "text": "Appeals court ruling that vacates Capitol rioter's sentence could impact dozens of Jan. 6 cases  —  A federal appeals court in Washington has ordered a new sentence for a retired Air Force officer who stormed the U.S. Capitol dressed in combat gear, in a ruling issued Friday that could impact dozens … ",
    "url": "https://apnews.com/article/jan-6-capitol-riot-appeals-court-sentences-e08abd6d451d954ec3573c9ff515a30e"
  },
  {
    "text": "Appeals court ruling means over 100 Jan. 6 rioters may be resentenced  —  More than 100 people convicted of participation in the Jan. 6, 2021, riot at the Capitol may have to be resentenced after a federal appeals court Friday overturned a sentencing enhancement used to help determine their punishments.",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/03/01/appeal-obstruction-trump-january-sixth/"
  },
  {
    "text": "New York man who killed a woman after a wrong turn in his driveway gets 25 years to life  —  A man who fatally shot a 20-year-old woman after the SUV she was riding in mistakenly drove into his rural driveway in upstate New York was sentenced Friday to more than 25 years to life in prison.",
    "url": "https://apnews.com/article/wrong-driveway-shooting-new-york-gillis-monahan-cdca1723c6ba7afb89102a1e1aaa3fe0"
  },
  {
    "text": "CDC officially drops five-day covid isolation guidelines  —  Americans who test positive for the coronavirus no longer need to routinely stay home from work and school for five days under new guidance released Friday by the Centers for Disease Control and Prevention.",
    "url": "https://www.washingtonpost.com/health/2024/03/01/new-cdc-covid-isolation-guidelines/"
  },
  {
    "text": "Biden announces U.S. will airdrop food aid into Gaza  —  The president reiterated that the U.S. is trying to push for an immediate cease-fire between Hamas and Israel in order to allow more aid into Gaza.  —  WASHINGTON — President Joe Biden announced Friday that the U.S. will drop food aid … ",
    "url": "https://www.nbcnews.com/politics/white-house/biden-announces-us-will-airdrop-food-aid-gaza-rcna141436"
  },
  {
    "text": "What “Project 2025” Would Do to America  —  What would a second Trump presidency look like?  What happens if the Reactionary Right returns to power?  —  Over the past few months, different factions on the Right have presented detailed plans for what they want to do the next time they get back to the White House.",
    "url": "https://thomaszimmer.substack.com/p/what-project-2025-would-do-to-america"
  },
  {
    "text": "Businessman Pleads Guilty to Bribing Sen. Bob Menendez  —  It is the first plea obtained by prosecutors in case against New Jersey Democrat  —  A New Jersey businessman pleaded guilty Friday to conspiring to bribe Sen. Bob Menendez and agreed to cooperate with federal prosecutors … ",
    "url": "https://www.wsj.com/us-news/businessman-pleads-guilty-to-bribing-sen-bob-menendez-165f27b1"
  },
  {
    "text": "Activists Charged in Red Powder Attack on U.S. Constitution at the U.S. Archives  —  For Immediate Release  —  U.S. Attorney's Office, District of Columbia  —  Defendants Caused More Than $50,000 in Damage Within the Rotunda  —  WASHINGTON - Donald Zepeda, 35, of Maryland, and Jackson Green … ",
    "url": "https://www.justice.gov/usao-dc/pr/activists-charged-red-powder-attack-us-constitution-us-archives"
  },
  {
    "text": "CVS and Walgreens Will Begin Selling Abortion Pills This Month  —  The pill mifepristone will be available with a prescription at pharmacy counters in a few states to start.  —  The two largest pharmacy chains in the United States will start dispensing the abortion pill mifepristone this month … ",
    "url": "https://www.nytimes.com/2024/03/01/health/abortion-pills-cvs-walgreens.html"
  },
  {
    "text": "Wisconsin high court rejects bid to revisit congressional maps  —  The Wisconsin Supreme Court rejected a bid Friday by Democrats to reconsider the state's congressional maps, delivering Republicans a win in the state.  —  The state's high court said it would not be revisiting … ",
    "url": "https://thehill.com/homenews/state-watch/4501922-wisconsin-high-court-rejects-bid-to-revisit-congressional-maps/"
  },
  {
    "text": "“Like someone pulled the metaphorical plug”: Dr. John Gartner on Trump's “accelerating dementia”  —  “Trump looks blank, stops in mid-sentence (or mid-word), his jaw goes a little slack”  —  Since at least 2016, some of the world's leading mental health professionals have been sounding … ",
    "url": "https://www.salon.com/2024/03/01/like-someone-pulled-the-metaphorical-plug-dr-john-gartner-on-accelerating-dementia/"
  },
  {
    "text": "Biden tightens chemical safety rule loosened by Trump  —  The Big Story  —  EPA imposes stricter safety rules for chemical plants  —  Biden administration on Friday tightened a safety rule for chemical plants that was loosened under the Trump administration.",
    "url": "https://thehill.com/newsletters/energy-environment/4502163-biden-tightens-chemical-safety-rule-loosened-by-trump/"
  },
  {
    "text": "Joe Biden got $40K from China funds, brother James admits in bombshell impeachment interview  —  WASHINGTON — First brother James Biden confirmed during his impeachment inquiry testimony that a $40,000 check made out to former Vice President Joe Biden in 2017 used funds James received … ",
    "url": "https://nypost.com/2024/03/01/us-news/joe-biden-got-40k-in-china-funds-brother-james-admits-in-bombshell-impeachment-interview/"
  },
  {
    "text": "Supreme Court Picks Up Where the Jan. 6 Mob Left Off  —  Just like the Capitol rioters, SCOTUS' right-wing is actively trying to help Trump illegitimately get back into the White House. … I don't think most Americans realize how close we are to losing everything we most value about our system of government.",
    "url": "https://www.thedailybeast.com/supreme-court-picks-up-where-jan-6-mob-left-off"
  },
  {
    "text": "Fishermen delivering possible spy balloon to FBI in Alaska  —  Commercial fishermen off the coast of Alaska have found what officials are concerned could be another spy balloon and are bringing it to shore with them, three sources familiar with the matter told CNN.",
    "url": "https://www.cnn.com/2024/03/01/politics/fishermen-possible-spy-balloon-fbi-alaska/"
  }
]