[
  {
    "text": "Judge says 2-year-old US citizen appears to have been deported with ‘no meaningful process’  —  The girl was deported Friday with her mother to Honduras, despite her father's efforts to keep her in the United States.  —  A federal judge is raising alarms that the Trump administration deported … ",
    "url": "https://www.politico.com/news/2025/04/25/us-citizen-deportation-donald-trump-00311631"
  },
  {
    "text": "Trump Has Now Deported Multiple U.S. Citizen Children With Cancer  —  Two families — among them three U.S. citizens aged two, four, and seven — were abruptly deported under “troubling circumstances,” says the ACLU … One of the children was undergoing cancer treatment and one of the mothers is pregnant.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-deport-child-cancer-us-citizen-1235325778/"
  },
  {
    "text": "ICE Deports 3 U.S. Citizen Children Held Incommunicado Prior to the Deportation  —  Families disappeared and isolated without legal access; one child with cancer deported without medication and pregnant mother deported as well  —  New Orleans, LA - Today, in the early hours of the morning … ",
    "url": "https://www.aclu.org/press-releases/ice-deports-3-u-s-citizen-children-held-incommunicado-prior-to-the-deportation"
  },
  {
    "text": "2-Year-Old U.S. Citizen Deported ‘With No Meaningful Process,’ Judge Suspects  —  A federal judge in Louisiana said the deportation of the child to Honduras with her mother, even though her father had filed an emergency petition, appeared to be “illegal and unconstitutional.”",
    "url": "https://www.nytimes.com/2025/04/25/us/politics/us-citizen-deported.html"
  },
  {
    "text": "MAGA maximalism: Trump's base loves Wisconsin judge arrest  —  The FBI's arrest of a Wisconsin judge shocked the establishment.  But it's exactly the kind of escalation the MAGA base has been agitating for.  — “This is not the time for summer soldiers or sunshine patriots,” … ",
    "url": "https://www.axios.com/2025/04/26/maga-maximalism-trump-base-wisconsin-judge-arrest"
  },
  {
    "text": "Voters See Trump's Use of Power as Overreaching, Times/Siena Poll Finds  —  Skepticism has grown of his efforts to expand his authority and of his handling of issues long seen as strengths for him, including the economy and immigration.  —  Voters believe President Trump is overreaching … ",
    "url": "https://www.nytimes.com/2025/04/25/us/politics/trump-poll-approval.html?unlocked_article_code=1.Ck8.5y2u.hsJS55hvnjoe&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "How Trump Plays Into Putin's Hands, From Ukraine to Slashing U.S. Institutions  —  Many of President Trump's actions have been seen as benefiting Russia either directly or indirectly, so much so that Russian officials have celebrated some of his moves.  —  If President Vladimir V. Putin … ",
    "url": "https://www.nytimes.com/2025/04/26/us/politics/trump-putin-russia-ukraine.html?unlocked_article_code=1.Ck8.hbvQ.uAelxKo7ozqh&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Virginia Giuffre, one of Jeffrey Epstein's most prominent abuse survivors, dies by suicide  —  Other Epstein victims credited Giuffre with giving them the courage to speak out.  —  Virginia Giuffre, one of the most prominent survivors of Jeffrey Epstein's sexual abuse, has died by suicide, her family said Friday.",
    "url": "https://www.nbcnews.com/news/us-news/virginia-giuffre-one-jeffrey-epsteins-prominent-abuse-survivors-dies-s-rcna203027"
  },
  {
    "text": "Virginia Giuffre, a survivor of Jeffrey Epstein's sexual abuse, has died aged 41  —  Giuffre's family issued a statement confirming she took her own life at her farm in Western Australia, where she had lived for several years  —  Virginia Giuffre, one of the most prominent victims … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/26/virginia-giuffre-suicide-dead-aged-41"
  },
  {
    "text": "Scoop: DOJ rescinds policy against subpoenaing journalists  —  Attorney General Pam Bondi said in an internal memo obtained by Axios that the Justice Department is rescinding her predecessor Merrick Garland's policy restricting most subpoenas for journalists.",
    "url": "https://www.axios.com/2025/04/25/bondi-doj-garland-subpoena-journalists"
  },
  {
    "text": "‘Vaguely Threatening’: Federal Prosecutor Queries Leading Medical Journal  —  The New England Journal of Medicine received a letter suggesting that it was biased and compromised by external pressure.  Other journals have also received the letter.  —  A federal prosecutor in Washington … ",
    "url": "https://www.nytimes.com/2025/04/25/health/nejm-prosecutor-letter.html?unlocked_article_code=1.CU8.XJpU.y5QmymkKZ5rY&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Vatican Caves and Gives Trump Front-Row Seat for Pope's Funeral  —  BLACK AND BLUE  —  The Vatican abandoned convention and protocol to pander to the vanity of Trump, who was one of the few people at the funeral not to wear black.  —  President Donald Trump, wearing a blue suit in a sea of black … ",
    "url": "https://www.thedailybeast.com/vatican-caves-to-donald-trump-gives-him-front-row-seat/"
  },
  {
    "text": "Trump Pardons Executive Whose Family Sought to Publicize Ashley Biden's Diary  —  The pardon of Paul Walczak, who had been convicted of tax crimes, comes as the president uses clemency to reward allies and swipe at perceived enemies.  —  President Trump on Wednesday pardoned … ",
    "url": "https://www.nytimes.com/2025/04/25/us/politics/trump-pardon-walczak-ashley-biden-diary.html"
  },
  {
    "text": "Exclusive: Trump's D.C. Prosecutor Threatens Wikipedia's Tax-Exempt Status  —  Ed Martin, the firebrand Republican activist whom President Donald Trump picked to be the top prosecutor in D.C., has a new target: Wikipedia.  —  Martin, the interim U.S. attorney in Washington and Trump's permanent selection … ",
    "url": "https://www.thefp.com/p/trump-prosecutor-threatens-wikipedia"
  },
  {
    "text": "Website For MAGA-Friendly Businesses Backfires As People Use It For Boycotts  —  Social media posts about PublicSquare have gone viral as Trump critics use it to find companies not to support - the opposite of what the site was set up for.  —  WASHINGTON - A few years ago … ",
    "url": "https://www.huffpost.com/entry/publicsquare-trump-critics-boycott-businesses_n_680900d2e4b00850c6839b0b"
  },
  {
    "text": "Among the meek and the mighty, Catholics bury their 'people's pope'  —  The pope's unadorned tomb, marked by a single Latin word — Franciscus — was intended, a cleric said, to reflect a life of “simplicity and essential things.”  —  VATICAN CITY — The Roman Catholic Church bid farewell … ",
    "url": "https://www.washingtonpost.com/world/2025/04/26/pope-francis-funeral-vatican/"
  },
  {
    "text": "Canadians bombarded with rightwing content on Musk's X ahead of election  —  FT analysis finds network of social media accounts attacking Liberal leader Mark Carney  —  As Canadians prepare to go to the polls on Monday, they are being bombarded with misleading rightwing content … ",
    "url": "https://www.ft.com/content/743c1dec-0c5c-4c39-a940-830ce156c235"
  },
  {
    "text": "Musk Allies Made FAA Staff Sign NDAs to Keep New Project Secret  —  Sources tell Rolling Stone the secret project could be a perfect vehicle for embedding Elon Musk's Starlink within the FAA's operations … The situation fits into some broader patterns: Musk and DOGE have expressed significant influence … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-musk-doge-faa-nda-secret-project-lift-1235325667/"
  },
  {
    "text": "Hegseth trying to show Trump he's a fighter amid chaos in Pentagon  —  Defense Secretary Pete Hegseth's behavior has become “erratic” and he seems increasingly “insecure” about his job, sources told NBC News.  —  Pete Hegseth wants Donald Trump to see him as a fighter amid … ",
    "url": "https://www.nbcnews.com/politics/national-security/hegseth-trying-show-trump-s-fighter-chaos-pentagon-rcna202915"
  },
  {
    "text": "Video casts doubt on Ed Martin's apology for praising Nazi sympathizer  —  Trump's pick for top D.C. federal prosecutor said he didn't know about the man's statements, but Martin had discussed the antisemitism allegations in podcasts.  —  Interim D.C. U.S. attorney Ed Martin apologized … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/04/25/trump-martin-antisemitism-apology-hale-cusanelli/"
  }
]