[
  {
    "text": "Exclusive: Biden plans feisty economic reset … - Biden needs a cure for what some advisers call “Trump amnesia” — the notion that the chaos and unpopularity of Trump's presidency has receded from some voters' memories nearly four years on. … - Voters largely understand the contrasts between Trump … ",
    "url": "https://www.axios.com/2024/03/07/state-of-the-union-biden-us-economy"
  },
  {
    "text": "In Shinzo's shadow, Japan fears ‘if Trump’  —  Moshi Tora.  That's the compact phrase now spreading like wildfire in Japan.  It means “If Trump,” and is often said with a sense of foreboding.  —  This haiku-like, four-syllable phrase is short for the longer sentence: “What if Trump wins the presidency again?”",
    "url": "https://thehill.com/opinion/white-house/4513866-in-shinzos-shadow-japan-fears-if-trump/"
  },
  {
    "text": "Trump to Seize Control of GOP Machine After Clinching Nomination  — Party staffers are bracing for layoffs under new leadership  — Some in GOP fear Trump may tap party funds to pay legal bills  —  Donald Trump will tighten his grip on the GOP on Friday when his allies are poised … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-07/trump-to-seize-control-of-gop-machine-after-clinching-nomination"
  },
  {
    "text": "How millions in corporate cash could help a radical conspiracy theorist become governor  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  On Tuesday, Mark Robinson (R) won the Republican nomination for Governor of North Carolina.  Robinson, currently North Carolina's lieutenant governor … ",
    "url": "https://popular.info/p/how-millions-in-corporate-cash-could"
  },
  {
    "text": "The Much Vaunted Guardrails Are Failing  —  Unless America's leading institutions start acting accordingly, how can we expect enough people to believe the danger to democracy and fundamental rights is really all that severe?  —  Most of you who are reading this probably remember where you were on January 6 … ",
    "url": "https://thomaszimmer.substack.com/p/the-much-vaunted-guardrails-are-failing"
  },
  {
    "text": "Mark Robinson's Bizarre Ramble: 'I Absolutely Want To Go Back To The America Where Women Couldn't Vote'  —  In a newly unearthed video, North Carolina's GOP nominee for governor says America was better then because Republicans “fought for real social change.”  —  LOADING",
    "url": "https://www.huffpost.com/entry/north-carolina-gop-mark-robinson-women-vote_n_65e7d899e4b0f9d26cacc002"
  },
  {
    "text": "Steve Bannon's Refusal to Pay His Bills Is Costing Him Big  —  Bannon has refused to pay his legal bills for two years.  Now he and his current lawyer are facing fines over Bannon's refusal to make good on his debts. … For two years, Steve Bannon has refused to pay the half-million dollars he owes his former lawyer.",
    "url": "https://www.thedailybeast.com/steve-bannons-refusal-to-pay-his-bills-is-costing-him-big"
  },
  {
    "text": "Ex-Congressional candidate Daniel Rodimer wanted for murder in Las Vegas  —  LAS VEGAS (KSNV) — Former professional wrestler and congressional candidate Daniel Rodimer is wanted for murder in connection with a homicide on the Las Vegas Strip last year, authorities have confirmed.",
    "url": "https://news3lv.com/news/local/ex-congressional-candidate-daniel-rodimer-wanted-for-murder-in-las-vegas-lvjc-lvmpd-homicide-investigation-cops-courts"
  },
  {
    "text": "Speaker Mike Johnson on IVF after Alabama decision: “It's something that every state has to wrestle with”  —  Washington — House Speaker Mike Johnson said Thursday that in vitro fertilization and the handling of embryos remains an issue that “policymakers have to determine how to handle.”",
    "url": "https://www.cbsnews.com/news/mike-johnson-interview-ivf-decision-state-of-the-union/"
  },
  {
    "text": "Navy demoted Ronny Jackson after probe into White House behavior  —  Ronny Jackson, the former White House physician turned GOP congressman, regularly touts his military bona fides.  —  “As a retired U.S. Navy Rear Admiral with nearly three decades of military service I understand the commitment … ",
    "url": "https://www.washingtonpost.com/nation/2024/03/07/ronny-jackson-demotion-white-house-medical-unit-navy/"
  },
  {
    "text": "FDA says to throw away these 6 cinnamon products because they contain high levels of lead  —  Consumers should not purchase half a dozen ground cinnamon products sold by retailers including Family Dollar and Dollar Tree because they contain elevated levels of lead, the U.S. Food and Drug Administration … ",
    "url": "https://www.cbsnews.com/news/lead-cinnamon-fda-applesauce-children/"
  },
  {
    "text": "Missouri's total war on Planned Parenthood  —  Republicans aren't stopping at abortion bans.  —  ∙ Paid  —  Given the sinkhole of conspiracies that is Elon Musk's X, it shouldn't be surprising that Andrew Bailey, Missouri's hard-right attorney general, used the platform to announce … ",
    "url": "https://www.publicnotice.co/p/missouri-planned-parenthood-lawsuit"
  },
  {
    "text": "Profound Damage Found in Maine Gunman's Brain, Possibly From Blasts  —  A laboratory found a pattern of cell damage that has been seen in veterans exposed to weapons blasts, and said it probably played a role in symptoms the gunman displayed before the shooting.",
    "url": "https://www.nytimes.com/2024/03/06/us/maine-shooting-brain-injury.html"
  },
  {
    "text": "Sweden set to become NATO's 32nd member as PM visits Washington  —  Sweden joined NATO in Washington on Thursday, two years after Russia's invasion of Ukraine forced it to rethink its national security policy and conclude that support for the alliance was the Scandinavian nation's best guarantee of safety.",
    "url": "https://www.reuters.com/world/sweden-set-become-natos-32nd-member-pm-visits-washington-2024-03-07/"
  },
  {
    "text": "Byron Donalds wouldn't commit to certifying election results if he was VP … - Donalds also did not clarify if he would have certified the 2020 election results, during an interview with Axios' Sophia Cai.  — Trump, the GOP presidential frontrunner, has continued to push the false theory … ",
    "url": "https://www.axios.com/2024/03/07/byron-donalds-certifying-election-results-trump-vp"
  },
  {
    "text": "The White House Announces Guest List for the First Lady's Box for the 2024 State of the Union Address  —  WASHINGTON, D.C. - First Lady Jill Biden will welcome guests to join her in the viewing box for President Biden's State of the Union Address on Thursday, March 7, 2024.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/03/07/the-white-house-announces-guest-list-for-the-first-ladys-box-for-the-2024-state-of-the-union-address/"
  }
]