[
  {
    "text": "Arizona Supreme Court rules that a near-total abortion ban from 1864 is enforceable  —  The bombshell decision adds the state to the growing lists of places where abortion care is effectively banned.  —  PHOENIX — The Arizona Supreme Court ruled Tuesday that a 160-year-old near-total abortion ban still … ",
    "url": "https://www.nbcnews.com/politics/arizona-supreme-court-ruling-abortion-ban-rcna146915"
  },
  {
    "text": "Trump loses bid to delay hush money trial pending gag order appeal  —  Donald Trump on Tuesday lost his second last-ditch bid in as many days to delay his April 15 trial on criminal charges stemming from hush money paid to a porn star.  —  The former U.S. president's lawyers argued at a hearing … ",
    "url": "https://www.reuters.com/world/us/trump-appeals-gag-order-stormy-daniels-hush-money-case-2024-04-09/"
  },
  {
    "text": "The Inside Story of Alvin Bragg's Case Against Trump … Reporters vied for seats in the briefing room, some even crouching on the floor.  They all knew, on this Tuesday in early April 2023, that Alvin L. Bragg, the Manhattan district attorney, was about to announce something momentous … ",
    "url": "https://www.nytimes.com/2024/04/09/magazine/alvin-bragg-donald-trump-trial.html"
  },
  {
    "text": "Donald Trump's lawyers ask appeals court to lift gag order in hush money criminal case  —  NEW YORK (AP) — Donald Trump's lawyers asked a New York appeals court Tuesday to delay his hush-money criminal trial while they fight to lift the former president's gag order, just days before the trial is scheduled to start.",
    "url": "https://apnews.com/article/donald-trump-gag-order-hush-money-juan-merchan-0a10c7ee0236f760ce50c05cafb163ef"
  },
  {
    "text": "Parents of Michigan school shooter sentenced to 10-15 years in prison  —  The parents of convicted Michigan school shooter Ethan Crumbley were each sentenced Tuesday to 10-15 years in prison for their role in the deaths of four high school students in 2021.  —  James and Jennifer Crumbley … ",
    "url": "https://thehill.com/homenews/state-watch/4582895-parents-michigan-school-shooter-sentenced-prison/"
  },
  {
    "text": "Livestream replay: James, Jennifer Crumbley sentenced to 10-15 years in prison  —  Tresa Baldas Lily Altavena Adrienne RobertsDetroit Free Press  —  James and Jennifer Crumbley, the first parents in America to be held criminally responsible for a school shooting by their child … ",
    "url": "https://www.freep.com/story/news/local/michigan/oakland/2024/04/09/james-jennifer-crumbley-sentencing-oxford-high-shooting/73243347007/"
  },
  {
    "text": "Michigan school shooter's parents sentenced to at least 10 years in prison  —  The parents of a Michigan school shooter have been sentenced to at least 10 years for failing to prevent the killing of four students in 2021.  Jennifer and James Crumbley are the first parents convicted in a U.S. mass school shooting.",
    "url": "https://apnews.com/article/james-crumbley-jennifer-crumbley-oxford-school-shooting-e5888f615c76c3b26153c34dc36d5436"
  },
  {
    "text": "I've Been at NPR for 25 Years.  Here's How We Lost America's Trust.  —  Uri Berliner, a veteran at the public radio institution, says the network lost its way when it started telling listeners how to think.  —  You know the stereotype of the NPR listener: an EV-driving, Wordle-playing, tote bag-carrying coastal elite.",
    "url": "https://www.thefp.com/p/npr-editor-how-npr-lost-americas-trust"
  },
  {
    "text": "Ken Buck knocks ‘Moscow Marjorie’ Taylor Greene  —  Former Rep. Ken Buck (R-Colo.) took shots at Rep. Marjorie Taylor Greene (R-Ga.) Monday, attacking his former GOP colleague as “Moscow Marjorie.”  —  The jab comes after former Speaker Kevin McCarthy (R-Calif.) called Greene a … ",
    "url": "https://thehill.com/homenews/house/4582430-ken-buck-knocks-moscow-marjorie-taylor-greene/"
  },
  {
    "text": "Jacob Wohl and Jack Burkman Fined $1.25M for ‘Depraved’ Robocall Scheme  —  ‘HELD ACCOUNTABLE’  —  They were found liable in March 2023 for “transmitting false and threatening messages intended to discourage voting” by Black New Yorkers.  —  Notorious conspiracy theorists Jacob Wohl … ",
    "url": "https://www.thedailybeast.com/jacob-wohl-and-jack-burkman-fined-dollar125m-for-depraved-robocall-scheme"
  },
  {
    "text": "The deeply silly, extremely serious rise of ‘Alpha Male’ Nick Adams  —  Meet the Trump-backed raconteur who is teaching America's young men the art of being hard to deal with  —  Nick Adams was speaking to the men in the room.  —  “Never apologize,” he said.  “Never mask up.",
    "url": "https://www.washingtonpost.com/style/power/2024/04/09/nick-adams-alpha-male-trump-campaign-surrogate/"
  },
  {
    "text": "How Senate Dems plan to quickly ‘dispose’ of Mayorkas trial  —  Sen. Debbie Stabenow, the No. 3 Democrat, said the party will move to dismiss the articles of impeachment on Thursday.",
    "url": "https://www.politico.com/live-updates/2024/04/09/congress/dems-plan-to-dispose-of-mayorkas-trial-00151251"
  },
  {
    "text": "European court rules human rights violated by climate inaction  —  A group of older Swiss women have won the first ever climate case victory in the European Court of Human Rights.  —  The women, mostly in their 70s, said that their age and gender made them particularly vulnerable to the effects of heatwaves linked to climate change.",
    "url": "https://www.bbc.com/news/science-environment-68768598"
  },
  {
    "text": "The Influential Conservative Group Making it Harder for Idaho Districts to Fix Their Schools  —  The Idaho Freedom Foundation has gone beyond the education culture wars by targeting local bond and levy elections, which districts rely on heavily to build and repair schools.  —  Co-published with Idaho Statesman",
    "url": "https://www.propublica.org/article/the-influential-group-disrupting-efforts-to-fix-idaho-schools"
  },
  {
    "text": "As Kushner's Investment Firm Steps Out, the Potential Conflicts Are Growing  —  Jared Kushner's Affinity Partners has invested more than $1.2 billion, much of it in firms abroad, drawing new scrutiny as his father-in-law, Donald Trump, again seeks the presidency.",
    "url": "https://www.nytimes.com/2024/04/09/us/politics/jared-kushner-affinity-partners.html"
  },
  {
    "text": "Trump says Jews who vote for Biden do ‘not love Israel’ and ‘should be spoken to’  —  The presumptive Republican presidential nominee repeated an antisemitic trope he has pushed suggesting American Jews have dual loyalties to the U.S. and Israel.  —  Former President Donald Trump on Monday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-says-jews-vote-biden-not-love-israel-spoken-rcna146972"
  },
  {
    "text": "Tenth consecutive monthly heat record alarms and confounds climate scientists  —  If the anomaly does not stabilise by August, ‘the world will be in uncharted territory’, says climate expert  —  Another month, another global heat record that has left climate scientists scratching their heads … ",
    "url": "https://www.theguardian.com/global/2024/apr/09/tenth-consecutive-monthly-heat-record-alarms-confounds-climate-scientists"
  },
  {
    "text": "TV Networks to Urge Biden and Trump to Debate, Wading Into a Fraught Topic  —  Speculation has swirled in the political world about whether the presumptive candidates will agree to the traditional face-to-face events, a campaign staple since 1976.  —  In an unusual move … ",
    "url": "https://www.nytimes.com/2024/04/09/business/media/networks-biden-trump-debate-letter.html"
  },
  {
    "text": "The Ugly Truth Behind Ted Cruz's Super PAC Podcast  —  CRUZ CONTROL  —  Ted Cruz is once again pushing the bounds of campaign finance laws, this time with his super PAC pocketing hundreds of thousands of dollars for his podcast appearances. … In recent weeks, a number of news reports … ",
    "url": "https://www.thedailybeast.com/ted-cruz-is-turning-an-allied-super-pac-into-a-media-company"
  },
  {
    "text": "Biden's Latest Student Loan Bailout Has Election-Year Bribe Written All Over It  —  The Democrat's election-year bribe would be paid for by taxpayers forced to shoulder an ever-expanding national debt.  —  President Joe Biden campaigned in swing-state Wisconsin on Monday to sell … ",
    "url": "https://thefederalist.com/2024/04/09/bidens-latest-student-loan-bailout-has-election-year-bribe-written-all-over-it/"
  },
  {
    "text": "Idaho Man Arrested for Attempting to Provide Material Support to ISIS  —  For Immediate Release  —  Alexander Scott Mercurio, 18, of Coeur d'Alene, Idaho, was arrested Saturday, April 6, 2024, in Coeur d'Alene for attempting to provide material support and resources to ISIS.",
    "url": "https://www.justice.gov/opa/pr/idaho-man-arrested-attempting-provide-material-support-isis"
  },
  {
    "text": "Who Wants to Be a Trillionaire?  —  Don't laugh.  That's exactly where America's oligarchic policies are taking us.  —  Forbes' annual list of the 400 richest Americans debuted in 1982 with shipping magnate Daniel Ludwig in the top slot.  Ludwig's wealth, the magazine reported, was $2 billion (about $6.3 billion in today's dollars).",
    "url": "https://www.motherjones.com/politics/2024/04/wealth-inequality-trillionaires-oligarchy-federal-tax-policy/"
  },
  {
    "text": "Anti-Israel agitators shut down Senate cafeteria, around 50 arrested  —  Dozens arrested after incident inside Dirksen Senate Office Building  —  More than 50 people were arrested Tuesday after the Senate cafeteria was shut down by anti-Israel protesters chanting “Senate can't eat until Gaza eats!”",
    "url": "https://www.foxnews.com/politics/anti-israel-agitators-shut-down-senate-cafeteria-arrested"
  }
]