[
  {
    "text": "Former US attorney for Eastern District of Virginia Jessica Aber found dead at 43  —  The cause of her death is still under investigation  —  Jessica Aber, former U.S. attorney for the Eastern District of Virginia (EDVA), was found dead Saturday morning, the Alexandria Police Department said.",
    "url": "https://www.nbcwashington.com/news/local/former-us-attorney-for-eastern-district-of-virginia-jessica-aber-found-dead-at-43/3874185/"
  },
  {
    "text": "Former federal prosecutor found dead in Virginia home  —  A former federal prosecutor was found dead Saturday morning at a home in Alexandria, Virginia, authorities said.  —  Officers with the Alexandria Police Department were dispatched to the home at 9:18 a.m. Eastern Time on a report of an unresponsive woman.",
    "url": "https://www.cbsnews.com/news/jessica-aber-former-federal-prosecutor-found-dead-virginia-home/"
  },
  {
    "text": "With New Decree, Trump Seeks to Cow the Legal Profession  —  A presidential memorandum aimed at lawyers everywhere struck a menacing tone.  —  President Trump broadened his campaign of retaliation against lawyers he dislikes with a new memorandum that threatens to use government power … ",
    "url": "https://www.nytimes.com/2025/03/22/us/politics/trump-memo-lawyers.html"
  },
  {
    "text": "What the Venezuelans Deported to El Salvador Experienced  —  On the night of Saturday, March 15, three planes touched down in El Salvador, carrying 261 men deported from the United States. … I was there to document their arrival.  —  For more than a year, I have been embedded throughout … ",
    "url": "https://time.com/7269604/el-salvador-photos-venezuelan-detainees/"
  },
  {
    "text": "IRS nears deal with ICE to share addresses of suspected undocumented immigrants  —  The move toward information-sharing comes as President Donald Trump pushes his administration to use every resource to conduct what he hopes will be the largest mass deportation of immigrants in U.S. history.",
    "url": "https://www.washingtonpost.com/us-policy/2025/03/22/ice-irs-immigrants-deport/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyNjE2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzOTk4Mzk5LCJpYXQiOjE3NDI2MTYwMDAsImp0aSI6ImVlZDViMjExLTkwZDYtNDRkNi1iODA3LTJkOTQyNzRhZjJiOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS91cy1wb2xpY3kvMjAyNS8wMy8yMi9pY2UtaXJzLWltbWlncmFudHMtZGVwb3J0LyJ9.YYErFt49qsNUlix8F8-roAlWjN9SrzqvpFYjc-wOiXs&itid=gfta"
  },
  {
    "text": "Sen. Ruben Gallego: Trump set political ‘trap’ for Dems on deportation issue  —  U.S. Sen. Ruben Gallego said President Donald Trump has set a political “trap” for Democrats with his controversial deportations of Venezuelans to El Salvador.  In an interview with the Arizona Daily Star … ",
    "url": "https://tucson.com/news/local/subscriber/article_14958188-72e9-402c-9d63-268f231ef2e8.html"
  },
  {
    "text": "Hanging by a Thread  —  Meta's decisions at the once promising “Twitter killer” serve as a cautionary tale about the risks of prioritizing corporate interests and political appeasement over user trust. … Earlier this week, Meta made a small but notable change to Threads … ",
    "url": "https://www.status.news/p/threads-engagement-meta-bluesky-x"
  },
  {
    "text": "CDC Clone Site, Rife with False Vaccine Claims, Hosted by Group Previously Led by HHS Secretary  —  A CDC clone site with false vaccine claims is hosted by an NGO once led by the current HHS Secretary.  With CDC logos, real social media links, and a near-identical design, it may violate federal laws.",
    "url": "https://infoepi.substack.com/p/cdc-clone-site-rife-with-false-vaccine"
  },
  {
    "text": "Voice of America journalists sue Trump officials for dismantling the outlet  —  The lawsuit, filed in the Southern District of New York, asks a federal judge to order officials to restore the outlet.",
    "url": "https://www.washingtonpost.com/politics/2025/03/22/voice-america-lawsuit-trump-kari-lake/"
  },
  {
    "text": "US decision to limit Canadian access to border-straddling library prompts outpouring of emotion  —  For more than 100 years, people in Stanstead, Quebec have been able to walk into Derby Line, Vermont to enter the border-straddling Haskell Free Library and Opera House - no passport required.",
    "url": "https://apnews.com/article/canada-america-library-vermont-quebec-7c4851c705d18e0cc891c3ce085e15e4"
  },
  {
    "text": "Columbia University's Concessions to Trump Seen as a Watershed  —  Threatened with losing $400 million in federal funding, the university agreed to overhaul its protest policies and security practices.  —  Many professors saw it as surrender, a reward to the Trump administration's heavy hand.",
    "url": "https://www.nytimes.com/2025/03/22/nyregion/columbia-trump-concessions-watershed.html"
  },
  {
    "text": "They were arrested during routine ICE check-ins.  Then they disappeared.  —  Deportation proceedings are often shrouded in secrecy.  But lawyers say the lack of information about the Venezuelan migrants deported under the Alien Enemies Act is nearly unprecedented.",
    "url": "https://www.washingtonpost.com/immigration/2025/03/22/trump-venezuela-migrants-el-salvador/"
  },
  {
    "text": "Trump's Latest Stunt: Revoking a Clearance I Don't Even Have  —  Well, it looks like Donald Trump has done it again—another petty, performative move designed to punish his perceived enemies, regardless of reality.  Reports are circulating that he's decided to revoke my security clearance.",
    "url": "https://adamkinzinger.substack.com/p/trumps-latest-stunt-revoking-a-clearance"
  },
  {
    "text": "Why the Pentagon Scuttled Its Briefing of Musk on War Plans  —  “You wouldn't show it to a businessman,” President Trump said in denying that Elon Musk was to be briefed on top-secret plans in the event of war with China.  —  Over the past 24 hours, my colleagues' report that Elon Musk … ",
    "url": "https://www.nytimes.com/2025/03/21/us/politics/musk-trump-pentagon-china.html"
  },
  {
    "text": "Australia Treasurer Warns of ‘Seismic’ US Global Economic Shock  —  Trump Branding Migrants as Criminals Is Complicating Plans to Bring Them Home … Year of Elections … Balance of Power",
    "url": "https://www.bloomberg.com/news/articles/2025-03-22/australia-treasurer-warns-of-seismic-us-global-economic-shock"
  },
  {
    "text": "Tax revenue could drop by 10 percent amid turmoil at IRS  —  Staff cuts and disruptions related to the U.S. DOGE Service have officials bracing for a sharp loss of revenue.  —  Just now  —  Senior tax officials are bracing for a sharp drop in revenue collected this spring … ",
    "url": "https://www.washingtonpost.com/business/2025/03/22/irs-tax-revenue-loss-federal-budget/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyNjE2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzOTk4Mzk5LCJpYXQiOjE3NDI2MTYwMDAsImp0aSI6ImJmZDZkMGEzLTQ2YTQtNGUyYS1iNzNjLTFjYWZhZjVmN2JmMCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAzLzIyL2lycy10YXgtcmV2ZW51ZS1sb3NzLWZlZGVyYWwtYnVkZ2V0LyJ9.tMXjcX_pKifjKRlyEVAIL4NFdmci1E2QPG0wdt1rpyE&itid=gfta"
  },
  {
    "text": "Georgia Democratic Sen. Jon Ossoff vows defiance to Trump ahead of 2026 election  —  U.S. Sen. Jon Ossoff came home to Atlanta Saturday to rally core Democrats desperate for effective action now against President Donald Trump's administration.  “Georgia will bow to no king!”",
    "url": "https://apnews.com/article/jon-ossoff-senate-election-2026-georgia-20dcdc9e7dc10f15b3aa3c23d845220e"
  },
  {
    "text": "Trump demands Maine governor apologize — or the state will face consequences  —  The Trump administration has sparred with Maine and singled out its governor in recent weeks over his order banning trans athletes from playing in women's sports.  —  President Donald Trump is demanding a … ",
    "url": "https://www.politico.com/news/2025/03/22/donald-trump-trans-athletes-maine-00003871"
  },
  {
    "text": "Republicans, independents crave answers from GOP congressman in Alabama  —  Rep. Dale Strong's constituents are demanding a response as the politician faces backlash to DOGE cutbacks in a district awash with federal money.  —  Just now  —  HUNTSVILLE, Ala. — She didn't want to be dismissed … ",
    "url": "https://www.washingtonpost.com/nation/2025/03/22/republican-independent-voters-alabama-congressman/"
  },
  {
    "text": "Why Did Elon Musk Go After Bunkers Full of Seeds?  —  In a climate-controlled bunker in an unremarkable building in rural Aberdeen, Idaho, there are shelves upon shelves of meticulously labeled boxes of seed.  This vault is home to many of the United States' more than 62,000 genetically unique lines … ",
    "url": "https://www.nytimes.com/2025/03/22/opinion/doge-elon-musk-usda-crops.html?unlocked_article_code=1.504.6d8Y.SOfwUWA-5mKL&smid=url-share"
  },
  {
    "text": "Trump said he didn't sign the Alien Enemies Act proclamation.  So who — or what — did?  —  Did Trump misspeak?  Is he trying to deflect a decision under heavy legal scrutiny onto Secretary of State Marco Rubio?  —  Joe Davidson",
    "url": "https://www.washingtonpost.com/politics/2025/03/22/trump-deportations-autopen/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyNjE2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzOTk4Mzk5LCJpYXQiOjE3NDI2MTYwMDAsImp0aSI6IjJhMWRkMmE5LTAyOWQtNDQ2My04YjhkLTQ1YTRmY2JiNzc3NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzIyL3RydW1wLWRlcG9ydGF0aW9ucy1hdXRvcGVuLyJ9.j08sZRqoDJ5V9MhTC4jgUjYkZ1MYzQUERJVxZ-uyXE4&itid=gfta"
  },
  {
    "text": "Elon Musk Returns to His Trump Playbook in a Big Wisconsin Race  —  The billionaire, now a White House official and no longer a private citizen, is spending millions of dollars to elect a conservative judge, and making himself a main character in the race.  —  Much has changed since … ",
    "url": "https://www.nytimes.com/2025/03/22/us/politics/elon-musk-brad-schimel-wisconsin-state-supreme-court.html?unlocked_article_code=1.504.PFPv.LVXKMkIq67Oe&smid=url-share"
  }
]