[
  {
    "text": "Iowa Poll: Donald Trump holds overwhelming lead; Ron DeSantis edges ahead of Nikki Haley  —  A new nationally renowned Iowa Poll shows that a shrinking field has only made Donald Trump's lead grow as Nikki Haley and Ron DeSantis fail to capitalize on powerful endorsements",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/caucus/2023/12/11/iowa-poll-ron-desantis-nikki-haley-unable-to-shrink-donald-trumps-overwhelming-lead-iowa-caucuses/71850893007/"
  },
  {
    "text": "Wall Street donors dreamed of a Trump alternative.  Now they're waking up  —  Setting aside Trump's recent noodling on what he could accomplish in a one-day dictatorship, markets are increasingly wary of how U.S. political disruptions can ripple across the global financial system.",
    "url": "https://www.politico.com/news/2023/12/11/wall-street-never-trump-00131024"
  },
  {
    "text": "Trump Has Found a Dangerous Workaround to Gag Orders  —  Donald Trump will have a number of opportunities to violate gag orders in the coming months.  He may have just found a dangerous loophole.  —  Donald Trump is, once again, outmaneuvering the American court system.",
    "url": "https://www.thedailybeast.com/trump-has-found-a-dangerous-workaround-to-gag-orders"
  },
  {
    "text": "Supreme Court rejects challenge to Washington state ‘conversion therapy’ ban  —  Over the objection of three conservatives, the court left in place a state law that bars therapists from counseling minors to change sexual orientation or gender identity, a practice favored by some conservatives.",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rejects-challenge-washington-state-conversion-therapy-ba-rcna122364"
  },
  {
    "text": "Organized journalistic crime  —  On July 19, the Washington Post Editorial Board published an impassioned column calling for an aggressive national response to organized retail crime (ORC).  The Editorial Board described ORC as “the term security specialists use to distinguish planned … ",
    "url": "https://popular.info/p/organized-journalistic-crime"
  },
  {
    "text": "‘It was chaos’: Witness recounts seeing vehicle drive through religious group in downtown Billings  —  BILLINGS — The Billings Police Department on Sunday released more information regarding the arrest of 55-year-old Genevienne Rancuret after she allegedly drove a vehicle through a religious group … ",
    "url": "https://www.ktvq.com/news/crime-watch/it-was-chaos-witness-recounts-seeing-group-driven-through-in-downtown-billings"
  },
  {
    "text": "Majority of Americans Back Israel as Democrats Split Over War With Hamas, WSJ Poll Finds  —  Republicans and independents are more sympathetic to Israelis than Palestinians; Biden gets low marks for handling of conflict  —  WASHINGTON—U.S. public opinion remains favorable toward Israel … ",
    "url": "https://www.wsj.com/politics/majority-of-americans-back-israel-as-democrats-split-over-war-with-hamas-wsj-poll-finds-030f22c2?mod=followamazon"
  },
  {
    "text": "NBC News demands Trump campaign take down fake clip of reporter  —  The Scoop  —  NBC News has demanded that Donald Trump's campaign remove a video that includes audio deceptively edited to seem like it comes from an NBC correspondent after the third presidential debate, two people familiar with the exchange told Semafor.",
    "url": "https://www.semafor.com/article/12/10/2023/nbc-news-demands-trump-campaign-take-down-fake-clip-of-reporter"
  },
  {
    "text": "Air Force watchdog finds alleged Pentagon leaker Jack Teixeira's unit “failed” to take action after witnessing questionable activity  —  The Air Force inspector general found that individuals in alleged Pentagon leaker Jack Teixeira's unit failed to take proper action after at least four separate security incidents.",
    "url": "https://www.cbsnews.com/news/air-force-pentagon-leaker-jack-teixeira-investigation-report/"
  },
  {
    "text": "Still Annoyed at Biden, New Hampshire Democrats Gear Up to Help Him  —  Despite being bumped down the presidential calendar, Democrats in the state are planning a write-in campaign for the president, who won't be on New Hampshire primary ballots.  —  New Hampshire Democrats were furious … ",
    "url": "https://www.nytimes.com/2023/12/11/us/politics/biden-new-hampshire-primary-2024.html"
  },
  {
    "text": "CNN Polls: Trump leads Biden in Michigan and Georgia as broad majorities hold negative views of the current president  —  Former President Donald Trump has the upper hand over President Joe Biden in two critical battleground states - Michigan and Georgia - with broad majorities … ",
    "url": "https://www.cnn.com/2023/12/11/politics/cnn-polls-trump-biden-michigan-georgia/"
  },
  {
    "text": "Key McConnell ally makes endorsement in crucial swing state race that could flip Senate red  —  Arizona Senate race expected to be one of most closely watched of 2024 election cycle  —  EXCLUSIVE: A key ally of Senate Minority Leader Mitch McConnell, R-Ky., has decided which candidate … ",
    "url": "https://www.foxnews.com/politics/key-mcconnell-ally-makes-endorsement-crucial-swing-state-race-flip-senate-red"
  },
  {
    "text": "Biden Administration Chooses Military Supplier for First CHIPS Act Grant  —  The award, which will go to BAE Systems, is part of a new government program aimed at creating a more secure supply of semiconductors.  —  The Biden administration will announce on Monday that BAE Systems … ",
    "url": "https://www.nytimes.com/2023/12/11/business/economy/biden-chips-bae-systems.html"
  },
  {
    "text": "George Santos earning so much on Cameo, he picks up tab for political pals while hanging with Rep. Lauren Boebert in NYC  —  George Santos is making so much dough on Cameo — he picked up the tab for his political pals on Saturday night.  —  The ousted pol was hanging with “ball of energy” … ",
    "url": "https://pagesix.com/2023/12/10/gossip/george-santos-with-rep-lauren-boebert-at-late-night-nyc-bash/"
  },
  {
    "text": "U.S. has failed the Palestinian people, officials say after vetoed UN vote for Gaza Strip cease-fire  — Palestinian figureheads expressed disappointment after the United States vetoed a United Nations resolution calling for an immediate cease-fire in Gaza.",
    "url": "https://www.cnbc.com/2023/12/11/israel-hamas-us-has-failed-the-palestinian-people-officials-say.html"
  },
  {
    "text": "Kevin McCarthy on Trump: America doesn't want “retribution”  —  California Republican Kevin McCarthy holds a place in history as the first-ever Speaker of the House to be voted out of that position.  Historic, but looking at how his tenure began, hardly a shock.",
    "url": "https://www.cbsnews.com/news/kevin-mccarthy-on-trump-america-doesnt-want-retribution/"
  }
]