[
  {
    "text": "Former Tim Scott adviser is running new pro-DeSantis effort in Iowa  —  A new super PAC is attacking Nikki Haley to help Ron DeSantis in the first caucus state.  —  A top adviser to Sen. Tim Scott's now-defunct presidential campaign is now helming a new super PAC supporting Florida Gov. Ron DeSantis in Iowa.",
    "url": "https://www.politico.com/news/2023/11/28/tim-scott-desantis-iowa-00128962"
  },
  {
    "text": "Playbook: Why the left is blanching at the border talks  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  BREAKING OVERNIGHT — “US military Osprey aircraft with 6 aboard crashes off southern Japan, at least 1 dead,” by AP's Mari Yamaguchi in Tokyo",
    "url": "https://www.politico.com/newsletters/playbook/2023/11/29/why-the-left-is-blanching-at-the-border-talks-00129019"
  },
  {
    "text": "11/29/23 ☀️ Punchbowl News AM  —  THE TOP … First, Speaker Mike Johnson is meeting today with Senate Republicans during their Steering lunch in the Capitol. … Johnson is at the fulcrum of a host of big decisions that need to be made in December.",
    "url": "https://punchbowl.news/archive/112923-punchbowl-news-am/"
  },
  {
    "text": "Elon Musk boosts Pizzagate conspiracy theory that led to D.C. gunfire  —  The far-right theory motivated a gunman to fire multiple rounds inside the Comet Ping Pong pizzeria in Northwest Washington in 2016.  Musk boosted the theory to his 164 million followers anyway.",
    "url": "https://www.washingtonpost.com/technology/2023/11/28/pizzagate-musk-twitter-x-controversy/"
  },
  {
    "text": "Elon Musk has boosted the ‘pizzagate’ conspiracy theory five times in the last two weeks  —  A new iteration of “pizzagate” has focused on unfounded claims that journalists were part of the conspiracy theory.  —  Elon Musk continued to boost a debunked conspiracy theory Tuesday … ",
    "url": "https://www.nbcnews.com/tech/tech-news/elon-musk-boosted-pizzagate-conspiracy-theory-rcna127087"
  },
  {
    "text": "How Arab American voters' defections could hurt Biden … - Michigan, Virginia, Georgia, Arizona and Pennsylvania all have notable pockets of these populations. … - Like with young voters, Biden faces the prospect of having to devote time to saving part of his base in addition to courting swing voters.",
    "url": "https://www.axios.com/2023/11/29/arab-american-voter-defections-biden-2024"
  },
  {
    "text": "Exclusive: Liz Cheney's new book blasts GOP as ‘enablers and collaborators’ of Trump, whom one member called ‘Orange Jesus’  —  In her new book, former Rep. Liz Cheney paints a scathing portrait of the Republican Party, condemning her former colleagues and party leaders as … ",
    "url": "https://www.cnn.com/2023/11/28/politics/liz-cheney-trump-mccarthy-book/"
  },
  {
    "text": "Scoop: Students for Trump Founder charged with aggravated assault  —  The North Carolina-based Students for Trump co-founder Ryan Fournier is facing misdemeanor charges for assault on a female and assault with a deadly weapon, law enforcement records obtained by Axios show.",
    "url": "https://www.axios.com/2023/11/28/students-for-trump-ryan-fournier-arrested-assault"
  },
  {
    "text": "Melania Trump Adds Awkward Touch to Rosalynn Carter Funeral  —  In recent decades the former presidents and First Ladies have made a big show of their post-White House chumminess.  In 2005, Bill Clinton and George H.W. Bush teamed up to raise money for victims of the Indian Ocean tsunami … ",
    "url": "https://nymag.com/intelligencer/2023/11/melania-trump-rosalynn-carter-funeral.html"
  },
  {
    "text": "Top-ranking CIA official shared pro-Palestinian Facebook posts weeks after Hamas terror attack: report  —  A high-ranking CIA official boldly shared multiple pro-Palestinian images on her Facebook page just two weeks after Hamas launched its bloody surprise attack on Israel … ",
    "url": "https://nypost.com/2023/11/28/news/top-cia-agent-shared-pro-palestinian-to-facebook-after-hamas-attack-report/"
  },
  {
    "text": "First plane using only sustainable fuel flies across Atlantic  —  A Virgin Atlantic plane powered using only sustainable fuel completed its flight from London to New York on Tuesday, highlighting an eco-friendly and low-carbon option for transatlantic flights.",
    "url": "https://thehill.com/policy/energy-environment/4332469-first-plane-using-only-sustainable-fuel-flies-across-atlantic/"
  },
  {
    "text": "California struggles to boot Trump  —  THE BUZZ: DEADLINE AHEAD — The window is narrowing to try to knock former President Donald Trump off California's March 5 primary ballot.  —  Democrats launched several long-shot challenges to Trump's ballot status.  But the deadline for Secretary … ",
    "url": "https://www.politico.com/newsletters/california-playbook/2023/11/28/path-narrowing-on-trump-ballot-challenges-00128805"
  },
  {
    "text": "Gusty winds topple National Christmas Tree near the White House  —  The National Christmas tree in D.C. near the White House is once again upright after strong winds toppled it Tuesday afternoon.  —  The tree fell over around 1 p.m. during a strong wind gust, the National Park Service said.",
    "url": "https://wtop.com/dc/2023/11/gusty-winds-topple-national-christmas-tree-near-the-white-house/"
  },
  {
    "text": "Republicans Reject Hunter Biden's Offer to Testify Publicly  —  ‘OPENING THE DOOR’  —  House Oversight Committee Chairman James Comer (R-KY) denied Hunter Biden's request to testify publicly, saying that he wants the president's son to sit down for a closed-door deposition on Dec. 13.",
    "url": "https://www.thedailybeast.com/hunter-biden-agrees-to-testify-before-housebut-only-in-public-hearing"
  },
  {
    "text": "Jailed U.S. ex-marine Paul Whelan attacked in Russian prison, brother says  —  Arrested in 2018 in Russia, Paul Whelan was convicted of espionage in 2020 and sentenced to 16 years in a facility southeast of Moscow.  —  Former U.S. marine Paul Whelan has been attacked by another inmate … ",
    "url": "https://www.nbcnews.com/news/world/jailed-us-ex-marine-paul-whelan-attacked-russian-prison-brother-says-rcna127134"
  },
  {
    "text": "Von der Leyen: ‘Now or never’ for Israel-Palestine solution  —  VON DER LEYEN INTERVIEW  —  IT'S ‘NOW OR NEVER’ FOR ISRAEL AND PALESTINE TWO-STATE SOLUTION, SAYS VON DER LEYEN: Israelis and Palestinians have a once in a lifetime opportunity to reach a political solution in their decades-long conflict … ",
    "url": "https://www.politico.eu/newsletter/brussels-playbook/von-der-leyen-now-or-never-for-israel-palestine-solution/"
  },
  {
    "text": "Chris Christie says he wouldn't sign 6-week federal abortion ban  —  Former New Jersey Gov. Chris Christie said Tuesday he would not sign a six-week federal abortion ban as president because he does not believe such legislation aligns with the views of the American public.",
    "url": "https://www.cnn.com/2023/11/28/politics/chris-christie-abortion-ban-republicans/"
  },
  {
    "text": "Jimmy Carter Emerges From Hospice Care for Rosalynn's Memorial Service  —  “Come hell or high water, Jimmy Carter was going to use his inner resources to be there,” the presidential historian Douglas Brinkley said of Mr. Carter's emerging from hospice care for his wife's memorial service.",
    "url": "https://www.nytimes.com/2023/11/28/us/jimmy-carter-health.html"
  },
  {
    "text": "Trump Tries Again to Dismiss Civil Fraud Case After Deutsche Exec Testifies  —  Judge Engoron appeared skeptical Tuesday after the former president's attorneys moved to end the trial after testimony from a high-ranking Deutsche Bank executive  —  Former President Donald Trump's lead attorney … ",
    "url": "https://themessenger.com/politics/trump-motion-dismiss-civil-fraud-trial-deutsche-exec-testifies"
  },
  {
    "text": "If Trump convicted, Home Depot billionaire says he'd still likely fund campaign  —  Republican mega-donor Bernie Marcus said on Tuesday he would likely still give money to Donald Trump's 2024 presidential bid if the former president was convicted of a crime - but the billionaire does not plan to be one of his biggest financial backers.",
    "url": "https://www.reuters.com/world/us/home-depot-billionaire-says-hed-likely-still-fund-trump-if-candidate-convicted-2023-11-28/"
  },
  {
    "text": "A U.S. military plane with eight on board crashes into the sea near Japan  —  A coast guard spokesperson confirmed to NBC News that the plane crashed into the ocean near Yakushima, an island off the Kagoshima region on the southern main island of Kyushu.  —  TOKYO — A U.S. military Osprey aircraft … ",
    "url": "https://www.nbcnews.com/news/world/us-military-plane-crashes-sea-japan-osprey-yakushima-rcna127129"
  }
]