[
  {
    "text": "Biden team brings in $10 million in the 24 hours after the State of the Union  —  First to NBC News: The financial haul dwarfs some of the president's biggest fundraising days in 2023, before his rematch with Donald Trump was set.  —  President Joe Biden's re-election machine brought … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-raises-10-million-24-hours-state-union-rcna142624"
  },
  {
    "text": "Biden breaks with Netanyahu but sticks with Israel … But in many ways, Biden sees Netanyahu as the one responsible for the deal slipping away. … - Biden has given the Israeli government unprecedented support over the past five months, at the cost of strong pushback from the president's party during an election year.",
    "url": "https://www.axios.com/2024/03/10/biden-netanyahu-hurting-israel-red-line"
  },
  {
    "text": "Marjorie Taylor Greene Wants Points for ‘Scaring’ Joe Biden at SOTU  —  LOOK AT ME!  LOOK AT ME!  —  “You know, you guys saw that video of Joe Biden when he saw me this week at the State of the Union.  This is the hat I had on.”  —  Rep. Marjorie Taylor Greene (R-GA) … ",
    "url": "https://www.thedailybeast.com/marjorie-taylor-greene-wants-points-for-scaring-joe-biden-at-sotu"
  },
  {
    "text": "Katie Britt used decades-old example of rapes in Mexico as Republican attack on Biden border policy  —  The Republican senator who gave the party's response to President Joe Biden's State of the Union address used a harrowing account of a young woman's sexual abuse to attack his border policies … ",
    "url": "https://apnews.com/article/katie-britt-mexico-border-sex-trafficking-f74c95d1f7e3e5b9a660d9efc51ab214"
  },
  {
    "text": "Katie Britt's false linkage of a sex-trafficking case to Joe Biden  —  The Fact Checker … — Sen. Katie Boyd Britt (R-Ala.), in the Republican response to the State of the Union address, March 7  —  If you were watching Britt's speech on Thursday night, you likely would have thought … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/09/fact-check-katie-britt-sex-trafficking/"
  },
  {
    "text": "How Katie Britt, Alabama's so-called ‘reasonable’ senator, lost herself and much more  —  This is an opinion column.  —  Katie Britt's kitchen was empty.  Her table was bare.  —  There was nothing to see but her.  And she was - they told us - ready for her closeup.  —  Come on in, America.",
    "url": "https://www.al.com/news/2024/03/archibald-how-katie-britt-alabamas-so-called-reasonable-senator-lost-herself-and-a-whole-lot-more.html"
  },
  {
    "text": "Americans split on who they trust to do a better job as president: POLL  —  An ABC News/Ipsos poll finds a near-even split between Biden, Trump and neither.  —  President Joe Biden delivers the annual State of the Union address before a joint session of Congress in the House chamber at the Capital building … ",
    "url": "https://abcnews.go.com/Politics/biden-trump-americans-trust-president-poll/story?id=107938351"
  },
  {
    "text": "$91M Bond Didn't Stop Trump From Trashing E. Jean Carroll Again  —  Donald Trump just had to post a $91.6 million bond while he appeals the verdict in the defamation case won by his rape accuser, E. Jean Carroll.  But that whopping sum wasn't enough to get him to stop trashing her.",
    "url": "https://www.thedailybeast.com/dollar91m-bond-didnt-stop-donald-trump-from-trashing-e-jean-carroll-again"
  },
  {
    "text": "Kari Lake Tries a New Tactic: Mending Fences  —  The close Trump ally is courting former foes and trying to mend fences as she runs for Senate in Arizona.  But bad blood from her 2022 campaign simmers at home.  —  Conciliatory messages on social media.  Open invitations for coffee.",
    "url": "https://www.nytimes.com/2024/03/10/us/politics/kari-lake-arizona-senate.html"
  },
  {
    "text": "600 Activision QA workers just formed the biggest videogame union in the US  —  Quality assured.  —  First reported by The Verge, 600 Activision QA workers have formed a new union at the publisher.  It was organized through the Communications Workers of America (CWA), like other unions at the company … ",
    "url": "https://www.pcgamer.com/gaming-industry/600-activision-qa-workers-just-formed-the-biggest-videogame-union-in-the-us/"
  },
  {
    "text": "Nervous about November?  Stop listening to pundits and start defending the president  —  It's the only way that we are going to defeat the anti-democratic forces that are looking to transform our nation  —  This past week's State of the Union, and the incredibly powerful performance by the President … ",
    "url": "https://www.salon.com/2024/03/10/nervous-about-november-stop-listening-to-pundits-and-start-defending-the/"
  },
  {
    "text": "After Trump ballot ruling, critics say Supreme Court is selectively invoking conservative originalist approach  —  Some legal scholars criticized the court for ignoring arguments based on the text and original understanding of Section 3 of the 14th Amendment in a ruling that kept Trump on the ballot.",
    "url": "https://www.nbcnews.com/politics/supreme-court/trump-ballot-ruling-critics-say-supreme-court-selectively-invoking-con-rcna142020"
  },
  {
    "text": "Scoop: Trump's team hires lawyer to “watch the money” at RNC … - Trump campaign co-campaign manager and incoming RNC chief operating officer Chris LaCivita is bringing on Sean Cairncross to be his number two at the RNC.  — Cairncross is a lawyer with a reputation of enforcing financial discipline … ",
    "url": "https://www.axios.com/2024/03/10/trump-republicans-rnc-money"
  },
  {
    "text": "Invented Narratives and the Outrage Industry  —  The Outrage Industry  —  Even if you are not caught up in the Outrage Industry, it affects you because it affects us all.  —  The Outrage Industry influences how we talk about politics with our friends and family—and why some people avoid talking about politics.",
    "url": "https://terikanefield.com/invented-narratives-and-the-outrage-industry/"
  },
  {
    "text": "Pope Francis Says Ukraine Should Negotiate End of War With Russia  —  Pope Francis said in an interview that Ukraine, facing a possible defeat, should have the courage to negotiate an end to the war with Russia and not be ashamed to sit at the same table to carry out peace talks.",
    "url": "https://www.bloomberg.com/en/news/thp/2024-03-09/pope-francis-ukraine-should-have-the-courage-of-the-white-flag-negotiate-end-of-war-with-russia"
  }
]