[
  {
    "text": "Judge says 2-year-old US citizen appears to have been deported with ‘no meaningful process’  —  The girl was deported Friday with her mother to Honduras, despite her father's efforts to keep her in the United States.  —  A federal judge is raising alarms that the Trump administration deported … ",
    "url": "https://www.politico.com/news/2025/04/25/us-citizen-deportation-donald-trump-00311631"
  },
  {
    "text": "ICE Deports 3 U.S. Citizen Children Held Incommunicado Prior to the Deportation  —  Families disappeared and isolated without legal access; one child with cancer deported without medication and pregnant mother deported as well  —  New Orleans, LA - Today, in the early hours of the morning … ",
    "url": "https://www.aclu.org/press-releases/ice-deports-3-u-s-citizen-children-held-incommunicado-prior-to-the-deportation"
  },
  {
    "text": "Voters See Trump's Use of Power as Overreaching, Times/Siena Poll Finds  —  Skepticism has grown of his efforts to expand his authority and of his handling of issues long seen as strengths for him, including the economy and immigration.  —  Voters believe President Trump is overreaching … ",
    "url": "https://www.nytimes.com/2025/04/25/us/politics/trump-poll-approval.html?unlocked_article_code=1.Ck8.5y2u.hsJS55hvnjoe&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump Is Suddenly Bleeding Independents.  A Brutal New Poll Shows Why.  —  Donald Trump campaigned for the presidency this time around on the most openly ethno-nationalist platform in memory, one he explicitly promised to implement with undisguised authoritarian measures.",
    "url": "https://newrepublic.com/article/194424/trump-approval-poll-immigration-independents"
  },
  {
    "text": "DOGE slashes disability and aging services  —  Welcome to POLITICO's West Wing Playbook: Remaking Government, your guide to Donald Trump's unprecedented overhaul of the federal government — the key decisions, the critical characters and the power dynamics that are upending Washington and beyond.",
    "url": "https://www.politico.com/newsletters/west-wing-playbook-remaking-government/2025/04/25/doge-slashes-disability-and-aging-services-00311303"
  },
  {
    "text": "Congress erupts over FBI arrest of Wisconsin judge  —  Democratic lawmakers reacted with ferocity — and some Republicans with cheers — to the Friday arrest of Wisconsin judge Hannah Dugan for allegedly helping an undocumented defendant avoid arrest by ICE agents.",
    "url": "https://www.axios.com/2025/04/25/fbi-arrest-judge-hannah-dugan-wisconsin-congress"
  },
  {
    "text": "Milwaukee County Circuit Judge Hannah Dugan charged with 2 felonies in ICE case  —  Milwaukee County Circuit Judge Hannah Dugan was charged April 25 with two felonies on allegations of trying to help an undocumented immigrant avoid arrest after he appeared in her courtroom.",
    "url": "https://eu.jsonline.com/story/news/breaking/2025/04/25/milwaukee-county-judge-hannah-dugan-arrested-by-feds-at-courthouse/83270885007/"
  },
  {
    "text": "Scoop: DOJ rescinds policy against subpoenaing journalists  —  Attorney General Pam Bondi said in an internal memo obtained by Axios that the Justice Department is rescinding her predecessor Merrick Garland's policy restricting most subpoenas for journalists.",
    "url": "https://www.axios.com/2025/04/25/bondi-doj-garland-subpoena-journalists"
  },
  {
    "text": "A.G. Bondi reverses Garland policy against subpoenaing journalists  —  Attorney General Pam Bondi on Friday announced a stepped-up effort to go after government leaks by changing the policy for when the Justice Department will seek information from journalists — reversing a Biden administration policy barring “compulsory process.”",
    "url": "https://www.lawdork.com/p/bondi-reverses-garland-media-subpoena-policy"
  },
  {
    "text": "Virginia Giuffre, one of Jeffrey Epstein's most prominent abuse survivors, dies by suicide  —  Other Epstein victims credited Giuffre with giving them the courage to speak out.  —  Virginia Giuffre, one of the most prominent survivors of Jeffrey Epstein's sexual abuse, has died by suicide, her family said Friday.",
    "url": "https://www.nbcnews.com/news/us-news/virginia-giuffre-one-jeffrey-epsteins-prominent-abuse-survivors-dies-s-rcna203027"
  },
  {
    "text": "Virginia Giuffre, a survivor of Jeffrey Epstein's sexual abuse, has died aged 41  —  Giuffre's family issued a statement confirming she took her own life at her farm in Western Australia, where she had lived for several years  —  Virginia Giuffre, one of the most prominent victims … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/26/virginia-giuffre-suicide-dead-aged-41"
  },
  {
    "text": "Exclusive: Trump's D.C. Prosecutor Threatens Wikipedia's Tax-Exempt Status  —  Ed Martin, the firebrand Republican activist whom President Donald Trump picked to be the top prosecutor in D.C., has a new target: Wikipedia.  —  Martin, the interim U.S. attorney in Washington and Trump's permanent selection … ",
    "url": "https://www.thefp.com/p/trump-prosecutor-threatens-wikipedia"
  },
  {
    "text": "‘Vaguely Threatening’: Federal Prosecutor Queries Leading Medical Journal  —  The New England Journal of Medicine received a letter suggesting that it was biased and compromised by external pressure.  Other journals have also received the letter.  —  A federal prosecutor in Washington … ",
    "url": "https://www.nytimes.com/2025/04/25/health/nejm-prosecutor-letter.html?unlocked_article_code=1.CU8.XJpU.y5QmymkKZ5rY&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Musk Allies Made FAA Staff Sign NDAs to Keep New Project Secret  —  Sources tell Rolling Stone the secret project could be a perfect vehicle for embedding Elon Musk's Starlink within the FAA's operations … The situation fits into some broader patterns: Musk and DOGE have expressed significant influence … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-musk-doge-faa-nda-secret-project-lift-1235325667/"
  },
  {
    "text": "Inspector General Probes Whether Trump, DOGE Sought Private Taxpayer Information or Sensitive IRS Material  —  A Treasury Department inspector general is probing efforts by President Donald Trump and Elon Musk's Department of Government Efficiency to obtain private taxpayer data … ",
    "url": "https://www.propublica.org/article/trump-doge-irs-treasury-tigta-inspector-general-probe"
  },
  {
    "text": "Trump DOJ Ordered ICE to Invade Homes Without Search Warrant … The Justice Department quietly invoked the Alien Enemies act last month to give Immigration and Customs Enforcement agents the power to conduct warrantless searches of people's homes as long as they suspect them to be an “alien enemy.”",
    "url": "https://newrepublic.com/post/194442/trump-doj-memo-ice-arrest-search-warrant"
  },
  {
    "text": "Trump administration discussed possible exemptions for some Afghan refugees facing deportation  —  Christian leaders lobbied the White House to spare hundreds of Christians after the administration revoked humanitarian parole status for Afghan refugees.  —  Trump administration officials … ",
    "url": "https://www.politico.com/news/2025/04/25/trump-administration-exemptions-christians-afghan-refugees-deportation-00309672"
  },
  {
    "text": "Canadians bombarded with rightwing content on Musk's X ahead of election  —  FT analysis finds network of social media accounts attacking Liberal leader Mark Carney  —  As Canadians prepare to go to the polls on Monday, they are being bombarded with misleading rightwing content … ",
    "url": "https://www.ft.com/content/743c1dec-0c5c-4c39-a940-830ce156c235"
  },
  {
    "text": "F.D.A. Scientists Are Reinstated at Agency Food Safety Labs  —  After 20 percent of the agency's work force was cut, federal health officials have decided to bring back some experts and review firings to fill gaps in critical roles.  —  Federal health officials have reversed the decision … ",
    "url": "https://www.nytimes.com/2025/04/25/health/fda-food-safety-trump-layoffs.html"
  },
  {
    "text": "Trump administration reverses abrupt terminations of foreign students' US visa registrations  —  DOJ announced the reversal in federal court after weeks of intense scrutiny by courts and dozens of restraining orders issued by judges.  —  The Trump administration has restored … ",
    "url": "https://www.politico.com/news/2025/04/25/trump-admin-reverses-termination-foreign-student-visa-registrations-00309407"
  },
  {
    "text": "Fired, rehired, and fired again: Some federal workers find they're suddenly uninsured  —  Danielle Waterfield was already dealing with the shock and disappointment of being fired from a job she loved.  —  An attorney recruited to the Commerce Department's CHIPS for America program in 2023 … ",
    "url": "https://www.npr.org/2025/04/25/nx-s1-5373990/trump-federal-employees-firings-health-insurance-benefits"
  },
  {
    "text": "Cargo Shipments From China to U.S. Slide Toward a Standstill  —  Cancellations accelerate; ‘shipments out of China for major retailers and manufacturers has ceased’  —  The number of ships sailing from China to the U.S. laden with clothes, electronics, furniture and other goods is plunging … ",
    "url": "https://www.wsj.com/business/logistics/cargo-shipments-from-china-to-the-u-s-dwindle-9877596a"
  },
  {
    "text": "‘Complete takeover’: Lawmakers exert control over university policy in 11th hour  —  Over the course of 36 hours at the tail end of the three-month legislative session, Indiana lawmakers made significant policy changes that fundamentally alter how state universities conduct themselves.",
    "url": "https://eu.indystar.com/story/news/politics/2025/04/25/indiana-lawmakers-indiana-university-control-mike-braun/83265418007/"
  },
  {
    "text": "Kennedy Center's events scheduled for LGBTQ+ pride celebration canceled, organizers say  —  Organizers and the Kennedy Center have canceled a week's worth of events celebrating LGBTQ+ rights for this summer's World Pride festival in Washington, D.C., amid a shift in priorities and the ousting … ",
    "url": "https://apnews.com/article/world-pride-kennedy-center-trump-lgbtq-69fbf0ca20c2f9c36f49f8311f8bf1b6"
  },
  {
    "text": "Ukraine has exposed Trump's true identity: as a vandal, an autocrat, a gangster and a fool  —  This presidency places authoritarian ambition above all - and now the people of Ukraine are paying the price  —  To see the true face of Donald Trump, look no further than Ukraine.",
    "url": "https://www.theguardian.com/commentisfree/2025/apr/25/ukraine-donald-trump-true-identity-vandal-autocrat-gangster-fool"
  },
  {
    "text": "BLACKPRESSUSA UPDATE COMING SOON - The Smithsonian PURGE: Trump Team Removes Artifacts of Black Resistance  —  BLACKPRESSUSA NEWSWIRE - Black Press USA has learned that Trump officials are sending back exhibit items to their rightful owners and dismantling them—starting with the 1960 Woolworth's lunch counter sit-in exhibit.",
    "url": "https://blackpressusa.com/the-smithsonian-purge-trump-team-removes-artifacts-of-black-resistance/"
  },
  {
    "text": "US judge blocks Trump from ending union bargaining for many federal workers  —  A federal judge on Friday temporarily blocked the administration of President Donald Trump from stripping hundreds of thousands of federal employees of the ability to unionize and collectively bargain over working conditions.",
    "url": "https://www.reuters.com/legal/us-judge-blocks-trump-ending-union-bargaining-many-federal-workers-2025-04-25/"
  },
  {
    "text": "The ‘Never Surrender’ President Retreats  —  The White House tempered its position on key issues this week, as polling suggests voters are souring on Trump's steering of the economy  —  This week, President Trump said he had “no intention” of seeking the ouster of the Federal Reserve chairman … ",
    "url": "https://www.wsj.com/politics/elections/the-never-surrender-president-retreats-9b82807e"
  }
]