[
  {
    "text": "Supreme Court allows Trump's sentencing in New York hush money case  —  The decision means that a sentencing hearing scheduled for Friday can go ahead as planned.  The president-elect had asked the high court to intervene.  —  WASHINGTON — The Supreme Court on Thursday rejected President … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-declines-block-trump-sentencing-hush-money-case-rcna186837"
  },
  {
    "text": "Appeals court allows special counsel's report about Trump's election interference case to be released to public  —  The president-elect could still appeal the ruling to the Supreme Court.  —  A federal appeals court ruled Thursday that the Justice Department can release a report … ",
    "url": "https://www.nbcnews.com/politics/justice-department/appeals-court-allows-jack-smiths-report-trumps-election-interference-c-rcna186959"
  },
  {
    "text": "Supreme Court refuses to delay Trump's hush money sentencing  —  President-elect Donald Trump turned to the Supreme Court in a last-ditch effort to stop the sentencing, citing the conservative majority's explosive immunity opinion.",
    "url": "https://www.washingtonpost.com/politics/2025/01/09/trump-sentencing-supreme-court-new/"
  },
  {
    "text": "Appeals court allows release of Trump Jan. 6 special counsel report  —  The ruling can be appealed.  President-elect Donald Trump says releasing the special counsel report would interfere with his White House transition  —  A federal appellate court has cleared the way for the Justice Department … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/09/trump-jack-smith-special-counsel-report/"
  },
  {
    "text": "Supreme Court Denies Trump's Last-Ditch Effort to Avoid Sentencing  —  After the court declined in a 5-to-4 decision to block Donald J. Trump's criminal sentencing, he is scheduled to face a New York judge on Friday morning.  —  The U.S. Supreme Court on Thursday denied President-elect … ",
    "url": "https://www.nytimes.com/2025/01/09/nyregion/trump-sentencing-supreme-court.html"
  },
  {
    "text": "How a Phone Call Drew Alito Into a Trump Loyalty Squabble  —  The phone call centered on a former law clerk of Justice Alito's.  In the eyes of the Trump team, the clerk still needed to prove his loyalty to the president-elect.  —  Justice Samuel A. Alito Jr. received a call on his cellphone Tuesday.",
    "url": "https://www.nytimes.com/2025/01/09/us/politics/alito-trump-phone-call-ethics.html?unlocked_article_code=1.oE4.IMyd.vDGukd3d0M7O&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Donald Trump Jr.'s Ridiculous Greenland Trip Just Took a Dark Turn  —  A MAGA visit intended to make Greenland look pro-Donald Trump appears staged from the bottom up.  —  The so-called tourism trip saw Donald Trump Jr., far-right political pundit Charlie Kirk, and Trump administration … ",
    "url": "https://newrepublic.com/post/190070/donald-trump-jr-greenland-staged-homeless"
  },
  {
    "text": "'It's Total Chaos Internally at Meta Right Now': Employees Protest Zuckerberg's Anti LGBTQ Changes  —  Meta employees are furious with the company's newly announced content moderation changes that will allow users to say that LGBTQ+ people have “mental illness,” according to internal conversations obtained … ",
    "url": "https://www.404media.co/its-total-chaos-internally-at-meta-right-now-employees-protest-zuckerbergs-anti-lgbtq-changes/"
  },
  {
    "text": "Leaked Meta Rules: Users Are Free to Post “Mexican Immigrants Are Trash!” or “Trans People Are Immoral”  —  Meta is now granting its users new freedom to post a wide array of derogatory remarks about races, nationalities, ethnic groups, sexual orientations, and gender identities, training materials obtained by The Intercept reveal.",
    "url": "https://theintercept.com/2025/01/09/facebook-instagram-meta-hate-speech-content-moderation/"
  },
  {
    "text": "Fetterman to be first sitting Democratic U.S. senator to visit Trump at Mar-a-Lago  —  Democratic Sen. John Fetterman of Pennsylvania has accepted an invitation from President-elect Donald Trump to meet with him at his Mar-a-Lago estate, according to multiple sources familiar with the plans.",
    "url": "https://www.cbsnews.com/news/fetterman-trump-mar-a-lago/"
  },
  {
    "text": "Democrats Are About to Surrender to Trump in a Hugely Damaging Way  —  By all indications, at least nine Senate Democrats will vote to advance the Laken Riley Act, a sweeping measure that mandates the detention of undocumented immigrants who have committed nonviolent crimes, all but ensuring that it will move forward.",
    "url": "https://newrepublic.com/article/190043/laken-riley-immigration-bill-trump-democrats-surrender"
  },
  {
    "text": "Elon Musk and Donald Trump spread disinformation as wildfires rage in the LA area … As fires rage across Los Angeles and tens of thousands flee their homes, the usual suspects have decided to blame the blazes on their political enemies.  In a series of posts on Truth Social … ",
    "url": "https://www.theverge.com/2025/1/9/24339980/la-fires-pacific-palisades-disinformation-trump-musk"
  },
  {
    "text": "Inside Trump's Search for a Health Threat to Justify His Immigration Crackdown  —  President-elect Donald J. Trump's advisers have spent months trying to identify a disease that will help them build their case for closing the border.  —  President-elect Donald J. Trump is likely to justify … ",
    "url": "https://www.nytimes.com/2025/01/09/us/politics/trump-title-42-migrants.html?unlocked_article_code=1.n04.MOeP.WMVO9O2AF_cF&smid=url-share"
  },
  {
    "text": "Federal judge strikes down Biden Title IX rules  —  A federal judge in Kentucky struck down changes made to Title IX by the Biden administration Thursday, ruling that the new regulations, which had sought to expand nondiscrimination protections for LGBTQ students, violate the Constitution.",
    "url": "https://thehill.com/homenews/state-watch/5077271-kentucky-judge-rules-biden-title-ix/"
  },
  {
    "text": "Anita Bryant, Singer and Crusader Against Gay Rights, Dies at 84  —  She has hits with songs like “Paper Roses” and served as a spokesperson for Florida orange juice before her career came crashing down.  —  Anita Bryant, the pop singer and Oklahoma beauty queen who gained fame by convincing America that a … ",
    "url": "https://www.hollywoodreporter.com/news/music-news/anita-bryant-dead-singer-orange-juice-gay-rights-1236105715/"
  },
  {
    "text": "“Pizzagate” gunman dies in officer-involved shooting in North Carolina  —  Edgar Madison Welch was stopped by officers outside of Charlotte.  —  Signs of support hang on the building at Comet Ping Pong in Washington, D.C., on Dec. 6, 2016.  The business is set to reopen after Edgar Maddison Welch … ",
    "url": "https://abcnews.go.com/Politics/pizzagate-gunman-dies-officer-involved-shooting-north-carolina/story?id=117527334"
  },
  {
    "text": "Candy Crush, Tinder, MyFitnessPal: See the Thousands of Apps Hijacked to Spy on Your Location  —  This article was produced with support from WIRED.  —  Some of the world's most popular apps are likely being co-opted by rogue members of the advertising industry to harvest sensitive location data … ",
    "url": "https://www.404media.co/candy-crush-tinder-myfitnesspal-see-the-thousands-of-apps-hijacked-to-spy-on-your-location/"
  },
  {
    "text": "CNN's Scott Jennings Makes L.A. Fire Hell All About DEI  —  Scott Jennings felt the ire of Rep. Jasmine Crockett (D-TX), who took a blowtorch to him after he appeared to suggest on CNN NewsNight that the southern California wildfires are worse because there are not enough white men working … ",
    "url": "https://www.thedailybeast.com/scott-jennings-says-la-firefighters-too-busy-promoting-diversity/"
  },
  {
    "text": "Mark Zuckerberg gave Meta's Llama team the OK to train on copyrighted works, filing claims  —  Counsel for plaintiffs in a copyright lawsuit filed against Meta allege that Meta CEO Mark Zuckerberg gave the green light to the team behind the company's Llama AI models to use a dataset of pirated e-books and articles for training.",
    "url": "https://techcrunch.com/2025/01/09/mark-zuckerberg-gave-metas-llama-team-the-ok-to-train-on-copyrighted-works-filing-claims/"
  },
  {
    "text": "Thousands of homes destroyed or damaged in Palisades firestorm, LAFD estimates  —  Los Angeles fire officials said Thursday that thousands of homes appear to have been damaged or destroyed in the firestorm in Pacific Palisades, an estimate that would significantly heighten the scale of the disaster.",
    "url": "https://www.latimes.com/california/story/2025-01-09/even-after-a-two-day-nightmare-l-a-girds-for-more-days-of-fire-weather"
  },
  {
    "text": "Remembering Carter, Biden's truth deficit, and Zuckerberg's choice to raise the risk of genocide  —  Good evening from Washington, where I am still learning and relearning the lesson not to compose newsletters in the content management system.  If you're reading this, you're subscribed to the first edition of Civic Texts in the year.",
    "url": "https://civic-texts.ghost.io/remembering-carter-bidens-truth-deficit-and-zuckerbergs-choice-to-raise-the-risk-of-genocide/"
  },
  {
    "text": "Elizabeth May proposes California, Oregon, Washington join Canada after Trump's 51st state threat  —  The basic idea of ‘Cascadia’ is to calve off B.C., Washington and Oregon to form a super-rich hyper-progressive enviro-state  —  Amid repeated pledges by U.S. president-elect Donald Trump to annex Canada … ",
    "url": "https://nationalpost.com/opinion/donald-trump-annexation-elizabeth-may-cascadia"
  },
  {
    "text": "Trump's talk of retaking Panama Canal becomes a GOP bill … - Rep. Marjorie Taylor Greene (R-Ga.) said Tuesday she plans to introduce a bill that would rename the Gulf of Mexico to the “Gulf of America.” … - The bill authorizes the president and secretary of state to … ",
    "url": "https://www.axios.com/2025/01/09/trump-panama-canal-house-republican-bill"
  },
  {
    "text": "Karen Pence Snubs Donald Trump At Jimmy Carter's Funeral  —  This was the first time Mike Pence and Donald Trump have been together publicly since the insurrection.  —  LOADING  —  Former second lady Karen Pence appeared to snub President-elect Donald Trump on Thursday at former President Jimmy Carter's funeral.",
    "url": "https://www.huffpost.com/entry/karen-pence-snubs-donald-trump-jimmy-carter-funeral_n_677ff987e4b0dc0efd13adb0"
  },
  {
    "text": "Falsehoods around the L.A. fires are proliferating on the right  —  Anything to keep the realities of climate change from spreading.  —  There is nothing political about the wildfires that have annihilated thousands of buildings around Los Angeles this week, with two exceptions.",
    "url": "https://www.washingtonpost.com/politics/2025/01/09/los-angeles-fires-politics/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM2Mzk4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM3NzgxMTk5LCJpYXQiOjE3MzYzOTg4MDAsImp0aSI6ImE3N2IyYWJkLTVjYjItNDY3Yi04ZDBhLTBhNDI2Mjk0YmUzMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAxLzA5L2xvcy1hbmdlbGVzLWZpcmVzLXBvbGl0aWNzLyJ9.joiSOVPm4sJK4Jtpvl0AmoakhBImvm0g3Bf3RYSuR3c&itid=gfta"
  }
]