[
  {
    "text": "GOP senators weigh ‘special’ meeting on their leadership after McConnell's freeze  —  It takes just five Republicans to force such a sitdown, the most direct way to specifically discuss their future amid revived questions about the leader's health.  —  A handful of GOP senators is weighing whether … ",
    "url": "https://www.politico.com/news/2023/08/31/gop-senators-mcconnell-freeze-up-00113610"
  },
  {
    "text": "Trump rambled so much in a NY fraud-case deposition, a lawyer griped, 'we're going to be here until midnight'  — Trump gave long-winded answers while being deposed in NY AG Letitia James' financial-fraud lawsuit.  — He went on and on about his “beautiful” and “tremendous” golf courses, a new transcript shows.",
    "url": "https://www.businessinsider.com/trump-rambled-fraud-deposition-lawyer-well-be-here-all-night-2023-8?op=1"
  },
  {
    "text": "Trump told NY officials he was too busy saving the world ‘from nuclear holocaust’ to commit business fraud  — In a sworn deposition, Trump told New York officials he was too busy “saving millions of lives” to commit business fraud.  — “I think you would have nuclear holocaust” … ",
    "url": "https://www.businessinsider.com/trump-busy-saving-world-from-nuclear-holocaust-commit-business-fraud-2023-8?op=1"
  },
  {
    "text": "Trump could soon be in big legal trouble for inflating his net worth  —  New York's attorney general wants a speedy ruling in the case over Trump's business dealings.  —  New York Attorney General Letitia James is seeking a speedy judgment against former President Donald Trump for allegedly inflating … ",
    "url": "https://www.vox.com/politics/2023/8/31/23854224/trump-new-york-net-worth-case-james"
  },
  {
    "text": "Kemp rejects talk of special session, says punishing Fani Willis carries risks  —  X  —  During a remarkable press conference, Gov. Brian Kemp quashed the idea of a special legislative session pushed by former President Donald Trump and his allies to oust Fulton County District Attorney Fani Willis … ",
    "url": "https://www.ajc.com/politics/kemp-rejects-talk-of-special-session-warns-of-risks-of-punishing-fani-willis/I4JZYJIORNACFKY2COSFE3VCSI/"
  },
  {
    "text": "UPDATES: Trump hearings, trials will be YouTube live streamed  —  ATLANTA, Ga. (Atlanta News First) - For the first time in American history, cameras and live streaming coverage will be allowed inside the courtroom when a former U.S. president stands trial for allegedly running … ",
    "url": "https://www.atlantanewsfirst.com/2023/08/31/updates-judge-approves-youtube-stream-donald-trump-hearings-trials/"
  },
  {
    "text": "Proud Boys Joe Biggs, Zachary Rehl Sentenced For Jan. 6 Plot  —  Biggs, an Army veteran and former Infowars correspondent, was sentenced to 17 years for seditious conspiracy.  Rehl was sentenced to 15 years.  —  LOADING  —  Two leaders of the Proud Boys street gang were each sentenced Thursday … ",
    "url": "https://www.huffpost.com/entry/proud-boys-joe-biggs-sentenced_n_64ef3e5de4b0efecbcb97d74"
  },
  {
    "text": "Giuliani to enter not guilty plea in Fulton County case, waive arraignment  —  Rudy Giuliani, Donald Trump's former lawyer, will waive arraignment and enter a not guilty plea in the Fulton County, Georgia case in which he's charged alongside the former president, according to his spokesperson.",
    "url": "https://www.cbsnews.com/news/giuliani-not-guilty-plea-fulton-county-case-waive-arraignment/"
  },
  {
    "text": "Justice Thomas says he used private jet for security reasons after Dobbs leak  —  In required financial disclosure, Justice Clarence Thomas reports three 2022 trips on private jet of Harlan Crow  —  Supreme Court Justice Clarence Thomas reported three 2022 trips on the private jet … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/31/clarence-thomas-alito-financial-disclosures/"
  },
  {
    "text": "Why Biden is now routinely taking the short stairs up to Air Force One  —  It's one of the iconic images of the American presidency: the commander in chief, standing and waving to the cameras from the top of the stairs leading into Air Force One.  —  But recently, President Biden … ",
    "url": "https://www.npr.org/2023/08/31/1196803354/biden-air-force-one-short-stairs"
  },
  {
    "text": "Fulton judge says Trump court proceedings will be televised  —  X  —  A Fulton County judge on Thursday said that all court proceedings in the election interference case against former President Donald Trump and 18 co-defendants will be live streamed and televised.",
    "url": "https://www.ajc.com/politics/fulton-judge-says-trump-court-proceedings-will-be-televised/GNUTN4TYAVCQ7IPMOONTIY6SJM/"
  },
  {
    "text": "DeSantis-aligned super PAC asked for $50 million from donors on day of first GOP primary debate, leaked audio shows  —  In an urgent appeal to wealthy Republicans who had assembled in Milwaukee ahead of the first GOP presidential primary debate, top brass for the super PAC backing Florida … ",
    "url": "https://www.cnn.com/2023/08/31/politics/desantis-super-pac-audio/"
  },
  {
    "text": "Giuliani loses support of billionaires Langone, Cooperman: 'I wouldn't give him a nickel'  — Former New York City Mayor Rudy Giuliani will not be getting help with his legal bills from many of the big-money donors who financed his 2008 campaign for president.",
    "url": "https://www.cnbc.com/2023/08/31/giuliani-loses-financial-support-of-billionaires-langone-cooperman.html"
  },
  {
    "text": "45 New Victims Allegedly ID'd in Leaked Chats From Andrew Tate's ‘War Room’  —  Paying members allegedly discussed chilling techniques to abuse and groom women into sex work.  —  Members of influencer Andrew Tate's “War Room” group discussed techniques for how to groom women … ",
    "url": "https://www.thedailybeast.com/45-new-victims-allegedly-idd-in-leaked-chats-from-andrew-tates-war-room"
  },
  {
    "text": "K-12 Education Satisfaction in U.S. Ties Record Low  —  WASHINGTON, D.C. — Americans' satisfaction with the quality of K-12 education in the U.S. has fallen six percentage points in the past year to match the record-low 36% reading on this measure, which Gallup has tracked for 24 years.",
    "url": "https://news.gallup.com/poll/510401/education-satisfaction-ties-record-low.aspx"
  },
  {
    "text": "Trump campaign aide told police officers to ‘go hang yourself’ at Jan. 6 riot  —  Dylan Quattrucci, the deputy director of Trump's 2024 campaign in New Hampshire, recorded the expletive-laden video at the foot of the Capitol.  —  WASHINGTON — The No. 2 official in Hampshire … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-aide-dylan-quattrucci-police-go-hang-jan-6-riot-rcna99437"
  },
  {
    "text": "Governor Healey Activates National Guard to Provide Services at Emergency Shelter Sites  —  Guard members to coordinate food, transportation, medical care, and other basic needs.  Administration also launches Regional Rapid Response Teams to oversee shelter sites … Karissa Hand, Press Secretary",
    "url": "https://www.mass.gov/news/governor-healey-activates-national-guard-to-provide-services-at-emergency-shelter-sites"
  }
]