[
  {
    "text": "Romney stands by Trump criticism but says MAGA is now the Republican Party  —  Sen. Mitt Romney, a frequent Donald Trump critic who will soon retire from Congress, stood by his criticism of the president-elect's character but said Trump and his MAGA movement now define the Republican Party.",
    "url": "https://www.cnn.com/2024/12/15/politics/romney-trump-state-of-the-union"
  },
  {
    "text": "Universities warn international students to return before Trump inauguration … They include the University of Southern California, Brown University, University of Pennsylvania, MIT and others.  — USC in an email to students on special visas said they are expected to be in class … ",
    "url": "https://www.axios.com/2024/12/15/trump-inauguration-international-students-warning"
  },
  {
    "text": "ABC to Pay $15 Million to Settle a Defamation Suit Brought by Trump  —  The outcome of the lawsuit marks an unusual victory for President-elect Donald J. Trump in his ongoing legal campaign against national news organizations.  —  ABC News is set to pay $15 million to settle a defamation lawsuit brought by Donald J. Trump.",
    "url": "https://www.nytimes.com/2024/12/14/business/media/trump-abc-settlement.html"
  },
  {
    "text": "Patrick Soon-Shiong's controversial shakeup at the L.A. Times: ‘Bias meter,’ opinion upheaval and a call for growth  —  Patrick Soon-Shiong had become accustomed to making the news.  —  He was the doctor and medical technology innovator who built a fortune, the striving South African immigrant … ",
    "url": "https://www.latimes.com/california/story/2024-12-15/la-patrick-soon-shiong-interview"
  },
  {
    "text": "‘Trump has been explicit about revenge’: Asif Kapadia on his new film about the threat to democracy  —  The man behind Amy and Senna has turned his attention to ‘techno-authoritarianism’ in the genre-defying 2073.  He talks to our journalist - one of the movie's unlikely stars - about the events that fed his dystopian vision",
    "url": "https://www.theguardian.com/film/2024/dec/15/asif-kapadia-2073-amy-winehouse-senna-maradona-trump"
  },
  {
    "text": "Elon Musk put $277 million into the election.  Now he's $200 billion richer.  —  The tech mogul made a big bet on Donald Trump.  By one measure, it has paid off handsomely.  —  Elon Musk's net worth has climbed by more than $200 billion in 2024, a massive increase in the same year … ",
    "url": "https://www.washingtonpost.com/business/2024/12/15/elon-musk-trump-election-wealth/"
  },
  {
    "text": "McConnell has the chutzpah to complain about Trump's ‘America First’  —  Mitch McConnell bears great responsibility for the return of Trump and his foreign policy.  —  Without minimizing the many factors responsible for reelecting the most unfit presidential candidate in U.S. history … ",
    "url": "https://www.washingtonpost.com/opinions/2024/12/15/mitch-mcconnell-trump-america-first/"
  },
  {
    "text": "Sen. Bernie Sanders says Biden should ‘very seriously’ consider preemptive pardons  —  The senator's comments to NBC News' “Meet the Press” come after President-elect Donald Trump said that members of the Jan. 6th committee “should go to jail.”  —  Sen. Bernie Sanders, I-Vt. … ",
    "url": "https://www.nbcnews.com/politics/politics-news/bernie-sanders-says-biden-seriously-consider-preemptive-pardons-rcna184290"
  },
  {
    "text": "Devin Nunes, Pugnacious Trump Loyalist, to Lead Espionage Advisory Board  —  As chair of the House Intelligence Committee, he attacked the Russia inquiry and Donald J. Trump's first impeachment.  Now, Mr. Nunes runs Mr. Trump's social media company.  —  President-elect Donald J. Trump announced … ",
    "url": "https://www.nytimes.com/2024/12/14/us/devin-nunes-intelligence-advisory-board.html"
  },
  {
    "text": "Trump's CDC pick wouldn't let go of false theory vaccines cause autism  —  Dave Weldon's long record of promoting the disproven link between vaccines and autism raises concerns among some public health experts about his ability to run the CDC.  —  The world's most respected infectious-disease agency needed a new leader.",
    "url": "https://www.washingtonpost.com/health/2024/12/15/dave-weldon-trump-cdc-vaccine-skepticism/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM0MjM4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM1NjIxMTk5LCJpYXQiOjE3MzQyMzg4MDAsImp0aSI6IjAxNDVhMDFkLTQwOWEtNDM2NS1hOTcyLTg2OGZkNDIwNjg0YSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9oZWFsdGgvMjAyNC8xMi8xNS9kYXZlLXdlbGRvbi10cnVtcC1jZGMtdmFjY2luZS1za2VwdGljaXNtLyJ9.FbLjuIvHGwPRfOL7iwrmh06QK2BTuLO7GL24jBZw0yo&itid=gfta"
  },
  {
    "text": "Conservatives fall in line behind Mike Johnson ahead of speaker race  —  Johnson has been working diligently behind the scenes to solidify support.  —  Mike Johnson's speakership appeared to be on life support seven months ago.  Now, even his biggest antagonists are preparing to back him as the party enters the second Trump era.",
    "url": "https://www.politico.com/news/2024/12/15/conservatives-speaker-race-mike-johnson-00194356"
  },
  {
    "text": "CEOs Want Trump to Change Course on Tariffs.  He Isn't Budging.  —  Companies mount a campaign to soften the president-elect's trade policies, but Trump's team tells consultants he is serious  —  Donald Trump's tariff threats have triggered a behind-the-scenes lobbying campaign to soften or alter the president-elect's plans.",
    "url": "https://www.wsj.com/economy/trade/trump-tariff-plan-business-lobbying-8f02ccea"
  },
  {
    "text": "Republicans make inroads in state legislative elections, teeing up high-stakes 2025 races  —  Republicans are expanding their footprint in statehouses across the country, reversing Democrats' earlier trend of high-profile wins just a year ago.  —  In the Midwest, the GOP successfully flipped … ",
    "url": "https://thehill.com/homenews/campaign/5040340-republicans-state-elections-2025/"
  },
  {
    "text": "Rand Paul offers support for Trump immigration agenda, Noem as DHS chief  —  Sen. Rand Paul (R-Ky.) said he would prioritize South Dakota Gov. Kristi Noem's (R) confirmation as Secretary of the Department of Homeland Security once President-elect Trump takes office in January.",
    "url": "https://thehill.com/homenews/administration/5040874-rand-paul-trump-noem/"
  }
]