[
  {
    "text": "Joe Biden Is a Good Man and a Good President.  He Must Bow Out of the Race.  —  I watched the Biden-Trump debate alone in a Lisbon hotel room, and it made me weep.  I cannot remember a more heartbreaking moment in American presidential campaign politics in my lifetime … ",
    "url": "https://www.nytimes.com/2024/06/28/opinion/joe-biden-tom-friedman.html"
  },
  {
    "text": "Biden's debate is a “DEFCON 1” moment for Democrats … - With breathtaking speed, private discussions about Biden's expected performance against Donald Trump went from optimism to shock and even questions about whether Biden could continue his campaign. … - A “disaster,” one former Biden administration official called it.",
    "url": "https://www.axios.com/2024/06/28/biden-trump-debate-defcon1-2024-election"
  },
  {
    "text": "How To Process Biden's Debate Disaster  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  —  Say It Ain't So, Joe  —  I loathe theater criticism-style debate coverage, but by any standard it was a disastrous performance by President Biden.",
    "url": "https://morningmemo.talkingpointsmemo.com/p/how-to-process-bidens-debate-disaster"
  },
  {
    "text": "The true losers of this presidential debate were the American people  —  We didn't need this show.  Each candidate has had time to show us who they are, and one is a felon trying to destroy democracy  —  The American people lost the debate last night, and it was more painful than usual … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jun/28/debate-losers-american-people"
  },
  {
    "text": "Democrats Privately Discuss Replacing Biden on Presidential Ticket  —  Halting debate performance spurs turmoil in the party over 2024 candidate  —  ATLANTA—President Biden's halting performance against Donald Trump on Thursday left the Democratic Party in turmoil, with officials trying … ",
    "url": "https://www.wsj.com/politics/elections/democrats-privately-discuss-replacing-biden-on-presidential-ticket-73622773"
  },
  {
    "text": "Democrats openly admit “sense of doom” over Biden debate … - One House Democrat said a number of Democratic governors have been floated as possible alternatives: Gretchen Whitmer of Michigan, Tim Walz of Minnesota, Roy Cooper of North Carolina, Josh Shapiro of Pennsylvania and Gavin Newsom of California.",
    "url": "https://www.axios.com/2024/06/28/congress-democrats-biden-trump-debate-reaction"
  },
  {
    "text": "CNN Flash Poll: Majority of debate watchers say Trump outperformed Biden  —  Registered voters who watched CNN's presidential debate between Joe Biden and Donald Trump largely think Trump outperformed Biden, according to a CNN poll of debate watchers conducted by SSRS, with most saying … ",
    "url": "https://www.cnn.com/2024/06/28/politics/debate-poll-cnn-trump-biden/"
  },
  {
    "text": "Gavin Newsom Is Ready for the Biden Emergency  —  California's governor has fundraising chops, messaging skills and the campaign infrastructure to step up.  —  When cameras captured California Governor Gavin Newsom walking into CNN's spin room on Thursday evening, flashing his Hollywood smile … ",
    "url": "https://www.bloomberg.com/opinion/articles/2024-06-28/gavin-newsom-is-a-top-democrat-to-replace-joe-biden"
  },
  {
    "text": "June 27, 2024  —  Tonight was the first debate between President Joe Biden and presumptive Republican presidential nominee Donald Trump, and by far the most striking thing about the debate was the overwhelming focus among pundits immediately afterward about Biden's appearance and soft … ",
    "url": "https://heathercoxrichardson.substack.com/p/june-27-2024"
  },
  {
    "text": "What it means for the Supreme Court to throw out Chevron decision, undercutting federal regulators  —  WASHINGTON (AP) — Executive branch agencies will likely have more difficulty regulating the environment, public health, workplace safety and other issues under a far-reaching decision by the Supreme Court.",
    "url": "https://apnews.com/article/supreme-court-chevron-regulations-environment-4ae73d5a79cabadff4da8f7e16669929"
  },
  {
    "text": "The Supreme Court weakens federal regulators, overturning decades-old Chevron decision  —  The Supreme Court on Friday upended a 40-year-old decision that made it easier for the federal government to regulate the environment, public health, workplace safety and consumer protections … ",
    "url": "https://apnews.com/article/supreme-court-chevron-regulations-environment-5173bc83d3961a7aaabe415ceaf8d665"
  },
  {
    "text": "Supreme Court delivers blow to power of federal agencies, overturning 40-year-old precedent  —  The important 1984 precedent gave federal bureaucrats flexibility to interpret the law when the language is unclear.  —  WASHINGTON — The Supreme Court on Friday overturned a 40-year-old precedent … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-delivers-blow-power-federal-agencies-rcna145344"
  },
  {
    "text": "Supreme Court says prosecutors improperly charged hundreds of Jan. 6 rioters  —  Supreme Court's decision on obstruction charge will impact trials of hundreds of Jan. 6 rioters and, potentially, former president Donald Trump.  —  Federal prosecutors improperly charged hundreds of Jan. 6 defendants … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/28/supreme-court-obstruction-jan-6-trump/"
  },
  {
    "text": "Supreme Court rules for Jan. 6 rioter challenging obstruction charge  —  The closely-watched case focuses on charge that former President Donald Trump also faces in his election interference case.  —  WASHINGTON — The Supreme Court on Friday ruled in favor of a former police officer … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rules-jan-6-rioter-challenging-obstruction-char-rcna155902"
  },
  {
    "text": "Supreme Court allows Oregon city policy targeting homeless people  —  The justices ruled that ordinances in Grants Pass do not violate the Constitution's Eighth Amendment, which bars cruel and unusual punishment.  —  WASHINGTON — The Supreme Court on Friday rejected a constitutional challenge … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rejects-challenge-oregon-city-laws-targeting-ho-rcna153249"
  }
]