[
  {
    "text": "‘This to Him Is the Grand Finale’: Donald Trump's 50-Year Mission to Discredit the Justice System  —  The former president is in unparalleled legal peril, but he has mastered the ability to grind down the legal system to his advantage.  It's already changing our democracy.",
    "url": "https://www.politico.com/news/magazine/2024/01/12/donald-trump-indictments-legal-system-00135151"
  },
  {
    "text": "Trump's latest about-face: He now says 2020 election was ‘long over’  —  It's a new piece of rhetoric that Trump hopes will help him win immunity from his criminal charges.  —  In the months after the 2020 election, Donald Trump leaned on his campaign to launch ad blitzes and legal challenges … ",
    "url": "https://www.politico.com/news/2024/01/12/trump-2020-election-legal-00135230"
  },
  {
    "text": "Elise Stefanik's Ugly “Hostages” Barb Points to Serious GOP Mayhem Ahead  —  GOP Representative Elise Stefanik no doubt thought it was shrewd to describe the rioters who attacked the Capitol as “January 6 hostages.”  This sort of talk hits a sweet trifecta for a GOP leader with seemingly limitless ambition.",
    "url": "https://newrepublic.com/article/178044/elise-stefanik-jan-6-hostages-gop-mayhem"
  },
  {
    "text": "The Greatest Threat Posed by Trump  —  If Donald Trump storms through Iowa and easily seizes the G.O.P. nomination, as presumed, and then goes on to win back the presidency, his victory will trigger a wild political and legal melee.  The primary motivating purpose of his campaign is vengeance.",
    "url": "https://www.nytimes.com/2024/01/12/opinion/donald-trump-culture-decline.html"
  },
  {
    "text": "US, British militaries launch massive retaliatory strike against Iranian-backed Houthis in Yemen  —  The U.S. and British militaries bombed more than a dozen sites used by the Iranian-backed Houthis in Yemen on Thursday, in a massive retaliatory strike using warship- and submarine-launched Tomahawk missiles … ",
    "url": "https://apnews.com/article/yemen-houthis-biden-retaliation-attacks-0804b93372cd5e874a0dd03513fe36a2"
  },
  {
    "text": "Statement from President Joe Biden on Coalition Strikes in Houthi-Controlled Areas in Yemen  —  Today, at my direction, U.S. military forces—together with the United Kingdom and with support from Australia, Bahrain, Canada, and the Netherlands—successfully conducted strikes against a number … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/11/statement-from-president-joe-biden-on-coalition-strikes-in-houthi-controlled-areas-in-yemen/"
  },
  {
    "text": "Dean Phillips: I'm Being Blackballed — and It's Joe Biden's Fault  —  What the Minnesota Rep's unsurprising media struggles say about our news ecosystem.  —  “I'm appalled,” fumes U.S. Rep. and presidential hopeful Dean Phillips.  “I'm disappointed.  I'm disgusted that professionals … ",
    "url": "https://www.politico.com/news/magazine/2024/01/12/dean-phillips-msnbc-joe-biden-00135134"
  },
  {
    "text": "Statement from President Joe Biden on Early Student Debt Cancellation for Borrowers Enrolled in SAVE  —  From Day One of my Administration, I vowed to fix the student loan system and make sure higher education is a pathway to the middle class - not a barrier to opportunity.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/12/statement-from-president-joe-biden-on-early-student-debt-cancellation-for-borrowers-enrolled-in-save/"
  },
  {
    "text": "Why Platformer is leaving Substack  —  After much consideration, we have decided to move Platformer off of Substack.  Over the next few days, the publication will migrate to a new website powered by the nonprofit, open-source publishing platform Ghost.  If you already subscribe to Platformer … ",
    "url": "https://www.platformer.news/p/why-platformer-is-leaving-substack"
  },
  {
    "text": "2024 Republicans worry that subzero temperatures could scramble caucus turnout  —  The 2024 Republican presidential contenders are growing increasingly concerned about the dangerously frigid weather that Iowans will be confronted with when they head to the polls on caucus day … ",
    "url": "https://www.cnn.com/2024/01/12/politics/iowa-caucuses-weather-turnout/"
  },
  {
    "text": "The AMA wants a Medicare cut reversed - and lawmakers to stay out of care  —  Good morning.  I'm Julie Rovner, chief Washington correspondent at KFF Health News and host of its weekly news podcast, “What the Health?”  Listen here or wherever you get your podcasts, and send tips to JulieR@kff.org.",
    "url": "https://www.washingtonpost.com/politics/2024/01/11/ama-wants-medicare-cut-reversed-lawmakers-stay-out-care/"
  },
  {
    "text": "IRS has already collected more than $500 million in back taxes from delinquent millionaires  —  The new look at IRS enforcement comes while a government shutdown, and tax season, are nearing  —  Millionaires who were behind on their taxes have already paid half-a-billion dollars to get current … ",
    "url": "https://www.marketwatch.com/story/irs-has-already-collected-more-than-500-million-in-back-taxes-from-delinquent-millionaires-b70fe240?redirect=amp"
  },
  {
    "text": "Joe Biden Called David Axelrod a ‘Prick.’ It Won't Shut Him Up.  —  A Q&A with the former Obama strategist who's not afraid to critique the Biden campaign.  —  David Axelrod recently got a gift in the mail.  —  It was a box of political pins that captured the unique role … ",
    "url": "https://www.politico.com/news/magazine/2024/01/12/david-axelrod-obama-biden-2024-00135194"
  },
  {
    "text": "Don't Turn Away From the Charges of Genocide Against Israel  —  With the question of whether Israel is committing genocide in Gaza now before the International Court of Justice, the Biden administration has struck a tone of glib dismissal.  —  “Meritless” seems to be the agreed-upon term among U.S. officials.",
    "url": "https://www.nytimes.com/2024/01/12/opinion/israel-icj-genocide-south-africa.html"
  },
  {
    "text": "No Labels has 13 contenders for ticket against Biden and Trump  —  No Labels, the centrist organization plotting a potential 2024 presidential ticket, has 13 possible candidates to challenge a rematch of President Joe Biden and former President Donald Trump.",
    "url": "https://www.washingtonexaminer.com/news/2792042/no-labels-13-contenders-march-deadline-biden-trump/"
  },
  {
    "text": "Johnson confronts biggest test yet: Whether to walk away from his own funding deal  —  Conservatives are pushing him to renege.  Most of the rest of his party wants him to stand firm.  Whichever path he chooses carries real risks.  —  Speaker Mike Johnson's grip on his fractious conference slipped … ",
    "url": "https://www.politico.com/news/2024/01/12/johnson-funding-conservatives-00135152"
  },
  {
    "text": "Schiff would abolish filibuster, end the Electoral College in his pro-democracy plan  —  The proposal dovetails with Rep. Adam Schiff's campaign focus on the threats of Trumpism.  —  California Senate candidate and Congressmember Adam Schiff is calling for a major overhaul of American institutions … ",
    "url": "https://www.politico.com/news/2024/01/12/schiff-pro-democracy-plan-filibuster-electoral-college-00135232"
  }
]