[
  {
    "text": "Sunny Hostin Makes Disgusting, Offensive Comparison to January 6th, Then Gets Launched Into Orbit  —  With another January 6th upon us, it was just a matter of time before someone delivered the worst take of the day, and no one will be shocked to learn that it came out of Sunny Hostin's mouth.",
    "url": "https://redstate.com/bonchie/2025/01/06/sunny-hostin-makes-disgustingly-offensive-comparison-to-january-6th-then-gets-launched-into-orbit-n2184014"
  },
  {
    "text": "The Internet Is Worse Than a Brainwashing Machine  —  A rationale is always just a scroll or a click away.  —  Try to remember for a moment how you felt on January 6, 2021.  Recall the makeshift gallows erected on the Capitol grounds, the tear gas, and the sound of the riot shields colliding with hurled flagpoles.",
    "url": "https://www.theatlantic.com/technology/archive/2025/01/january-6-justification-machine/681215/?gift=bQgJMMVzeo8RHHcE1_KM0a4qV9a0Rv2_NNVQ656zT6A&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Proud Boys leader serving 22 years for Jan. 6 conviction asks Trump for a pardon  —  Enrique Tarrio, who is serving the longest Jan. 6 sentence given to a Capitol defendant to date, was convicted of seditious conspiracy for his role in planning for the riot.",
    "url": "https://www.nbcnews.com/politics/justice-department/proud-boys-leader-serving-22-years-jan-6-conviction-asks-trump-pardon-rcna186434"
  },
  {
    "text": "Rudy Giuliani is in contempt of court in $148 million defamation case  —  Rudy Giuliani was found in contempt of court Monday for failing to properly respond to requests for information as he turned over assets to satisfy a $148 million defamation judgment granted to two Georgia election workers.",
    "url": "https://apnews.com/article/rudy-giuliani-defamation-georgia-election-workers-5fe7787f42b4b89ef9d6df50bcde2efb"
  },
  {
    "text": "How will replacing Trudeau work?  Breaking down a Liberal leadership contest  —  Parliament is prorogued until March 24, buying the Liberals time to find a new leader  —  Prime Minister Justin Trudeau announced Monday morning that he plans to step down once his party picks a successor.",
    "url": "https://www.cbc.ca/news/politics/trudeau-replacement-leadership-contest-1.7423254"
  },
  {
    "text": "Mark Carney Says He's Considering Running to Succeed Trudeau  —  Mark Carney, the former governor of the Bank of Canada and Bank of England, said he's considering entering the race to replace Justin Trudeau as Canada's prime minister.  —  Carney said he's “encouraged and honored by the support … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-07/mark-carney-says-he-s-considering-running-to-succeed-trudeau"
  },
  {
    "text": "Danish king changes coat of arms amid row with Trump over Greenland  —  Design shows intent to keep control of Faroe Islands and Greenland - which Trump says he would like the US to buy  —  The Danish king has shocked some historians by changing the royal coat of arms to more prominently feature Greenland … ",
    "url": "https://www.theguardian.com/world/2025/jan/06/danish-king-changes-coat-of-arms-in-apparent-rebuke-to-donald-trump"
  },
  {
    "text": "Trump, Who Incited Insurrection, Accuses Biden Of Making Transition ‘As Difficult As Possible’  —  Four years after trying to stop the peaceful transfer of power, the president-elect claimed Biden is engaging in “lawfare such as has never been seen before.”  —  LOADING",
    "url": "https://www.huffpost.com/entry/trump-insurrection-accuses-biden-difficult-transition_n_677c2708e4b0da20062b766e"
  },
  {
    "text": "January 6th was Successful  —  A Slow-Motion Coup  —  Today is January 6th and I feel a certain tedium and impatience about marking the anniversary of the Capitol Hill attack four years later.  There seems to be a growing consensus that it, along with all of Trump's other menaces to constitutional rule, is not worth taking seriously.",
    "url": "https://www.unpopularfront.news/p/january-6th-was-successful"
  },
  {
    "text": "McDonald's is the latest company to roll back diversity goals  —  Four years after launching a push for more diversity in its ranks, McDonald's is ending some of its diversity practices, citing a U.S. Supreme Court's decision that outlawed affirmative action in college admissions.",
    "url": "https://apnews.com/article/mcdonalds-diversity-dei-goals-845d94cd46511341a43e98e057b0fa8e"
  },
  {
    "text": "Axios interview: Susie Wiles vows to block West Wing troublemakers … Wiles, who was co-campaign manager, gets much of the credit.  Two weeks from today, she'll bring her formula to Washington. … - The veteran Florida political operative — a former lobbyist who worked for Trump's GOP primary rival … ",
    "url": "https://www.axios.com/2025/01/06/axios-interview-susie-wiles-trump"
  },
  {
    "text": "Trump urges Garland to block release of Jack Smith's final report  —  His lawyers wrote to Attorney General Merrick Garland.  —  Donald Trump and two of his allies are making a last-minute push to block special counsel Jack Smith from issuing his final report on his two dismissed criminal cases against the president-elect.",
    "url": "https://www.politico.com/news/2025/01/06/trump-garland-jack-smith-filing-00196786"
  },
  {
    "text": "Private equity to lobby Donald Trump for access to savers' retirement funds  —  Industry hopes incoming administration will open long-restricted private investments to individual investors  —  The private equity industry is preparing to lobby the incoming Donald Trump administration to give … ",
    "url": "https://www.ft.com/content/dddd1752-789a-40b6-9aa8-d7cf6f408c81"
  },
  {
    "text": "Biden permanently bans offshore drilling in 625 million acres of ocean, making a Trump reversal difficult  —  President Joe Biden on Monday announced an executive action that will permanently ban future offshore oil and gas development in parts of the Atlantic and Pacific oceans … ",
    "url": "https://www.cnn.com/2025/01/06/business/biden-offshore-drilling-ban-trump"
  },
  {
    "text": "Trump says he'll replace National Archives leader  —  President-elect Trump said on Monday that he'll replace the National Archives and Records Administration (NARA) leader.  —  “We will [have a] new archivist,” Trump told conservative radio host Hugh Hewitt on his show.",
    "url": "https://thehill.com/homenews/administration/5070619-trump-says-hell-replace-national-archives-leader/"
  },
  {
    "text": "Dana White, UFC CEO and Trump ally, to join Meta's board of directors  — Meta on Monday announced Dana White will join the company's board of directors.  — White said he'd “never been interested” in joining a company's board before Meta's offer.  — White is the CEO … ",
    "url": "https://www.businessinsider.com/ufc-ceo-dana-white-join-meta-board-directors-donald-trump-2025-1"
  },
  {
    "text": "The Bogus Case Against Birthright Citizenship for the Children of Undocumented Immigrants  —  As Inauguration Day approaches, President-elect Donald Trump's promise of mass deportation at an unprecedented scale and the infighting within his own movement over H-1B visas have understandably taken center stage.",
    "url": "https://www.theunpopulist.net/p/the-bogus-case-against-birthright"
  },
  {
    "text": "Trump aides ready ‘universal’ tariff plans — with one key change  —  President-elect's aides look at universal import duties, but only on certain sectors, among first big moves of presidency.  —  President-elect Donald Trump's aides are exploring tariff plans that would be applied … ",
    "url": "https://www.washingtonpost.com/business/2025/01/06/trump-tariff-economy-trade/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM2MTM5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM3NTIxOTk5LCJpYXQiOjE3MzYxMzk2MDAsImp0aSI6ImIyY2QzNzBkLTgxNDctNGNjMy1iZjBlLWJlZTE0OTgzNzZkZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAxLzA2L3RydW1wLXRhcmlmZi1lY29ub215LXRyYWRlLyJ9.el2pftfrzzyx3P1kg79fnhzpBgd4Vi9xEtvIDwrVE98"
  },
  {
    "text": "The oppressive goal at the top of Speaker Mike Johnson's to-do list  —  making Democrats look bad by defending trans women — or look bad by not defending trans women — isn't Republicans' end goal here.  —  Not bringing down the cost of groceries or making housing more affordable, or even giving tax cuts to the rich.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/republicans-congress-trans-women-sports-bill-rcna186195"
  },
  {
    "text": "Biden Uses 72-Year-Old Law to Give Trump a Slap in the Face Before MAGA 2.0  —  The White House move could create a roadblock to one of President-elect Trump's major plans.",
    "url": "https://www.thedailybeast.com/biden-uses-72-year-old-law-to-give-trump-a-slap-in-the-face-before-maga-20/"
  },
  {
    "text": "Thune to Senate GOP: Don't overrule parliamentarian on reconciliation  —  Senate Majority Leader John Thune indicated to us that he'd oppose efforts to overrule the Senate's parliamentarian if certain GOP border security and tax provisions are ruled inconsistent with budget reconciliation rules.",
    "url": "https://punchbowl.news/archive/1625-am/card/11/#group-11"
  },
  {
    "text": "Ford and Musk.  They Made Cars.  They Backed Fascists.  —  Each age's premier industrialist has had appalling politics.  —  Elon Musk attends the opening of the Tesla Gigafactory Berlin-Brandenburg, March 22, 2022.  —  Time was when a comparison of Henry Ford and Elon Musk would have focused … ",
    "url": "https://prospect.org/power/2025-01-06-ford-musk-made-cars-backed-fascists/"
  },
  {
    "text": "Newsom proposes ‘balanced’ budget with no deficits  —  California Gov. Gavin Newsom (D) on Monday proposed a $322 billion budget that he said would be “balanced” and without deficits — marking a significant turnaround after two years of shortfalls.  —  Newsom delivered a “top-line” … ",
    "url": "https://thehill.com/homenews/state-watch/5070250-california-budget-gavin-newsom/"
  }
]