[
  {
    "text": "Do you approve or disapprove of deploying Marines to the Los Angeles area to respond to protests over the federal government's immigration enforcement?  —  YouGov surveyed 4309 US adults  —  Approve  —  34%  —  Disapprove  —  47%  —  Not sure  —  19%  —  Download Image",
    "url": "https://today.yougov.com/topics/politics/survey-results/daily/2025/06/10/50147/4"
  },
  {
    "text": "Trump warns ‘any’ protesters at military parade will be ‘met with heavy force’  —  Nine small protests are planned in Washington on Saturday, officials said.  —  President Donald Trump speaks with reporters in the Oval Office of the the White House, June 10, 2025, in Washington.",
    "url": "https://abcnews.go.com/Politics/trump-warns-protesters-military-parade-met-heavy-force/story?id=122692921"
  },
  {
    "text": "Democrats Enter Risky Political Terrain as Protests Grip California  —  Scenes of unrest in Southern California, stoked by President Trump as he tries to deport more immigrants, have left Democratic leaders worried the confrontation elevates a losing issue for the party.",
    "url": "https://www.nytimes.com/2025/06/10/us/politics/trump-immigration-ice-democrats.html"
  },
  {
    "text": "Trump Should Crush the L.A. Riots—with a Subtle Hand  —  Los Angeles is burning.  Earlier this year, seasonal fires ripped through the Southern California city, but now, the fires are entirely manmade.  In response to the Trump administration's deportation policy, left-wing activists … ",
    "url": "https://christopherrufo.com/p/trump-should-crush-the-la-riotswith"
  },
  {
    "text": "Fake Images and Conspiracy Theories Swirl Around L.A. Protests  —  Disinformation spreading on social media platforms has stoked an already tense situation.  —  Misleading photographs, videos and text have spread widely on social media as protests against immigrant raids have unfolded in Los Angeles … ",
    "url": "https://www.nytimes.com/2025/06/10/technology/la-protests-conspiracy-theories-disinformation.html?unlocked_article_code=1.N08.86pR.u0-XR0mtt1Uo&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Troops deployed to LA will cost $134M, Pentagon predicts  —  The estimate came during a budget hearing with Defense Secretary Pete Hegseth, who said the president is enforcing “law and order.”  —  President Donald Trump's decision to deploy troops to Los Angeles amid mass deportation protests … ",
    "url": "https://www.politico.com/news/2025/06/10/troops-deployed-to-la-will-cost-134m-pentagon-official-says-00396632"
  },
  {
    "text": "The White House Marching Orders That Sparked the L.A. Migrant Crackdown  —  After deportations fell short of President Trump's campaign promises, federal agents summoned to a meeting in Washington were told to ‘just go out there and arrest illegal aliens’  —  Even with the high-profile arrests … ",
    "url": "https://www.wsj.com/us-news/protests-los-angeles-immigrants-trump-f5089877?st=uY6fj3&reflink=article_copyURL_share"
  },
  {
    "text": "Congresswoman Charged for Forcibly Impeding and Interfering With Federal Officers  —  For Immediate Release  —  U.S. Attorney's Office, District of New Jersey  —  NEWARK, N.J. - U.S. Representative LaMonica McIver was charged in a three-count indictment today for forcibly impeding … ",
    "url": "https://www.justice.gov/usao-nj/pr/congresswoman-charged-forcibly-impeding-and-interfering-federal-officers"
  },
  {
    "text": "US Rep. LaMonica McIver indicted on federal charges from skirmish at New Jersey immigration center  —  U.S. Rep. LaMonica McIver was indicted Tuesday on federal charges alleging she impeded and interfered with immigration officers outside a New Jersey detention center while Newark's mayor … ",
    "url": "https://apnews.com/article/lamonica-mciver-assault-charge-alina-habba-immigration-7b6a5b0fc8079a9efd0606ab68e3f02d"
  },
  {
    "text": "ABC News drops Terry Moran over late-night post attacking Trump and Stephen Miller  —  ABC News is parting ways with veteran correspondent Terry Moran, two days after he posted a missive on X calling President Donald Trump and deputy chief of staff Stephen Miller “world-class haters.”",
    "url": "https://cnn.com/2025/06/10/media/abc-news-terry-moran-exits-trump"
  },
  {
    "text": "Trump team plans to send thousands of migrants to Guantanamo starting as soon as this week  —  The use of the facility would send another signal of deterrence amid immigration crackdown.  —  The Trump administration is planning to dramatically ramp up sending undocumented migrants … ",
    "url": "https://www.politico.com/news/2025/06/10/trump-plans-migrants-guantanamo-bay-00396673"
  },
  {
    "text": "Trump announces he is ‘restoring’ the names of several bases changed under Biden  —  President makes surprise announcement during speech at Fort Bragg to cheering crowd  —  President Donald J. Trump announced Tuesday that his administration will restore the original names of several U.S. Army bases … ",
    "url": "https://www.foxnews.com/politics/trump-announces-he-restoring-names-several-bases-changed-under-biden"
  },
  {
    "text": "Send In the Troops, for Real  —  When local police can't restore order, the federal government has a duty to do so with a show of force.  —  Violent insurrectionists turned areas of Los Angeles into lawless hellscapes over the weekend, with anarchists setting fire to vehicles … ",
    "url": "https://www.wsj.com/opinion/send-in-the-troops-for-real-los-angeles-riots-ice-949c8ace"
  },
  {
    "text": "Anti-ICE protests held coast-to-coast after L.A. unrest as national movement grows  —  Activists plan more events on Tuesday, with events due in New York, Chicago, Dallas, and Atlanta.  —  Dozens of protests and rallies opposing ICE raids and government immigration policies were held across … ",
    "url": "https://www.nbcnews.com/news/us-news/anti-ice-protests-held-coast-coast-l-unrest-national-movement-grows-rcna211980"
  },
  {
    "text": "Is Trump's Birthday Parade a Celebration of the Army or a Funeral Cortege for Democracy?  —  ANYBODY WANT CAKE?  —  The president is, once again, disrespecting our armed forces by hijacking the U.S. Army's 250th birthday celebrations—and turning it into a party for himself.  —  OPINION",
    "url": "https://www.thedailybeast.com/is-trumps-birthday-parade-a-celebration-of-the-army-or-a-funeral-cortege-for-democracy/"
  },
  {
    "text": "Airlines Don't Want You to Know They Sold Your Flight Data to DHS  —  This article was primarily reported using public records requests.  We are making it available to all readers as a public service.  FOIA reporting can be expensive, please consider subscribing to 404 Media to support this work.",
    "url": "https://www.404media.co/airlines-dont-want-you-to-know-they-sold-your-flight-data-to-dhs/"
  },
  {
    "text": "Elon Was Right, Trump Is Compromised and Knows It: Ex-Aide  —  ‘KOMPROMAT’  —  The president may be compromised—but not exactly how Musk alleged, according to Anthony Scaramucci.  —  Even if Donald Trump's not in the Epstein files, Anthony Scaramucci suspects the president's real vulnerability lies somewhere even more alarming.",
    "url": "https://www.thedailybeast.com/elon-was-right-trump-is-compromised-and-knows-it-ex-aide/"
  },
  {
    "text": "Southern Baptists Endorse Effort to Overturn Same-Sex Marriage  —  The nation's largest Protestant denomination was motivated by conservative Christians' success in reversing Roe v. Wade.  —  Southern Baptists voted overwhelmingly on Tuesday to call for the overturning of the Supreme Court ruling … ",
    "url": "https://www.nytimes.com/2025/06/10/us/southern-baptist-obergefell-same-sex-marriage.html?unlocked_article_code=1.N08.H_A-.sZdzFMPfxrwc&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump Declares Dubious Emergencies to Amass Power, Scholars Say  —  In disputes over protests, deportations and tariffs, the president has invoked statutes that may not provide him with the authority he claims.  —  To hear President Trump tell it, the nation is facing a rebellion in Los Angeles … ",
    "url": "https://www.nytimes.com/2025/06/10/us/politics/trump-emergency-powers-invasion.html?unlocked_article_code=1.N08.PXpo.u8qk_3hI5IG2&smid=url-share"
  },
  {
    "text": "Most GOP lawmakers plan to skip Trump's big parade  —  POLITICO surveyed 50 Hill Republicans.  Only six said they'd stick around Saturday for the big show.  —  President Donald Trump is celebrating the Army's 250th anniversary — and his own 79th birthday — with a massive, multimillion-dollar military parade Saturday in Washington.",
    "url": "https://www.politico.com/news/2025/06/10/trump-parade-congress-republicans-00398774"
  },
  {
    "text": "New PRRI Poll: Three-Quarters of Americans Oppose Trump's Military Parade  —  As the 250th anniversary of the United States Army approaches, which also coincides with President Donald Trump's 79th birthday, Washington is preparing to mark the occasion with a large-scale military parade featuring thousands … ",
    "url": "https://prri.org/spotlight/military-parade-in-d-c-draws-public-opposition-ahead-of-army-and-trump-celebrations/"
  },
  {
    "text": "Trump Says FEMA Phaseout to Begin After Hurricane Season  —  Once the World's ‘Most Popular Politician,’ Lula Is Losing His Way in Brazil … Year of Elections",
    "url": "https://www.bloomberg.com/news/articles/2025-06-10/trump-says-fema-phaseout-to-begin-after-hurricane-season-mbqu8je1?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0OTU3OTgxMSwiZXhwIjoxNzUwMTg0NjExLCJhcnRpY2xlSWQiOiJTWE5HRDVEV1JHRzAwMCIsImJjb25uZWN0SWQiOiIwOTRFQTUyQzdCQTQ0RDRDQjk1QTNCNDVENDg4RjY1NSJ9.UYnft3cdFfjBeLnL1mDk4-3LNCBkKHmKu-Xc4A34VIc"
  },
  {
    "text": "Eleanor Holmes Norton says she's seeking reelection amid age questions  —  Eleanor Holmes Norton, D.C.'s nonvoting House delegate, told reporters Tuesday she intends to seek reelection amid mounting questions about her ability to serve in Congress.  “Yeah, sure,” she said when asked about running for reelection.",
    "url": "https://www.politico.com/live-updates/2025/06/10/congress/eleanor-holmes-norton-reelection-00397248"
  },
  {
    "text": "Former, current CDC employees call on RFK Jr. to resign  —  Current and former employees of Centers for Disease Control and Prevention are calling on Health Secretary Robert F. Kennedy Jr. to resign, warning that job cuts and proposed funding reductions will hurt the agency's ability to protect the public from future health outbreaks.",
    "url": "https://www.axios.com/local/atlanta/2025/06/10/cdc-workers-protest-walk-out-advisory-committee-rfk"
  },
  {
    "text": "The DOGE 100: Musk Is Out, but More Than 100 of His Followers Remain to Implement Trump's Blueprint  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  In an effort launched shortly after DOGE's creation … ",
    "url": "https://www.propublica.org/article/doge-elon-musk-trump-staffers-tracker-update"
  },
  {
    "text": "Can anyone beat Cuomo?  And is it Zohran?  —  Today's newsletter is a guest post from Joel Wertheimer.  Even if you don't care about New York, I think you'll like the post.  It contains some nerdy diversions into game theory and ranked choice voting, a system that can introduce … ",
    "url": "https://www.natesilver.net/p/can-anyone-beat-cuomo-and-is-it-zohran"
  },
  {
    "text": "Mike Bloomberg to endorse old foe, Andrew Cuomo, in mayor's race  —  The billionaire ex-mayor will back the Democratic frontrunner as socialist Zohran Mamdani rises.  —  NEW YORK — Former Mayor Michael Bloomberg is prepared to endorse his old nemesis, Andrew Cuomo, for mayor Tuesday … ",
    "url": "https://www.politico.com/news/2025/06/10/mike-bloomberg-to-endorse-old-foe-andrew-cuomo-in-mayors-race-00397425"
  },
  {
    "text": "World Bank Forecast Underscores Cost of U.S. Trade War  —  Along with a sharply downgraded projection for global output this year, it urged a “course correction” on trade to help preserve living standards.  —  The global economy is projected to slow sharply this year as President Trump's … ",
    "url": "https://www.nytimes.com/2025/06/10/business/trump-trade-war-global-economy.html?unlocked_article_code=1.N08.KYUv.MdFkxOHf5J52&smid=url-share"
  },
  {
    "text": "The Political Gap in Americans' News Sources  —  Exploring use of and trust in 30 sources across U.S. political lines  —  Table of Contents Table of Contents  —  Pew Research Center conducted this study to continue tracking news consumption and trust across a wide range of specific news sources.",
    "url": "https://www.pewresearch.org/journalism/2025/06/10/the-political-gap-in-americans-news-sources/"
  }
]