[
  {
    "text": "Scoop: Iran warns Israel through UN against ground offensive in Gaza … - Iran's message, sent to Israel through the UN, comes as the Biden administration has been trying to deter Iran and Lebanon-backed Hezbollah, supported by Iran, from joining the war.",
    "url": "https://www.axios.com/2023/10/14/iran-warning-israel-hezbollah-hamas-war-gaza"
  },
  {
    "text": "Israel-Gaza war live updates  —  Israeli military preparing ‘wide range’ attacks as Gaza residents flee  —  The Israeli military said it is preparing a “wide range of offensive operative plans” for Gaza, including attacks by land, sea and air, after warning the entire population … ",
    "url": "https://www.washingtonpost.com/world/2023/10/14/israel-gaza-war-updates-hamas-palestine/"
  },
  {
    "text": "A flood of misinformation shapes views of Israel-Gaza conflict  —  The barrage of false images, memes, videos and posts — mostly generated from within the region itself — is making it difficult to assess what is real.  —  A WhatsApp voice memo purporting to have insider information … ",
    "url": "https://www.washingtonpost.com/technology/2023/10/14/propaganda-misinformation-israel-hamas-war-social-media/"
  },
  {
    "text": "Inside Trump's Backroom Effort to Lock Up the Nomination  —  As the former president dodges debates, it can seem as if he's bypassing the primary.  But he and his team have been working quietly to twist the delegate rules in their favor.  —  Not long after the new chairman of the Republican Party … ",
    "url": "https://www.nytimes.com/2023/10/14/us/politics/trump-delegate-strategy.html"
  },
  {
    "text": "Nadler: supporting innocent Palestinians doesn't make you anti-Israel  —  Rep. Jerry Nadler (D-N.Y.) argued on Saturday that supporting innocent Palestinians doesn't make a person anti-Israel amid the ongoing fighting between Israel and Hamas.  —  “It's a fairly simple proposition … ",
    "url": "https://thehill.com/homenews/house/4256443-nadler-supporting-innocent-palestinians-doesnt-make-you-anti-israel/"
  },
  {
    "text": "UN expert warns of new instance of mass ethnic cleansing of Palestinians, calls for immediate ceasefire  —  Statement by Mr. Françis Amar, Chief, Division of International Organizations, ICRC  —  VIOLENCE AGAINST WOMEN LINKED TO POVERTY, ARMED CONFLICT, THIRD COMMITTEE TOLD, AS DISCUSSION OF WOMEN'S ISSUES CONCLUDES",
    "url": "https://www.ohchr.org/en/press-releases/2023/10/un-expert-warns-new-instance-mass-ethnic-cleansing-palestinians-calls"
  },
  {
    "text": "Will Jim Jordan bully his way to the speakership?  —  To win the speaker's gavel, the Ohio Republican might have to embrace the tough tactics he built his reputation on.  —  Back in September 2016, Rep. Jim Jordan was on a crusade: He wanted the House to launch impeachment proceedings … ",
    "url": "https://www.politico.com/news/2023/10/14/jim-jordans-bully-pulpit-00121585"
  },
  {
    "text": "New Zealand Defeats Ardern's Party, Electing Conservative Coalition  —  The rightward shift came as voters punished the party once led by Jacinda Ardern for failing to deliver the transformational change that it had promised.  —  After an election campaign of fits and starts … ",
    "url": "https://www.nytimes.com/2023/10/14/world/asia/new-zealand-election-national-wins.html"
  },
  {
    "text": "Most say Biden has acted either illegally or unethically in his son's business dealings  —  A third of the public approves of the House's impeachment inquiry and 38% say neither party is equipped to manage government corruption. … Most adults say President Biden has at the very least acted unethically … ",
    "url": "https://apnorc.org/projects/most-say-biden-has-acted-either-illegally-or-unethically-in-his-sons-business-dealings/"
  },
  {
    "text": "DeSantis argues against US accepting Gaza refugees, citing antisemitism  —  Florida Gov. Ron DeSantis (R) argued Saturday that the U.S. shouldn't take in Palestinian refugees fleeing from Gaza amid the war between Israel and Hamas militants.  —  “I don't know what [President] Biden's gonna do … ",
    "url": "https://thehill.com/policy/international/4256373-ron-desantis-argues-against-gaza-refugees/"
  },
  {
    "text": "The Real Danger in Robert F. Kennedy Jr.'s Independent Run  —  Most of the concern over the independent presidential campaigns of Robert F. Kennedy Jr., Cornel West and the No Labels party has focused on the risk that they could draw votes away from President Biden and throw the 2024 election to Donald Trump.",
    "url": "https://www.nytimes.com/2023/10/14/opinion/the-real-danger-in-robert-f-kennedy-jrs-independent-run.html"
  },
  {
    "text": "Judge punishes Rudy Giuliani for ‘continued and flagrant disregard’ of court orders  —  U.S. District Judge Beryl Howell said jurors at an upcoming trial will be told that the former Trump lawyer intentionally tried to hide financial documents.  —  The judge presiding over the upcoming damages trial … ",
    "url": "https://www.nbcnews.com/politics/politics-news/judge-punishes-rudy-giuliani-flagrant-disregard-court-orders-rcna120412?taid=652a9eedd10457000169719c"
  },
  {
    "text": "The House Speaker Race Is a Mess—and So Is the GOP  —  Even if Jordan wins, the GOP caucus is like a Rubik's cube.  If you do what you have to do to fix one side, you are likely to mess up your previous work on the opposite side. … It's dumpster fire time as the House GOP's dysfunction … ",
    "url": "https://www.thedailybeast.com/the-house-speaker-race-is-a-messand-so-is-the-gop"
  },
  {
    "text": "Joe Biden, defender of democracy  —  In just under 13 months, we will face our next existential question: Will we choose to continue the American experiment, or will the forces of darkness, revenge and power take control, probably for the foreseeable future?",
    "url": "https://thehill.com/opinion/campaign/4253280-joe-biden-defender-of-democracy/"
  }
]