[
  {
    "text": "Live updates Jim Jordan fails to become House speaker on third ballot  —  Rep. Jim Jordan (R-Ohio) failed Friday on a third ballot to be elected House speaker after backing off a plan to empower a temporary speaker.  Jordan, a conservative firebrand and ally of former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/20/house-speaker-vote-live/"
  },
  {
    "text": "House GOP abandons Jordan for Speaker after secret ballot loss  —  The Republican conference on Friday voted to no longer back House Judiciary Chair Jim Jordan (R-Ohio) as Speaker.  —  The secret ballot vote came hours after Jordan's third failed ballot on the House floor.",
    "url": "https://thehill.com/homenews/house/4264545-house-gop-not-backing-jim-jordan-speaker/"
  },
  {
    "text": "Jim Jordan Says He's Not Giving Up On Speaker Bid Ahead Of Another Vote  —  As the prospect of a series of weekend votes in the House looms, the Judiciary Committee chairman is sticking with his 2020 election denialism.  —  LOADING  —  Rep. Jim Jordan (R-Ohio) is not done yet.",
    "url": "https://www.huffpost.com/entry/jim-jordan-not-giving-up-house-speaker_n_65326c14e4b0d7f72de1da43"
  },
  {
    "text": "Listen: Terrifying voicemail left for GOP lawmaker's wife over Jim Jordan vote  —  CNN has obtained exclusive audio of a threatening voice message to the wife of a congressman who opposes Jim Jordan's bid for House speaker.",
    "url": "https://www.cnn.com/videos/politics/2023/10/19/tapper-voicemail-threat-phone-call-jim-jordan-vpx.cnn"
  },
  {
    "text": "Kenneth Chesebro: Pro-Trump lawyer pleads guilty in Georgia election subversion case, implicates Trump in fake elector conspiracy  —  Kenneth Chesebro, an attorney who helped orchestrate the Trump campaign's 2020 fake electors plot, pleaded guilty Friday in the Georgia election subversion case … ",
    "url": "https://www.cnn.com/2023/10/20/politics/kenneth-chesebro-georgia-election-subversion/"
  },
  {
    "text": "Trump co-defendant Kenneth Chesebro pleads guilty in Georgia election case  —  Chesebro became the second former Trump lawyer to plead guilty in as many days, following Sidney Powell on Thursday.  —  ATLANTA — Kenneth Chesebro, a former lawyer for Donald Trump's campaign … ",
    "url": "https://www.washingtonpost.com/national-security/2023/10/20/chesebro-guilty-plea-trump-georgia/"
  },
  {
    "text": "Team Trump Never Dreamed Sidney Powell Would Flip on Them  —  She was the ultimate MAGA conspiracy theorist.  Then she got charged with being part of a criminal conspiracy, and her tune started to change  —  Sidney Powell was the wildest of MAGA diehards — someone who swore long past … ",
    "url": "https://www.rollingstone.com/politics/politics-features/team-trump-sidney-powell-flip-rico-fulton-county-1234858576/"
  },
  {
    "text": "Jury selection begins in Fulton Trump case amid talk of plea deal  —  Hundreds of would-be jurors gathered at the Fulton County courthouse Friday and began filling out questionnaires, the first step in the criminal trial of a Donald Trump ally accused to conspiring with the former president to overthrow the 2020 election.",
    "url": "https://www.ajc.com/politics/jury-selection-begins-in-fulton-trump-case-amid-talk-of-plea-deal/O2LJI2U3ZNHKNCYG2QXNJLKCCI/"
  },
  {
    "text": "It Turns Out Joe Biden Is Actually In Charge of the Biden Administration … The central Republican attack line on Joe Biden has always been that he is not in charge of his own administration.  “They're surrounded by vicious, smart people, radical left people, but they're very smart, and they're very vicious,” said Donald Trump.",
    "url": "https://nymag.com/intelligencer/2023/10/bidens-israel-policy-proves-hes-running-his-administration.html"
  },
  {
    "text": "President Biden Gaslights Americans in Oval Office Address on Ukraine, Israel  —  Why did President Joe Biden travel to Israel to meet with  Prime Minister Bibi Netanyahu?  So he could deliver an Oval Office address on Thursday night to beg Americans and a leaderless House of Representatives for more money for Ukraine.",
    "url": "https://pjmedia.com/news-and-politics/victoria-taft/2023/10/19/president-bidens-oval-office-gas-light-chat-on-ukraine-israel-n1736538"
  },
  {
    "text": "Elon Musk's X removes the New York Times' verification badge  —  The unexplained decision removes the only symbol distinguishing the news organization from impostors and comes amid a flood of false information related to the Israel-Gaza war, some of which Musk has personally endorsed.",
    "url": "https://www.washingtonpost.com/technology/2023/10/19/x-twitter-nyt-dispute-musk/"
  },
  {
    "text": "Behind the Curtain: Rattled U.S. government fears wars could spread … Never before have we talked to so many top government officials who, in private, are so worried about so many overseas conflicts at once. … But to sound a siren of clinical, clear-eyed realism: U.S. officials … ",
    "url": "https://www.axios.com/2023/10/20/biden-government-war-fears-israel-hamas"
  },
  {
    "text": "Judge Threatens ‘Imprisoning’ Trump for ‘Blatantly’ Violating Gag Order  —  Trump's New York AG case isn't supposed to be a criminal case, but it may result in Trump getting thrown in jail anyway.  —  The judge overseeing Donald Trump's bank fraud trial threatened to throw the former president in jail … ",
    "url": "https://www.thedailybeast.com/judge-threatens-imprisoning-trump-for-blatantly-violating-gag-order"
  },
  {
    "text": "Maryland circuit court judge killed in driveway of home, police say  —  Washington County Circuit Court Judge Andrew Wilkinson, 52, was found with apparent gunshot wounds and died at a hospital, authorities said.  —  A Maryland judge was found apparently shot in the driveway of his home Thursday evening and later died, officials say.",
    "url": "https://www.nbcnews.com/news/us-news/maryland-circuit-court-judge-killed-driveway-home-police-say-rcna121366"
  },
  {
    "text": "Jon Stewart's Show on Apple Is Ending  —  Mr. Stewart and Apple are parting ways because of creative differences over “The Problem,” people with knowledge of the decision said.  —  Jon Stewart's show on Apple's streaming service is abruptly coming to an end, according to several people … ",
    "url": "https://www.nytimes.com/2023/10/19/business/media/jon-stewart-the-problem-ends.html"
  },
  {
    "text": "Sarah Huckabee Sanders Bans ‘Woke’ Words In Culture War Cluelessness  —  The Arkansas governor, who once served as Trump's press secretary, was criticized by the ACLU and LGBTQ+ advocates for the move.  —  LOADING  —  Arkansas Gov. Sarah Huckabee Sanders (R) on Thursday signed an executive order banning … ",
    "url": "https://www.huffpost.com/entry/sarah-huckabee-sanders-anti-woke_n_65327ce1e4b0eb7cdbc26f38"
  },
  {
    "text": "On Israel, Progressive Jews Feel Abandoned by Their Left-Wing Allies  —  Jewish leaders and voters said they were taken aback to discover that many of their ideological allies saw them as oppressors who deserved blame following the Israel attacks.  —  Progressive Jews who have spent years … ",
    "url": "https://www.nytimes.com/2023/10/20/us/politics/progressive-jews-united-states.html"
  },
  {
    "text": "Israeli official slams Greta Thunberg after she backs Palestinians in Gaza  —  ‘Whoever identifies with Greta in any way in the future, in my view, is a terror supporter,’ says Israeli army spokesperson.  —  The Israeli military lashed out at Swedish climate activist Greta Thunberg on Friday … ",
    "url": "https://www.politico.eu/article/greta-thunberg-calls-global-pro-palestinian-strike-gaza-genocide-israel-slam/"
  }
]