[
  {
    "text": "The Real Reason Trump and Vance Are Spreading Lies About Haitians  —  Investing in Rust Belt communities would not fix what they see as the actual problem.  —  Six days into terrorizing the city of Springfield, Ohio, with baseless nonsense about Haitian immigrants kidnapping and eating people's pets … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/09/trumps-campaign-immigrants-springfield-ohio-haiti/679913/?gift=FaTgSr1DlmjAMpTRhP-EJeXQS0j-YwBUiSR24ZTd3cc&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "How the Trump Campaign Ran With Rumors About Pet-Eating Migrants—After Being Told They Weren't True  —  Springfield, Ohio, city officials were contacted by Vance's team and said the claims were baseless.  It didn't matter and now the town is in chaos.  —  SPRINGFIELD, Ohio … ",
    "url": "https://www.wsj.com/us-news/springfield-ohio-pet-eating-claims-haitian-migrants-04598d48?st=n5zqPV&reflink=article_copyURL_share"
  },
  {
    "text": "J.D. Vance offers ‘proof’ of pet-eating, but it's proven false with 1 phone call  —  Donald Trump's running mate JD Vance has dug in on his claim Haitians in an Ohio community are abducting and eating pets, even as the state's GOP governor and other officials insist there is no evidence of such behavior.",
    "url": "https://www.nj.com/politics/2024/09/jd-vance-offers-proof-of-pet-eating-but-its-proven-false-with-1-phone-call.html"
  },
  {
    "text": "Teamsters: No Endorsement for U.S. President  —  International Union Cites Strong Political Divides, Few Commitments from Candidates  —  Press Contact: Kara Deniz Phone: (202) 497-6610 Email: kdeniz@teamster.org  —  (WASHINGTON) — The General Executive Board of the International Brotherhood … ",
    "url": "https://teamster.org/2024/09/teamsters-no-endorsement-for-u-s-president/"
  },
  {
    "text": "West Coast Teamsters break with national chapter in endorsing Harris  —  The announcement came minutes after the national Teamsters declined to make a presidential endorsement.  —  West Coast Teamsters announced their endorsement of Vice President Kamala Harris on Wednesday … ",
    "url": "https://www.politico.com/news/2024/09/18/west-coast-teamsters-endorse-harris-00179923"
  },
  {
    "text": "Teamsters will not endorse for president, a blow to Democrats  —  The union last failed to endorse a Democrat for president in 1996.  Several powerful regional factions have endorsed Kamala Harris on their own.  —  For the first time in nearly three decades, the International Brotherhood … ",
    "url": "https://www.washingtonpost.com/business/2024/09/18/teamsters-endorsement-election/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI2NjMyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI4MDE0Mzk5LCJpYXQiOjE3MjY2MzIwMDAsImp0aSI6IjdlNzJlZjQyLTYxZjctNDQ1OS1hZGQ3LTViMzIzNDc3YjA2ZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI0LzA5LzE4L3RlYW1zdGVycy1lbmRvcnNlbWVudC1lbGVjdGlvbi8ifQ.TMTrR3b0vQytxTtuu3388lRjWAajCK9SOsrKoBY501M&itid=gfta"
  },
  {
    "text": "Fox News Poll: Harris tops Trump by two points  —  The latest Fox News national survey finds 3-point shift since August  —  Vice President Kamala Harris edges former President Trump in a head-to-head matchup, as more voters see Harris as the candidate who will help the middle class … ",
    "url": "https://www.foxnews.com/official-polls/fox-news-poll-harris-tops-trump-two-points"
  },
  {
    "text": "Swing State Poll 2024: Pennsylvania, Michigan, Wisconsin: Harris Ahead In 2 Key Battleground States, 3rd State Up For Grabs, Quinnipiac University Poll Finds; U.S. Senate Races: Democrats Have Leads In All 3 States  —  mail_outline  —  PENNSYLVANIA: Harris 51%, Trump 45%, Stein 1%, Oliver 1%",
    "url": "https://poll.qu.edu/poll-release?releaseid=3905"
  },
  {
    "text": "Could there be a Kamala Harris landslide in November?  The data scientist who correctly called the last election is betting yes … In late 2020 and early 2021, this reporter wrote several stories focusing on the election predictions advanced by Thomas Miller, a data scientist at Northwestern University.",
    "url": "https://fortune.com/2024/09/18/trump-vs-harris-election-odds-who-will-win/"
  },
  {
    "text": "Israel planted explosives in Hezbollah's Taiwan-made pagers, say sources  —  A Taiwanese pager maker denied on Wednesday that it had produced devices that wounded thousands of Hezbollah operatives in Lebanon when they exploded, an audacious attack that raised the prospect of a full-scale war between … ",
    "url": "https://www.reuters.com/world/middle-east/israel-planted-explosives-hezbollahs-taiwan-made-pagers-say-sources-2024-09-18/"
  },
  {
    "text": "Israel Planted Explosives in Pagers Sold to Hezbollah, Officials Say  —  Small amounts of explosive were implanted in beepers that Hezbollah had ordered from a Taiwanese company, according to American and other officials briefed on the operation.  —  Israel carried out its operation … ",
    "url": "https://www.nytimes.com/2024/09/17/world/middleeast/israel-hezbollah-pagers-explosives.html"
  },
  {
    "text": "Fed slashes interest rates by a half point, an aggressive start to its first easing campaign in four years … WATCH NOW  —  WASHINGTON - The Federal Reserve on Wednesday enacted its first interest rate cut since the early days of the Covid pandemic, slicing half a percentage point off benchmark rates … ",
    "url": "https://www.cnbc.com/2024/09/18/fed-cuts-rates-september-2024-.html"
  },
  {
    "text": "Trump's Talk of Prosecution Rattles Election Officials  —  The former president has long claimed, despite evidence to the contrary, that elections are corrupt.  What if he carries through with threats to prosecute the officials who run them?  —  Donald J. Trump's escalating calls to investigate … ",
    "url": "https://www.nytimes.com/2024/09/18/us/politics/donald-trump-2024-election-officials.html"
  },
  {
    "text": "House Republicans reject their own funding bill with a shutdown around the corner  —  A handful of Republicans voted to derail Speaker Johnson's plan linking funding to a Trump-backed voter ID bill.  The government will shut down on Oct. 1 unless Congress acts.",
    "url": "https://www.nbcnews.com/politics/congress/house-republicans-vote-funding-bill-shutdown-trump-save-act-rcna171635"
  },
  {
    "text": "Iranian hackers tried but failed to interest Biden's campaign in stolen Trump info, FBI says  —  Iranian hackers sought to interest President Joe Biden's campaign in information stolen from rival Donald Trump's campaign, sending unsolicited emails to people connected to the Democratic president … ",
    "url": "https://apnews.com/article/iran-fbi-election-interference-dni-ae96f57f438772dac08e076be7aa4904"
  },
  {
    "text": "Nearly 3 in 10 Democrats polled say it ‘would be better if Trump had been killed’  —  A damning new poll revealed Wednesday that nearly one in three Democrats would have preferred to see Kamala Harris' political opponent gunned down in cold blood on Sunday.  —  Scott Rasmussen's RMG Research conducted … ",
    "url": "https://www.theblaze.com/news/nearly-three-in-ten-democrats-polled-say-it-would-be-better-if-trump-had-been-killed"
  },
  {
    "text": "This Is What a Losing Campaign Looks Like  —  How does Donald Trump's running mate have so much time on his hands?  —  A first draft of this story opened: “It's not every day that a candidate for vice president of the United States rage-tweets at you.”  —  Backspace, backspace, backspace.",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/trump-vance-x-campaign-losing/679924/"
  },
  {
    "text": "EPA Scientists Said They Were Pressured to Downplay Harms From Chemicals.  A Watchdog Found They Were Retaliated Against.  —  More than three years ago, a small group of government scientists came forward with disturbing allegations.  —  During President Donald Trump's administration … ",
    "url": "https://www.propublica.org/article/epa-scientists-faced-retaliation-after-finding-harm-from-chemicals"
  },
  {
    "text": "Musk's satellites ‘blocking’ view of the universe  —  Radio waves from Elon Musk's growing network of satellites are blocking scientists' ability to peer into the universe, according to researchers in the Netherlands.  —  The new generation of Starlink satellites, which provide fast internet around … ",
    "url": "https://www.bbc.com/news/articles/cy4dnr8zemgo"
  }
]