[
  {
    "text": "Second federal court rules against Trump's tariffs  —  The decision comes less than 24 hours after another court ruled against the president's use of an emergency law to justify tariffs on dozens of the United States' largest trading partners.  —  A second federal court has ruled … ",
    "url": "https://www.politico.com/news/2025/05/29/second-federal-court-rules-against-trumps-tariffs-00374377"
  },
  {
    "text": "US ruling that Trump tariffs are unlawful stirs relief and uncertainty  —  A U.S. trade court ruling that blocked most of President Donald Trump's tariffs and found he had overstepped his authority triggered some relief on financial markets on Thursday, while adding to the uncertainties weighing on the global economy.",
    "url": "https://www.reuters.com/business/us-ruling-that-trump-tariffs-are-unlawful-stirs-relief-uncertainty-2025-05-29/"
  },
  {
    "text": "Appeals court halts ruling that blocked Trump's tariffs  —  A federal appellate court on Thursday temporarily stayed a ruling that effectively wiped out most of President Trump's tariffs.  —  Why it matters: The intervention will deepen the chaos around the Court of International Trade's Wednesday order … ",
    "url": "https://www.axios.com/2025/05/29/trump-tariffs-court-appeal"
  },
  {
    "text": "Trump tariffs reinstated by appeals court for now … WATCH NOW  —  A federal appeals court on Thursday granted the Trump administration's request to temporarily pause a lower-court ruling that struck down most of President Donald Trump's tariffs.  —  The Trump administration had earlier told … ",
    "url": "https://www.cnbc.com/2025/05/29/blocked-trump-tariffs-trade-court-appeal.html"
  },
  {
    "text": "US court blocks most Trump tariffs, says president exceeded his authority  —  A U.S. trade court blocked most of President Donald Trump's tariffs in a sweeping ruling on Wednesday that found the president overstepped his authority by imposing across-the-board duties on imports from U.S. trading partners.",
    "url": "https://www.reuters.com/world/us/us-court-blocks-trumps-liberation-day-tariffs-2025-05-28/"
  },
  {
    "text": "The MAHA Report Cites Studies That Don't Exist  —  The Trump administration's “Make America Healthy Again” report misinterprets some studies and cites others that don't exist, according to the listed authors.  — Copy  —  Health Secretary Robert F. Kennedy Jr. says his “Make America Healthy Again” … ",
    "url": "https://www.notus.org/health-science/make-america-healthy-again-report-citation-errors"
  },
  {
    "text": "The Trump administration's ‘MAHA Report’ cites nonexistent scientific studies  —  There's new evidence that the White House's “The MAHA Report: Making Our Children Healthy Again” relied in part on scientific research that doesn't exist.  —  After Donald Trump and his White House team unveiled … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-administrations-maha-report-cites-nonexistent-scientific-studies-rcna209732"
  },
  {
    "text": "A Texas Cop Searched License Plate Cameras Nationwide for a Woman Who Got an Abortion  —  Earlier this month authorities in Texas performed a nationwide search of more than 83,000 automatic license plate reader (ALPR) cameras while looking for a woman who they said had a self-administered abortion … ",
    "url": "https://www.404media.co/a-texas-cop-searched-license-plate-cameras-nationwide-for-a-woman-who-got-an-abortion/"
  },
  {
    "text": "Supreme Court limits environmental review of major infrastructure projects  —  The Supreme Court on Thursday limited the scope of environmental reviews of major infrastructure projects in a decision that could speed up approvals of highways, airports and pipelines.",
    "url": "https://cnn.com/2025/05/29/politics/supreme-court-nepa"
  },
  {
    "text": "U.S. Cancels Contract With Moderna to Develop Bird Flu Vaccine  —  Health Secretary Robert F. Kennedy Jr. has repeatedly questioned the safety of mRNA technology, which is used in the company's shot.  —  The Trump administration has delivered its latest blow to vaccines … ",
    "url": "https://www.nytimes.com/2025/05/29/health/us-cancels-contract-with-moderna-to-develop-bird-flu-vaccine.html?unlocked_article_code=1.K08.4ria.2FChRj1hY4wI&smid=url-share"
  },
  {
    "text": "Live Updates: Judge Intends to Block Trump Effort to Stop Harvard From Enrolling Foreign Students  —  Students and faculty waged small acts of protest at Harvard's graduation ceremonies as the university's lawyers temporarily beat back the Trump administration's attacks in court.",
    "url": "https://www.nytimes.com/live/2025/05/29/us/harvard-trump"
  },
  {
    "text": "The Debate Over Transgender Rights Is a Liability for Democrats.  Here's How to Neutralize It.  —  It's time for real discussion, dissent and debate, without fear of being canceled.  —  It will go down as one of the most infamous taglines in modern campaign history: “Kamala is for they/them — President Trump is for you.”",
    "url": "https://www.politico.com/news/magazine/2025/05/29/transgender-politics-democrats-third-way-00372820"
  },
  {
    "text": "China thought it had a truce with the US.  Then Trump dropped two bombshells  —  A one-two punch from the United States risks shattering the already fragile trade war truce between Washington and Beijing, with Chinese tech companies and students both dealt shock blows by the Trump administration Wednesday night.",
    "url": "https://cnn.com/2025/05/29/china/china-us-truce-chips-student-visa-intl-hnk"
  },
  {
    "text": "The Punch That Launched Trump's War on American Universities  —  Threats to withhold billions in federal research funds to punish campuses grew heated after a 2019 altercation left a man with a black eye",
    "url": "https://www.wsj.com/us-news/education/trump-college-university-federal-funding-fight-91c2a274?st=UDKi7K&reflink=article_copyURL_share"
  },
  {
    "text": "A Disillusioned Musk, Distanced From Trump, Says He's Exiting Washington  —  The billionaire has made clear he is frustrated with the obstacles he encountered as he tried to upend the federal bureaucracy.  —  Elon Musk during a cabinet meeting at the White House last month.Eric Lee/The New York Times",
    "url": "https://www.nytimes.com/2025/05/28/us/politics/elon-musk-trump-doge.html?unlocked_article_code=1.K08.4XYc.ogBOdRQcbKSB&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Statement on Chair Powell's meeting with the President  —  For immediate release  —  At the President's invitation, Chair Powell met with the President today at the White House to discuss economic developments including for growth, employment, and inflation.",
    "url": "https://www.federalreserve.gov/newsevents/pressreleases/other20250529a.htm"
  },
  {
    "text": "Trump finds more convicted congressional Republicans to reward with pardons  —  Thanks to the president's latest flurry of pardons, he's now pardoned most of the Republican congressmen convicted of felonies in the 21st century.  —  It's been a challenge keeping up with the flurry … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-finds-convicted-congressional-republicans-reward-pardons-rcna209668"
  },
  {
    "text": "The Totalitarian Logic of Immigration Controls  —  There were many terrible moments in Donald Trump's nakedly fascist 2024 campaign, but I will personally never forget taking the time, in May, to read Radley Balko's extensive discussion of how mass deportation might work in practice.",
    "url": "https://www.liberalcurrents.com/the-totalitarian-logic-of-immigration-controls/"
  },
  {
    "text": "GOP bill would force D.C. to call its Metro the “Trump Train”  —  A House Republican introduced legislation to block federal funding for the Washington, D.C. Metrorail system unless it is renamed the “Trump Train”.  —  Why it matters: The bill is likely a long-shot, but it is the latest … ",
    "url": "https://www.axios.com/2025/05/29/donald-trump-bill-dc-wmata-metro-republican"
  },
  {
    "text": "Photos: NYPD Arrests Protesters Blocking ICE Vans Transporting Detained Immigrants  —  On Wednesday night in Lower Manhattan, the NYPD arrested dozens of protesters who were attempting to block the path of two vans that Immigration and Customs Enforcement agents were using to transport people they had recently detained.",
    "url": "https://hellgatenyc.com/nypd-arrests-protesters-to-help-ice/"
  },
  {
    "text": "Sen. Lindsey Graham gets a 2026 challenge from Democrat Annie Andrews, who ran against Nancy Mace  —  Dr. Annie Andrews, the South Carolina Democrat who unsuccessfully challenged U.S. Rep. Nancy Mace in 2022, says she's running against Republican U.S. Sen. Lindsey Graham in 2026 … ",
    "url": "https://apnews.com/article/lindsey-graham-south-carolina-senate-annie-andrews-26ae12355e9e5d1a44047bcbb6cdc36c"
  },
  {
    "text": "Why the right wants to ban this innovation before you get to try it  —  Conservatives want the government to dictate what you can and cannot eat.  Or so Republican policymaking increasingly suggests.  —  Earlier this month, Montana and Nebraska became the latest US states to ban lab-grown meat … ",
    "url": "https://www.vox.com/future-of-meat/414735/lab-grown-meat-ban-nebraska-montana-republicans"
  },
  {
    "text": "Rep. Steny Hoyer draws a challenger who makes the age argument explicit  —  A 35-year-old volunteer firefighter said longtime incumbent is “still operating in this 1980s information environment.”  —  Rep. Steny Hoyer has drawn a primary challenger with a pointed message about the 85-year-old … ",
    "url": "https://www.politico.com/news/2025/05/29/hoyer-challenger-age-harry-jarin-00373866"
  },
  {
    "text": "Record Party Divide 10 Years After Same-Sex Marriage Ruling  —  Republican support has dropped 14 points since 2022  —  WASHINGTON, D.C. — A decade after the Supreme Court's milestone Obergefell v. Hodges ruling declared same-sex marriage a national right in the U.S., a steady 68% of Americans support it.",
    "url": "https://news.gallup.com/poll/691139/record-party-divide-years-sex-marriage-ruling.aspx"
  },
  {
    "text": "Big Law Firms 3, Trump 0  —  Three judges across the political spectrum have now said the President's punitive executive orders are unconstitutional.  —  Click for Sound  —  President Trump dismisses court rulings against him as judicial overreach, and sometimes he's right.",
    "url": "https://www.wsj.com/opinion/richard-leon-wilmerhale-donald-trump-executive-order-law-firms-perkins-coie-30ad849a"
  },
  {
    "text": "Trump's new ‘gold standard’ rule will destroy American science as we know it  —  The new executive order allows political appointees to undermine research they oppose, paving the way to state-controlled science  —  Science is under siege.  —  On Friday evening, the White House released … ",
    "url": "https://www.theguardian.com/commentisfree/2025/may/29/trump-american-science"
  },
  {
    "text": "Far-right activist with history of anti-gay comments fired from leadership role at Kennedy Center after CNN investigation  —  Floyd Brown, a far-right political activist with a history of anti-gay rhetoric and promoting conspiracy theories about former President Barack Obama … ",
    "url": "https://cnn.com/2025/05/29/politics/floyd-brown-kennedy-center-kfile-dg"
  },
  {
    "text": "Nellie Ohr made false statements to Congress about Trump-Russia investigation, FBI memo shows  —  A newly declassified FBI memo on Wednesday revealed that Nellie Ohr, a researcher for opposition research firm Fusion GPS, gave false testimony to Congress in 2018 about her involvement … ",
    "url": "https://www.washingtonexaminer.com/news/justice/3424416/nellie-ohr-false-statements-congress-trump-russia-investigation/"
  },
  {
    "text": "The US Is Storing Migrant Children's DNA in a Criminal Database  —  Customs and Border Protection has swabbed the DNA of migrant children as young as 4, whose genetic data is uploaded to an FBI-run database that can track them if they commit crimes in the future.",
    "url": "https://www.wired.com/story/cbp-dna-migrant-children-fbi-codis/"
  },
  {
    "text": "Trump 2.0 falls apart before our eyes  —  On Wednesday, Donald Trump went nuts when a reporter asked him about a Wall Street acronym mentioning him and his tariff policy: “TACO” or “Trump always chickens out.”  —  The president had threatened to raise tariffs on European goods last Friday, but later backed off.",
    "url": "https://www.salon.com/2025/05/29/20-falls-apart-before-our-eyes/"
  }
]