[
  {
    "text": "Biden expected to issue executive order targeting Israeli settlers in West Bank  —  The executive order is set to be released later Thursday.  —  President Joe Biden is expected to imminently issue an executive order aimed at punishing Israeli settlers in the West Bank who have been attacking Palestinians … ",
    "url": "https://www.politico.com/news/2024/02/01/biden-executive-order-israel-palestine-00139023"
  },
  {
    "text": "West Bank: Biden to issue executive order over settler violence  —  President Joe Biden on Thursday issued an executive order that targets Israeli settlers in the West Bank who have been accused of attacking Palestinians and Israeli peace activists in the occupied territory … ",
    "url": "https://apnews.com/article/biden-west-bank-israeli-settlers-palestinians-80f9e6be6f6a7bb75dc86360ac2fa6ce"
  },
  {
    "text": "Biden to sign executive order targeting Israeli settlers who attack Palestinians  —  President Biden is expected to sign an executive order on Thursday allowing the U.S. to impose new sanctions on Israeli settlers — and potentially Israeli politicians and government officials … ",
    "url": "https://www.axios.com/2024/02/01/biden-israel-settler-violence-palestinians-executive-order"
  },
  {
    "text": "Oregon high court says 10 GOP state senators who staged long walkout can't run for reelection  —  Last year's boycott lasted six weeks — the longest in state history — and paralyzed the legislative session, stalling hundreds of bills.  —  SALEM, Oregon — The Oregon Supreme Court said Thursday … ",
    "url": "https://www.politico.com/news/2024/02/01/oregon-supreme-court-gop-walkout-00139079"
  },
  {
    "text": "Plans for U.S. strikes on Iranian personnel and facilities in Iraq, Syria approved after Jordan drone attack  —  U.S. officials have confirmed to CBS News that plans have been approved for a series of strikes over a number of days against targets — including Iranian personnel and facilities — inside Iraq and Syria.",
    "url": "https://www.cbsnews.com/news/us-strikes-iran-personnel-facilities-in-iraq-syria-approved-jordan-drone-attack/"
  },
  {
    "text": "Haley Trails in Home State  —  West Long Branch, NJ - Both Nikki Haley and Donald Trump have gained support among South Carolina Republican primary voters since the presidential nomination contest became a two-person race.  However, the state's former governor continues to trail the former president … ",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_sc_020124/"
  },
  {
    "text": "Inside Kevin McCarthy's vengeance operation against the Republicans who fired him  —  Allies of the booted speaker have identified their three biggest targets: Reps. Nancy Mace, Bob Good and Eli Crane.  —  Kevin McCarthy is not done trying to exact revenge on the fellow Republicans who ended his Hill career.",
    "url": "https://www.politico.com/news/2024/02/01/kevin-mccarthy-vengeance-challengers-00138897"
  },
  {
    "text": "The House passed a Child Tax Credit expansion.  It faces a GOP buzzsaw in the Senate.  —  The News  —  The House passed its $78 billion, bipartisan tax bill with a lopsided 357-to-70 vote on Wednesday, in which the measure attracted slightly more Democratic than Republican support … ",
    "url": "https://www.semafor.com/article/01/31/2024/house-passes-tax-bill-senate-opposition"
  },
  {
    "text": "Donald Trump's ‘sex and bribes’ data protection case rejected by UK court  —  Ex-US president took action over allegations he took part in ‘perverted acts’ and bribed Russian officials  —  Donald Trump's data protection claim for damages over allegations in the “Steele dossier” … ",
    "url": "https://www.theguardian.com/us-news/2024/feb/01/donald-trump-sex-bribes-data-protection-claim-rejected-by-uk-court"
  },
  {
    "text": "DeSantis sends National Guard troops to Texas border  —  Florida Gov. Ron DeSantis (R) announced Thursday he will be deploying members of the National Guard to “assist” Texas at the southern border, where Gov. Greg Abbott (R) has declared an invasion amid a surge in migrant border crossings.",
    "url": "https://thehill.com/homenews/state-watch/4442713-desantis-national-guard-troops-texas-border/"
  },
  {
    "text": "Inside Trump's Costly Outburst: ‘Like an 8-Year-Old Having a Temper Tantrum’  —  Roberta Kaplan's strategy delivered E. Jean Carroll $83 million from Donald Trump.  Federal prosecutors may want to take note.  —  Roberta Kaplan knows how to beat Donald Trump in court.  She's already done it twice.",
    "url": "https://www.politico.com/news/magazine/2024/02/01/trump-kaplan-carroll-00138970"
  },
  {
    "text": "Senate sex tape: Capitol Police decline to press charges  —  Incident happened inside Hart Senate Office Building on Dec. 13  —  The U.S. Capitol Police announced Thursday they have declined to press charges following the filming of a “sex video that was recorded inside the Hart Senate Office Building … ",
    "url": "https://www.foxnews.com/politics/senate-sex-tape-capitol-police-decline-press-charges"
  },
  {
    "text": "MAGA World Is About to Meet Taylor Swift's Fandom.  It Won't Go Well.  —  Swift expert Brian Donovan on why the political right is targeting a rich, heteronormative pop star.  —  A lot of Swifties take their cues from Taylor Swift, they listen to her statements about politics and absorb them and act on them.",
    "url": "https://www.politico.com/news/magazine/2024/02/01/the-twisted-logic-of-the-taylor-swift-backlash-it-seems-like-political-suicide-00138924"
  },
  {
    "text": "Bush, Tlaib vote against bill barring Oct. 7 attackers from the U.S.  —  Tlaib said the bill is ‘unnecessary because it is redundant with already existing federal law’  —  Reps. Cori Bush (D-MO) and Rashida Tlaib (D-MI) broke with the rest of the House on Wednesday evening to vote … ",
    "url": "https://jewishinsider.com/2024/01/bush-tlaib-vote-against-bill-barring-oct-7-attackers-from-the-u-s/"
  },
  {
    "text": "One Clue That Kyrsten Sinema Is Retiring: Her Weird Spending  —  Kyrsten Sinema is spending more than $100,000 a month on personal security, barely raising money, and shelling out for first-class plane tickets—after railing against first class. … Once upon a time, Sen. Kyrsten Sinema … ",
    "url": "https://www.thedailybeast.com/one-clue-that-kyrsten-sinema-is-retiring-her-weird-spending"
  },
  {
    "text": "Alabama said he was too dangerous to parole.  He'd been dead for 10 days. … On a spring day last year, the Alabama parole board split over the fate of Fredrick Bishop.  They voted 2-1 to send him back to prison.  But the board members missed a key detail in the case.  —  The man was already dead.",
    "url": "https://www.al.com/news/birmingham/2024/02/alabama-said-he-was-too-dangerous-to-parole-hed-been-dead-for-10-days.html"
  },
  {
    "text": "Former White House lawyer Ty Cobb brands Alina Habba a ‘loser’ after E. Jean Carroll verdict  —  Former Trump White House lawyer Ty Cobb said on Wednesday that former President Trump's attorney, Alina Habba, is a “loser” after last week's outcome of the defamation trial brought by writer E. Jean Carroll.",
    "url": "https://thehill.com/regulation/court-battles/4442240-white-house-ty-cobb-alina-habba-e-jean-carroll-new-york/"
  },
  {
    "text": "Republicans smeared Ilhan Omar over a faulty translation.  Here's what she really said.  —  (L-R) Rep. Rashida Tlaib (D-MI), Rep. Ilhan Omar (D-MN) and Rep. Jamaal Bowman (D-NY) take questions during a news conference about Islamophobia on Capitol Hill on November 30, 2021 in Washington, DC.",
    "url": "https://minnesotareformer.com/2024/02/01/republicans-smeared-ilhan-omar-over-a-faulty-translation-heres-what-she-really-said/"
  },
  {
    "text": "Exclusive: Embattled Georgia prosecutor Willis will not recuse herself from Trump case amid affair allegations, sources say  —  Fulton County District Attorney Fani Willis has no plans to step down from the Georgia election subversion case over allegations she's having an affair with her lead prosecutor … ",
    "url": "https://www.cnn.com/2024/02/01/politics/fani-willis-not-recuse-affair-allegations-trump-election-case-georgia/"
  }
]