[
  {
    "text": "‘Dangerous and un-American’: new recording of JD Vance's dark vision of women and immigration  —  Trump's running mate rants against feminism, immigrants and Ilhan Omar in a newly unearthed podcast from 2021  —  Donald Trump's running mate, JD Vance, said that professional women … ",
    "url": "https://www.theguardian.com/us-news/article/2024/aug/31/jd-vance-podcast-feminism-immigration"
  },
  {
    "text": "JD Vance Rants About ‘Miserable’ Professional Women in Unearthed Clip  —  NOT WEIRD AT ALL  —  The 2021 podcast was produced by right-wing non-profit American Moment, an organizational partner for Project 2025.  —  Journalist  —  JD Vance said professional women choose “a path to misery” … ",
    "url": "https://www.thedailybeast.com/jd-vance-rants-about-miserable-professional-women-in-unearthed-clip"
  },
  {
    "text": "Donald Trump at Moms for Liberty says Ivanka ‘hired millions of people’  —  Republican candidate tells conservative group his daughter should have been UN ambassador and the ‘most brilliant leaders’ come from Scotland like his mother  —  Donald Trump has claimed that when he was president … ",
    "url": "https://www.theguardian.com/us-news/article/2024/aug/31/donald-trump-at-moms-for-liberty-says-ivanka-hired-millions-of-people"
  },
  {
    "text": "Harris jabs Trump over ‘surrendering to his advisors’ in muted mic debate  —  Vice President Harris took another swing at former President Trump Saturday over the back-and-forth around the rules of the upcoming debate, claiming he is “surrendering to his advisors” by supporting muted mics.",
    "url": "https://thehill.com/homenews/campaign/4857311-kamala-harris-jabs-donald-trump-debate-rules/"
  },
  {
    "text": "‘Disrespected sacred ground’: Harris slams Trump over Arlington National Cemetery incident  —  Vice President Kamala Harris weighed in Saturday on the altercation between GOP rival Donald Trump's staff and an official at Arlington National Cemetery, saying Trump “disrespected sacred ground, all for the sake of a political stunt.”",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/31/kamala-harris-trump-arlington/75031802007/"
  },
  {
    "text": "In N.C., some Black voters are uneasy with Harris's abortion rights focus  —  Democrats worry that socially conservative Black voters in the South are wary of Harris's outspoken support for reproductive freedom.  —  CHARLOTTE — Vice President Kamala Harris spent the second anniversary … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/31/harris-abortion-social-conservative-black-voters-south/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI1MDc2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI2NDU5MTk5LCJpYXQiOjE3MjUwNzY4MDAsImp0aSI6IjE0NDQ0ZThmLTA4ZTUtNDQzOS1iYzc1LTVkZGQxMjhhNGE2OSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzMxL2hhcnJpcy1hYm9ydGlvbi1zb2NpYWwtY29uc2VydmF0aXZlLWJsYWNrLXZvdGVycy1zb3V0aC8ifQ.lHEDsiJqZCgqgR4y4Z2M2-I2OAiD0Y4i3qgnz9aJgcY&itid=gfta"
  },
  {
    "text": "'He's on our side': Video shows Trump cheering on supporter who attacked press at PA rally  —  On Friday, a rally former President Donald Trump was hosting in Johnstown, Pennsylvania briefly erupted into chaos when one of his supporters lunged into the press area to attack journalists.",
    "url": "https://www.alternet.org/trump-supporter-attacked-press/"
  },
  {
    "text": "Platforms like Telegram Accused of Facilitating Child Sexual Abuse Can't Invoke Free Speech Protections  —  “POV: It's 2030 in Europe and you're being executed for liking a meme,” Elon Musk dramatically proclaimed on X last Saturday.  The ominous pronouncement came as news broke of the arrest … ",
    "url": "https://www.theunpopulist.net/p/platforms-like-telegram-accused-of"
  },
  {
    "text": "Why Trump's new trading cards are a very bad bet  —  Nobody is going to care or remember these cards in November.  The time to sell is today.  —  Trading cards have had a healthy resurgence in the past five years.  Parents are collecting with their children, card shows are happening all over the country … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/trump-trading-cards-nft-america-first-rcna168999"
  },
  {
    "text": "Winning election wouldn't save Trump from massive fraud, defamation judgments  —  Trump's widespread fraud and repeated defamation may still catch up to him, despite a string of legal breaks  —  A new analysis shows that Donald Trump may still be on the hook for the half a billion dollars … ",
    "url": "https://www.salon.com/2024/08/31/winning-wouldnt-save-from-massive-fraud-defamation-judgments/"
  },
  {
    "text": "Kennedy sues NC elections officials to get name off ballots  —  Robert F. Kennedy Jr. says his We The People Party complied with state law and met the deadline to be removed from ballots.  He claims elections officials knew of his desire to be removed but directed county elections boards to print ballots anyway.",
    "url": "https://www.wral.com/story/kennedy-sues-nc-elections-officials-to-get-name-off-ballots/21603024/"
  },
  {
    "text": "August 30, 2024  —  Trump and the MAGA movement garnered power through performances that projected dominance and cowed media and opponents into silence.  Rather than disqualifying him from the highest office in the United States, Trump's mocking of a disabled reporter, bragging about assaulting women … ",
    "url": "https://heathercoxrichardson.substack.com/p/august-30-2024"
  },
  {
    "text": "A Georgia Democrat seeks to unseat an indicted Trump elector who says he only did what he was told  —  A young Georgia Democrat is raising big money from voters across the country by labeling a suburban Atlanta senate race as a chance to unseat a Republican election denier.",
    "url": "https://apnews.com/article/still-ramaswami-fake-elector-election-georgia-senate-e0581cbd876638ffcda06e7b3a052dae"
  },
  {
    "text": "Police: Man injured 2 Jewish Pitt students with glass bottle near Cathedral of Learning  —  A man attacked two Jewish University of Pittsburgh students with a glass bottle as they walked through campus Friday evening near the Cathedral of Learning, according to authorities.",
    "url": "https://www.post-gazette.com/local/city/2024/08/31/jewish-students-attacked-near-cathedral-of-learning/stories/202408310057"
  }
]