[
  {
    "text": "Statement from President Joe Biden on Bipartisan Senate National Security Agreement  —  For too long, going back decades, the immigration system has been broken.  It's time to fix it.  That's why over two months ago I instructed members of my administration to work with a bipartisan group of Senators to … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/02/04/statement-from-president-joe-biden-on-bipartisan-senate-national-security-agreement/"
  },
  {
    "text": "Senators unveil bipartisan bill to impose tougher asylum and border laws  —  The deal is the result of months of negotiations between Senate Republicans and Democrats, as well as the Biden administration.  It's not clear it will pass Congress.  —  WASHINGTON — Senators released … ",
    "url": "https://www.nbcnews.com/politics/congress/new-immigration-asylum-reform-bill-released-senate-text-rcna136602"
  },
  {
    "text": "House Republicans Impeach Alejandro Mayorkas at Their Peril  —  Just when you thought House Republicans couldn't warp the impeachment process any more, here we are, watching them twist and stretch this weighty constitutional provision beyond all recognition — like some grimy wad of Silly Putty pulled … ",
    "url": "https://www.nytimes.com/2024/02/05/opinion/house-impeachment-mayorkas.html"
  },
  {
    "text": "Senate releases new $118 billion package for Ukraine, Israel, border  —  The Senate appropriations committee released on Sunday the text of their sweeping $118.3 billion emergency spending package, which combines foreign aid with restrictive policy changes for the U.S.-Mexico border.",
    "url": "https://www.axios.com/2024/02/05/senate-border-deal-final-text-ukraine-israel-taiwan"
  },
  {
    "text": "Trump floats ousting RNC chair after brutal 2023  —  Former President Trump, in a stunning public rebuke of a longtime ally, suggested on Fox News today that Republican National Committee chair Ronna McDaniel should get the boot. … Trump's comments are a sign of him flexing muscle … ",
    "url": "https://www.axios.com/2024/02/04/rnc-trump-2024-biden-dnc-fundraising"
  },
  {
    "text": "Trump suggests Ronna McDaniel may be removed as RNC chairwoman  —  Former President Donald Trump said there will “probably be some changes made” regarding the Republican National Committee and its chairwoman, Ronna McDaniel.  —  Speaking on Fox News's Sunday Morning Futures … ",
    "url": "https://www.washingtonexaminer.com/news/2836374/trump-suggests-ronna-mcdaniel-may-be-removed-as-rnc-chairwoman/"
  },
  {
    "text": "Scoop: Obama veterans relaunch national security group backing Biden  —  Veterans of the Obama administration are re-launching an advocacy group, National Security Action, to make the case for President Biden's re-election based on his foreign policy, according to a memo obtained by Axios.",
    "url": "https://www.axios.com/2024/02/05/obama-veterans-national-security-group-backing-biden-relaunch"
  },
  {
    "text": "When the tech bros come for me  —  First, the tech bros came for the warehouse workers, and I said nothing.  Paying them terrible wages, working them to the bone, tracking their every second, injuring them at record levels, all in the pursuit of customer obsession and profit.",
    "url": "https://gerrymcgovern.com/when-the-tech-bros-come-for-me/"
  },
  {
    "text": "The 91-year-old Republican suing to kick Donald Trump off the ballot  —  Norma Anderson, a trailblazing former GOP legislator, is among the Colorado voters who have challenged the Republican front-runner's candidacy in a case that will be heard by the Supreme Court",
    "url": "https://www.washingtonpost.com/politics/2024/02/05/trump-supreme-court-ballot-norma-anderson/"
  },
  {
    "text": "How Donald Trump reduced the GOP to groveling sycophants  —  The GOP made the same bargain the Prussian generals made in 1933 — and the consequence is their total destruction … It was said that Prussia, the nucleus of the German state, was not a country with an army but an army with a country.",
    "url": "https://www.salon.com/2024/02/04/how-donald-reduced-the-to-groveling-sycophants/"
  },
  {
    "text": "George Stephanopoulos Cuts Off GOP Senator After He Suggests Trump Could Defy SCOTUS  —  Senator, thanks for your time this morning,\" George Stephanopoulos said before Sen. Vance's mic was cut off.  —  ABC News anchor George Stephanopoulos would not tolerate another word from Sen. J.D. Vance … ",
    "url": "https://www.thedailybeast.com/george-stephanopoulos-cuts-off-jd-vance-after-he-suggests-trump-could-defy-scotus"
  },
  {
    "text": "A Major Sign of Trouble in Nancy Mace's Office: Total Staff Turnover  —  Nancy Mace's entire D.C. office has turned over since Nov. 1.  Former staff members described a “toxic” work culture driven by a “delusional” boss. … Add another ignoble credential to Rep. Nancy Mace's résumé.",
    "url": "https://www.thedailybeast.com/a-major-sign-of-trouble-in-nancy-maces-office-total-staff-turnover"
  },
  {
    "text": "Publix versus the public  —  Elected officials should not do the bidding of corporate donors; they should act in the best interests of their constituents.  It is often difficult, however, to prove a politician's motivation.  A politician can generally claim that an act or omission that benefits … ",
    "url": "https://popular.info/p/publix-versus-the-public"
  },
  {
    "text": "McCarthy wanted a successor.  He got a fight.  —  In red California, the race to replace the former speaker could be a microcosm of forces shaping the Republican Party.  —  Kevin McCarthy couldn't bend unruly Republican lawmakers to his will in Washington.  Back home in Bakersfield, Republican voters may reject his succession plan.",
    "url": "https://www.politico.com/news/2024/02/05/mccarthy-ouster-succession-fight-00139440"
  },
  {
    "text": "Tucker Carlson Being Spotted in Moscow Sparks Frenzied Speculation  —  The reported appearance of former Fox News host Tucker Carlson in the Russian capital has sparked intense speculation over the purpose of the conservative media personality's visit to Moscow.",
    "url": "https://www.newsweek.com/tucker-carlson-moscow-russia-vladimir-putin-1866669"
  }
]