[
  {
    "text": "Trump stuns donors with behind-closed-doors rant about bombing Russia and China: report  —  Former President Donald Trump told a recent group of donors at a fundraising event that he would have bombed Russia and China in response to their aggression against U.S. allies, reportedThe Washington Post on Tuesday.",
    "url": "https://www.rawstory.com/trump-donors-2668393354/"
  },
  {
    "text": "Dems in full-blown ‘freakout’ over Biden  —  One adviser to major Democratic donors keeps a running list of reasons Biden could lose.  —  A pervasive sense of fear has settled in at the highest levels of the Democratic Party over President Joe Biden's reelection prospects … ",
    "url": "https://www.politico.com/news/2024/05/28/democrats-freakout-over-biden-00160047"
  },
  {
    "text": "Trump makes sweeping promises to donors on audacious fundraising tour  —  By tying donation requests to pledges of tax cuts and other policies, Trump is testing the boundaries of federal campaign finance laws.  —  When Donald Trump met some of the country's top donors at a luxurious … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/28/trump-wealthy-donors-fundraising/"
  },
  {
    "text": "“Full panic mode”: Experts say Trump mad he's “finally being treated like any other defendant”  —  Trump on Truth Social complained that the rules in his trial are the same as “virtually every criminal court”  —  Donald Trump is not behaving like someone who expects to be found “not guilty.”",
    "url": "https://www.salon.com/2024/05/28/full-panic-mode-experts-say-mad-hes-finally-being-treated-like-any-other-defendant/"
  },
  {
    "text": "Live Updates: Defense Urges Jurors Not to Believe ‘Lies’ in Trump's Criminal Trial  —  Closing arguments have begun in the trial of Donald J. Trump, who faces 34 felony counts in connection with a hush-money payment to a porn star before the 2016 election.  The jury could have the case by Wednesday.",
    "url": "https://www.nytimes.com/live/2024/05/28/nyregion/trump-trial-closing-arguments"
  },
  {
    "text": "Republican member of Fulton elections board won't certify primary results  —  Her lawsuit seeks detailed voting data and a ruling that her duties are discretionary  —  A Republican member of the Fulton County elections board refuses to certify primary election results unless given access … ",
    "url": "https://www.ajc.com/news/atlanta-news/republican-member-of-fulton-elections-board-wont-certify-primary-results/IDYT7CZVMZAJXHDAADS7G6JNT4/"
  },
  {
    "text": "The Alitos, the Neighborhood Clash and the Upside-Down Flag  —  Inside the escalating conflict on a bucolic suburban street that Justice Alito said prompted a “Stop the Steal” symbol at his home.  —  The police in Fairfax County, Va., received an unusual phone call on Feb. 15, 2021.",
    "url": "https://www.nytimes.com/2024/05/28/us/justice-alito-neighbors-stop-steal-flag.html"
  },
  {
    "text": "FBI arrests ‘dreaded’ Jan. 6 defendant they say rammed ‘Trump’ sign into police line  —  William George Knight shoved an officer during the Capitol attack, the FBI said, after “ramming” a giant metal-framed “TRUMP” sign into police officers at the Capitol.  —  WASHINGTON — A Jan. 6 participant … ",
    "url": "https://www.nbcnews.com/politics/justice-department/fbi-arrests-dreaded-jan-6-defendant-say-rammed-trump-sign-police-line-rcna154374"
  },
  {
    "text": "DNC to nominate Biden and Harris to bypass Ohio ballot issues  —  The move came before the Ohio Senate addressed Biden appearing on the ballot.  —  This is a breaking news story please check back for updates.  —  The Democratic National Committee will move to conduct virtual party proceedings … ",
    "url": "https://abcnews.go.com/Politics/dnc-virtually-nominate-biden-ahead-convention-amid-ballot/story?id=110617732"
  },
  {
    "text": "U.S. Coast Guard: Man Dies After Jumping Off World's Largest Cruise Ship  —  Authorities said a passenger died after allegedly leaping from the world's largest cruise ship on Sunday during a journey from Florida to Honduras.  —  The vessel the man went overboard from was identified … ",
    "url": "https://www.breitbart.com/local/2024/05/28/u-s-coast-guard-man-dies-jumping-off-worlds-largest-cruise-ship/"
  },
  {
    "text": "‘You are gangsters’: Robert De Niro clashes with pro-Trump protesters  —  After a press conference outside the Manhattan courtroom where Trump is on trial, De Niro mixed it up with a crowd of protesters who called him a “little punk” whose “movies suck.”  —  NEW YORK — President Joe Biden's … ",
    "url": "https://www.nbcnews.com/politics/2024-election/robert-de-niro-clashes-trump-protesters-gangsters-rcna154316"
  },
  {
    "text": "US pier constructed off Gaza has broken apart  —  The temporary pier constructed by the US military to transport aid into Gaza broke apart and sustained damage in heavy seas on Tuesday in a major blow to the American-led effort to create a maritime corridor for humanitarian supplies into the war-torn enclave, the Pentagon said.",
    "url": "https://www.cnn.com/2024/05/28/politics/us-gaza-pier-broken-apart/"
  },
  {
    "text": "Appeals court upholds retired NYPD officer's 10-year prison sentence for Capitol riot attack  —  A federal appeals court on Tuesday upheld a retired New York Police Department officer's conviction and 10-year prison sentence for assaulting a police officer during the Jan. 6, 2021, siege at the U.S. Capitol.",
    "url": "https://apnews.com/article/thomas-webster-new-york-police-officer-capitol-riot-aa0448b1995618059b299c27be519457"
  },
  {
    "text": "The media and sullen nonvoters should listen to Ken Burns  —  The historian knows something about civil war — and moral responsibility in politics.  —  A skilled graduation speaker who poetically delivers life lessons and imparts insightful advice can leave me teary-eyed.",
    "url": "https://www.washingtonpost.com/opinions/2024/05/28/ken-burns-graduation-election-trump/"
  },
  {
    "text": "Nikki Haley Writes ‘Finish Them!’ on Israeli Bomb After Refugee Massacre  —  The former UN Ambassador and failed presidential candidate toured areas ravaged byHamas' Oct. 7 attack  —  DAYS AFTER DOZENS of Palestinians were killed by Israeli air strikes against displacement camps in Southern Gaza … ",
    "url": "https://www.rollingstone.com/politics/politics-news/nikki-haley-finish-them-bomb-israel-gaza-1235028702/"
  },
  {
    "text": "The slaughter in Rafah and Israel's moral nadir  —  Israel is massacring Palestinians — and undermining its own security in the process. … The carnage was horrific even by the bloody standards set by Israel's war: An emergency doctor on the ground told NPR that it was … ",
    "url": "https://www.vox.com/world-politics/351968/the-slaughter-in-rafah-and-israels-moral-nadir"
  },
  {
    "text": "The Texas GOP takes the party's hostility to democracy to a new level  —  Who says people should matter more than land area?  —  One of the more remarkable responses to Donald Trump's loss in the 2020 presidential election has been the vilification not of voter fraud but, instead, of voting.",
    "url": "https://www.washingtonpost.com/politics/2024/05/28/texas-republican-party-democracy/"
  },
  {
    "text": "Marco Rubio Wants to Be Trump's Vice President.  He Doesn't Want to Audition.  —  The last time the Florida senator lived in Donald J. Trump's orbit he was mocked and defeated.  As he returns, he's trying to do it on his terms.  —  Senator Marco Rubio, the Republican of Florida … ",
    "url": "https://www.nytimes.com/2024/05/28/us/politics/marco-rubio-trump-vp.html"
  },
  {
    "text": "Former Marco Rubio Intern Indicted for Storming Capitol on January 6  —  The former FIU student was seen entering the Capitol during the insurrection alongside members of the far-right Proud Boys. … A former Florida International University student and Miami GOP strategist has been indicted … ",
    "url": "https://www.miaminewtimes.com/news/ex-marco-rubio-intern-indicted-for-january-6-capitol-attack-20022168"
  },
  {
    "text": "‘Unacceptable’: Illegal immigrant wanted for murder has ‘extensive’ criminal past  —  The suspect tried to claim asylum in Canada but was turned back to the US and released  —  An illegal immigrant wanted for the murder of a woman in West Virginia has an “extensive” criminal history in his home country of El Salvador.",
    "url": "https://www.foxnews.com/politics/unacceptable-illegal-immigrant-wanted-murder-has-extensive-criminal-past"
  }
]