[
  {
    "text": "US Army rebukes Trump campaign for incident at Arlington National Cemetery  —  The US Army issued a stark rebuke of former President Donald Trump's presidential campaign over the incident on Monday at Arlington National Cemetery, saying in a statement on Thursday that participants in the ceremony … ",
    "url": "https://www.cnn.com/2024/08/29/politics/us-army-rebukes-trump-campaign-arlington-incident/"
  },
  {
    "text": "Army blasts Trump trip to Arlington cemetery for violating decorum  —  Army officials criticized former President Donald Trump's campaign staff for violating decorum rules at Arlington National Cemetery and abusing a cemetery worker earlier this week, but no further actions will be pursued … ",
    "url": "https://www.militarytimes.com/news/pentagon-congress/2024/08/29/army-blasts-trump-trip-to-arlington-cemetery-for-violating-decorum/"
  },
  {
    "text": "For Trump, Arlington National Cemetery controversy goes from bad to worse  —  Republicans might've hoped Donald Trump's Arlington National Cemetery scandal would be a one-day story.  I have some bad news for them.  —  As the week got underway, Donald Trump probably thought going to Arlington National Cemetery would be a good idea.",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-arlington-cemetery-controversy-goes-bad-worse-rcna168747"
  },
  {
    "text": "Army says Arlington National Cemetery worker was ‘pushed aside’ by Trump aides  —  The U.S. Army said an employee at Arlington National Cemetery who tried to “ensure adherence” to rules that prohibit political activities at the cemetery “was abruptly pushed aside,” but that the employee decided … ",
    "url": "https://www.npr.org/2024/08/29/nx-s1-5092087/trump-arlington-cemetery-altercation-video"
  },
  {
    "text": "X flags NPR story on Trump, Arlington as unsafe  —  The social platform X flagged a story from NPR that outlined the fallout of a reported clash between Trump campaign staffers and Arlington National Cemetery officials earlier this week as potentially “unsafe.”",
    "url": "https://thehill.com/homenews/media/4853870-donald-trump-npr-x-post-flagged-unsafe-arlington-cemetery-clash/"
  },
  {
    "text": "JD Vance Won't Apologize For Telling Kamala Harris To ‘Go To Hell’  —  He claimed his callous comment was just “a colloquial phrase.”  —  LOADING  —  Republican vice presidential candidate JD Vance isn't sorry he said Vice President Kamala Harris “can go to hell.”",
    "url": "https://www.huffpost.com/entry/jd-vance-wont-apologize-for-telling-kamala-harris-to-go-to-hell_n_66d0d5f1e4b02e951606494b"
  },
  {
    "text": "Harris explains in exclusive CNN interview why she's shifted her position on key issues since her first run for president  —  Note: The full interview will at 9 p.m. ET Thursday on CNN's “The First Interview: Harris & Walz, A CNN Exclusive”  —  Vice President Kamala Harris on Thursday offered … ",
    "url": "https://www.cnn.com/2024/08/29/politics/kamala-harris-tim-walz-cnntv/"
  },
  {
    "text": "Kamala Harris Has Snappy Answer To CNN's Trump-Inspired Question  —  The vice president refused to play when Dana Bash asked her about the former president's accusation she had altered her racial identity.  —  LOADING  —  Kamala Harris may have sat down with CNN's Dana Bash … ",
    "url": "https://www.huffpost.com/entry/kamala-harris-trump-question-dana-bash-cnn_n_66d0f52ee4b0b422df2230e1"
  },
  {
    "text": "Harris' CNN interview is the latest highly anticipated twist in wild presidential race  —  Vice President Kamala Harris faces the next test in her presidential bid on Thursday with her first unscripted interview with a major media outlet since becoming the Democratic nominee.",
    "url": "https://www.cnn.com/2024/08/29/politics/kamala-harris-cnn-interview-analysis/"
  },
  {
    "text": "Trump says he wants to make IVF treatments paid for by government or insurance companies if elected  —  In an interview with NBC News, the former president defended himself over abortion rights and said either the government or insurance companies will pay for IVF if he's elected.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-says-wants-make-ivf-treatments-paid-government-insurance-compani-rcna168804"
  },
  {
    "text": "The Left Is Going to Freak Out Over Nate Silver's Latest Election Model  —  Did you hear that scream?  Liberals far and wide are no doubt freaking out right now because the election they thought they had in the bag after the Democratic Party crowned Kamala Harris as its nominee … ",
    "url": "https://pjmedia.com/matt-margolis/2024/08/29/the-left-is-going-to-freak-out-about-nate-silvers-latest-election-model-n4932093"
  },
  {
    "text": "Pennsylvania may be a problem for Harris  —  The Electoral College/popular vote gap is increasing in post-DNC data. … I'm going to keep this brief, both because I'm jetlagged in two different directions  —  1 and because the model is really hungry for post-DNC/post-RFK-dropout data … ",
    "url": "https://www.natesilver.net/p/pennsylvania-may-be-a-problem-for"
  },
  {
    "text": "Musk ramps up attacks on Brazil's top judge as X faces possible suspension, Starlink finances frozen … Tesla, SpaceX and X Corp. leader Elon Musk ramped up his online attacks on Brazilian Supreme Court justice Alexandre de Moraes on Thursday, amid an intensifying political and legal battle between … ",
    "url": "https://www.cnbc.com/2024/08/29/elon-musk-brazil-judge-x-ban-starlink-freeze.html"
  },
  {
    "text": "We can now watch Grace Hopper's famed 1982 lecture on YouTube  —  The lecture featured Hopper discussing future challenges of protecting information.  —  The late Rear Admiral Grace Hopper was a gifted mathematician and undisputed pioneer in computer programming, honored posthumously in 2016 with the Presidential Medal of Freedom.",
    "url": "https://arstechnica.com/science/2024/08/we-can-now-watch-grace-hoppers-famed-1982-lecture-on-youtube/"
  },
  {
    "text": "Wes Moore and the Bronze Star He Claimed but Never Received  —  For years, the Maryland governor has faced questions about whether he had wrongfully said he had a Bronze Star.  He insisted no. But an old document proves otherwise.  —  When Wes Moore ran for governor of Maryland in 2022 … ",
    "url": "https://www.nytimes.com/2024/08/29/us/politics/wes-moore-bronze-star.html?unlocked_article_code=1.Gk4.-pH5.Dvt8Qh6lVO08&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb&ngrp=mxn"
  },
  {
    "text": "Harris Edges Trump in Key States, With Sun Belt Now Up for Grabs  —  The honeymoon for the new Democratic nominee is far from over, as she narrows or reverses Trump's advantages on key economic issues.  —  Kamala Harris has sustained the burst of momentum she brought to the presidential contest … ",
    "url": "https://www.bloomberg.com/news/articles/2024-08-29/election-2024-poll-harris-leads-or-ties-with-trump-in-swing-states"
  },
  {
    "text": "What really happened to JD Vance in Erie  —  ERIE, Pennsylvania — The chaser Wednesday in Sen. J.D. Vance's (R-OH) trip to this all-important county in the northwestern corner of Pennsylvania came when the Republican vice presidential nominee said Democratic presidential nominee Kamala Harris can … ",
    "url": "https://www.washingtonexaminer.com/opinion/columnists/3138057/what-really-happened-vance-erie/"
  },
  {
    "text": "Jack White rips Trump campaign for posting band's song: 'Don't even think about using my music you fascists'  —  Jack White is blasting former President Trump's campaign and threatening a lawsuit after an aide to the former president posted a clip that featured a song by The White Stripes.",
    "url": "https://thehill.com/homenews/4854535-jack-white-trump-campaign-white-stripes-song/"
  },
  {
    "text": "2024 Race: Harris And Trump Neck And Neck As RFK Jr. Exits Presidential Race, Quinnipiac University National Poll Finds; Nearly 7 In 10 Think America's Best Days Are Yet To Come  —  mail_outline  —  Fresh off the Democratic National Convention and heading into the final months of the presidential race … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3903"
  },
  {
    "text": "Harris camp hires activist reverend who claims Christianity has been ‘hijacked’ by White supremacy  —  In 2022, Butler said Christians are called to ‘resist’ and must ‘reclaim our faith for justice’  —  The Harris-Walz campaign has hired liberal activist the Rev. Jennifer Butler to be its new head … ",
    "url": "https://www.foxnews.com/politics/harris-camp-hires-activist-reverend-who-claims-christianity-has-been-hijacked-by-white-supremacy"
  },
  {
    "text": "Decision on Georgia election board threatens Kemp's détente with Trump  —  The governor must decide whether to seek the removal of board members who have been praised by the former president for changing election rules with months to go before the vote.",
    "url": "https://www.washingtonpost.com/politics/2024/08/29/trump-kemp-georgia-election-board/"
  }
]