[
  {
    "text": "Jordan expands probe into Smith's handling of Trump cases  —  House Judiciary Chair Jim Jordan (R-Ohio) expanded his probe into special counsel Jack Smith, asking him to turn over all documents and records related to his prosecutions of former President Trump.",
    "url": "https://thehill.com/homenews/house/4371789-jim-jordan-jack-smith-probe-trump-cases/"
  },
  {
    "text": "Supreme Court showdown with Trump  —  The Supreme Court is stuck with Donald Trump, whether the justices like it or not. … - Almost no one in politics has managed to escape that maelstrom undamaged, and that's bad news for the court at a time when its seams are more visible than they've been in decades … ",
    "url": "https://www.axios.com/2023/12/21/supreme-court-trump-colorado-jan-6"
  },
  {
    "text": "The Colorado Ruling Calls the Originalists' Bluff  —  The disqualification of Donald Trump challenges the Supreme Court's conservatives to follow through on their stated beliefs.  —  The Colorado Supreme Court has left the justices of the United States Supreme Court in the very uncomfortable position … ",
    "url": "https://www.theatlantic.com/ideas/archive/2023/12/colorado-supreme-court-trump-originalism/676909/"
  },
  {
    "text": "How Rep. Jamie Raskin sees the Colorado Supreme Court ruling  —  Good morning, Early Birds.  Winter is no longer coming — it's here.  Today is the shortest day of the year.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2023/12/21/how-rep-jamie-raskin-sees-colorado-supreme-court-ruling/"
  },
  {
    "text": "Former Trump lawyer Rudy Giuliani files for bankruptcy protection, lists more than $100 million in debts  — Rudy Giuliani filed for Chapter 11 bankruptcy protection in New York.  — The former New York City mayor listed debts that include a recent nearly $150 million civil judgment … ",
    "url": "https://www.cnbc.com/2023/12/21/former-trump-lawyer-rudy-giuliani-files-for-bankruptcy-protection.html"
  },
  {
    "text": "Rudy Giuliani files for Chapter 11 bankruptcy in New York after defamation case  —  Rudy Giuliani has filed for chapter 11 bankruptcy in New York, one day after a federal judge ruled that he must immediately pay the $148 million he owes two Georgia women he falsely accused of helping to steal the 2020 election.",
    "url": "https://www.washingtonpost.com/national-security/2023/12/21/rudy-giuliani-bankruptcy/"
  },
  {
    "text": "Putin 'has Trump's number' and still sees him ‘as an asset’, says Fiona Hill  —  Former White House Russia expert argues in a podcast why Moscow is eager for the ex-president to return  —  Vladimir Putin has had Donald Trump's “number for some time ... knows how to manipulate him” … ",
    "url": "https://www.theguardian.com/us-news/2023/dec/20/donald-trump-vladimir-putin-us-elections-2024-moscow"
  },
  {
    "text": "It's not just Trump: How racism shadows the GOP campaign  —  Donald Trump is getting headlines for saying immigrants are “poisoning the blood of our country.”  But for months the GOP race for president has been shadowed by xenophobia, as some candidates or those backing them have embraced racist and white nationalist themes.",
    "url": "https://www.axios.com/2023/12/21/trump-racism-gop-campaign-2024"
  },
  {
    "text": "Fetterman, Breaking With the Left on Israel, Rejects ‘Progressive’ Label  —  The Pennsylvania senator, who has angered liberal Democrats with his staunchly pro-Israel stance and position on immigration, assailed the left and said he no longer considers himself a progressive.",
    "url": "https://www.nytimes.com/2023/12/21/us/politics/john-fetterman-progressive-israel.html"
  },
  {
    "text": "The English-Muffin Problem  —  A simple explanation for economic discontent  —  The economy is hot, but the people are bothered.  Americans think the country is in dreadful economic shape despite strong wage growth, low unemployment, and steadily declining inflation.  We know this from survey after survey.",
    "url": "https://www.theatlantic.com/ideas/archive/2023/12/inflation-food-prices-democrat-biden/676901/"
  },
  {
    "text": "U.S. House quietly investigated separate sex tape scandal  —  The Scoop  —  The high-profile Senate sex scandal that rocked Washington, D.C. this month, was, in fact, the time in less thantwo years that sexually explicit videos filmed in the U.S. Capitol prompted an investigation.",
    "url": "https://www.semafor.com/article/12/20/2023/us-house-quietly-investigated-separate-sex-tape-scandal"
  },
  {
    "text": "Scoop: Mike Johnson urges Biden to unleash executive actions on border security … - Johnson argued Biden should reimplement Trump administration policies such as resuming construction of the border wall and ending the use of parole programs that release people who've crossed the border.",
    "url": "https://www.axios.com/2023/12/21/mike-johnson-biden-executive-action-border-security"
  },
  {
    "text": "The NRA Is at Rock Bottom—And 15 Years of Tax Filings Tell the Story  —  Years of NRA tax returns obtained by The Daily Beast show that the gun group's revenue has been falling for years.  And last year was the NRA's weakest fundraising year since 2008. … Pay Dirt is a weekly foray into the pigpen of political funding.",
    "url": "https://www.thedailybeast.com/the-nra-is-at-rock-bottomand-15-years-of-tax-filings-tell-the-story"
  },
  {
    "text": "Over 570K people in Gaza starving due to war fallout: UN report  —  At least five people were killed and dozens injured in a strike that hit three residential homes and a mosque in Gaza's southern city of Rafah on Wednesday.  (20 December).  —  Photos  —  More than half a million people in Gaza … ",
    "url": "https://apnews.com/article/israel-hamas-war-news-12-21-2023-7d9718b32bf0d308c44c7c9e3c4e0deb"
  },
  {
    "text": "Schiff riding high amidst scramble for 2nd place in CA Senate race  —  Morning Consult poll reveals Rep. Adam Schiff as a clear leader in the race with Republican Steve Garvey and Democratic Reps. Katie Porter and Barbara Lee tied for second place.  —  LOS ANGELES — Rep. Adam Schiff holds … ",
    "url": "https://www.politico.com/news/2023/12/21/schiff-california-senate-00132816"
  },
  {
    "text": "Federal judge blocks California law that would have banned carrying firearms in most public places  —  A federal judge on Wednesday temporarily blocked a California law that would have banned carrying firearms in most public places, ruling that it violates the Second Amendment of the U.S. Constitution … ",
    "url": "https://apnews.com/article/california-gun-laws-concealed-carry-c7ebb8506ed99f41b59455350647c0b6"
  }
]