[
  {
    "text": "Trump wants his daughter-in-law in the Senate.  DeSantis may defy him.  —  Lara Trump's interest in replacing Sen. Marco Rubio (R-Florida), Donald Trump's pick for secretary of state, complicates an already fraught relationship between Trump and the state's Republican governor.",
    "url": "https://www.washingtonpost.com/politics/2024/12/14/lara-trump-senate-desantis-rubio-seat/"
  },
  {
    "text": "How GOP Senators Are Secretly Getting Ready to Surrender to Trump … It's largely passing unnoticed, but Republicans are quietly laying the groundwork to give their full blessing to one of Donald Trump's more corrupt schemes: Unleashing law enforcement on his political enemies without cause once he's sworn in again next year.",
    "url": "https://newrepublic.com/article/189406/gop-patel-fbi-weaponize-trump"
  },
  {
    "text": "South Korean president Yoon Suk Yeol impeached after martial law ploy  —  Yoon must immediately hand over power to the prime minister, who will act as caretaker while the courts review the impeachment vote.  The process could take months.  —  SEOUL — The South Korean National Assembly voted Saturday … ",
    "url": "https://www.washingtonpost.com/world/2024/12/14/south-korea-yoon-impeachment-vote/"
  },
  {
    "text": "Apple CEO visits Mar-a-Lago, joining list of tech execs seemingly courting Trump  —  Apple CEO Tim Cook visited Mar-a-Lago on Friday, joining a growing list of tech executives that are seemingly courting President-elect Trump ahead of his return to the White House.",
    "url": "https://thehill.com/policy/technology/5040426-apple-tim-cook-donald-trump-visit/"
  },
  {
    "text": "In Display of Fealty, Tech Industry Curries Favor With Trump  —  It was a week of frenzied activity, as Silicon Valley billionaires and their companies brandished checks and compliments for the President-elect.  —  The $1 million donations came gradually — and then all at once.  —  Meta.  Amazon.",
    "url": "https://www.nytimes.com/2024/12/14/technology/trump-tech-amazon-meta-openai.html?unlocked_article_code=1.hU4.29gd.MUs5Bt6IFE5l&smid=url-share"
  },
  {
    "text": "Trump brings political drama to Army-Navy game sidelines  —  Defense Secretary nominee Pete Hegseth and Marine veteran Daniel Penny are attending the game with President-elect Trump and Vice President-elect JD Vance  —  President-elect Trump and Vice President-elect JD Vance will attend … ",
    "url": "https://www.foxnews.com/politics/trump-brings-political-drama-army-navy-game-sidelines"
  },
  {
    "text": "Inside Democrats' emerging Trump inauguration boycott … - For many Democrats, the scars of the Jan. 6, 2021, attack on the Capitol remain fresh in the mind, marking Trump as a threat to democracy.  — “For somebody who he said he's going to lock me up, I don't see the excitement … ",
    "url": "https://www.axios.com/2024/12/14/democrats-boycott-attending-trump-inauguration"
  },
  {
    "text": "McConnell Defends Polio Vaccine, an Apparent Warning to Kennedy  —  “Efforts to undermine public confidence in proven cures are not just uninformed — they're dangerous,” said the former Republican leader, who is a polio survivor.  —  Senator Mitch McConnell, the former Republican leader … ",
    "url": "https://www.nytimes.com/2024/12/13/us/politics/mcconnell-polio-vaccine-rfk-jr.html?unlocked_article_code=1.hU4.LTJL.KTBX1EbeSUzA&smid=url-share"
  },
  {
    "text": "Pelosi underwent hip surgery after ‘hard fall’ in Luxembourg  —  The former speaker had surgery after she was hospitalized after a fall during a congressional visit to Luxembourg marking the 80th anniversary of the Battle of the Bulge.  —  Former House speaker Nancy Pelosi (D-California) … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/14/nancy-pelosi-hip-surgery/"
  },
  {
    "text": "Trump's Transition Business Largely Happens After Night Falls  —  At his Mar-a-Lago club in Florida, the president-elect has been hosting diplomatic dinners, announcing cabinet picks and firing off texts to his aides — all after the sun goes down.  —  It was past midnight in Florida this week … ",
    "url": "https://www.nytimes.com/2024/12/14/us/politics/trump-diplomacy-night-mar-a-lago.html"
  },
  {
    "text": "Obesity rate among US adults fell in 2023 for first time in over a decade: Study  —  The obesity rate among U.S. adults fell in 2023 for the first time in over a decade, according to a new study released on Friday.  —  The study published in the journal JAMA Health Forum found that obesity nationwide … ",
    "url": "https://thehill.com/policy/healthcare/5040586-obesity-rate-dip-study/"
  },
  {
    "text": "Attorney General Ken Paxton Sues Activist New York Doctor for Illegally Providing Abortion Drugs Across State Lines  —  Attorney General Ken Paxton sued a New York doctor for unlawfully providing abortion-inducing drugs to Texas residents in direct violation of state law.",
    "url": "https://www.texasattorneygeneral.gov/news/releases/attorney-general-ken-paxton-sues-activist-new-york-doctor-illegally-providing-abortion-drugs-across"
  },
  {
    "text": "Georgia lawmakers elect Western critic as new president  —  Georgian lawmakers elected Mikheil Kavelashvili, a hardline critic of the West, as president on Saturday, setting him up to replace a pro-Western incumbent amid major protests against the government over a halt to the country's European Union accession talks last month.",
    "url": "https://www.reuters.com/world/europe/lawmakers-georgia-elect-hardline-critic-west-new-president-2024-12-14/"
  },
  {
    "text": "A New Risk for Employers: Losing Millions of Migrants With Temporary Work Permits  —  Trump promised to eliminate programs that provide temporary work permits, including to Dreamers  —  Nate Koetje, chief executive of an electrical contractor based in Grand Rapids, Mich., would like to hire as many as 200 workers next year.",
    "url": "https://www.wsj.com/politics/policy/trump-immigration-work-permit-policy-business-impact-0ecadef5?st=KdpiH9&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump nominates conservative culture warrior to lead DOJ civil rights  —  Harmeet Dhillon, a Republican lawyer in liberal San Francisco, is poised to be the first Sikh American to run the U.S. Department of Justice's Civil Rights Division.  —  WASHINGTON — President-elect Donald Trump tapped Harmeet Dhillon … ",
    "url": "https://www.nbcnews.com/politics/justice-department/trump-nominates-conservative-culture-warrior-lead-doj-civil-rights-rcna183588"
  },
  {
    "text": "RFK Jr.'s Hopes of Having Daughter-in-Law at CIA Hit Roadblock  —  ROBERT F. KENNEDY JR.'S DAUGHTER-IN-LAW faces long odds in winning a top job at the Central Intelligence Agency amid mounting criticism from members of Donald Trump's transition team and Senate Republicans.",
    "url": "https://www.thebulwark.com/p/rfk-jr-robert-kennedy-hopes-daughter-in-law-amaryllis-fox-at-cia-roadblock"
  },
  {
    "text": "Fed-up NJ sheriff sends own drone to follow mystery flying objects — what happened left some ‘stunned’  —  A fed-up New Jersey sheriff said he tried to track the mystery drones swarming the skies above his county — but they “easily” evaded the effort.  —  The Ocean County Sheriff's office sent … ",
    "url": "https://nypost.com/2024/12/14/us-news/nj-county-sheriff-sends-own-drone-up-to-follow-mystery-flying-objects/"
  },
  {
    "text": "The Week CEOs Bent the Knee to Trump  —  Companies abandoned him after the Jan. 6, 2021, riot.  Now, they are rushing to curry favor with the president-elect as he prepares to return to the White House.  —  When Donald Trump arrived at the New York Stock Exchange this week for a postelection victory lap … ",
    "url": "https://www.wsj.com/politics/policy/donald-trump-ceos-corporate-influence-second-term-df1455f7?st=841ksg&reflink=article_copyURL_share"
  },
  {
    "text": "Are Childhood Vaccines ‘Overloading’ the Immune System?  No.  —  Vaccines today are more efficient and contain far fewer stimulants to the immune system than some used decades ago.  —  It's an idea as popular as it is incorrect: American babies now receive too many vaccines … ",
    "url": "https://www.nytimes.com/2024/12/14/health/childhood-vaccines-immunity.html"
  },
  {
    "text": "Trump Backs a Longshoremen's Union That Supported Him  —  President-elect Donald J. Trump is supporting the International Longshoremen's Association, which could strike soon if it doesn't reach a deal on automation with employers.  —  Leaders of some labor unions tried to establish … ",
    "url": "https://www.nytimes.com/2024/12/14/business/economy/trump-ila-port-strike.html"
  }
]