[
  {
    "text": "Trump administration will offer all 2 million federal workers a buyout to resign  —  An email is set to go out to federal workers beginning Tuesday.  —  President Donald Trump's administration is set to offer every single federal worker the chance to take a “deferred resignation” … ",
    "url": "https://www.nbcnews.com/politics/white-house/trump-administration-offer-federal-workers-buyouts-resign-rcna189661"
  },
  {
    "text": "Scoop: Trump offering buyouts to all federal workers, source says … We're five years past COVID and just 6 percent of federal employees work full-time in office.  That is unacceptable,\" a senior administration official tells Axios.",
    "url": "https://www.axios.com/2025/01/28/trump-federal-workers-quit-severance"
  },
  {
    "text": "D.C. federal judge temporarily blocks Trump plan to pause federal aid spending  —  The order from Judge Loren AliKhan runs through next Monday, when further arguments in the case are scheduled.  —  Trump administration freezes nearly all federal grants and loans",
    "url": "https://www.nbcnews.com/politics/donald-trump/dc-federal-judge-temporarily-blocks-trump-plan-pause-federal-aid-spend-rcna189706"
  },
  {
    "text": "White House incentivizes federal workers to resign  —  The email sent to the federal workforce is the most sweeping effort yet by the new Trump administration to shrink the ranks of government employees.  —  The White House's Office of Personnel Management sent an email blast Tuesday … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/28/trump-emails-workforce/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4MDQwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NDIyNzk5LCJpYXQiOjE3MzgwNDA0MDAsImp0aSI6IjdiYzYyMDcwLWZjMzktNDAwYi04ZjNlLWYzMzQ0Mjg0ZDBjZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAxLzI4L3RydW1wLWVtYWlscy13b3JrZm9yY2UvIn0.NOvFpC8Ks_JQ3MmXWM71M0t_TWxEl88EK-V6Ckpwc7A&itid=gfta"
  },
  {
    "text": "Trump offers all federal workers a buyout with 7 months' pay in effort to shrink size of government  —  The White House on Tuesday began offering buyouts worth seven months of salary to all federal employees who opt to leave their jobs by Feb. 6 — part of President Donald Trump's unprecedented overhaul of the U.S. government.",
    "url": "https://apnews.com/article/trump-buyouts-to-all-federal-employees-f67f5751a0fd5ad8471806a5a1067b5e"
  },
  {
    "text": "Illinois shut out of Medicaid after Trump administration halts federal grants and loans  —  The Trump administration's federal freeze has shut Illinois out of Medicaid, according to Gov. JB Pritzker's office.  The government-funded health insurance program covered about 3.9 million people … ",
    "url": "https://chicago.suntimes.com/politics/donald-trump/2025/01/28/illinois-medicaid-federal-funding-freeze-trump-administration"
  },
  {
    "text": "White House says Medicaid portal ‘will be back online shortly’ after Trump funding freeze blamed … Medicaid reimbursement portals were down Tuesday in every U.S. state on the heels of a funding freeze ordered by the Trump administration of federal grants and loans, Sen. Ron Wyden said.",
    "url": "https://www.cnbc.com/2025/01/28/trump-funding-freeze-medicaid-state-portals-omb.html"
  },
  {
    "text": "Legal battle looms as Trump orders a funding freeze during a review of federal loans and grants  —  The White House is pausing federal grants and loans starting Tuesday as President Donald Trump's administration begins an across-the-board ideological review of its spending … ",
    "url": "https://apnews.com/article/donald-trump-pause-federal-grants-aid-f9948b9996c0ca971f0065fac85737ce"
  },
  {
    "text": "Medicaid, Head Start, health centers say they're locked out of federal funding website  —  A wide range of organizations and agencies that depend on federal health department funds say they have been locked out of the online system responsible for tracking and depositing their money … ",
    "url": "https://www.cbsnews.com/news/medicaid-head-start-health-centers-trump-funding-freeze/"
  },
  {
    "text": "Elon Musk Lackeys Have Taken Over the Office of Personnel Management  —  Sources tell WIRED that the OPM's top layers of management now include individuals linked to xAI, Neuralink, the Boring Company, and Palantir.  One expert found the takeover reminiscent of Stalin.",
    "url": "https://www.wired.com/story/elon-musk-lackeys-office-personnel-management-opm-neuralink-x-boring-stalin/"
  },
  {
    "text": "Caroline Kennedy warns senators of ‘predator’ RFK Jr. in searing letter  —  In a letter to lawmakers, the former U.S. ambassador to Australia and cousin of Trump's HHS nominee, questions Robert F. Kennedy's ethics and views on vaccines.  —  Caroline Kennedy on Tuesday warned senators … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/28/kennedy-lettor-rfk/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4MDQwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NDIyNzk5LCJpYXQiOjE3MzgwNDA0MDAsImp0aSI6ImZhNmJjNWE5LTg3OTEtNDQyZC1hMGU3LTUxZmJhMDIyY2UzZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAxLzI4L2tlbm5lZHktbGV0dG9yLXJmay8ifQ.fW4r9jt8DqylCfb5j_rzlwhNhNQfMJ2GaIAA7wUH7mU"
  },
  {
    "text": "Trump's Attempt to Usurp Congress's Spending Power  —  The Trump Administration is undertaking what amounts to a wide-ranging assault on Congress's power of the purse, seeking instead to usurp authority over federal spending.  Today, the Office of Management and Budget issued a memo mandating a … ",
    "url": "https://reason.com/volokh/2025/01/28/trumps-attempt-to-usurp-congresss-spending-power/"
  },
  {
    "text": "Trump moves to fire members of EEOC and NLRB, breaking with precedent  —  The dismissals target two independent agencies that oversee large swaths of U.S. workers, employers and labor unions.  —  President Donald Trump has moved to fire Democratic members of two independent federal commissions … ",
    "url": "https://www.washingtonpost.com/business/2025/01/28/trump-fire-eeoc-nlrb-board-members/"
  },
  {
    "text": "Live Updates: White House Defends Trump's Funding Freeze as Opponents Rush to Block It  —  Where Things Stand  — Federal aid pause: The White House budget office ordered a pause in grants, loans and other federal financial assistance, a sweeping move it said was necessary to bring … ",
    "url": "https://www.nytimes.com/live/2025/01/28/us/trump-news-executive-orders"
  },
  {
    "text": "Americans sour on some of Trump's early moves, Reuters/Ipsos poll finds  —  Americans have a dim view of some of President Donald Trump's early barrage of executive orders, including his attempt to do away with so-called birthright citizenship and his decision to rename the Gulf of Mexico, a Reuters/Ipsos poll found.",
    "url": "https://www.reuters.com/world/us/americans-sour-some-trumps-early-moves-reutersipsos-poll-finds-2025-01-28/"
  },
  {
    "text": "Trump's Order on Transgender Troops Will Likely Ban Their Service, Again  —  In an executive order issued Monday night, the president said transgender service members “cannot satisfy the rigorous standards necessary” for the military.  —  Hours after President Trump signed … ",
    "url": "https://www.nytimes.com/2025/01/28/us/politics/trump-transgender-troops.html"
  },
  {
    "text": "Departing the New York Times  —  As many people reading this know, last month I retired from my position as an opinion writer at the New York Times—a job I had done for 25 years.  Despite the encomiums issued by the Times, it was not a happy departure.  If you check out my Substack … ",
    "url": "https://contrarian.substack.com/p/departing-the-new-york-times"
  },
  {
    "text": "Michigan's Gary Peters won't seek reelection to U.S. Senate.  Here's why  —  Washington ― Gary Peters, Michigan's senior senator and a former congressman, said he won't seek reelection next year and will retire from the U.S. Senate when his second term ends in January 2027.",
    "url": "https://www.detroitnews.com/story/news/politics/2025/01/28/michigan-democratic-senator-gary-peters-will-not-run-for-reelection-to-us-senate-seat-2026/77985876007/"
  },
  {
    "text": "Republican congressman suggests some children receiving free school lunches should work at McDonald's instead  —  Rep. Rich McCormick said that the freeze on federal aid would allow the government to review all programs including ones that provide free school lunches to low-income children.",
    "url": "https://www.nbcnews.com/politics/congress/republican-congressman-suggests-children-receiving-free-school-lunches-rcna189614"
  },
  {
    "text": "Protecting Children from Chemical and Surgical Mutilation  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Policy and Purpose.  Across the country today, medical professionals are maiming … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/protecting-children-from-chemical-and-surgical-mutilation/"
  },
  {
    "text": "France floated sending troops to Greenland, foreign minister says  —  The comments came as Denmark's prime minister travels to Berlin, Paris and Brussels to shore up support from allies.  —  PARIS — France has discussed with Denmark sending troops to Greenland in response … ",
    "url": "https://www.politico.eu/article/france-fm-jean-noel-barrot-floats-sending-troops-to-greenland-denmark/"
  },
  {
    "text": "Google reclassifies U.S. as ‘sensitive country’ alongside China, Russia after Trump's ‘Gulf of America’ comments … Google's maps division on Monday reclassified the U.S. as a “sensitive country,” a designation it reserves for states with strict governments and border disputes, CNBC has learned.",
    "url": "https://www.cnbc.com/2025/01/28/google-reclassifies-us-as-sensitive-country-like-china-russia-.html"
  },
  {
    "text": "Pentagon pulling Gen. Milley's security detail and clearance ‘immediately,’ may face demotion in retirement  —  EXCLUSIVE: Defense Secretary Pete Hegseth will announce he is “immediately pulling” retired Gen. Mark Milley's personal security detail and security clearance, multiple senior administration officials tell Fox News.",
    "url": "https://www.foxnews.com/politics/white-house-pulling-gen-milleys-security-detail-clearance-panel-may-face-demotion-retirement"
  },
  {
    "text": "Tuberculosis outbreak that has killed 2 in Kansas continues to grow  —  More than 60 people were being treated for the disease in the Kansas City area as of Friday, according to the state health department.  —  The number of tuberculosis cases linked to an outbreak in the Kansas City area continues … ",
    "url": "https://www.nbcnews.com/health/health-news/tuberculosis-outbreak-kansas-rcna189637"
  },
  {
    "text": "Democrats' playbook for Trump 2.0: Tune out the noise and focus on economic issues  —  As Trump floods the zone in his first week in office, Democrats are departing from their “resistance” strategy in his first term and zeroing in on issues that cost them the last election.",
    "url": "https://www.nbcnews.com/politics/congress/democrats-playbook-trump-tune-noise-focus-economic-issues-rcna189180"
  }
]