[
  {
    "text": "A lot of Americans embrace Trump's authoritarianism  —  With every hour that passes, Donald Trump's grip on the Republican Party's 2024 presidential nomination grows tighter.  Every day in which his opponents aren't gaining ground on his position is a day in which he gets nearer to appearing … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/10/lot-americans-embrace-trumps-authoritarianism/"
  },
  {
    "text": "The Warnings About Trump in 2024 Are Getting Louder  —  A judge's plea, Hillary Clinton invokes the H-word, and a shock poll in the Times.  —  Donald Trump often takes the breath away with his defiance of the basic norms of American public life.  (See: January 6th.)",
    "url": "https://www.newyorker.com/news/letter-from-bidens-washington/the-warnings-about-trump-in-2024-are-getting-louder"
  },
  {
    "text": "Trump's right, the system is RIGGED.  In his favor.  —  This free edition of Public Notice is made possible by paid subscribers.  If you aren't one already, please consider signing up.  Just click the button below.  —  Click for Public Notice free trial",
    "url": "https://www.publicnotice.co/p/trump-trials-engoron-james-jack-smith-rigged"
  },
  {
    "text": "Rep. Elise Stefanik files ethics complaint against judge in Trump's civil fraud trial  —  The senior House Republican and close Trump ally accused Judge Arthur Engoron of “weaponized law fare” against the former president and called on the judge to recuse himself.",
    "url": "https://www.nbcnews.com/politics/donald-trump/stefanik-files-ethics-complaint-judge-engoron-trump-trial-rcna124554"
  },
  {
    "text": "The Hill's Morning Report — Democrats see red with Manchin's retirement  —  Editor's note: The Hill's Morning Report is our daily newsletter that dives deep into Washington's agenda.  To subscribe, click here or fill out the box below.  —  Close  —  Thank you for signing up!",
    "url": "https://thehill.com/newsletters/morning-report/4303834-the-hills-morning-report-democrats-see-red-with-manchins-retirement/"
  },
  {
    "text": "Playbook: Why Congress could sleepwalk into a shutdown  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  DEBATE WINDFALLS — Florida Gov. RON DeSANTIS raised more than $1 million in the 24 hours after Wednesday night's GOP debate in Miami, we're told by his campaign.",
    "url": "https://www.politico.com/newsletters/playbook/2023/11/10/why-congress-could-sleepwalk-into-a-shutdown-00126552"
  },
  {
    "text": "Judge in classified documents case rejects Trump's request to delay May trial date  —  The federal judge had announced in July that the trial would begin on May 20 in Fort Pierce, Florida.  —  A federal judge on Friday declined former President Donald Trump's request to postpone the May start date … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-classified-documents-case-rejects-trumps-request-delay-may-trial-rcna124614"
  },
  {
    "text": "Where's Melania?  —  The former first lady isn't too hard to find.  So why does it feel like she's hiding?  —  PALM BEACH, Fla. — On an October morning, before the club had opened for its winter season, all was quiet at Mar-a-Lago.  The five clay tennis courts were unblemished.",
    "url": "https://www.washingtonpost.com/style/power/2023/11/10/where-is-melania-trump/"
  },
  {
    "text": "How the GOP muzzled the quiet coalition that fought foreign propaganda  —  The FBI put a pause on briefings with tech companies due to an ongoing lawsuit, adding to a broader breakdown in a system meant to guard against influence operations and to ensure election integrity.",
    "url": "https://www.nbcnews.com/tech/tech-news/gop-muzzled-quiet-coalition-fought-foreign-propaganda-rcna103373"
  },
  {
    "text": "Under new speaker, some Republicans hope impeachment inquiry will lose steam  —  The inquiry stagnated during the 3-week fight to elect a new speaker.  Now, James Comer has sent out new subpoenas as Speaker Mike Johnson strikes a more reserved tone.  —  During the 22-day fight to fill … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/10/biden-impeachment-inquiry-speaker-johnson/"
  },
  {
    "text": "Federal appeals court calls Biden's ‘ghost gun’ limits unlawful  —  So-called ghost guns are difficult for law enforcement to trace because they can be assembled from kits that can be bought online or at a store without a background check.  —  A federal appeals court on Thursday ruled … ",
    "url": "https://www.nbcnews.com/politics/politics-news/federal-appeals-court-calls-bidens-ghost-gun-limits-unlawful-rcna124601"
  },
  {
    "text": "Update on Fort Totten Park metal canister investigation  —  WASHINGTON— An area of Fort Totten Park remains closed and fenced, and cement barriers and “no trespassing” signs will remain while the National Park Service (NPS) and U.S. Army further investigate the metal canisters … ",
    "url": "https://www.nps.gov/rocr/learn/news/2023-11-09-fort-totten-park-update.htm"
  },
  {
    "text": "Arizona fake electors led vocal campaign to overturn the 2020 election — they're now part of a ‘robust’ state investigation  —  They called it “The Signing.”  Eleven fake electors for President Donald Trump convened at the state Republican Party headquarters in Phoenix, Arizona, on December 14, 2020.",
    "url": "https://www.cnn.com/2023/11/10/politics/arizona-fake-electors-kifle-invs/"
  },
  {
    "text": "The Key to Mike Johnson's Christian Extremism Hangs Outside His Office  —  The newly elected House Speaker has ties to the far-right New Apostolic Reformation — which is hell-bent on turning America into a religious state  —  THE AMERICAN PUBLIC has had much to learn about Mike Johnson over the past two weeks.",
    "url": "https://www.rollingstone.com/politics/political-commentary/mike-johnson-christian-nationalist-appeal-to-heaven-flag-1234873851/"
  },
  {
    "text": "Ex-National Guardsman wanted on Jan. 6 charges surrenders after FBI manhunt  —  Gregory Yetman turned himself into police in New Jersey following a 48-hour manhunt.  —  A former New Jersey National Guard police sergeant accused of pepper spraying officers during the Jan. 6 Capitol attack turned himself … ",
    "url": "https://www.nbcnews.com/politics/justice-department/ex-national-guardsman-wanted-jan-6-charges-surrenders-fbi-manhunt-rcna124621"
  },
  {
    "text": "Billionaire FBI informant Peter Thiel dished about two Kremlin invites to private Putin meetings … It was the perfect hunting ground for a Kremlin operative looking to get his hooks into Peter Thiel, one of the most powerful men in Silicon Valley: an extravagant birthday party with hundreds of guests … ",
    "url": "https://www.businessinsider.com/fbi-peter-thiel-vladimir-putin-russia-christian-angermayer-daniil-bisslinger-2023-11?op=1"
  },
  {
    "text": "Majority Now Say U.S. Losing Ground on Illegal Drug Problem  —  WASHINGTON, D.C. — Americans are more negative about U.S. progress in dealing with the problem of illegal drugs than at any prior point in Gallup's trend, which dates back to 1972.  For the first time, a majority of U.S. adults … ",
    "url": "https://news.gallup.com/poll/514142/majority-say-losing-ground-illegal-drug-problem.aspx"
  },
  {
    "text": "Prosecutors recommending 3-plus years in jail for man who pleaded guilty in Rep. Angie Craig assault  —  Prosecutors are recommending more than three years of jail time for the man who assaulted Rep. Angie Craig (D-Minn.) in her Washington, D.C., apartment earlier this year.",
    "url": "https://thehill.com/homenews/house/4304311-prosecutors-recommend-3-years-jail-man-angie-craig-assault/"
  },
  {
    "text": "Did Trump violate campaign finance laws (again)?  —  The most newsworthy part of Barton Gellman's new interview of tech entrepreneur Peter Thiel for the Atlantic is that Thiel is swearing off campaign contributions.  He'd been a big donor to Donald Trump's 2016 campaign, earning a speaking spot at that year's convention.",
    "url": "https://www.washingtonpost.com/politics/2023/11/10/thiel-trump-analysis/"
  },
  {
    "text": "‘Buying influence’: top US nuclear board advisers are tied to arms business  —  Nine of 12 members of the commission charged with avoiding nuclear conflict have financial ties to defense contractors  —  Co-published with Responsible Statecraft  —  Nine of the 12 members … ",
    "url": "https://www.theguardian.com/world/2023/nov/10/us-congress-nuclear-weapon-committee-conflict-interest"
  },
  {
    "text": "Ramaswamy camp: The RNC sabotaged us in the debate spin room  —  There is bad blood brewing here.  —  Vivek Ramaswamy's campaign accused Republican National Committee Chair Ronna McDaniel of trying to limit his campaign's visibility in the post debate spin room, following critical remarks he made of her at the forum.",
    "url": "https://www.politico.com/news/2023/11/09/ramaswamy-camp-rnc-sabotage-debate-spin-room-00126446"
  },
  {
    "text": "Chris Christie to travel to Israel  —  The former New Jersey governor said he was invited by Israel's foreign ministry and plans to talk to families of the hostages, members of the Israel Defense Forces and government officials.  —  MERRIMACK, N.H. — Former New Jersey Gov. Chris Christie … ",
    "url": "https://www.nbcnews.com/politics/politics-news/chris-christie-gop-presidential-candidate-travel-israel-rcna124550"
  }
]