[
  {
    "text": "CNN polls across six battlegrounds find Georgia and Pennsylvania are key toss-ups  —  The 2024 presidential campaign's home stretch kicks off with a mixed outlook across six key battlegrounds, according to new CNN polls conducted by SSRS in each state.  Vice President Kamala Harris holds … ",
    "url": "https://www.cnn.com/2024/09/04/politics/cnn-polls-battleground-states/"
  },
  {
    "text": "Republicans fret over Trump's freefall among women  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/homenews/campaign/4860681-trump-support-among-women-voters/"
  },
  {
    "text": "If Republicans Want to Win, They Need Trump to Lose — Big  —  To dominate the country once more, Republicans need to hasten the move to a post-Trump party.  —  Accepting his party's nomination in 1984, Democrat Walter Mondale vowed to cut the deficit with a memorable line about the tough medicine either … ",
    "url": "https://www.politico.com/news/magazine/2024/09/04/kamala-harris-republicans-after-trump-00177194"
  },
  {
    "text": "Playbook: The Republicans secretly rooting for a Trump loss  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  DEVELOPING OVERNIGHT — “Ukraine foreign minister resigns amid war's biggest reshuffle,” by Reuters' Olena Harmash in Kyiv … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/09/04/the-republicans-secretly-rooting-for-a-trump-loss-00177272"
  },
  {
    "text": "Harris to propose tenfold startup tax incentive increase she says will spur small business creation  —  Vice President Kamala Harris plans to propose on Wednesday a tenfold increase in federal tax incentives for small business startup expenses, from $5,000 to $50,000, hoping to help spur … ",
    "url": "https://apnews.com/article/harris-small-business-tax-plan-new-hampshire-12f34210263458ddb1b02fbd846d2be5"
  },
  {
    "text": "Trump appears to have misled Gold Star families on troop deaths in Afghanistan  —  Trump frequently suggests, as he did in a TikTok filmed at Arlington Cemetery, that an 18-month period without hostile-fire deaths took place entirely in his presidency.",
    "url": "https://www.washingtonpost.com/politics/2024/09/04/trump-misled-gold-star-families-troop-deaths-afghanistan/"
  },
  {
    "text": "The ugly truth we're missing on Trump, Arlington  —  There's an old saying: Never take any time off in 2024.  OK, I just made that up, but no sooner did I decide to skip a few column slots to recover from the joy, or whatever, of Chicago's Democratic National Convention, than all heck broke loose.",
    "url": "https://www.inquirer.com/columnists/attytood/trump-arlington-cemetery-sundown-towns-ferguson-20240903.html"
  },
  {
    "text": "Silver Bulletin 2024 presidential election forecast  —  All the numbers for Trump vs. Harris.  —  ∙ Paid … Let's cut to the chase: So, who's gonna win the election?  —  Well, honestly, we don't know — but we can give you our best probabilistic guess.",
    "url": "https://www.natesilver.net/p/nate-silver-2024-president-election-polls-model"
  },
  {
    "text": "Ginni Thomas Privately Praised Group Working Against Supreme Court Reform: “Thank You So, So, So Much”  —  In a call with donors, First Liberty Institute's Kelly Shackelford read the supportive email he said came from Thomas.  The leader of the religious-rights group also labeled Justice Elena Kagan … ",
    "url": "https://www.propublica.org/article/ginni-thomas-email-scotus-ethics-reform-first-liberty-institute"
  },
  {
    "text": "Trump ties himself in knots on abortion  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions  — descriptions off, selected",
    "url": "https://thehill.com/policy/healthcare/4860618-trump-abortion-twist-knots/"
  },
  {
    "text": "Why thousands of Florida students are not being taught sex ed  —  In May 2023, Florida Governor Ron DeSantis (R) signed Florida House Bill 1069, a law that requires sex education classes in the state to conform to right-wing ideology.  Specifically, the law requires all sex education classes … ",
    "url": "https://popular.info/p/why-thousands-of-florida-students"
  },
  {
    "text": "Josh Marshall on how the “liberal media” works against Dems  —  “Republicans in the national political conversation have trained the press to think, ‘We play hard.  We break the rules sometimes.’”  —  ∙ Paid … How is it possible that the elite press, comprised largely … ",
    "url": "https://www.publicnotice.co/p/josh-marshall-interview-2024-media-trump-harris"
  },
  {
    "text": "Biden's Asylum Restrictions Were Meant to Be Temporary.  Now That Could Change.  —  The changes under consideration would build on the executive order that President Biden issued in June, which blocked a vast majority of asylum claims at the southern border.",
    "url": "https://www.nytimes.com/2024/09/04/us/politics/biden-asylum-restrictions.html"
  },
  {
    "text": "Exclusive: Biden administration to accuse Russia of sustained effort to influence 2024 election  —  The Biden administration on Wednesday plans to accuse Russia of a sustained effort to influence the 2024 US presidential election by using Kremlin-run media and other online platforms … ",
    "url": "https://www.cnn.com/2024/09/04/politics/biden-administration-accuse-russia-election-influence-efforts"
  },
  {
    "text": "The saga of Trump's hush money case isn't over yet: Sentencing date nears  —  Republican presidential candidate and former President Donald Trump was hoping to delay his New York sentencing on 34 felony counts until after the Nov. 5 election, but a federal judge said Tuesday that he wouldn't block the case from moving forward.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/09/04/trump-sentencing-date-hush-money-case/75060317007/"
  },
  {
    "text": "‘A ton of Covid out there’: US summer wave not taken seriously enough - experts  —  Epidemiologists push newly approved booster vaccines as current virus strain threatens at-risk groups  —  Infectious disease experts say many people are not taking the latest Covid-19 wave in the US seriously enough … ",
    "url": "https://www.theguardian.com/us-news/article/2024/sep/04/covid-19-summer-wave"
  },
  {
    "text": "Barron Trump arrives at NYU for first day at college  —  Former President Donald Trump's youngest child, Barron Trump, was spotted arriving at New York University Wednesday to kick off his first day of college life.  —  The towering 18-year-old was flanked by Secret Service agents … ",
    "url": "https://nypost.com/2024/09/04/us-news/barron-trump-arrives-at-nyu-for-first-day-at-college/"
  },
  {
    "text": "Trump admits he lost 2020 election ‘by a whisker’ during Lex Fridman podcast  —  Trump repeats false claims about voter fraud as he concedes 2020 loss in podcast interview  —  Support truly  —  independent journalism  —  Our mission is to deliver unbiased, fact-based reporting that holds power to account and exposes the truth.",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-lex-fridman-podcast-interview-b2606533.html"
  },
  {
    "text": "Christian group recruits ‘Trojan horse’ election skeptics as US poll workers  —  Lion of Judah enrolls poll workers in Trump-aligned swing state tour, which experts say could be ‘hazard to democracy’  —  A Christian political operative has teamed up with charismatic preachers … ",
    "url": "https://www.theguardian.com/us-news/article/2024/sep/04/christian-election-poll-workers"
  },
  {
    "text": "Meghan McCain says she won't support Harris or Trump  —  Meghan McCain, the daughter of the late Sen. John McCain (R-Ariz.), said she will not support Vice President Harris or former President Trump in November.  —  Her comment comes just hours after her brother, Jimmy McCain, threw his support behind Harris.",
    "url": "https://thehill.com/homenews/campaign/4861019-meghan-mccain-kamala-harris-donald-trump-2024/"
  },
  {
    "text": "JD Vance's Catholicism helped shape his views.  So did this little-known group of Catholic thinkers  —  By his own account, Ohio Sen. JD Vance's 2019 conversion to Catholicism provided a spiritual fulfillment he couldn't find in his Yale education or career success.  —  It also amounted to a political conversion.",
    "url": "https://apnews.com/article/jd-vance-catholicism-postliberals-social-policy-7e37e43cb1976c516d642a95d495266a"
  },
  {
    "text": "SURPRISE!  —  Hello again, it's Brian Stelter — yes, really.  —  I am thrilled to share that I am returning as the lead author of CNN's Reliable Sources newsletter, the digest I founded in 2015.  —  But this is not going to be a “Back to the Future” remake.",
    "url": "https://view.newsletters.cnn.com/messages/1725400860804a11dd2d3fed6/raw"
  },
  {
    "text": "Former Trump Aide Peter Navarro Implores MAGA Fans To Avoid Kamala Harris Mistake  —  The election-overthrow plotter used a soccer analogy to make his point.  —  LOADING  —  Peter Navarro, Donald Trump's former adviser who helped plot the attempted election overthrow in 2020, had a message for MAGA world.",
    "url": "https://www.huffpost.com/entry/peter-navarro-no-kamala-harris-first-name_n_66d8464ce4b09a3ee66d0165"
  },
  {
    "text": "US service member detained in Venezuela, officials say  —  A US service member has been detained in Venezuela, according to four US officials familiar with the matter.  —  The service member, a US Navy sailor, is a US citizen and was detained on August 30 in Caracas, according to the officials.",
    "url": "https://www.cnn.com/2024/09/04/politics/us-service-member-detained-venezuela/"
  },
  {
    "text": "Sweden's foreign minister says he will step down  —  Sweden's Foreign Minister Tobias Billstrom will step down next week, he wrote in a post on social media platform X on Wednesday.  —  “It is with a mixture of sadness and pride that I have today informed the prime minister that I will leave … ",
    "url": "https://www.reuters.com/world/europe/swedens-foreign-minister-says-he-will-step-down-2024-09-04/"
  },
  {
    "text": "Goldman Sachs predicts stronger GDP and job growth if Democrats sweep White House and Congress … Goldman Sachs Group Inc. economists gamed out the potential economic implications of a Republican or Democratic victory in the November elections, cautioning that US GDP faces a hit in the case of a win for Donald Trump.",
    "url": "https://fortune.com/2024/09/03/goldman-sachs-predicts-stronger-gdp-and-job-growth-if-democrats-sweep-white-house-and-congress/"
  }
]