[
  {
    "text": "Why I'm voting for Biden and other Republicans should, too  —  Donald Trump has disqualified himself through his conduct and his character,  —  It's disappointing to watch an increasing number of Republicans fall in line behind former president Donald Trump.",
    "url": "https://www.ajc.com/opinion/geoff-duncan-why-im-voting-for-biden-and-other-republicans-should-too/LFLE5YWCBBA6VDGJAJKMNPCDKQ/"
  },
  {
    "text": "Hamas announces it has accepted an Egyptian-Qatari cease-fire proposal  —  Israel's army has told Palestinians to temporarily evacuate from parts of Rafah in southern Gaza, signaling that a ground invasion is imminent.  People were told to move to Muwasi, an Israeli-declared humanitarian area near the coast.",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-war-humanitarian-aid-8659eae6e0a7362504f0aa4aa4be53e0"
  },
  {
    "text": "Jack Dorsey praises Twitter as ‘freedom technology’ as he leaves Bluesky board  —  Former Twitter CEO Jack Dorsey praised the platform he founded, now known as X, as “freedom technology” on Saturday, shortly after revealing he was no longer serving on the board of directors for Bluesky.",
    "url": "https://thehill.com/policy/technology/4646630-jack-dorsey-praises-twitter-as-freedom-technology-as-he-leaves-bluesky-board/"
  },
  {
    "text": "Kristi Noem's Team Told Her to Nix the Dog Story 2 Years Ago  —  It would have violated the first rule of campaign memoirs: Do no harm.  —  Kristi Noem's story about killing her dog made headlines across America.  But it wasn't news to people who worked on her first book … ",
    "url": "https://www.politico.com/news/magazine/2024/05/06/kristi-noem-dog-killing-story-00156290"
  },
  {
    "text": "Guilty?  By nearly 3-1, Americans predict a Trump conviction, though some see unfairness  —  Susan Page Rachel Barber Sudiksha KochiUSA TODAY  —  Guilty?  —  Americans by nearly 3-1 predict that former President Donald Trump will be convicted on all or some of the felony charges he faces … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/05/07/trump-hush-money-trial-americans-guilty/73504245007/"
  },
  {
    "text": "Ole Miss Student Kicked Out of Fraternity After Video Caught Racist Gestures Toward Protester  —  Video footage of a student making racist gestures, seemingly imitating a monkey, toward a Black woman who was part of a scheduled pro-Palestinian protest at the University of Mississippi … ",
    "url": "https://time.com/6974979/university-of-mississippi-protest-racist-monkey-gesture-fraternity/"
  },
  {
    "text": "The critical difference that could save Cuellar  —  Presented by With assists from POLITICO's Congress team  —  Rep. Henry Cuellar's indictment marks the third high-profile Hispanic lawmaker to have been indicted in recent months.  Critically, the influential Congressional Hispanic Caucus is coming to his defense.",
    "url": "https://www.politico.com/newsletters/inside-congress/2024/05/06/the-critical-difference-that-could-save-cuellar-00156382"
  },
  {
    "text": "Jurors in Trump Trial Hear Witness Tie the President to the Payment  —  Before prosecutors began presenting crucial records, the judge held Donald J. Trump in contempt, saying his complaints about the jury were “a direct attack on the rule of law.”  —  After two weeks of enthralling jurors … ",
    "url": "https://www.nytimes.com/2024/05/06/nyregion/trump-trial-gag-order-hush-money.html"
  },
  {
    "text": "Congresswoman battling brain disorder delivers House speech using a text-to-voice app  —  Rep. Jennifer Wexton (D-Va.), whose ability to speak, hear and move has been affected by a degenerative brain condition, uses assistive technology to help her navigate life on the Hill.",
    "url": "https://www.washingtonpost.com/politics/2024/05/06/wexton-house-speech-brain-condition/"
  },
  {
    "text": "U.S. soldier detained in Russia, officials say  —  The soldier, who was stationed in Korea and traveled to Russia on his own, is accused of stealing from a woman.  —  A U.S. soldier was detained in Russia over the weekend, according to four U.S. officials.",
    "url": "https://www.nbcnews.com/politics/politics-news/us-soldier-detained-russia-officials-say-rcna150928"
  },
  {
    "text": "Trump mocks Sen. Tester's weight, hints at a Montana campaign appearance  —  Trump mocked the senator's weight at a fundraiser Saturday night in Palm Beach, Fla., comparing the Montana Democrat's appearance to that of a pregnant woman, according to a recording of the event obtained by The Washington Post.",
    "url": "https://www.washingtonpost.com/politics/2024/05/06/trump-tester-weight-comments/"
  },
  {
    "text": "Boeing Admits That Its Employees Falsified Aircraft Records for 787 Dreamliner  —  The airplane manufacturer is currently the subject of multiple separate probes.  —  In the latest disturbing twist to the Boeing saga, the company admitted to falsifying records related to the inspection of its 787 Dreamliner plane.",
    "url": "https://gizmodo.com/boeing-admits-employees-falsified-aircraft-records-1851459132"
  },
  {
    "text": "ProPublica Wins Pulitzer Prize for Supreme Court Coverage  —  The award marks ProPublica's 7th Pulitzer; Uvalde shooting investigation is named a Pulitzer finalist.  —  ProPublica won the prestigious public service Pulitzer Prize for what the judges described as “groundbreaking … ",
    "url": "https://www.propublica.org/article/pulitzer-prize-announcement-propublica-supreme-court"
  },
  {
    "text": "MIT becomes first elite university to ban diversity statements  —  In what's likely to be a watershed moment, the Massachusetts Institute of Technology has ended the use of diversity statements for faculty hiring, making it the first elite private university to backtrack on the practice … ",
    "url": "https://unherd.com/newsroom/mit-becomes-first-elite-university-to-ban-diversity-statements/"
  },
  {
    "text": "Scoop: Kristi Noem angled for top NRA job … - Late last fall, Noem called LaPierre to advocate to be the next executive vice president or CEO of the gun lobby.  — Noem is now in a heated PR cycle over passages in her book about shooting her dog and meeting with Kim Jong Un.",
    "url": "https://www.axios.com/2024/05/06/kristi-noem-south-dakota-nra-lapierre"
  },
  {
    "text": "Trump Says Abortion ‘Not That Big Of An Issue,’ GOP Is ‘Party Of Fertilization’  —  In a bizarre interview, the Republican presidential hopeful also said that “every” legal scholar “all over the world” supported overturning Roe v. Wade.  —  LOADING  —  In one of his most bizarre interviews … ",
    "url": "https://www.huffpost.com/entry/trump-abortion-fertilization_n_66390772e4b001bbb5106897"
  },
  {
    "text": "House Republicans plan to move forward with contempt against Attorney General Merrick Garland  —  The move comes after the DOJ declined House Republicans' requests to hand over audio of then-special counsel Robert Hur's interview with President Joe Biden.  —  WASHINGTON — The House Judiciary … ",
    "url": "https://www.nbcnews.com/politics/congress/house-republicans-plan-move-forward-contempt-attorney-general-merrick-rcna150937"
  },
  {
    "text": "EXCLUSIVE: “You Have Been Warned”: Republican Senators Threaten the ICC Prosecutor over Possible Israel Arrest Warrants  —  Read the full letter, obtained by Zeteo, which threatens sanctions in defense of Netanyahu.  —  Team Zeteo and Mehdi Hasan  —  A group of influential Republican senators … ",
    "url": "https://zeteo.com/p/exclusive-you-have-been-warned-republican"
  },
  {
    "text": "Russia to Hold Drills on Tactical Nuclear Weapons in New Tensions With West  —  Russian officials claimed the order was in response to comments from the West about the possibility of more direct involvement in Ukraine.  NATO called Russia's announcement “irresponsible.”",
    "url": "https://www.nytimes.com/2024/05/06/world/europe/russia-tactical-nuclear-weapons-drills.html"
  }
]