[
  {
    "text": "Virginia school board restores Confederate leaders' names to two schools  —  The change comes four years after the schools had removed the names during the national racial reckoning sparked by George Floyd's killing.  —  A Virginia school board voted to restore the names of two schools previously named … ",
    "url": "https://www.washingtonpost.com/education/2024/05/10/shenandoah-county-school-board-confederate-school-names/"
  },
  {
    "text": "Virginia school board votes to restore Confederate names to two schools  —  School board members in Virginia's Shenandoah County voted early Friday to restore the names of two schools that previously honored Confederate leaders - four years after those names had been removed.",
    "url": "https://www.cnn.com/2024/05/09/us/shenandoah-county-confederate-school-names-reaj/"
  },
  {
    "text": "Biden's big donors fume over Israel criticism … - “Bad, Bad, Bad, decision, on all levels, Pls reconsider,” he wrote in a message obtained by Axios and other news outlets.  — He added: “Let's not forget that there are more Jewish voters, who care about Israel, than Muslim voters that care about Hamas.”",
    "url": "https://www.axios.com/2024/05/10/israel-gaza-biden-rafah-donors"
  },
  {
    "text": "Trump gets Barron's age wrong when asked about his youngest son's convention role  —  In an interview with Telemundo 51, Trump offered that Barron, who turned 18 in March, is 17 years old.  —  Former President Donald Trump misstated the age of his youngest son in an interview that aired Thursday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-gets-barrons-age-wrong-asked-youngest-sons-convention-role-rcna151596"
  },
  {
    "text": "The simple reason Republican Sunday show hits are disasters  —  It's hard to defend the indefensible. … Not so long ago, the Sunday morning news shows were a vital part of the political ecosphere.  Politicians and government officials clamored for the mainstream platform provided by ABC's This Week … ",
    "url": "https://www.publicnotice.co/p/stephanopoulos-mace-sununu-gop-sunday-shows"
  },
  {
    "text": "Rubio Wants to Go From ‘Little Marco’ to Trump's VP  —  BIG GULP  —  Eight years after feuding with Trump about their relative penis sizes, Rubio is trying to glad-hand his way into The Donald's veep slot. … FROM ‘LITTLE MARCO’ TO VP CONTENDER  —  At Donald Trump's donor retreat … ",
    "url": "https://www.thedailybeast.com/rubio-wants-to-go-from-little-marco-to-trumps-vp"
  },
  {
    "text": "Biden to Quadruple Tariffs on Chinese EVs  —  Administration is preparing to announce higher levies on a range of Chinese goods next week  —  WASHINGTON—The Biden administration is preparing to raise tariffs on clean-energy goods from China in the coming days, with the levy … ",
    "url": "https://www.wsj.com/economy/trade/biden-to-quadruple-tariffs-on-chinese-evs-203127bf"
  },
  {
    "text": "Trump team throws out GOP plan and builds a ‘leaner’ 2024 operation  —  The new plan calls for fewer offices, less staff and a focus on new partnerships with outside groups — raising concerns among some Republicans.  —  Donald Trump's 2020 campaign called itself a “juggernaut” … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/10/trump-gop-field-operation/"
  },
  {
    "text": "Rick Scott tries to rewrite history on $1.7 billion Medicare fraud controversy  —  Conventional political wisdom would typically advise candidates to steer clear of mentioning their past controversies.  —  But U.S. Sen. Rick Scott went out of his way, quite literally, on Thursday … ",
    "url": "https://www.yahoo.com/news/rick-scott-attend-donald-trump-140134845.html"
  },
  {
    "text": "Strapped down, blindfolded, held in diapers: Israeli whistleblowers detail abuse of Palestinians in shadowy detention center  —  By CNN's International Investigations and Visuals teams  —  Sde Teiman, Israel CNN  —  At a military base that now doubles as a detention center in Israel's Negev desert … ",
    "url": "https://www.cnn.com/2024/05/10/middleeast/israel-sde-teiman-detention-whistleblowers-intl-cmd/"
  },
  {
    "text": "Paul Manafort, poised to rejoin Trump world, aided Chinese media deal  —  The former Trump campaign chairman, who's likely to help manage this summer's GOP convention, resumed consulting work after being pardoned in 2020.",
    "url": "https://www.washingtonpost.com/politics/2024/05/10/paul-manafort-pardon-donald-trump-china/"
  },
  {
    "text": "Trump White House aide Steve Bannon loses appeal of contempt of Congress conviction … Steve Bannon, former adviser to Donald Trump, arrives to federal court in Washington, D.C., U.S., on Wednesday, March 16, 2022.  —  A federal appeals court on Friday upheld the criminal contempt … ",
    "url": "https://www.cnbc.com/2024/05/10/appeals-court-upholds-steve-bannon-contempt-of-congress-conviction.html"
  },
  {
    "text": "Republicans are starting to wonder how hard to back Kari Lake  —  Lake keeps reversing her own positions and stirring up feuds, and some in the GOP see other states as better targets this fall.  —  National Republicans embraced Kari Lake's Arizona Senate bid, reasoning she was likely to win the primary with or without their support.",
    "url": "https://www.politico.com/news/2024/05/10/gop-kari-lake-questions-00157290"
  },
  {
    "text": "Crypto is Trump's new weapon against Biden  —  It's the first time crypto has become an issue in the general election of a presidential race.  —  Donald Trump is making presidential history all over again: He's poised to be the first major party nominee to court cryptocurrency traders.",
    "url": "https://www.politico.com/news/2024/05/10/trump-crypto-biden-00157051"
  },
  {
    "text": "Biden tells a lie a minute during CNN interview  —  The White House rarely allows President Biden to sit down for interviews, and Wednesday's chat with CNN's Erin Burnett shows why.  —  In a brief 17 minutes, Biden told 15 lies — nearly a lie a minute.  —  From whoppers about the economy … ",
    "url": "https://nypost.com/2024/05/09/opinion/biden-tells-a-lie-a-minute-during-cnn-interview/"
  },
  {
    "text": "House Democrats' Surprise Campaign Play: Embracing Border Security  —  Republicans blamed Biden for surge in illegal crossings but blocked bipartisan deal  —  WASHINGTON—Some House Democrats are leaning into border security on the campaign trail after years of playing defense against Republican criticism … ",
    "url": "https://www.wsj.com/politics/elections/house-democrats-surprise-campaign-play-embracing-border-security-7d2bf74f"
  },
  {
    "text": "Hoping tensions ease, House Republicans still brace for more drama  —  Many House Republicans don't believe Marjorie Taylor Greene and other agitators are going to “move on” as Speaker Mike Johnson hopes.  —  Shortly after House lawmakers overwhelming rejected Rep. Marjorie Taylor Greene's attempt … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/10/johnson-greene-speaker-house-republicans/"
  },
  {
    "text": "The Students Have Never Been the Enemy  —  Has there ever been a student protest movement that wasn't immediately derided by the political center and mainstream elite opinion as too radical, deluded, misguided, counter-productive, and dangerous?  —  That is certainly the prevailing opinion yet again … ",
    "url": "https://thomaszimmer.substack.com/p/the-students-have-never-been-the"
  },
  {
    "text": "A top Biden aide highlights a coming showdown with GOP over 2017 tax cuts that are due to expire  —  The Biden White House wants voters to know about its differences with Republicans over taxes, with a top aide making the case for higher rates on corporations and the ultra-wealthy.",
    "url": "https://apnews.com/article/biden-trump-tax-taxes-brainard-8380c835515aa1f855be6e665d530bed"
  },
  {
    "text": "Trump Is Not Invincible  —  In the folk wisdom of recent American politics, Donald Trump is a figure of herculean invulnerability to traditional scandal.  What lands as a crippling blow to most politicians leaves nary a scratch on Trump, who effortlessly deflected the slings and arrows … ",
    "url": "https://www.nytimes.com/2024/05/10/opinion/trump-trial-not-invincible.html"
  },
  {
    "text": "Trump's trial trap: Voters to be his most important jury … - “It really is an all-or-nothing strategy in the sense that the delaying tactic could be a complete victory if he were to be elected president,” said Robert Mintz, a former federal prosecutor.  — Judges have latitude in sentencing … ",
    "url": "https://www.axios.com/2024/05/10/trump-criminal-trials-2024-election"
  },
  {
    "text": "US to announce new $400 million military aid package for Ukraine  —  The package includes new Patriot missiles, Stinger anti-aircraft missiles, Bradley fighting vehicles, MRAPs, Javelin anti-armor systems and other munitions.  —  The United States will announce a new $400 million military aid package … ",
    "url": "https://www.politico.com/news/2024/05/10/us-ukraine-military-aid-russia-00157299"
  },
  {
    "text": "Corporate America Is Sitting Out the Trump-Biden Rematch  —  Business leaders felt in 2020 that they couldn't afford to stay silent on social and political issues.  In 2024, many hope to take a quieter approach.",
    "url": "https://www.wsj.com/business/corporate-america-is-sitting-out-the-trump-biden-rematch-a61f6b77"
  }
]