[
  {
    "text": "Trump should pick Haley as VP, McCarthy says  —  Former Speaker Kevin McCarthy (R-Calif.) said in an interview Wednesday that he would advise former President Trump to pick 2024 presidential candidate Nikki Haley as his running mate.  —  During the New York Times's DealBook Summit … ",
    "url": "https://thehill.com/elections/4333193-trump-vp-pick-haley-mccarthy/"
  },
  {
    "text": "GOP senators feel ambushed by Trump's policy promises  —  Former President Trump is creating new political headaches for Republicans locked in a highly competitive battle to win back the Senate majority by making extreme statements on health care, immigration and other issues unlikely to play well with swing voters in key states.",
    "url": "https://thehill.com/policy/healthcare/4332096-gop-senators-feel-ambushed-by-trumps-policy-promises/"
  },
  {
    "text": "The bad news is Trump is polling well — but the good news is he's ready to blow it  —  Trump is running on the Big Lie and a promise to take away Obamacare — both are losing strategies  —  Democrats, for very good reason, have been in a poll-induced panic for weeks now.",
    "url": "https://www.salon.com/2023/11/29/the-news-is-is-polling-well--but-the-good-news-is-hes-ready-to-blow-it/"
  },
  {
    "text": "If Trump convicted, Home Depot billionaire says he'd still likely fund campaign  —  Republican mega-donor Bernie Marcus said on Tuesday he would likely still give money to Donald Trump's 2024 presidential bid if the former president was convicted of a crime - but the billionaire does not plan to be one of his biggest financial backers.",
    "url": "https://www.reuters.com/world/us/home-depot-billionaire-says-hed-likely-still-fund-trump-if-candidate-convicted-2023-11-28/"
  },
  {
    "text": "Ramaswamy Political Director Joining Trump Campaign (Exclusive)  —  The move marks a major blow to Ramaswamy, who soared to prominence over the summer but has struggled to maintain his momentum  —  A former top aide to GOP presidential candidate Vivek Ramaswamy is leaving his campaign … ",
    "url": "https://themessenger.com/politics/ramaswamy-political-director-joining-trump-campaign-exclusive"
  },
  {
    "text": "Indian gov't official directed Sikh separatist's assassination plot in US, DOJ says  —  An Indian government official directed an unsuccessful plot to assassinate a Sikh separatist on U.S. soil, the U.S. Justice Department said on Wednesday, in announcing charges against a man accused of orchestrating the attempted murder.",
    "url": "https://www.reuters.com/world/us/us-charges-indian-national-with-conspiracy-assassinate-sikh-advocate-2023-11-29/"
  },
  {
    "text": "U.S. Attorney Announces Charges In Connection With Foiled Plot To Assassinate U.S. Citizen In New York City  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of New York  —  Indian Government Employee Directed a Plot From India to Murder U.S.-Based Leader of Sikh Separatist Movement",
    "url": "https://www.justice.gov/usao-sdny/pr/us-attorney-announces-charges-connection-foiled-plot-assassinate-us-citizen-new-york"
  },
  {
    "text": "U.S. prosecutors allege assassination plot of Sikh separatist directed by Indian government employee  —  An Indian government employee who described himself as a “senior field officer” responsible for intelligence ordered the assassination of a Sikh separatist in New York City in May, U.S. prosecutors alleged Wednesday.",
    "url": "https://www.washingtonpost.com/national-security/2023/11/29/india-us-assassination-plot-sikh-pannun/"
  },
  {
    "text": "Biden, Faced with Economic Pessimism, Turns to Economic Populism  —  As ‘Bidenomics’ fails to catch on with voters, the president is turning to a more populist message focused on price gouging and business ‘greed’  —  President Joe Biden is reemphasizing his focus on an economic populism … ",
    "url": "https://themessenger.com/politics/biden-faced-with-economic-pessimism-turns-to-economic-populism"
  },
  {
    "text": "Mysterious woman tells school board that Scholastic book sparked porn addiction  —  On November 14, a 20-year-old woman named Lanah Burkhardt appeared before the school board of the Conroe Independent School District in Texas.  Burkhardt told the board that, when she was 11 … ",
    "url": "https://popular.info/p/mysterious-woman-tells-school-board"
  },
  {
    "text": "11/29/23 ☀️ Punchbowl News AM  —  THE TOP … First, Speaker Mike Johnson is meeting today with Senate Republicans during their Steering lunch in the Capitol. … Johnson is at the fulcrum of a host of big decisions that need to be made in December.",
    "url": "https://punchbowl.news/archive/112923-punchbowl-news-am/"
  },
  {
    "text": "US military Osprey aircraft with 6 aboard crashes off southern Japan, at least 1 dead  —  A crew member who was recovered from the ocean after a U.S. military Osprey aircraft carrying six people crashed Wednesday off southern Japan has been pronounced dead, coast guard officials said.",
    "url": "https://apnews.com/article/japan-us-military-osprey-helicopter-crash-7d704ec5925826593aebcf0e7d1312ca"
  },
  {
    "text": "Mark Cuban says ‘no plans’ to run for president in 2024 on heels of Dallas Mavericks deal  — The billionaire Mark Cuban reiterated that he has no plans to run for president in 2024.  — Cuban plans to sell a majority stake in the NBA team Dallas Mavericks to Miriam Adelson and her family … ",
    "url": "https://www.cnbc.com/2023/11/29/mark-cuban-says-no-plans-to-run-for-president-after-mavericks-deal.html"
  },
  {
    "text": "The misleading Ukraine claim at the heart of the GOP's impeachment push  —  House Oversight Committee Chairman James Comer (R-Ky.) would like you to know (or, at least, would like consumers of right-wing television news to know) that his investigation into President Biden (or, at least, into members of Biden's family) is credible.",
    "url": "https://www.washingtonpost.com/politics/2023/11/29/biden-impeachment-ukraine-hunter/"
  },
  {
    "text": "Speaker Johnson expresses ‘real reservations’ about motion to expel Santos  —  House Speaker Mike Johnson (R-La.) on Wednesday expressed “real reservations” about a motion to expel embattled Rep. George Santos (R-N.Y.) and said that lawmakers would be free to “vote their conscience” during a floor vote expected Thursday.",
    "url": "https://www.washingtonpost.com/politics/2023/11/29/speaker-johnson-expel-george-santos/"
  },
  {
    "text": "Schumer Condemns Antisemitism, Warning the Left Against Abetting It  —  The majority leader and highest-ranking Jewish official in the country, cautioned progressives and young people against unwittingly embracing bigotry in the name of social justice.  —  Senator Chuck Schumer … ",
    "url": "https://www.nytimes.com/2023/11/29/us/politics/schumer-antisemitism-israel-hamas.html"
  },
  {
    "text": "JPMorgan CEO Jamie Dimon to business leaders: ‘Help Nikki Haley’  — JPMorgan CEO Jamie Dimon told an audience of business leaders to “help” Nikki Haley's 2024 Republican campaign for president.  — “Get a choice on the Republican side that might be better than [Donald] Trump,” … ",
    "url": "https://www.cnbc.com/2023/11/29/jamie-dimon-urges-business-leaders-to-help-nikki-haley.html"
  },
  {
    "text": "Why Drugs Are Disappearing From Your Insurance Coverage  —  Powerful companies are removing hundreds of medicines from insurance plans — and they're spending millions to stop attempts at reform.  —  For the millions of Americans that take one or more prescription drugs … ",
    "url": "https://www.levernews.com/why-drugs-are-disappearing-from-your-insurance-coverage/"
  },
  {
    "text": "First plane using only sustainable fuel flies across Atlantic  —  A Virgin Atlantic plane powered using only sustainable fuel completed its flight from London to New York on Tuesday, highlighting an eco-friendly and low-carbon option for transatlantic flights.",
    "url": "https://thehill.com/policy/energy-environment/4332469-first-plane-using-only-sustainable-fuel-flies-across-atlantic/"
  }
]