[
  {
    "text": "Harris shows some gains and economic views brighten a bit — CBS News poll  —  The 2024 presidential race clearly remains a contest either Donald Trump or Kamala Harris can win, CBS News' latest polling finds.  —  But with interest rates and gas prices coming down, the number of voters saying the economy is good has ticked up.",
    "url": "https://www.cbsnews.com/news/trump-harris-poll-debate-economy-09-22-2024/"
  },
  {
    "text": "Poll: Newly popular Harris builds momentum, challenging Trump for the mantle of change  —  The latest NBC News national poll shows Harris leading Trump 49%-44%, within the margin of error, while Trump holds advantages on the economy, inflation and the border.",
    "url": "https://www.nbcnews.com/politics/2024-election/poll-newly-popular-harris-challenging-trump-change-rcna171308"
  },
  {
    "text": "Harris is changing the way Democrats target Latino voters.  It's a risk.  —  The vice president is attempting to chart a path away from identity politics.  —  Kamala Harris doesn't talk often about her Black and South Asian American identity.  She's not talking to Latino voters about theirs either.",
    "url": "https://www.politico.com/news/2024/09/22/harris-latino-voters-00180365"
  },
  {
    "text": "Vance says allegations against Mark Robinson 'aren't necessarily reality'  —  Vance told NBC Philadelphia that it's “ultimately up to Mark Robinson and North Carolina whether he's going to be their governor and whether he wants to stay in the race.”  —  LEESPORT, Pa. — Sen. JD Vance … ",
    "url": "https://www.nbcnews.com/politics/2024-election/jd-vance-says-allegations-mark-robinson-arent-necessarily-reality-rcna172122"
  },
  {
    "text": "Trump appeals to women in return to North Carolina without Mark Robinson, a top in-state supporter  —  Donald Trump returned to North Carolina on Saturday, stumping in the southern battleground state with direct appeals to women, claiming he would be a better champion for them than Vice President Kamala Harris … ",
    "url": "https://apnews.com/article/trump-mark-robinson-north-carolina-wilmington-1bc79594567860c9ffe7f44375fac847"
  },
  {
    "text": "Trump Will Stage an Emergency to Ban Jack Smith's Book Report  —  I expect, on top of everything else this week, Trump's lawyers are going to claim an emergency to try to ban Jack Smith's book report, currently due Thursday.  —  As you'll recall, after Judge Tanya Chutkan finally got … ",
    "url": "https://www.emptywheel.net/2024/09/22/trump-will-stage-an-emergency-to-ban-jack-smiths-book-report/"
  },
  {
    "text": "Kamala Harris plans to skip historic Al Smith dinner despite long-standing tradition  —  Vice President Kamala Harris will skip the historic Al Smith dinner, eschewing a decades-old campaign tradition in which presidential candidates roast each other.  —  Harris' campaign told event organizers Harris … ",
    "url": "https://www.foxnews.com/politics/kamala-harris-plans-skip-historic-al-smith-dinner-despite-long-standing-tradition-report"
  },
  {
    "text": "Kamala Harris Is the Clear Choice for President  —  One candidate has spent her career as a dedicated public servant, who believes government exists to serve the people, the other has divided the nation for his own personal gain  —  Flo Ngala for Rolling Stone  —  T",
    "url": "https://www.rollingstone.com/politics/political-commentary/kamala-harris-president-rolling-stone-endorsement-1235096166/"
  },
  {
    "text": "Over 700 high-ranking national security officials endorse Harris  —  Over 700 high-ranking national security officials have endorsed Democratic candidate Vice President Harris in her run for the White House, with some leaders expressing concerns about former President Trump's “scary authoritarian streak.”",
    "url": "https://thehill.com/homenews/4892381-national-security-officials-endorse-harris/"
  },
  {
    "text": "Lobbyists exploit massive loophole to wine and dine lawmakers, aides at fancy getaways  —  Leading the way is the nonprofit Congressional Institute, which is run by veteran Republican staffers and funded by $3 million in annual dues from private interest groups.",
    "url": "https://www.politico.com/news/2024/09/22/lobbyists-flout-ethics-rules-free-trips-00176749"
  },
  {
    "text": "Barack Obama raises $4 million for Harris at L.A. fundraiser  —  The former president is adopting an increasingly visible role on the campaign trail for his longtime friend: “I'm pushing, and I hope you are, too,” he tells donors.  —  Former president Barack Obama headlined his first solo fundraiser … ",
    "url": "https://www.washingtonpost.com/elections/2024/09/21/obama-harris-trump-fundraiser/"
  },
  {
    "text": "Feds execute search warrant on new NYPD commissioner just over a week after he was appointed  —  Federal authorities executed a search warrant at the home of NYPD interim commissioner Thomas Donlon just over a week after he took on the position, he said in a statement Saturday night.",
    "url": "https://www.cnn.com/2024/09/22/us/nypd-police-commissioner-thomas-donlon-new-york/"
  },
  {
    "text": "Springfield students suffer collateral damage over anti-immigrant conspiracy theory  —  The students of Springfield, Ohio, are caught in a mess they had nothing to do with.  —  Schools had to shut down for multiple days after 33 separate bomb threats, and two universities moved classes online … ",
    "url": "https://thehill.com/homenews/education/4890896-springfield-ohio-haitians-conspiracy-theory-trump-vance-immigration/"
  },
  {
    "text": "Trump says it's ‘too late’ after Harris agrees to Oct. 23 debate on CNN  —  The former president's comments come after Harris goaded her opponent to accept another face-off.  —  Donald Trump quashed the prospect of another presidential debate on Saturday, saying it's “too late” … ",
    "url": "https://www.politico.com/news/2024/09/21/harris-challenges-trump-to-second-debate-on-oct-23-00180362"
  },
  {
    "text": "Mass shooting in Birmingham's 5 Points South leaves 4 dead, dozens injured by gunfire  —  Gunfire erupted in Birmingham's Five Points South entertainment area Saturday night, leaving four people dead and at least 21 others injured.  —  Officer Truman Fitzgerald said the shooting happened … ",
    "url": "https://www.al.com/news/2024/09/shooting-in-birminghams-5-points-south-may-have-mass-casualties-police-say.html"
  },
  {
    "text": "Georgia Voters Are Split Over How to Strengthen Democracy  —  Charges against Trump in Atlanta, after his claims of fraud in 2020, make issue of ‘democracy’ more salient—but also divisive  —  LILBURN, Ga.—Americans in this closely divided state have heard perhaps more than others … ",
    "url": "https://www.wsj.com/politics/elections/georgia-voters-are-split-over-how-to-strengthen-democracy-40e2c755"
  },
  {
    "text": "Ballot error shuts down Montana online absentee voting system  —  When Max Himsl opened his electronic ballot on Friday, he was dismayed to see a candidate missing from the list of options.  —  Voting absentee electronically while living abroad, Himsl saw that under the options for president … ",
    "url": "https://dailyinterlake.com/news/2024/sep/20/ballot-error-shuts-down-montana-online-absentee-voting-system/"
  },
  {
    "text": "Trump Melts Down And Attacks Bill Maher And Stephanie Ruhle As Election Slips Away  —  More proof that Trump knows that the election is slipping away from him as he went off off on a rant about Bill Maher, Stephanie Ruhle, Bret Stephens, and The New York Times.  —  Trump posted on Truth Social:",
    "url": "https://www.politicususa.com/2024/09/21/trump-melts-down-and-attacks-bill-maher-and-stephanie-ruhle-as-election-slips-away.html"
  },
  {
    "text": "Wisconsin Town Voting Machine Access Challenge  —  United States of America v. Town of Thornapple  —  Lawsuit filed by U.S. Department of Justice (DOJ) against the Town of Thornapple, the Town of Lawrence, town officials and the state of Wisconsin challenging the towns' decisions to ban … ",
    "url": "https://www.democracydocket.com/cases/wisconsin-town-voting-machine-access-challenge/"
  },
  {
    "text": "Trump holding far fewer rallies than in past runs … - He's a known quantity. … - Rallies are expensive. … - He's older, and more inclined to spend his time at Mar-a-Lago.",
    "url": "https://www.axios.com/2024/09/22/trump-2024-rallies-schedule"
  }
]