[
  {
    "text": "Tens of thousands at Burning Man told to conserve water and food after heavy rains leave attendees stranded in Nevada desert  —  Tens of thousands of people attending the Burning Man festival in the Nevada desert are being told to conserve food, water and fuel as they shelter in place … ",
    "url": "https://www.cnn.com/2023/09/02/us/burning-man-storms-shelter-black-rock-city/"
  },
  {
    "text": "Burning Man 2023: Feds shut down entry, tell burners waiting to get in to go home  —  Noon update: Burning Man entry shut down for remainder of event  —  The Bureau of Land Management released a statement Saturday, saying Burning Man entry is now closed for good:",
    "url": "https://www.rgj.com/story/life/arts/burning-man/2023/09/02/burning-man-2023-rain-keeps-burners-confined-to-camps/70749751007/"
  },
  {
    "text": "DeSantis' super PAC head honcho privately admits he's spreading dirt on Ramaswamy  —  The private remarks underscore a brewing anxiety about the upstart entrepreneur turned primary foe.  —  The top strategist for Ron DeSantis' super PAC privately told donors that Vivek Ramaswamy posed … ",
    "url": "https://www.politico.com/news/2023/09/03/desantis-super-pac-ramaswamy-00113836"
  },
  {
    "text": "The leaked internal poll numbers scrambling the GOP primary  —  The DeSantis campaign is trying to shape the race with its own data.  —  Ron DeSantis' supporters were thrilled last week when a poll emerged following the first primary debate showing him bouncing up 7 points in the critical first caucus state of Iowa.",
    "url": "https://www.politico.com/news/2023/09/02/desantis-gop-primary-internal-polling-00113716"
  },
  {
    "text": "DeSantis Florida redistricting map is unconstitutional and must be redrawn, judge says  —  A Florida redistricting plan pushed by Republican Gov. Ron DeSantis violates the state constitution and is prohibited from being used for any future U.S. congressional elections since it diminishes … ",
    "url": "https://www.npr.org/2023/09/02/1197452442/desantis-florida-redistricting-map-gerrymandering-unconstitutional"
  },
  {
    "text": "Florida judge rejects state congressional map championed by DeSantis  —  A Florida judge on Saturday struck down congressional district lines for northern Florida advocated by Gov. Ron DeSantis, ruling that the Republican governor's map had improperly diluted Black voting power.",
    "url": "https://www.cnn.com/2023/09/02/politics/florida-redistricting-map-lawsuit-desantis/"
  },
  {
    "text": "Senate Republican: 'We don't know' if Trump could beat Biden in 2024  —  Sen. Mike Rounds (R-S.D.) said on Sunday he does not know if former President Trump could beat President Biden in a hypothetical 2024 general election rematch at this point in the campaign, saying that's one of his concerns.",
    "url": "https://thehill.com/blogs/blog-briefing-room/news/4185085-senate-republican-we-dont-know-if-trump-could-beat-biden-in-2024/"
  },
  {
    "text": "Ramaswamy doubles down on voting for Trump if former president is convicted  —  GOP presidential candidate Vivek Ramaswamy doubled down on his comments regarding voting for former President Trump if he is the Republican nominee in 2024, even if Trump is convicted in one of his four ongoing legal battles.",
    "url": "https://thehill.com/homenews/campaign/4185050-ramaswamy-doubles-down-on-voting-for-trump-if-former-president-is-convicted/"
  },
  {
    "text": "As Clarence Thomas faces record unpopularity, Americans want an ethics code for the Supreme Court  —  Supreme Court Justice Clarence Thomas ended a monthslong saga last week by officially disclosing trips paid for by GOP megadonor Harlan Crow.  —  The incident brought to light a key fact … ",
    "url": "https://www.cnn.com/2023/09/03/politics/supreme-court-ethics-code-clarence-thomas/"
  },
  {
    "text": "Home insurers cut natural disasters from policies as climate risks grow  —  Some of the largest U.S. insurance companies say extreme weather has led them to end certain coverages, exclude natural disaster protections and raise premiums  —  In the aftermath of extreme weather events … ",
    "url": "https://www.washingtonpost.com/business/2023/09/03/natural-disaster-climate-insurance/"
  },
  {
    "text": "President Biden: Bidenomics is working in Wisconsin.  We're investing in American workers.  —  Labor Day honors the dignity of the American worker and recognizes that Wall Street didn't build America  —  President Joe BidenMilwaukee Journal Sentinel  —  Three weeks ago … ",
    "url": "https://www.jsonline.com/story/opinion/2023/09/03/biden-economic-plan-touts-jobs-wage-increase-overtime-pay/70742157007/"
  },
  {
    "text": "Congress poised for messy September as McCarthy races to avoid government shutdown  —  GOP hardliners in the House are eager to play a game of chicken over the end-of-the-month deadline to fund federal agencies, seeking to force the White House and Senate to make a choice … ",
    "url": "https://www.cnn.com/2023/09/03/politics/congress-september-government-shutdown-kevin-mccarthy/"
  },
  {
    "text": "Biden: ‘Nobody intelligent’ can deny the impact of climate crisis  —  President Biden on Saturday said that no intelligent person can deny the impacts of climate change after the president toured storm damage in Florida from Hurricane Idalia.  —  “Nobody can deny the impact of climate crises … ",
    "url": "https://thehill.com/homenews/administration/4184642-biden-says-nobody-intelligent-can-deny-the-impact-of-climate-crisis/"
  },
  {
    "text": "What the Contradiction of Slavery Tells Us About Abortion Rights  —  One of the ironies of the American slave system was that it depended for its survival on a federal structure that left it vulnerable and unstable.  —  Within the federal union, the slave-dependent states had access … ",
    "url": "https://www.nytimes.com/2023/09/02/opinion/slavery-abortion-rights-laws.html"
  },
  {
    "text": "GOP senator says McConnell is ‘perfectly capable’ following health scares  —  Republican Sen. Mike Rounds of South Dakota said Sunday that Senate GOP Leader Mitch McConnell is “perfectly capable” of carrying out his leadership position after he froze in public for the second time in as many months.",
    "url": "https://www.cnn.com/2023/09/03/politics/mike-rounds-mitch-mcconnell-health-cnntv/"
  }
]