[
  {
    "text": "E. Jean Carroll used to be somebody  —  Once you enter Trump's world, your own world evaporates  —  E. Jean Carroll used to have a career, now she has Donald Trump.  She used to have prestige, now she has Donald Trump.  She used to have an identity, and then in 2019 she accused … ",
    "url": "https://www.washingtonpost.com/style/power/2024/01/18/e-jean-carroll-and-the-donald-trump-trials/"
  },
  {
    "text": "Donald Trump Has Chosen to Pay Millions to Trash Rule of Law  —  I have a standing complaint that reporters serially fall into Donald Trump's trap of reporting on his courtroom tantrums rather than the evidence of his fraud and crime presented therein.  But I'm going to do just that … ",
    "url": "https://www.emptywheel.net/2024/01/18/donald-trump-has-chosen-to-pay-millions-to-trash-rule-of-law/"
  },
  {
    "text": "Judge hints at delay for Trump's March trial date in federal election case  —  Judge Tanya Chutkan suggested that Trump will get additional time to prepare for trial if appellate courts reject his claims of immunity.  —  The judge overseeing the federal criminal case against Donald Trump … ",
    "url": "https://www.politico.com/news/2024/01/18/judge-hints-at-delay-for-trumps-march-trial-date-in-federal-election-case-00136403"
  },
  {
    "text": "Ga. judge in Trump case orders hearing on accusations of Willis misconduct  —  Superior Court Judge Scott McAfee also wrote in his order that Willis must respond to the accusations in writing by Feb. 2.  The accusations first came to light in a filing from one of Trump's co-defendants, former campaign aide Mike Roman.",
    "url": "https://www.washingtonpost.com/national-security/2024/01/18/judge-orders-hearing-fani-willis-misconduct-georgia-case/"
  },
  {
    "text": "Judge in Trump Georgia case orders hearing on Fani Willis misconduct accusations  —  The Georgia judge overseeing former President Trump's criminal case scheduled a hearing next month to weigh accusations that Fulton County District Attorney Fani Willis (D) hired her romantic partner as a top prosecutor on the case.",
    "url": "https://thehill.com/regulation/court-battles/4416184-trump-georgia-case-fani-willis-hearing-misconduct-accusations/"
  },
  {
    "text": "Justice Department report finds ‘cascading failures’ in response to Uvalde attack  —  A U.S. Justice Department report released Thursday on the 2022 school shooting in Uvalde, Texas, found “cascading failures” by law enforcement before, during, and after the attack that killed 19 children and two teachers.",
    "url": "https://www.npr.org/2024/01/18/1225340219/uvalde-report"
  },
  {
    "text": "The GOP Is Already Clashing Over Trump's VP Pick  —  While Trump tries to sew up the nomination, his camp is already feuding about his future running mate — and hoping it isn't Nikki Haley.  —  As the vice-presidential field continues to develop, many consider what a Nikki Haley vice presidency could mean for the GOP.",
    "url": "https://www.politico.com/news/magazine/2024/01/18/maga-nightmare-trump-loyalists-move-to-head-off-haley-vp-pick-00136282"
  },
  {
    "text": "Netanyahu says he has told US that he opposes Palestinian state in any postwar scenario  —  Israeli Prime Minister Benjamin Netanyahu says he has informed the United States that he opposes the establishment of a Palestinian state as part of any postwar scenario.",
    "url": "https://apnews.com/article/israel-hamas-war-news-01-18-2024-73d552c6e73e0dc3783a0a11b2b5f67d"
  },
  {
    "text": "No Labels alleges criminal conspiracy against 2024 presidential effort  —  No Labels, the nonpartisan group preparing to run a third-party presidential ticket, has asked the Department of Justice to investigate whether Democratic and Republican strategists are engaged in an … ",
    "url": "https://www.axios.com/2024/01/18/no-labels-criminal-conspiracy-2024-president"
  },
  {
    "text": "“Here's why that's bad news for Biden”: A chat with NYT Pitchbot  —  The legend himself speaks to Public Notice.  —  ∙ Paid … If you're active on twitter — or were before Elon Musk started making everyone more progressive than Steve Bannon think about deleting their account … ",
    "url": "https://www.publicnotice.co/p/doug-balloon-new-york-times-pitchbot-interview"
  },
  {
    "text": "Fox News host praises Kamala Harris rhetoric on abortion  —  Fox News host Kayleigh McEnany heaped praise on Vice President Harris for her answers to questions on abortion during an appearance on ABC's “The View” on Wednesday.  —  During her appearance on the daytime table talk program … ",
    "url": "https://thehill.com/homenews/media/4414335-fox-news-mcenany-praises-harris-abortion/"
  },
  {
    "text": "Introducing the New England DEI Patriots  —  If racism is America's original sin, then Democrats and others on the Left are the biblical Babylonians of the 21st century.  For a group of people who claim to want racism gone, they wickedly do everything possible to make sure it remains alive — or at least the insinuation of it.",
    "url": "https://www.washingtonexaminer.com/opinion/beltway-confidential/2803337/introducing-the-new-england-dei-patriots/"
  },
  {
    "text": "Loose bolts open door to racism  —  On January 5th, a Boeing 737 Max 9 aircraft operated by Alaska Airlines was forced to make an emergency landing after a door panel flew off mid-air.  No deaths were reported, but multiple passengers required medical attention, officials said.",
    "url": "https://popular.info/p/loose-bolts-open-door-to-racism"
  },
  {
    "text": "Florida bill could lead to ban on pride flags in schools, government buildings  —  Florida lawmakers are mulling legislation that would ban gay pride flags and flags representing other political movements from flying on public properties, including schools and college campuses.",
    "url": "https://thehill.com/homenews/state-watch/4415582-florida-bill-ban-pride-flags-schools-government-buildings/"
  },
  {
    "text": "Operation Marg Bar Sarmachar  —  This morning Pakistan undertook a series of highly coordinated and specifically targeted precision military strikes against terrorist hideouts in Siestan-o-Baluchistan province of Iran.  A number of terrorists were killed during the Intelligence-based operation - codenamed *'Marg Bar Sarmachar'*.",
    "url": "https://mofa.gov.pk/press-releases/operation-marg-bar-sarmachar"
  },
  {
    "text": "Trump warns campaigns: Do not hire ex-DeSantis operative Jeff Roe  —  The admonition is another example of the former president's penchant for punishing people perceived as disloyal.  —  Former President Donald Trump and people in his inner circle have told down-ballot Republican candidates … ",
    "url": "https://www.politico.com/news/2024/01/18/trump-jeff-roe-republican-strategist-00136240"
  },
  {
    "text": "Spelman College to receive $100 million, largest single donation to an HBCU  —  Billionaires Ronda Stryker and William Johnston will donate $100 million to the women's college.  —  Spelman College in Atlanta will receive the largest single financial donation ever made to a historically Black college … ",
    "url": "https://www.nbcnews.com/news/nbcblk/spelman-college-donation-100-million-hbcu-rcna134515"
  },
  {
    "text": "United States of Ozempic: Where anti-obesity drugs are taking off  —  For every 1,000 people in Kentucky, roughly 21 were prescribed a drug that belongs to a buzzy class of diabetes and anti-obesity medications last year — the highest rate of any state, according to insurance claims data provided … ",
    "url": "https://www.axios.com/2024/01/18/ozempic-wegovy-weight-loss-drugs-states-map"
  },
  {
    "text": "This GOP Rep.'s Anti-Abortion Stances Keep Vanishing From Her Website  —  Rep. Monica De La Cruz (R-TX) initially ran for Congress with an unabashed anti-abortion stance.  Ever since then, abortion has quietly been disappearing from her campaign website.",
    "url": "https://www.thedailybeast.com/rep-monica-de-la-cruzs-anti-abortion-stances-keep-vanishing-from-her-website"
  },
  {
    "text": "Florida Governor Ron DeSantis On The Border Wall v. The Supplemental As Proposed; His Path To Super Tuesday  —  Florida Governor Ron DeSantis joined me this AM:  —  Audio:  —  01-18hhs-desantis  —  Transcript:  —  HH: Governor Ron DeSantis of Florida joins me.  Good morning, Governor.",
    "url": "https://hughhewitt.com/florida-governor-ron-desantis-on-the-border-wall-v-the-supplemental-as-proposed-his-path-to-super-tuesday"
  },
  {
    "text": "Metaphors Journalists Live By (Part II)  —  The conclusion of our story of the bad things that can happen when journalists refuse to criticize themselves  —  Demonstrators hold up signs during a protest against the election of Donald Trump, on Fifth Avenue near Trump Tower, November 12, 2016, in New York.",
    "url": "https://prospect.org/politics/2024-01-18-metaphors-journalists-live-by-part-ii/"
  }
]