[
  {
    "text": "This Is Who Melania Trump Is Reportedly Pushing for Her Husband's VP, and It's Not Surprising  —  In less than six weeks, voting is set to start in the 2024 Republican primary, and the only top contender is former President Trump.  —  So the only question remains: who will be his vice president pick?",
    "url": "https://townhall.com/tipsheet/saraharnold/2023/12/07/this-is-the-person-melania-trump-is-reportedly-pushing-for-her-husbands-vp-and-its-not-surprising-n2632145"
  },
  {
    "text": "Where Are All the Anti-Trump Republicans?  —  A vast array of GOP power brokers detest and disdain the former president.  So why are they keeping so quiet?  —  Here's a portrait of how Donald Trump reclaims power.  —  At a Hoover Institution conference here last week … ",
    "url": "https://www.politico.com/news/magazine/2023/12/08/the-stop-trump-effort-has-been-abysmal-00130751"
  },
  {
    "text": "GOP's Brutal Math: Trump Could Secure Nomination Before Conviction  —  Looking at the primary schedule, Republicans see the party handcuffing itself to a candidate on the verge of politically toxic criminal convictions. … ‘People need to wake up’  —  There's a scenario many Republicans are dreading … ",
    "url": "https://www.thedailybeast.com/gops-brutal-math-donald-trump-could-secure-2024-nomination-before-criminal-conviction"
  },
  {
    "text": "‘I Am Sorry’: Harvard President Gay Addresses Backlash Over Congressional Testimony on Antisemitism  —  Harvard President Claudine Gay apologized for her remarks at the end of her congressional testimony, which sparked fierce national criticism and led the leadership of Harvard Hillel … ",
    "url": "https://www.thecrimson.com/article/2023/12/8/gay-apology-congressional-remarks/"
  },
  {
    "text": "What to know about Trump-appointed judge in Hunter Biden tax case  —  Mark Scarsi, a U.S. district court judge, has been assigned to the case involving a federal indictment against President Biden's son, Hunter Biden.  —  Scarsi is based in the Central District of California and oversees Los Angeles.",
    "url": "https://thehill.com/regulation/court-battles/4350050-what-to-know-trump-appointed-judge-hunter-biden-tax-case/"
  },
  {
    "text": "Hunter Biden indicted on nine tax charges in special counsel probe  —  WASHINGTON (AP) — Hunter Biden was indicted on nine tax charges in California as a special counsel investigation into the business dealings of President Joe Biden's son intensifies against the backdrop of the 2024 election.",
    "url": "https://apnews.com/article/hunter-biden-tax-charges-special-counsel-75b2aa05f247535677454ff2dfa7c71f"
  },
  {
    "text": "Woman arrested for pouring gasoline, trying to burn down Martin Luther King Jr.'s birth home  —  ATLANTA — Atlanta police are investigating after a woman attempted to burn down Dr. Martin Luther King Jr.'s birth home.  —  Police told Channel 2 Action News they were called to King's birth home … ",
    "url": "https://www.wsbtv.com/news/local/police-investigating-after-person-tries-vandalize-martin-luther-king-jrs-home-near-king-center/NEBC6LEK4RABJNRYEKTFV6X7AU/"
  },
  {
    "text": "Inside Trump's Plot To Corrupt the 2024 Election With ‘Garbage’ Data  —  For more than a decade, election officials have relied on a system to reduce fraud and boost voter registration.  Trump's cronies are sabotaging it, state by state — and trying to replace it with something more MAGA",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-election-plans-corrupt-voter-registration-eric-eagleai-1234920083/"
  },
  {
    "text": "FACT SHEET: President Biden Announces Billions to Deliver World-Class High-Speed Rail and Launch New Passenger Rail Corridors Across the Country  —  $8.2 Billion from the President's Investing in America Agenda to Deliver Transformative Passenger Rail in America",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/12/08/fact-sheet-president-biden-announces-billions-to-deliver-world-class-high-speed-rail-and-launch-new-passenger-rail-corridors-across-the-country/"
  },
  {
    "text": "RNC officially bows out of hosting primary debates  —  The organization steps aside as television networks plan more early state debates.  —  The Republican National Committee is pausing its participation in 2024 GOP primary debates, the organization decided Friday.",
    "url": "https://www.politico.com/news/2023/12/08/rnc-officially-bows-out-of-hosting-primary-debates-for-now-00130857"
  },
  {
    "text": "White House Disavows U.S. Islamic Group After Leader's Oct. 7 Remarks  —  The director of the Council on American-Islamic Relations said in a speech that he was “was happy to see” Palestinians break out of Gaza on the day Hamas attacked Israel.  —  The White House disavowed … ",
    "url": "https://www.nytimes.com/2023/12/08/us/politics/white-house-cair-nihad-awad.html"
  },
  {
    "text": "Federal appeals court upholds but narrows the gag order in Trump's D.C. election interference case  —  The U.S. Court of Appeals of the District of Columbia found some of U.S. District Judge Tanya Chutkan's order were too broad.  —  A federal appeals court in Washington … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/federal-appeals-court-upholds-narrows-gag-order-trumps-dc-election-int-rcna128778"
  },
  {
    "text": "Wharton board calls on Penn president Liz Magill to resign  —  University of Pennsylvania President Liz Magill is being asked to resign by the board of Penn's Wharton business school, according to a letter obtained by Axios. … - Earlier today, Axios reported that a wealthy donor pulled … ",
    "url": "https://www.axios.com/2023/12/08/penn-antisemitism-wharton-magill-resign"
  },
  {
    "text": "GOP lawmaker: Ousted aides targeted my daughter for OnlyFans account  —  Rep. Brandon Williams, who represents a battleground seat, says his altercation stemmed from a threat to expose his daughter's OnlyFans account.  —  A Republican member of Congress is alleging that a former top aide spearheaded a … ",
    "url": "https://www.politico.com/news/2023/12/08/brandon-williams-interview-video-former-aides-00130713"
  },
  {
    "text": "Retail Group Retracts Startling Claim About ‘Organized’ Shoplifting  —  The National Retail Federation had said that nearly half of the industry's $94.5 billion in missing merchandise in 2021 was the result of organized theft.  It was likely closer to 5 percent.",
    "url": "https://www.nytimes.com/2023/12/08/business/organized-shoplifting-retail-crime-theft-retraction.html"
  },
  {
    "text": "Musk's Scandinavian woes deepen as Tesla loses Swedish court case, Finnish union joins port blockade  — Tesla is facing mounting pressure across Scandinavian countries to sign a collective bargaining agreement with employees in Sweden.  — Finnish transport workers' union AKT … ",
    "url": "https://www.cnbc.com/2023/12/08/musks-scandinavian-woes-deepen-as-tesla-loses-swedish-court-case.html"
  },
  {
    "text": "Police have recovered video of Florida GOP chair and alleged victim in rape investigation  —  Disclaimer: This story contains explicit sexual content and details involving an alleged sexual assault.  —  Sarasota police have recovered a cell phone video taken by Florida GOP chairman Christian Ziegler … ",
    "url": "https://flcga.org/police-have-recovered-video-of-florida-gop-chair-and-alleged-victim-in-rape-investigation/"
  },
  {
    "text": "Sheriff's Deputy Killed in Car Chase Involving U.S. Senator's Son  —  Ian Cramer, the son of Senator Kevin Cramer of North Dakota, led police on a car chase in North Dakota on Wednesday.  —  The son of a United States senator was arrested on felony charges after he led police in North Dakota … ",
    "url": "https://www.nytimes.com/2023/12/07/us/kevin-kramer-son-manslaughter.html"
  }
]