[
  {
    "text": "Trump Suggests Musk Effort at Treasury Found Irregularities  — There could be a problem with Treasuries, Trump says  — Trump made comments amid DOGE scrutiny of government payments  —  President Donald Trump suggested that Elon Musk's government efficiency team has found irregularities … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-09/trump-suggests-musk-found-irregularities-in-us-treasuries"
  },
  {
    "text": "Trump says US may have less debt than thought because of fraud  —  U.S. President Donald Trump on Sunday said the United States may carry less debt than thought and said it could be because of fraud related to debt payments.  —  Trump made his comments to reporters aboard Air Force One while flying to the Super Bowl in New Orleans.",
    "url": "https://www.reuters.com/markets/us/trump-says-us-might-have-less-debt-than-thought-2025-02-09/"
  },
  {
    "text": "Trump Says Some Treasury Notes May Not Be Real  —  I suspect this will just end up being something Old Man Trump said on a plane and we won't hear about it again.  But after recents, who are we kidding?  Anything is possible.  On Air Force One today en route to the Super Bowl Trump told reporters … ",
    "url": "https://talkingpointsmemo.com/edblog/trump-says-some-treasury-notes-may-not-be-real"
  },
  {
    "text": "Trump Plans to Impose 25% Tariffs on Steel, Aluminum Imports  — Duties to apply to imports from all countries, president says  — President to announce reciprocal tariffs in coming days  —  Trade wars, tariff threats and logistics shocks are upending businesses and spreading volatility.",
    "url": "https://www.bloomberg.com/news/articles/2025-02-09/trump-plans-to-announce-25-steel-aluminum-tariffs-on-monday"
  },
  {
    "text": "Vance and Musk question the authority of the courts as Trump's agenda faces legal pushback  —  Top Trump administration officials are openly questioning the judiciary's authority to serve as a check on executive power as the new president's sweeping agenda faces growing pushback from the courts.",
    "url": "https://apnews.com/article/trump-judiciary-musk-separation-of-powers-balance-checks-069c169ea1ddf6eea76f502d544c4c16"
  },
  {
    "text": "Vance Says 'Judges Aren't Allowed to Control' Trump's ‘Legitimate Power’  —  The declaration by the vice president came as court orders have temporarily blocked parts of the Trump administration's agenda.  —  Vice President JD Vance declared on Sunday that “judges aren't allowed to control … ",
    "url": "https://www.nytimes.com/2025/02/09/us/politics/vance-trump-federal-courts-executive-order.html"
  },
  {
    "text": "Trump Orders Treasury Secretary to Stop Minting Pennies  —  President Trump said that the coins cost more to produce than their face value.  —  President Trump said on Sunday night that he had ordered the Treasury secretary to stop producing new pennies, a move that he said would help reduce unnecessary government spending.",
    "url": "https://www.nytimes.com/2025/02/09/us/politics/trump-stop-minting-pennies.html"
  },
  {
    "text": "Trump says he has directed U.S. Treasury to stop minting new pennies, citing rising cost  —  The U.S. Mint reported losing $85.3 million in the 2024 fiscal year, which ended in September, on the nearly 3.2 billion pennies it produced.  —  / Source: The Associated Press",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-treasury-stop-minting-penny-rcna191421"
  },
  {
    "text": "Inside the House GOP clash over tax cuts  —  Hardliners are squaring off against their top tax writer as Republicans try to assemble a package President Donald Trump's priorities.  —  Prominent House Republicans are privately warring over how to advance tax cuts that are expiring … ",
    "url": "https://www.politico.com/news/2025/02/09/house-gop-continues-squabble-budget-costs-critical-week-00203302"
  },
  {
    "text": "CFPB to Close Office After Vought Tells Staff to Halt All Supervision  —  In an email Sunday, the agency's chief operating officer says headquarters will be closed in the week ahead  —  President Trump's newly installed Consumer Financial Protection Bureau chief Russell Vought is closing … ",
    "url": "https://www.wsj.com/finance/regulation/vought-moves-to-defang-cfpb-telling-staff-to-halt-all-supervision-19f1ac9f"
  },
  {
    "text": "In Breaking USAID, the Trump Administration May Have Broken the Law  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  It was the week President Donald Trump had signed a sweeping executive order shutting off … ",
    "url": "https://www.propublica.org/article/usaid-trump-musk-destruction-may-have-broken-law"
  },
  {
    "text": "Prebunking Elon Musk's Super Bowl Propaganda  —  Perception is reality.  —  I normally don't write on Sundays, but I have seen some alarming rumors that Elon Musk has purchased a $40 million Super Bowl ad in which he will expose the “fraud” and “corruption” at USAID.  (See here and here.)",
    "url": "https://asharangappa.substack.com/p/prebunking-elon-musks-super-bowl"
  },
  {
    "text": "Court Blocks U.S. From Sending 3 Venezuelan Migrants to Guantánamo  —  The men, who are detained in New Mexico, say they “fit the profile” of the type of migrants the Trump administration has started sending to the Navy base in Cuba.  —  A federal judge barred the U.S. government … ",
    "url": "https://www.nytimes.com/2025/02/09/us/politics/venezuelan-migrants-lawsuit-guantanamo.html?unlocked_article_code=1.v04.0yOR.0DOfAeJr3j5e&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Musk calls for annual firing of judges after blocked DOGE access at Treasury  —  Tech billionaire Elon Musk called for the annual firing of judges following an early Saturday decision from a judge stating that the Treasury Department should bar access to its payment systems to anyone besides … ",
    "url": "https://thehill.com/policy/technology/5135170-musk-annual-firing-judges-doge/"
  },
  {
    "text": "More Than 800K Have Lost $2B on Trump's Meme Coin  —  The token's price has crashed from $75 to $17.  —  ‘Thug’: Richard Gere Drags Trump in Award Acceptance Speech  —  ‘MILLIONAIRE CLOWNS’  —  “The millionaire clowns surrounding Trump are immature and narcissistic—a deadly mix,” Gere said.",
    "url": "https://www.thedailybeast.com/more-than-800k-have-lost-2b-on-trumps-meme-coin/"
  },
  {
    "text": "36 Hours After Russell Vought Took Over Consumer Bureau, He Shut Its Operations  —  The agency had been one of Wall Street's most feared regulators, with the power to issue rules on mortgages, credit cards, student loans and other areas affecting Americans' financial lives.",
    "url": "https://www.nytimes.com/2025/02/09/business/vought-cfpb-musk-trump.html"
  },
  {
    "text": "Trump, CBS, and ‘News Distortion’  —  The FCC opens a docket on a Kamala Harris interview, but for what?  —  President Trump has spent months howling that CBS should lose its broadcast license, because its editing of an interview with Kamala Harris amid the 2024 campaign was, as he put it Thursday … ",
    "url": "https://www.wsj.com/opinion/trump-cbs-and-news-distortion-broadcast-license-kamala-harris-interview-6591835d?st=b1QyMd&reflink=article_copyURL_share"
  }
]