[
  {
    "text": "Trump's Deportation Plan Is Said to Start Next Week in Chicago  —  The size of the planned immigration raids is unclear, but they would be the opening step in the president-elect's goal of overseeing the largest deportation program in history.  —  The incoming Trump administration intends to carry out … ",
    "url": "https://www.nytimes.com/2025/01/17/us/politics/trump-immigration-raids-chicago.html"
  },
  {
    "text": "Trump to Begin Large-Scale Deportations Tuesday  —  Chicago will be early target and the government will send as many as 200 officers to carry out the operation, according to people familiar with the planning  —  The incoming Trump administration is planning a large-scale immigration raid … ",
    "url": "https://www.wsj.com/politics/policy/trump-to-begin-large-scale-deportations-tuesday-e1bd89bd?st=47HCM3&ref=paydayreport.com"
  },
  {
    "text": "Trump says he will ‘most likely’ give TikTok a 90-day extension to avoid a ban  —  Trump spoke to NBC News' Kristen Welker in an exclusive phone interview Saturday, discussing his plans on what to do about the popular social media app.  —  President-elect Donald Trump told NBC News' … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-likely-give-tiktok-90-day-extension-avoid-ban-rcna188258"
  },
  {
    "text": "Trump ‘Most Likely’ To Give TikTok 90-Day Reprieve, NBC Says  — President-elect has indicated he wants to avoid app shutdown  — Trump tells NBC he'll probably announce decision on Monday  —  President-elect Donald Trump said he will “most likely” give TikTok a 90-day reprieve … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-18/trump-will-most-likely-give-tiktok-90-day-extension-nbc-says"
  },
  {
    "text": "Trump launches meme coin, apparently makes more than $25 billion overnight … - It also speaks to the nature of the crypto industry that someone could have $25 billion worth of something that literally did not exist 24 hours previously. … - His website bills it as “the only official Trump meme.”",
    "url": "https://www.axios.com/2025/01/18/trump-meme-coin-25-billion"
  },
  {
    "text": "Curtis Yarvin Says Democracy Is Done.  Powerful Conservatives Are Listening.  —  Philip Montgomery for The New York Times  —  For a long time, Curtis Yarvin, a 51-year-old computer engineer, has written online about political theory in relative obscurity.",
    "url": "https://www.nytimes.com/2025/01/18/magazine/curtis-yarvin-interview.html?unlocked_article_code=1.qE4.g1_N.MPg0zn-z3kN-&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Marc Andreessen Seems to Think Hillary Clinton Was Actually President  —  The New York Times made a sneaky edit to its own transcript to make Andreessen sound more coherent. … Marc Andreessen, the billionaire tech investor who co-founded Netscape, has recently been making the rounds … ",
    "url": "https://gizmodo.com/marc-andreessen-seems-to-think-hillary-clinton-was-actually-president-2000552062"
  },
  {
    "text": "State Supreme Court Candidate Wants Military Absentee Votes Tossed.  Years Earlier, That's How He Voted.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up for Dispatches, a newsletter that spotlights wrongdoing around the country, to receive our stories in your inbox every week.",
    "url": "https://www.propublica.org/article/jefferson-griffin-military-absentee-votes-north-carolina-supreme-court"
  },
  {
    "text": "“A troubling trend”: Experts say Republicans are continuing to undermine democracy in North Carolina  —  Jefferson Griffin, a Republican state Supreme Court candidate, is refusing to accept his November loss  —  North Carolina Appeals Court Judge Jefferson Griffin's legal effort to contest … ",
    "url": "https://www.salon.com/2025/01/18/a-troubling-trend-experts-say-are-continuing-to-undermine-democracy-in-north-carolina/"
  },
  {
    "text": "Canada Prepares for Trump Tariff Threat With Three-Stage Plan  —  Canadian officials are preparing retaliatory measures if the new U.S. administration imposes tariffs on Canadian imports.  —  Orange juice from Florida.  Whiskey from Tennessee.  Peanut butter from Kentucky.",
    "url": "https://www.nytimes.com/2025/01/17/world/canada/canada-trump-tariffs.html?unlocked_article_code=1.qE4.CZVk.mWWEtM54elN3&smid=bs-share"
  },
  {
    "text": "Shove the Presidency Down Trump's Throat  —  The most recent entry in the “good advice for Democrats” canon comes from occasional TNR contributor and Bulwark writer Jonathan V. Last, who wrote, “The job of the Democratic party comes in two parts.  First: Do not help Republicans.  Not in any way.",
    "url": "https://newrepublic.com/post/190337/trump-second-term-democrats-respond"
  },
  {
    "text": "Support for Trump's Policies Exceeds Support for Trump  —  A new poll found the public is sympathetic to the president-elect's plans to deport migrants and reduce America's presence overseas.  —  Many Americans who otherwise dislike President-elect Donald J. Trump share his bleak assessment … ",
    "url": "https://www.nytimes.com/2025/01/18/us/politics/trump-policies-immigration-tariffs-economy.html?unlocked_article_code=1.qE4.Axo4.bt2hEdcb0Ofc&smid=url-share"
  },
  {
    "text": "Donald Trump is returning to the White House vowing to seek retribution.  Those in his sights are worried both about him — and his supporters.  —  President-elect Donald J. Trump has promised to punish adversaries, particularly those involved in his prosecutions and the congressional investigation … ",
    "url": "https://www.nytimes.com/2025/01/18/us/politics/trump-officials-retribution.html?unlocked_article_code=1.qE4.VLsn.Ek59ylINDYjP&smid=bs-share"
  },
  {
    "text": "Israel to free up to 1,904 Palestinians in 1st stage of hostage deal, including killers  —  Figures comprises 737 jailed Palestinians, 1,167 Gazans detained in ground op; notorious terrorist Zakaria Zubeidi, others responsible for the murder of dozens, to be freed",
    "url": "https://www.timesofisrael.com/israel-to-free-1904-palestinians-in-1st-stage-of-hostage-deal-including-killers/"
  },
  {
    "text": "What Border Crisis?  Mexican Migrant Shelters Are Quiet Ahead of Trump  —  Ahead of the inauguration, migrant shelters south of the Rio Grande are far from full, a reflection of the tougher measures imposed on both sides of the border.  —  Ahead of the inauguration, migrant shelters south … ",
    "url": "https://www.nytimes.com/2025/01/18/world/americas/migrants-trump-inauguration-border.html"
  },
  {
    "text": "The Real Story Behind Mike Turner's Firing  —  The speaker's decision to cashier his Intelligence chair wasn't about Donald Trump.  —  When Speaker Mike Johnson summarily fired House Intelligence Chair Mike Turner this week, everyone assumed it was about Donald Trump.",
    "url": "https://www.politico.com/news/magazine/2025/01/18/mike-johnson-mike-turner-firing-column-00199129"
  },
  {
    "text": "Trump Brings a Chill to Washington  —  For many moons over the Potomac, the protocol for inaugurations has been as immutable and dignified as the words of presidents engraved on their monuments.  —  Leaders and luminaries would put aside their grudges and come together to celebrate democracy.",
    "url": "https://www.nytimes.com/2025/01/18/opinion/trump-inauguration-indoors-cold.html"
  },
  {
    "text": "How moving Trump's inauguration inside spurred an all-out scramble  —  The sudden weather-induced change forced a scramble for hundreds of thousands of people who had spent months planning for the swearing-in of the nation's 47th president.  —  President-elect Donald Trump on Friday ordered … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/01/17/why-trump-inauguration-moved-indoors-capitol-rotunda-extreme-cold/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3MDkwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4NDcyMzk5LCJpYXQiOjE3MzcwOTAwMDAsImp0aSI6ImFjMjQ5MTk3LWYwN2ItNDNiNS1hOWJhLTc0ODA5NGQ2MmIxMCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS8yMDI1LzAxLzE3L3doeS10cnVtcC1pbmF1Z3VyYXRpb24tbW92ZWQtaW5kb29ycy1jYXBpdG9sLXJvdHVuZGEtZXh0cmVtZS1jb2xkLyJ9.xPLtkG3VmpJZ9tnEnG631S1lWhNfLmYRpBLi1Psj8Nc&itid=gfta"
  }
]