[
  {
    "text": "DeSantis Campaign Uses Fake Churchill Quote in Final Message  —  The International Churchill Society once referred to it as “a double misquote” in a blog post on the same set of words.  —  The Ron DeSantis large language model appeared to hallucinate on Sunday, with the campaign running … ",
    "url": "https://www.thedailybeast.com/desantis-campaign-posts-fake-churchill-quote-in-final-message"
  },
  {
    "text": "‘A total failure to launch’: Why Ron DeSantis was doomed from the start  —  Muddled messages, hiring too many staffers and even a puzzle — how it all went wrong for DeSantis' presidential bid.  —  Iowa was supposed to be make-or-break for Ron DeSantis.  —  The Florida governor essentially moved … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-campaign-doomed-puzzle-rcna132688"
  },
  {
    "text": "Ron DeSantis ends presidential campaign, endorses Trump  —  Florida Gov. Ron DeSantis is ending his once-promising presidential campaign, which steadily deflated as he struggled to connect with voters and convince Republicans to swap Donald Trump for a younger, more disciplined champion of his ideas.",
    "url": "https://www.washingtonpost.com/politics/2024/01/21/ron-desantis-drops-out/"
  },
  {
    "text": "What DeSantis suspending his campaign could mean for Haley  —  GOP Presidential candidate and former UN Ambassador Nikki Haley shares that this is the race she has been hoping for after Ron DeSantis announced his 2024 campaign suspension.  NBC News' Ali Vitali explains how the suspension will affect the Haley campaign moving forward.",
    "url": "https://www.nbcnews.com/now/video/what-desantis-suspending-his-campaign-could-mean-for-haley-202588229713"
  },
  {
    "text": "Trump hints at VP pick: 'People won't be that surprised'  —  Former President Trump on Saturday suggested he has his pick for vice president and hinted people will not “be that surprised” by his choice of running mate.  —  Asked by Fox News chief political anchor Brett Baier during a pull aside … ",
    "url": "https://thehill.com/homenews/campaign/4420397-trump-hints-at-vp-pick-people-wont-be-that-surprised/"
  },
  {
    "text": "Ron DeSantis ends his struggling presidential bid before New Hampshire and endorses Donald Trump  —  Florida Gov. Ron DeSantis suspends his presidential campaign  —  Florida Gov. Ron DeSantis suspended his Republican presidential campaign on Sunday, ending his 2024 White House bid … ",
    "url": "https://apnews.com/article/ron-desantis-250c8ed4b49843350e258f0c2754c8ba"
  },
  {
    "text": "Ron DeSantis Drops Out of 2024 Presidential Race and Endorses Trump  —  The Florida governor, who once appeared to be Donald Trump's most daunting challenger, ran a costly, turbulent campaign that failed to catch on with Republican voters.  —  Gov. Ron DeSantis of Florida suspended his campaign … ",
    "url": "https://www.nytimes.com/2024/01/21/us/politics/desantis-drops-out.html"
  },
  {
    "text": "CNN Poll: Trump's lead over Haley widens to double digits in New Hampshire  —  The race for the New Hampshire Republican presidential primary appears to be former President Donald Trump's to lose, according to a new CNN poll conducted by the University of New Hampshire following Trump's 30-point win in Iowa's caucuses last week.",
    "url": "https://www.cnn.com/2024/01/21/politics/new-hampshire-primary-poll-trump-haley-desantis/"
  },
  {
    "text": "Trump ‘very honored’ by DeSantis endorsement after Florida governor suspends presidential run  —  ‘Very honored to have his endorsement’  —  Former President Trump said he is “very honored” by Florida Gov. Ron DeSantis' endorsement, telling Fox News Digital he is looking forward “to working together with him to beat Joe Biden.”",
    "url": "https://www.foxnews.com/politics/trump-very-honored-desantis-endorsement-florida-governor-suspends-presidential-run"
  },
  {
    "text": "Trump Leads Haley in Final CNN/UNH New Hampshire Primary Poll 1/21/2024  —  Former President Donald Trump leads former South Carolina Governor Nikki Haley by 11 percentage points in New Hampshire's first in the nation presidential primary.  Haley holds a significant lead among undeclared … ",
    "url": "https://scholars.unh.edu/survey_center_polls/780/"
  },
  {
    "text": "In Judge Kaplan's court, Trump plays with fire  —  A misbehaving defendant claims to want a showdown Monday with a judge who has a unique track record on contempt  —  In the high-stakes world of presidential trials, there are no judges like Lewis A. Kaplan.",
    "url": "https://www.washingtonpost.com/national-security/2024/01/21/trump-carroll-judge-kaplan-witness/"
  },
  {
    "text": "Dean Phillips Floats a No Labels Bid if 2024 Is Trump vs. Biden  —  The Minnesota Democrat, currently challenging President Biden, said he would consider running on the ticket of the centrist group if he thought Mr. Biden would lose to Donald Trump.  —  Representative Dean Phillips of Minnesota … ",
    "url": "https://www.nytimes.com/2024/01/20/us/politics/dean-phillips-no-labels-biden.html"
  },
  {
    "text": "Fire erupts at Russia's Novatek Baltic Sea terminal after explosions heard  —  Novatek (NVTK.MM), Russia's largest liquefied natural gas producer, said on Sunday it had been forced to suspend some operations at a huge Baltic Sea export terminal due to a fire started by what Ukrainian media said was a drone attack.",
    "url": "https://www.reuters.com/world/fire-erupts-russias-novatek-baltic-sea-terminal-after-explosions-heard-2024-01-21/"
  },
  {
    "text": "‘America Is Under Attack’: Inside the Anti-D.E.I. Crusade  —  In late 2022, a group of conservative activists and academics set out to abolish the diversity, equity and inclusion programs at Texas' public universities.  —  They linked up with a former aide to the state's powerful lieutenant governor … ",
    "url": "https://www.nytimes.com/interactive/2024/01/20/us/dei-woke-claremont-institute.html"
  },
  {
    "text": "US support for Ukraine: The difference between victory and defeat  —  Ukrainians will continue to fight Russian forces that have been invading, occupying and bombing their country not just since Russian President Vladimir Putin launched his full-scale invasion in February 2022 but since … ",
    "url": "https://thehill.com/opinion/4420156-us-support-for-ukraine-the-difference-between-victory-and-defeat/"
  }
]