[
  {
    "text": "Suozzi wins New York special election, replacing George Santos  —  The Democrat prevailed in a race that centered heavily on immigration  —  Democrat Tom Suozzi won a hotly contested special election for Congress on Tuesday, the Associated Press projected, retaking a seat in suburban New York … ",
    "url": "https://www.washingtonpost.com/elections/2024/02/13/new-york-district-3-special-election-george-santos/"
  },
  {
    "text": "Democrats flip Santos's New York House seat in high-stakes special election  —  Former Rep. Tom Suozzi (D) has won back his old seat in the House, giving Democrats a critical pickup that will further narrow the GOP House majority, according to a projection from Decision Desk HQ.",
    "url": "https://thehill.com/homenews/campaign/4465973-tom-suozzi-democrats-mazi-pillip-george-santos-new-york/"
  },
  {
    "text": "Playbook: Why Ukraine aid is headed nowhere fast  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  SUOZZILAND — After a failed governor run and a second chance granted by the grace of GEORGE SANTOS, veteran New York Democrat TOM SUOZZI is headed … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/02/14/why-ukraine-aid-is-headed-nowhere-fast-00141363"
  },
  {
    "text": "New York 3rd Congressional District Special Election Results  —  The special House election to replace George Santos in New York is a tossup with unusually high stakes — both for the immediate balance of power in the House and November's general elections.  It pits Mazi Pilip … ",
    "url": "https://www.nytimes.com/interactive/2024/02/13/us/elections/results-new-york-us-house-3-special.html"
  },
  {
    "text": "NY-03 gives Republicans lots to worry about  —  Tom Suozzi's victory highlights GOP weakness and D strengths. … Much pre-election hype suggested the NY-03 special to replace lying grifting weirdo George Santos was going to be a nail biter.  In the event, though, it wasn't that close.",
    "url": "https://www.publicnotice.co/p/tom-suozzi-ny-03-pilip-loss-2024-takeaways"
  },
  {
    "text": "Lindsey Graham, a longtime foreign policy hawk, bows to Trump on Ukraine  —  The shift sends another warning sign to U.S. allies about the isolationist posture spreading within the Republican Party  —  Last May, Lindsey Graham (R-S.C.) visited Ukrainian President Volodymyr Zelensky in Kyiv … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/14/lindsey-graham-ukraine-trump/"
  },
  {
    "text": "February 13, 2024  —  “History is watching,” President Joe Biden said this afternoon.  He warned “Republicans in Congress who think they can oppose funding for Ukraine and not be held accountable” that “[f]ailure to support Ukraine at this critical moment will never be forgotten.”",
    "url": "https://heathercoxrichardson.substack.com/p/february-13-2024"
  },
  {
    "text": "Statement from President Joe Biden on House GOP's Baseless Impeachment of Secretary Mayorkas  —  History will not look kindly on House Republicans for their blatant act of unconstitutional partisanship that has targeted an honorable public servant in order to play petty political games.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/02/13/statement-from-president-joe-biden-on-house-gops-baseless-impeachment-of-secretary-mayorkas/"
  },
  {
    "text": "Lara Trump says she'd spend ‘every single penny’ of RNC funds to elect father-in-law  —  Lara Trump on Tuesday doubled down on her support for her father-in-law, former President Trump, vowing to spend “every single penny” of Republican National Committee (RNC) funds to reelect him to the White House.",
    "url": "https://thehill.com/homenews/campaign/4467232-lara-trump-spend-rnc-funds-to-elect-donald-trump/"
  },
  {
    "text": "High School Girls Basketball Team Quits After Crowd Allegedly Spews Racial Slurs  —  School officials in Scarsdale and East Ramapo have announced an investigation into the incident.  —  A high school girls' basketball game in Scarsdale, New York came to an early finish on Saturday … ",
    "url": "https://www.thedailybeast.com/high-school-girls-basketball-team-quits-after-crowd-spews-racial-slurs-report-says"
  },
  {
    "text": "Racial slurs spewed at Scarsdale v. East Ramapo girls basketball game, officials say  —  Scarsdale and East Ramapo school officials are investigating a reported racially charged incident during a Feb. 10 girls basketball game at Scarsdale.  It's the latest investigation into slurs being spewed during a Section 1 sporting event.",
    "url": "https://www.lohud.com/story/news/local/westchester/scarsdale/2024/02/13/racial-slurs-scarsdale-east-ramapo-ny-basketball-game-reported-investigated/72570529007/"
  },
  {
    "text": "GOP Congressman Spews Racist Screed on Fall of “Western Civilization”  —  Texas Republican Representative Chip Roy may have stirred up disunity in the GOP earlier this year with his threats to oust House Speaker Mike Johnson, but he's in lockstep with the rest of his party on one thing … ",
    "url": "https://newrepublic.com/post/178981/republican-congressman-chip-roy-western-civilization-migrants"
  },
  {
    "text": "New documents underscore why the Supreme Court must let Jack Smith's Trump case move forward  —  January 6 was just the tip of the iceberg — Trump's criminal conspiracy was sprawling  —  Despite taking their own sweet time to render what should have been a five-minute decision ruling … ",
    "url": "https://www.salon.com/2024/02/14/new-documents-underscore-why-the-must-let-jack-smiths-case-move-forward/"
  },
  {
    "text": "Extending our Mastodon social media trial  —  In July 2023 we announced our plan to establish a BBC presence in the distributed collection of social networks known as the Fediverse, a collection of social media applications all linked together by common protocols, as part of our research into social technologies.",
    "url": "https://www.bbc.co.uk/rd/blog/2024-02-extending-our-mastodon-social-media-trial"
  },
  {
    "text": "Democrats on track to maintain majority in Pennsylvania state House  —  Democratic school board member Jim Prokopiak appeared on track to represent Pennsylvania's 140th state House district in Tuesday's special election, signaling the party will likely maintain its majority in the state's lower chamber.",
    "url": "https://thehill.com/homenews/campaign/4466050-democrats-on-track-to-maintain-majority-in-pennsylvania-state-house/"
  },
  {
    "text": "Immigration Leads Reasons Biden's Detractors Disapprove  —  WASHINGTON, D.C. — As President Joe Biden starts his reelection year with more Americans disapproving than approving of how he is handling his job, Gallup finds his detractors mainly focused on issues when explaining their view … ",
    "url": "https://news.gallup.com/poll/610322/immigration-leads-reasons-biden-detractors-disapprove.aspx"
  },
  {
    "text": "Ireland, Spain want EU to review Israel's human rights compliance in Gaza  —  The prime ministers of Spain and Ireland asked the European Commission on Wednesday to urgently review whether Israel is complying with its human rights obligations in Gaza.  —  At least 1,200 Israelis were killed … ",
    "url": "https://www.reuters.com/world/ireland-spain-want-eu-review-israels-human-rights-compliance-gaza-2024-02-14/"
  },
  {
    "text": "Bloodbath at CBS News claims senior correspondent embroiled in First Amendment case — and another who weathered HR probe: sources  —  Several CBS News reporters were caught up in layoffs at Paramount Global that claimed 800 jobs, including one who is embroiled in a high-stakes First Amendment fight … ",
    "url": "https://nypost.com/2024/02/13/media/bloodbath-at-cbs-news-includes-reporter-fighting-first-amendment-case/"
  }
]