[
  {
    "text": "It's ‘insulting’ to have ‘nonsense Republicans’ on Biden impeachment inquiry panel, Democrat says  —  Rep. Jasmine Crockett (D-Texas) dubbed some of her Republican colleagues “idiots” and “a-holes” alongside criticism of the House Oversight Committee's attempts to launch a formal impeachment inquiry into President Biden.",
    "url": "https://thehill.com/homenews/house/4355290-jasmine-crockett-nonsense-republicans-biden-impeachment-inquiry-panel/"
  },
  {
    "text": "Some House Republicans Admit There Is No Evidence To Impeach Biden  —  ‘Probably not,’ Rep. Don Bacon, R-Neb., said Tuesday when asked if Biden committed high crimes or misdemeanors  —  A number of House Republicans are openly admitting that there is no evidence to impeach President Joe Biden … ",
    "url": "https://themessenger.com/politics/some-house-republicans-admit-there-is-no-evidence-to-impeach-biden"
  },
  {
    "text": "House speaker: Evidence against Biden can't be ignored.  We're pursuing impeachment inquiry.  —  House Republicans understand that to begin to rebuild Americans' trust in the Congress, we owe it to the people to undertake this process methodically and transparently.",
    "url": "https://www.usatoday.com/story/opinion/2023/12/12/biden-impeachment-inquiry-vote-house-republicans-speaker-mike-johnson/71877294007/"
  },
  {
    "text": "McConnell: No Border Deal Until Biden Negotiates With Senate Republicans  —  The Senate minority leader said he told Biden 'the only way we'll get an agreement is for you to be involved'  —  JWPlayer  —  Senate Minority Leader Mitch McConnell said Tuesday that he has encouraged President Joe Biden … ",
    "url": "https://themessenger.com/politics/mcconnell-no-border-deal-until-biden-negotiates-with-senate-republicans"
  },
  {
    "text": "Russia Has Suffered Staggeringly High Losses, U.S. Report Says  —  The declassified intelligence assessment also found that Russia's objective has been eroding Western support for Ukraine, the country it invaded.  —  The Russian push in eastern Ukraine this fall and winter was designed … ",
    "url": "https://www.nytimes.com/2023/12/12/us/politics/russia-intelligence-assessment.html"
  },
  {
    "text": "U.S. declassifies intel as the White House pushes for more Ukraine funding  —  The U.S. assesses that more than 13,000 Russian soldiers have been killed or wounded in a key eastern Ukrainian battleground since October.  —  The U.S. has declassified intelligence on the situation in Ukraine … ",
    "url": "https://www.politico.com/news/2023/12/12/white-house-ukraine-intel-declassified-00131296"
  },
  {
    "text": "Israel Begins Pumping Seawater Into Hamas's Gaza Tunnels  —  Early effort to flood tunnels is one of several techniques aimed at destroying network that underpins Hamas's operations  —  Israel's military has begun pumping seawater into Hamas's vast complex of tunnels in Gaza … ",
    "url": "https://www.wsj.com/world/middle-east/israel-takes-fight-against-hamas-to-vast-tunnel-network-2ed3b3f2?mod=followamazon"
  },
  {
    "text": "Israel's Netanyahu Rejects U.S. Plan for Postwar Gaza  —  The prime minister says he won't allow the Palestinian Authority to take over Gaza  —  TEL AVIV—Israeli Prime Minister Benjamin Netanyahu on Monday said he would block the Biden administration's postwar plan to have the Palestinian Authority … ",
    "url": "https://www.wsj.com/world/middle-east/israels-netanyahu-rejects-u-s-plan-for-post-war-gaza-d60fc0c3?mod=followamazon"
  },
  {
    "text": "Trump sells snippets of mugshot suit, Mar-a-Lago dinner in latest NFT promotion  — Former President Donald Trump is selling snippets of the clothes he wore the day of his arrest in a Georgia state election case, part of a promotional pitch for a new set of NFT “digital trading cards.”",
    "url": "https://www.cnbc.com/2023/12/12/trump-sells-mugshot-suit-mar-a-lago-dinner-in-latest-nft-promotion.html"
  },
  {
    "text": "White House lays out offer on immigration changes in talks with Congress  —  Washington — The Biden administration on Tuesday indicated to congressional lawmakers that it would be willing to support a new border authority to expel migrants without asylum screenings, as well as a dramatic expansion … ",
    "url": "https://www.cbsnews.com/news/immigration-white-house-congress-border-security-detention-deportation/"
  },
  {
    "text": "Statement from the Harvard Corporation: Our President  —  As members of the Harvard Corporation, we today reaffirm our support for President Gay's continued leadership of Harvard University.  Our extensive deliberations affirm our confidence that President Gay is the right leader to help … ",
    "url": "https://www.harvard.edu/blog/2023/12/12/statement-from-the-harvard-corporation-our-president/"
  },
  {
    "text": "Poll: A fifth of Black voters want ‘someone else’ instead of Trump or Biden  —  The former president has also substantially improved his 2020 numbers with Black voters, according to the GenForward survey.  —  One of the best-respected polls of voters of color shows President Joe Biden … ",
    "url": "https://www.politico.com/news/2023/12/12/poll-a-fifth-of-black-voters-want-someone-else-instead-of-trump-or-biden-00131185"
  },
  {
    "text": "The history behind Jack Smith's Trump-Supreme Court gambit  —  A key 2020 episode — also involving the Supreme Court and a Trump claim of absolute immunity — is worth recalling in this moment  —  The question of Donald Trump's criminal jeopardy could be headed to the Supreme Court sooner rather than later.",
    "url": "https://www.washingtonpost.com/politics/2023/12/11/history-behind-jack-smiths-trump-supreme-court-gambit/"
  },
  {
    "text": "Biden extends White House invitation to families of Americans held hostage by Hamas  —  Biden has held Zoom meetings with the family members and they have met in person with other administration officials.  —  WASHINGTON — President Joe Biden has invited family members of Americans taken hostage … ",
    "url": "https://www.nbcnews.com/politics/white-house/biden-invites-families-americans-hostage-hamas-rcna129293"
  },
  {
    "text": "Far-right Polish MP uses fire extinguisher to put out Hanukah candles after Donald Tusk speaks out against xenophobia - Europe live  —  Speaker of house tells reporters that a complaint will be filed with the prosecutor's office against Grzegorz Braun after incident  —  Key events",
    "url": "https://www.theguardian.com/world/live/2023/dec/12/donald-tusk-prime-minister-poland-parliament-coalition-europe-latest-news"
  },
  {
    "text": "Missouri AG launches investigation of Media Matters  —  Missouri Attorney General Andrew Bailey (R) says he has launched an investigation into Media Matters for America, the progressive watchdog, following its report about harmful antisemitic content on X, the platform formerly known as Twitter.",
    "url": "https://thehill.com/homenews/4355644-missouri-ag-launches-investigation-of-media-matters/"
  },
  {
    "text": "Kate Cox begged Texas to let her end a dangerous pregnancy.  She won't be the last  —  Two years ago, a woman like Cox was able to control her body on her own terms.  Now, she has to go before a court and beg  —  In most cases, we would never have learned her name.",
    "url": "https://www.theguardian.com/commentisfree/2023/dec/12/kate-cox-emergency-abortion-texas"
  },
  {
    "text": "FBI arrests an ‘internet pornography personality’ on Jan. 6 charges  —  Paul Caloia, who went by the name “GodHypnotic,” was “bragging” in a Skype chat about taking part in the Jan. 6 attack on the Capitol, an FBI affidavit stated.  —  WASHINGTON — The FBI has arrested an … ",
    "url": "https://www.nbcnews.com/politics/justice-department/fbi-arrests-internet-pornography-personality-jan-6-charges-rcna129325"
  },
  {
    "text": "Judge: Giuliani may have defamed Georgia election workers again outside DC courthouse  —  Just minutes after leaving the first day of his civil trial, Rudy Giuliani repeated a false allegation about the pollworkers.  —  Rudy Giuliani's defiant public statements outside a Washington, D.C. … ",
    "url": "https://www.politico.com/news/2023/12/12/judge-giuliani-defamed-georgia-election-workers-00131288"
  },
  {
    "text": "Pharmacies share medical data with police without a warrant, inquiry finds  —  The revelation could shape the debate over Americans' health privacy as states move to criminalize abortion and drugs related to reproductive health  —  The nation's largest pharmacy chains have handed … ",
    "url": "https://www.washingtonpost.com/technology/2023/12/12/pharmacy-records-police-privacy-abortion/"
  },
  {
    "text": "Antisemitic sign hung outside Michigan Republican congressman's district office  —  The sign depicted Uncle Sam removing his American stovepipe hat to reveal a kippah with a Star of David underneath reading ‘Jew u$ury buy$ USA pols’  —  An antisemitic sign was hung outside the office … ",
    "url": "https://www.foxnews.com/politics/antisemitic-sign-hung-outside-michigan-republican-congressmans-district-office"
  },
  {
    "text": "Lawsuit Challenges D.C. Transit Authority for Violating the First Amendment  —  Complaint Alleges That WMATA Unlawfully Rejected Controversial Ads  —  WASHINGTON D.C.— The American Civil Liberties Union, the ACLU of the District of Columbia, the First Liberty Institute, and the law firm of Steptoe … ",
    "url": "https://www.acludc.org/en/press-releases/lawsuit-challenges-dc-transit-authority-violating-first-amendment"
  }
]