[
  {
    "text": "Trump Loses Federal Appeal on Immunity in E. Jean Carroll Case  —  No judge from the Second Circuit called for a vote to rehear Trump's appeal, leaving the Supreme Court as the last possible stop for the former president  —  Donald Trump on Monday lost again in the former president's bid … ",
    "url": "https://themessenger.com/politics/trump-loses-federal-appeal-immunity-e-jean-carroll-defamation-case"
  },
  {
    "text": "Kilmeade says Biden went ‘full Hitler’ attacking Trump during Valley Forge speech  —  Fox News hots Brian Kilmeade said President Biden went “full Hitler” in a recent speech attacking former President Trump ahead of a potential rematch between the two candidates in the 2024 presidential election.",
    "url": "https://thehill.com/media/4395082-kilmeade-biden-full-hitler-trump-speech/"
  },
  {
    "text": "The GOP's post-Trump lesson: Power isn't dependent on voting  —  Rep. Elise Stefanik (R-N.Y.) serves as Republican Conference chair, the party's third-highest leadership position in the House.  She earned that position in part by doing what her predecessor, former Wyoming congresswoman Liz Cheney … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/08/stefanik-trump-election-results/"
  },
  {
    "text": "Trump Hopes Any US Market Crash Happens Under Biden And Not Him  — US economic indicators remain robust, but voters are uneasy  — Trump has predicted economic calamity under Biden since 2020  —  Donald Trump said he hopes any US economic crash happens this year and not during his prospective second term.",
    "url": "https://www.bloomberg.com/news/articles/2024-01-09/trump-hopes-any-us-market-crash-happens-under-biden-and-not-him"
  },
  {
    "text": "BREAKING: Filing alleges ‘improper’ relationship between Fulton DA, top Trump prosecutor  —  Fani Willis hired alleged romantic partner as special prosecutor, court motion says  —  District Attorney Fani Willis improperly hired an alleged romantic partner to prosecute Donald Trump … ",
    "url": "https://www.ajc.com/politics/breaking-filing-alleges-improper-relationship-between-fulton-da-top-trump-prosecutor/A2N2OWCM7FFWJBQH2ORAK2BKMQ/"
  },
  {
    "text": "Exclusive: Roger Stone Spoke With Cop Pal About Assassinating Eric Swalwell and Jerry Nadler  —  Weeks before the 2020 presidential election, infamous political operative Roger Stone sat across from his associate Sal Greco at a restaurant in Florida.  —  At the time, Greco was an NYPD cop working security for Stone on the side.",
    "url": "https://www.mediaite.com/politics/exclusive-roger-stone-spoke-with-cop-pal-about-assassinating-eric-swalwell-and-jerry-nadler/"
  },
  {
    "text": "Roger Stone Discussed Assassinating Dems Before 2020 Election: Report  —  ‘TIME TO DO IT’  —  Roger Stone discussed assassinating members of Congress in the lead-up to the 2020 election with a then-NYPD police officer, according to audio of the longtime Republican operative's comments obtained by Mediaite.",
    "url": "https://www.thedailybeast.com/roger-stone-discussed-assassinating-eric-swalwell-and-jerry-nadler-before-2020-election-report"
  },
  {
    "text": "Special counsel Jack Smith was targeted by attempted swatting on Christmas Day  —  Police were dispatched toward Smith's residence but were called off when they learned it was a false alarm and that everyone inside the home was safe.  —  Special counsel Jack Smith, who is overseeing … ",
    "url": "https://www.nbcnews.com/politics/politics-news/special-counsel-jack-smith-was-targeted-attempted-swatting-christmas-d-rcna132964"
  },
  {
    "text": "Florida Republican Party ousts Christian Ziegler as chairman after rape allegation  —  The move was widely expected after news broke last month that Ziegler was under investigation by the Sarasota County Police Department.  —  The Republican Party of Florida on Monday formally voted … ",
    "url": "https://www.nbcnews.com/politics/politics-news/florida-republican-party-ousts-christian-ziegler-chairman-rape-allegat-rcna131936"
  },
  {
    "text": "Substack says it will remove Nazi publications from the platform  —  Nazi content violates rules against incitement to violence, the company says  —  Substack is removing some publications that express support for Nazis, the company said today.  The company said this did not represent … ",
    "url": "https://www.platformer.news/p/substack-says-it-will-remove-nazi"
  },
  {
    "text": "Driver in custody after crashing into White House gates  —  The crash occurred just before 6 p.m. ET, a spokesman for the Secret Service wrote on X.  —  WASHINGTON — A driver was in custody Monday after crashing a vehicle into an exterior gate of the White House complex, a spokesman for the Secret Service wrote on X.",
    "url": "https://www.nbcnews.com/politics/white-house/driver-custody-crashing-white-house-gates-rcna132962"
  },
  {
    "text": "This Might Be the High-Water Mark of Trumpism  —  1. How Biden Wins  —  Mark Halperin watched both Trump and Biden's January 5 speeches and came away with a shrewd piece of analysis. … Halperin then says that Biden's three big problems are:  — That he's playing from behind as an incumbent … ",
    "url": "https://plus.thebulwark.com/p/this-might-be-the-high-water-mark"
  },
  {
    "text": "‘Impossible’ to create AI tools like ChatGPT without copyrighted material, OpenAI says  —  Pressure grows on artificial intelligence firms over the content used to train their products  —  The developer OpenAI has said it would be impossible to create tools like its groundbreaking chatbot … ",
    "url": "https://www.theguardian.com/technology/2024/jan/08/ai-tools-chatgpt-copyrighted-material-openai"
  },
  {
    "text": "United finds loose bolts on plug doors during 737 Max 9 inspections  —  Air safety reporting by The Air Current is provided without a subscription as a public service.  Please subscribe to gain full access to our all scoops, in-depth reporting and analyses.",
    "url": "https://theaircurrent.com/feed/dispatches/united-finds-loose-bolts-on-plug-doors-during-737-max-9-inspections/"
  },
  {
    "text": "South Korea's parliament expected to pass bill to ban dog meat trade  —  South Korea's parliament is expected to vote on Tuesday to phase out the eating and selling of dog meat, a move that would end the controversial centuries-old practice amid growing support for animal welfare in the country.",
    "url": "https://www.reuters.com/world/asia-pacific/south-koreas-parliament-expected-pass-bill-ban-dog-meat-trade-2024-01-09/"
  },
  {
    "text": "U.S. Navy Sailor Sentenced to 27 Months in Prison for Transmitting Sensitive U.S. Military Information to Chinese Intelligence  —  For Immediate Release  —  A U.S. Navy service member was sentenced today to 27 months in prison and ordered to pay a $5,500 fine for transmitting sensitive U.S … ",
    "url": "https://www.justice.gov/opa/pr/us-navy-sailor-sentenced-27-months-prison-transmitting-sensitive-us-military-information"
  },
  {
    "text": "Welcome to Semafor Media, where we are still largely staffed by humans.  —  More than a decade ago, the Supreme Court ruled that corporations are people.  Hollywood has spent the years since reversing that formula: What if people — celebrities, that is — could be corporations?",
    "url": "https://www.semafor.com/newsletter/01/07/2024/after-the-slap"
  }
]