[
  {
    "text": "Trump Taps a ‘MAHA’ Movement Leader for Surgeon General  —  Casey Means will work closely with RFK Jr. on health policy, president says  —  WASHINGTON—President Trump said he would nominate Dr. Casey Means, a California doctor and wellness influencer, to be the next surgeon general.",
    "url": "https://www.wsj.com/politics/policy/trump-taps-a-maha-movement-leader-for-surgeon-general-81756dfa?st=g8DcpA&reflink=article_copyURL_share"
  },
  {
    "text": "Trump picks conspiracy theorist with no medical license to replace Fox News contributor as Surgeon General  —  Previous nominee was withdrawn amid claims she had misrepresented her medical education … President Donald Trump has selected a conspiracy theorist and self-styled … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/surgeon-general-pick-medical-school-b2746743.html"
  },
  {
    "text": "Trump pulls surgeon general nominee  —  President Trump has pulled his nomination of Janette Nesheiwat to be U.S. surgeon general and has instead chosen chronic disease entrepreneur Casey Means, a physician with close ties to the “Make American Healthy Again,” or MAHA, movement, as his new pick to fill the role.",
    "url": "https://thehill.com/policy/healthcare/5288601-trump-nominee-casey-means-surgeon-general/"
  },
  {
    "text": "GOP Plans To Cut Medicaid Would Kick Millions Off Health Insurance, New Analysis Says  —  An authoritative analysis by Congressional Budget Office is House Speaker Mike Johnson's latest headache.  —  WASHINGTON ― Some of Republicans' top ideas for reducing Medicaid spending … ",
    "url": "https://www.huffpost.com/entry/cbo-medicaid-cuts-fmap-reduction_n_681b76fee4b0c2b15d971fc0"
  },
  {
    "text": "Chief Justice John Roberts defends independent judiciary as Trump officials criticize courts  —  Speaking in Buffalo, the Supreme Court justice said judges sometimes have to “check the excesses” of the president and Congress.  —  Chief Justice John Roberts on Wednesday stressed the importance … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-john-roberts-independent-judiciary-trump-officials-rcna205461"
  },
  {
    "text": "Judge warns Trump administration against Libya deportations  —  The stern order followed reports indicating the U.S. was poised to send a planeload of immigrants to the troubled African nation.  —  A federal judge warned the Trump administration Wednesday that it cannot deport immigrants to Libya … ",
    "url": "https://www.washingtonpost.com/national-security/2025/05/07/libya-trump-migrants-plane-deportations/"
  },
  {
    "text": "America Needs More Judges Like Judge Myers  —  When judges act as partisan hacks, it is important to condemn their conduct.  Last month, four Republican justices on the North Carolina Supreme Court blessed the antidemocratic attempt by the fellow Republican judge Jefferson Griffin to subvert … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/05/north-carolina-supreme-court/682731/"
  },
  {
    "text": "U.S. pushes nations facing tariffs to approve Musk's Starlink, cables show  —  Some countries have turned to the satellite internet firm in conjunction with trade talks, State Department staffers wrote.  The U.S. has a strategic interest in countering Chinese internet providers, but Musk's role complicates the picture.",
    "url": "https://www.washingtonpost.com/business/2025/05/07/elon-musk-starlink-trump-tariffs/"
  },
  {
    "text": "Kennedy Announces New Database for Research Into ‘Root Causes’ of Autism  —  The director of the National Institutes of Health previously floated — then walked back — the idea of an autism registry, alarming researchers and parents.  —  After weeks of confusion about his plans for autism research … ",
    "url": "https://www.nytimes.com/2025/05/07/us/politics/rfk-jr-autism-cause-database.html"
  },
  {
    "text": "Democrats Cave, Prepare to Rubber-Stamp Trump Crypto Corruption  —  Pro-crypto senators are poised to pass a stablecoin bill, while failing to crack down on the Trump organization issuing one to collect payments from foreign governments.  —  Despite the twists and turns and drama-creation … ",
    "url": "https://prospect.org/politics/2025-05-08-democrats-cave-prepare-rubber-stamp-trump-crypto-corruption/"
  },
  {
    "text": "Trump's NIH Axed Research Grants Even After a Judge Blocked the Cuts, Internal Records Show  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  For more than two months, the Trump administration … ",
    "url": "https://www.propublica.org/article/trump-nih-cuts-transgender-research-grants"
  },
  {
    "text": "Trump teases ‘major trade deal’ with ‘big, highly respected country’  —  President Trump on Wednesday night teased a trade deal announcement, nearly a month after he implemented a 90-day pause on reciprocal tariffs and implemented a 145 percent tariff on China.",
    "url": "https://thehill.com/homenews/administration/5289084-trump-teases-major-trade-deal-big-highly-respected-country/"
  },
  {
    "text": "Thom Tillis Says No to U.S. Attorney Ed Martin  —  This is a good exercise of the Senate's advise and consent power.  —  Republican Senators who hold up a troubling nominee might attract President Trump's short-term anger, but they're doing him a long-term favor.",
    "url": "https://www.wsj.com/opinion/thom-tillis-ed-martin-nomination-u-s-attorney-donald-trump-4920e70b"
  },
  {
    "text": "Exclusive: Some ‘Les Mis’ cast members plan to boycott Trump's attendance at Kennedy Center performance next month  —  When President Donald Trump descends on the Kennedy Performing Arts Center next month for a high-dollar fundraiser and a performance of “Les Misérables,” … ",
    "url": "https://cnn.com/2025/05/07/politics/kennedy-center-les-mis-cast-boycott-trump"
  },
  {
    "text": "From traffic stop to ICE custody: Dalton student now in limbo, family wants answers  —  DALTON, Ga. — After a traffic stop for turning right on a red light in Dalton on Monday, a 19-year-old Dalton State student is now facing possible deportation.  —  Friends say Ximena Arias-Cristobal … ",
    "url": "https://newschannel9.com/news/local/from-traffic-stop-to-ice-custody-dalton-student-now-in-limbo-family-wants-answers-immigration-customs-enforcement-whitfield-county-georgia-law-enforcement-illegal-immigration-undocumented-migrants"
  },
  {
    "text": "Disney to build its 7th theme park, this one in the United Arab Emirates  —  Disney will build its seventh theme park, this one in the United Arab Emirates, the entertainment company said Wednesday.  —  The waterfront resort will be built on Yas Island on the outskirts of Abu Dhabi … ",
    "url": "https://apnews.com/article/disney-abu-dhabi-miral-yas-uae-trump-831fe2e23068b5d487765c53a7d52e63"
  },
  {
    "text": "Trump administration eyes release of Hur interview blocked by Biden  —  Biden had asserted executive privilege to block House committees from obtaining the recordings.  —  The Trump administration is making plans to release the audio of former President Joe Biden's interview with Robert Hur … ",
    "url": "https://www.politico.com/news/2025/05/07/trump-administration-eyes-release-hur-interview-00334587"
  },
  {
    "text": "A US Navy aircraft carrier in the Red Sea fight just lost a third Super Hornet.  The $60 million jet went overboard on landing.  — An F/A-18 fighter jet went overboard after trying to land on the USS Harry S. Truman on Tuesday.  — It's the second Super Hornet the Truman has lost … ",
    "url": "https://www.businessinsider.com/us-navy-aircraft-carrier-red-sea-lost-another-super-hornet-2025-5"
  },
  {
    "text": "Sen. John Fetterman raises alarms with outburst at meeting with union officials, AP sources say  —  Democratic Sen. John Fetterman of Pennsylvania was meeting last week with representatives from a teachers union in his home state when things quickly devolved.",
    "url": "https://apnews.com/article/john-fetterman-trump-democrats-senate-pennsylvania-8129e206ed9479ad8534eac3fd128abe"
  },
  {
    "text": "Outgoing UMich Prez Santa Ono Pulls His Name from Academic Freedom Letter … Over the weekend University of Michigan President Santa Ono announced that he was leaving his post to take up the leadership of the University of Florida.  It was an interesting choice.",
    "url": "https://talkingpointsmemo.com/edblog/outgoing-umich-prez-santa-ono-pulls-his-name-from-academic-freedom-letter"
  },
  {
    "text": "Dozens of students arrested in pro-Palestinian protest at Columbia University  —  Police arrested dozens of Columbia University students who seized part of the school's main library on Wednesday in one of the biggest pro-Palestinian demonstrations on campus since last year's wave of protests against Israel's war in Gaza.",
    "url": "https://www.reuters.com/world/us/dozens-pro-palestinian-protesters-occupy-columbia-university-library-2025-05-07/"
  },
  {
    "text": "Meet Trump's memecoin dinner guests  —  Citation Needed is an independent publication, entirely supported by readers like you.  Consider signing up for a pay-what-you-can subscription to support this kind of deep analysis and reporting.  —  Foreign investors have spent millions scrambling … ",
    "url": "https://www.citationneeded.news/trump-memecoin-dinner-guests/"
  },
  {
    "text": "A ‘Trump Card Visa’ Is Already Showing Up in Immigration Forms  —  Donald Trump has proposed launching a “gold card” program offering US residency for $5 million.  Elon Musk's DOGE has begun rolling out the technology to enable it.  —  Elon Musk's so-called Department of Government Efficiency … ",
    "url": "https://www.wired.com/story/doge-trump-gold-visa-program-immigration/"
  },
  {
    "text": "Under Texas' Abortion Ban, Where a Pregnant Woman Lives Can Determine Her Risk of Developing Sepsis  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Nearly four years ago in Texas … ",
    "url": "https://www.propublica.org/article/texas-abortion-ban-sepsis-rates-dallas-houston"
  },
  {
    "text": "China says U.S. asked for trade meeting in Switzerland … The upcoming meeting in Switzerland between U.S. Treasury Secretary Scott Bessent and his Chinese counterpart was requested by the Trump administration, Chinese officials said Wednesday.  —  China will be entering the talks “firmly” … ",
    "url": "https://www.cnbc.com/2025/05/07/china-trump-tariffs-bessent-switzerland.html"
  }
]