[
  {
    "text": "The Young, Inexperienced Engineers Aiding Elon Musk's Government Takeover  —  Engineers between 19 and 24, most linked to Musk's companies, are playing a key role as he seizes control of federal infrastructure.  —  Elon Musk's takeover of federal government infrastructure is ongoing … ",
    "url": "https://www.wired.com/story/elon-musk-government-young-engineers/"
  },
  {
    "text": "Musk Says DOGE Is Halting Treasury Payments to US Contractors  —  Elon Musk said his “DOGE team” of government efficiency enforcers is shutting down payments to federal contractors, suggesting that the world's richest man may have access to sensitive systems used at the US Treasury Department.",
    "url": "https://www.bloomberg.com/news/articles/2025-02-02/musk-says-doge-is-rapidly-shutting-down-treasury-payments"
  },
  {
    "text": "Senior USAID security officials put on leave after refusing Musk's DOGE access to agency systems  —  Two top security officials at the US Agency for International Development were put on administrative leave Saturday night after refusing to allow officials from Elon Musk's Department … ",
    "url": "https://www.cnn.com/2025/02/02/politics/usaid-officials-leave-musk-doge/"
  },
  {
    "text": "USAID security leaders on leave after trying to keep Musk's DOGE from classified info, officials say  —  The Trump administration has placed two top security chiefs at the U.S. Agency for International Development on leave after they refused to turn over classified material in restricted areas … ",
    "url": "https://apnews.com/article/doge-musk-trump-classified-information-usaid-security-35101dee28a766e0d9705e0d47958611"
  },
  {
    "text": "‘This is a five-alarm fire’: Experts pounce on Musk's new ‘grave national security threat’  —  It was reported on Sunday that two officials at the U.S. Agency for International Development (USAID) were threatened with arrest and then put on leave after refusing to let Elon Musk access systems at the agency … ",
    "url": "https://www.rawstory.com/musk-national-security-threat-usaid/"
  },
  {
    "text": "Trump faces backlash from business as tariffs ignite inflation fears  —  Experts warn aggressive trade measures against US allies will hurt consumers and roil supply chains  —  Donald Trump faced a backlash from business groups and some in his own Republican party after kicking off a trade war … ",
    "url": "https://www.ft.com/content/3cc26cc1-57e7-44d0-8c09-6c5dec30cc75"
  },
  {
    "text": "Top F.B.I. Agent in New York Vows to ‘Dig In’ After Removals at Agency  —  James E. Dennehy, the highly respected leader of the largest and most important field office in the bureau, said in an email to staff that the F.B.I. was in a “battle of our own.”  —  The top agent at the F.B.I.'s … ",
    "url": "https://www.nytimes.com/2025/02/02/us/politics/fbi-new-york-email-trump.html?unlocked_article_code=1.t04.JDug.6QRxLrLXK-8y&smid=url-share"
  },
  {
    "text": "FBI agents, officials asked to detail their work on Jan. 6 cases  —  Leaders and agents at the bureau are bracing for a potential purge of those deemed disloyal to Trump.  —  Thousands of FBI agents and employees are being asked by Justice Department leadership to fill out a 12-question survey detailing … ",
    "url": "https://www.politico.com/news/2025/02/02/fbi-agents-officials-jan-6-cases-011048"
  },
  {
    "text": "Agents ‘have started to pack up their desks’ as fear of FBI mass firings swirls  —  Some agents have been sent a 12-question survey about their role in Jan. 6 cases.  An FBI agent group advised agents overall to “stay calm and refrain from making any statements.”",
    "url": "https://www.nbcnews.com/politics/national-security/agents-started-pack-desks-fear-fbi-mass-firings-swirls-rcna190342"
  },
  {
    "text": "ICE raided his family's North Philly car wash. Here is Jeffrey Lee's account of what happened.  —  Jeffrey Lee, 35, was en route to his family's business, Complete Autowash Philly, when a call came through his car's speaker.  The caller ID read “Dad” but there was an ICE agent on the other end … ",
    "url": "https://www.inquirer.com/news/philadelphia/ice-raid-account-north-philly-car-wash-20250202.html"
  },
  {
    "text": "MAGA intellectual Darren Beattie will fill key State Department role  —  The Scoop  —  Secretary of State Marco Rubio will appoint Darren Beattie, a speechwriter in President Donald Trump's first term, acting undersecretary of state for public diplomacy, two people briefed on the plans said.",
    "url": "https://www.semafor.com/article/02/02/2025/maga-intellectual-darren-beattie-will-fill-key-state-department-role"
  },
  {
    "text": "Trump administration taps controversial conservative journalist for top job  —  Darren Beattie is the acting under secretary in a top State Department role.  —  A sign for the U.S. Department of State is captured on the outside of the Harry S. Truman Federal Building on Oct. 8, 2024 in Washington, D.C.",
    "url": "https://abcnews.go.com/US/trump-administration-taps-controversial-conservative-journalist-top-job/story?id=118369945"
  },
  {
    "text": "The Logic of Destruction  —  What is a country?  The way its people govern themselves.  America exists because its people elect those who make and execute laws.  The assumption of a democracy is that individuals have dignity and rights that they realize and protect by acting together.",
    "url": "https://snyder.substack.com/p/the-logic-of-destruction"
  },
  {
    "text": "Rubio says Panama must reduce Chinese influence around the canal or face possible US action  —  U.S. Secretary of State Marco Rubio brought a warning to Panamanian leader José Raúl Mulino on Sunday: Immediately reduce what President Donald Trump says is Chinese influence … ",
    "url": "https://apnews.com/article/panama-rubio-trump-canal-mulino-illegal-immigration-f159e218e66812bc0e462d8fb8bb5b5f"
  },
  {
    "text": "The power of independent journalism: From her Brooklyn apartment, she ‘scooped’ the nation's media  —  First word of the Trump administration's since-rescinded order to freeze spending on federal loans and grants came not from a major news organization, but from a woman working alone in her Brooklyn apartment.",
    "url": "https://apnews.com/article/independent-journalists-trump-local-news-a60b49c97058d14f1b2e36cdc771d8f7"
  },
  {
    "text": "Why Write About the Illegality of What Trump and Musk are Doing?  —  NYU Law professor Noah Rosenblum posted on Bluesky yesterday that “[t]here has never been a larger gap in my (admittedly quite short) professional life between how lay folks and law profs are talking about what is happening in government right now.",
    "url": "https://buttondown.com/sbagen/archive/why-write-about-the-illegality-of-what-trump-and/"
  },
  {
    "text": "Union official says Education Department employees were placed on leave after taking diversity training during Trump's first term  —  A letter to the affected employees obtained by NBC News said they would continue to receive their full salaries and benefits and would not be required to do any work-related tasks.",
    "url": "https://www.nbcnews.com/politics/donald-trump/union-official-education-department-employees-leave-dei-training-rcna190337"
  },
  {
    "text": "IMPOSING DUTIES TO ADDRESS THE FLOW OF ILLICIT DRUGS ACROSS OUR NORTHERN BORDER  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, including the International Emergency Economic Powers Act (50 U.S.C. 1701 et seq.)",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/02/imposing-duties-to-address-the-flow-of-illicit-drugs-across-our-national-border/"
  },
  {
    "text": "Don't Believe Him  —  This is an edited transcript of an audio essay on “The Ezra Klein Show.”  You can listen to the conversation by following or subscribing to the show on the NYT Audio App, Apple, Spotify, Amazon Music, YouTube, iHeartRadio or wherever you get your podcasts.",
    "url": "https://www.nytimes.com/2025/02/02/opinion/ezra-klein-podcast-trump-column-read.html?unlocked_article_code=1.t04.v61j.h_eaTdRj3_sz&smid=url-share"
  }
]