[
  {
    "text": "Musk says all federal employees need to explain their work immediately — or be let go  —  Federal employees received an email Saturday afternoon, and gave them a deadline of Monday night.  —  All federal government employees will have to share what they've been working on in the last week or face dismissal, Elon Musk said Saturday.",
    "url": "https://www.politico.com/news/2025/02/22/musk-federal-employees-explanation-dismissal-00205613"
  },
  {
    "text": "Federal employees told to justify jobs in email or Musk says they face dismissal  —  Federal workers began receiving emails Saturday asking them to explain what work they did last week, as Elon Musk announced that “failure to respond will be taken as a resignation.”",
    "url": "https://www.cnn.com/2025/02/22/politics/elon-musk-employees-emails"
  },
  {
    "text": "How Federal Employees Are Fighting Back Against Elon Musk … Karen Ortiz, an administrative law judge at the Equal Employment Opportunity Commission, said her ability to send emails was shut off after she sent an agencywide message calling on the commission's acting chair to resign.Taurat Hossain for The New York Times",
    "url": "https://www.nytimes.com/2025/02/22/us/politics/federal-employees-elon-musk.html?unlocked_article_code=1.y04.uThj.JIKPWDn_GCQm&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "US threatens to shut off Starlink if Ukraine won't sign minerals deal, sources tell Reuters  —  Editor's Note: This story has been updated with Elon Musk's denial of the Reuters report.  —  The United States has threatened to cut off Ukraine's access to Starlink satellite internet terminals … ",
    "url": "https://kyivindependent.com/us-threatens-to-shut-off-starlink-if-ukraine-wont-sign-minerals-deal-sources-tell-reuters/"
  },
  {
    "text": "U.S. Pressing Tough Demands in Revised Deal for Ukraine's Minerals  —  The Trump administration appears to be insisting that Ukraine relinquish half of its revenues from natural resource extraction, with no security guarantee in exchange.  —  Ukraine on Saturday was seriously considering … ",
    "url": "https://www.nytimes.com/2025/02/22/world/europe/ukraine-trump-minerals.html"
  },
  {
    "text": "Trump's Own Pollster Just Hit Him with Very Bad News—and a Warning  —  As you watch President Donald Trump and Elon Musk recklessly attempt to destroy the federal government like a pair of toddlers picking legs off a spider, it seems as if Republicans have decided public opinion no longer constrains them in the least.",
    "url": "https://newrepublic.com/article/191841/trump-approval-rating-pollster-bad-news-warning"
  },
  {
    "text": "Trump's Firing of Gen. Charles Q. Brown May Have Roots in George Floyd Protests  —  A four-minute video appears to have been a turning point for the president and Gen. Charles Q. Brown Jr., the ousted Joint Chiefs chairman.  —  For the second time, the killing of George Floyd by a police officer … ",
    "url": "https://www.nytimes.com/2025/02/22/us/politics/trump-cq-brown-george-floyd.html"
  },
  {
    "text": "New Social Security chief was being investigated when Musk team tapped him  —  Leland Dudek, a data analyst working in a small anti-fraud office, was suspected of sharing unauthorized access to information with representatives of Musk's U.S. DOGE Service.  Now he's the acting Social Security commissioner.",
    "url": "https://www.washingtonpost.com/politics/2025/02/22/social-security-trump-doge-musk/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwMjAwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxNTc5MTk5LCJpYXQiOjE3NDAyMDA0MDAsImp0aSI6IjU2YjkyYWU4LTA4ZWUtNDE1ZC1iOWJkLWVlNmM3MzRlZjczNCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAyLzIyL3NvY2lhbC1zZWN1cml0eS10cnVtcC1kb2dlLW11c2svIn0.0kUuRrAbqH__HvhpYAFPsmOnb9NsRmpXoIr8gKYhkaQ&itid=gfta"
  },
  {
    "text": "DOGE shared its receipts — and some of them don't match  —  “Everyone is very well-aware they're repeating the wrong numbers,” said one manager at a company on DOGE's list of cuts.  —  Elon Musk promised to deliver a “maximally transparent” government efficiency program.",
    "url": "https://www.politico.com/news/2025/02/22/doge-data-errors-inconsistencies-00002576"
  },
  {
    "text": "Musk's DOGE says it has saved $55 billion.  Not so fast.  —  A Washington Post analysis found that hundreds of the canceled contracts DOGE listed represent savings of $0 each.  —  Elon Musk's U.S. DOGE Service claimed this week to have saved an estimated $55 billion through a combination of layoffs … ",
    "url": "https://www.washingtonpost.com/business/2025/02/22/doge-savings-found-list-analysis/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwMjAwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxNTc5MTk5LCJpYXQiOjE3NDAyMDA0MDAsImp0aSI6Ijk1YWFkZTllLTU0NDAtNGQ0Yi1iZWI3LWMwMDg5M2NhMTYxNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAyLzIyL2RvZ2Utc2F2aW5ncy1mb3VuZC1saXN0LWFuYWx5c2lzLyJ9.Y-VGkg7MWDYtyE5gBTQmGlQjkV8RurPAEMvxlaGw3sY&fbclid=PAZXh0bgNhZW0CMTEAAaYJ_9C-it2tY45pxnA33j5qgGkOf7NRCvw0gZdhXHFP8bkwnzt2LmackZg_aem_O_QhatWnnhDiFgAqR7R4zA"
  },
  {
    "text": "Musk's cost-cutting team is laying off workers at the auto safety agency overseeing his car company  —  Elon Musk's cost-cutting team is eliminating jobs at the vehicle safety agency that oversees Tesla and has launched investigations into deadly crashes involving his company's cars.",
    "url": "https://apnews.com/article/musk-trump-autonomous-selfdriving-doge-auto-safety-99b369c5e3ccd3e7c09b6951604b3a0a"
  },
  {
    "text": "Measles Outbreaks in Texas and New Mexico Sicken Nearly 100 People  —  Texas reported 90 cases this week, while New Mexico reported nine.  A majority of the cases have been in a Texas county where vaccination rates have lagged behind the rest of the state.  —  Outbreaks of measles in parts … ",
    "url": "https://www.nytimes.com/2025/02/22/us/texas-measles-outbreak.html?unlocked_article_code=1.y04.4uZP.Cl0OlTn70tou&smid=url-share"
  },
  {
    "text": "The Great Resegregation  —  The nostalgia behind the slogan “Make America great again” has always provoked the obvious questions of just when America was great, and for whom.  Early in the second Trump administration, we are getting the answer.  —  In August, speaking with someone he believed … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/02/trump-attacks-dei/681772/?gift=Je3D9AQS-C17lUTOnl2W8CfbS33sf5rPuBaDA0rzwEA&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Feds must answer email on what they did last week — or lose jobs, Musk says  —  Emails began going out to the 2.3-million federal employees Saturday asking for five bullet points of their accomplishments.  —  Federal workers began receiving emails Saturday asking them to describe what they did last week … ",
    "url": "https://www.washingtonpost.com/nation/2025/02/22/musk-email-federal-workers/"
  },
  {
    "text": "As sales drop, artists weigh canceling Kennedy Center shows in protest  —  Ticket sales dropped roughly 50 percent week-over-week after Trump announced his takeover, sources said.  Meanwhile, performers are mulling their options.  —  W. Kamau Bell was scheduled to perform at the Kennedy Center … ",
    "url": "https://www.washingtonpost.com/entertainment/2025/02/22/artists-cancel-kennedy-center-shows-ticket-sales/"
  },
  {
    "text": "Federal prisons prep to move trans inmates as early as next week  —  The Bureau of Prisons is pushing ahead with plans to move transgender inmates out of prisons that align with their gender identity and into facilities corresponding to their sex at birth.  The moves could happen as early as next week … ",
    "url": "https://www.npr.org/2025/02/21/nx-s1-5305282/trans-inmates-federal-prison-policy-transfers"
  },
  {
    "text": "Pope Francis is in critical condition after long respiratory crisis, requiring oxygen at high flow  —  Pope Francis was in critical condition Saturday after he suffered a long asthmatic respiratory crisis that required high flows of oxygen, the Vatican said.",
    "url": "https://apnews.com/article/pope-francis-pneumonia-sepsis-vatican-respiratory-infection-bab5b9a141517171d4efc71fadafa0a4"
  },
  {
    "text": "February 21, 2025  —  In an appearance at the Conservative Political Action Conference (CPAC) yesterday, billionaire Elon Musk seemed to be having difficulty speaking.  Musk brandished a chainsaw like that Argentina's president Javier Milei used to symbolize the drastic cuts he intended … ",
    "url": "https://heathercoxrichardson.substack.com/p/february-21-2025"
  },
  {
    "text": "Why Civ-Mil People Are Freaking Out?  —  Trump bravely waited until Friday night to purge the top level of the US military.  Why are people freaking out?  We knew this was going to happen.  Trump promised this before the election, and the selection of Hegseth, a misogynist and racist … ",
    "url": "https://saideman.blogspot.com/2025/02/why-civ-mil-people-are-freaking-out.html"
  },
  {
    "text": "CDC Shutters PRAMS Program on Maternal and Infant Health  —  The Pregnancy Risk Assessment Monitoring System (PRAMS) is a federal data collection system, run out of CDC, “designed to identify groups of women and infants at high risk for health problems, to monitor changes in health status … ",
    "url": "https://talkingpointsmemo.com/edblog/cdc-shutters-prams-program-on-maternal-and-infant-health"
  },
  {
    "text": "Kristi Noem Says $200 Million DHS Ad Campaign Thanking Trump Was His Idea  —  Trump's Homeland Security Secretary said he instructed her to make ads that “thank me for closing the border”  —  NATIONAL HARBOR, Maryland  — The Department of Homeland Security has budgeted up to $200 million … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-kristi-noem-200-million-dhs-ad-campaign-thanks-president-1235276324/"
  }
]