[
  {
    "text": "Exclusive: Musk aides lock government workers out of computer systems at US agency, sources say  —  Aides to Elon Musk charged with running the U.S. government human resources agency have locked career civil servants out of computer systems that contain the personal data of millions of federal employees … ",
    "url": "https://www.reuters.com/world/us/musk-aides-lock-government-workers-out-computer-systems-us-agency-sources-say-2025-01-31/"
  },
  {
    "text": "Senior U.S. official to exit after rift with Musk allies over payment system  —  A top Treasury career staffer is expected to depart.  Surrogates of Musk's DOGE effort had sought access to sensitive payment systems.  —  The highest-ranking career official at the Treasury Department … ",
    "url": "https://www.washingtonpost.com/business/2025/01/31/elon-musk-treasury-department-payment-systems/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4Mjk5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NjgxOTk5LCJpYXQiOjE3MzgyOTk2MDAsImp0aSI6ImNmNDI1NjUyLWQ1MjYtNDZmMC05OWE2LTM4MjZkNjhhM2U3NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAxLzMxL2Vsb24tbXVzay10cmVhc3VyeS1kZXBhcnRtZW50LXBheW1lbnQtc3lzdGVtcy8ifQ.yZfsykqc6t_9ScDJY93aWJQZfsrqpSaNaPMIurEt720&itid=gfta"
  },
  {
    "text": "Elon Musk Is Trying to Get Control of Key Payment System—at Any Cost  —  A top-ranking official in the U.S. Department of the Treasury is resigning after a fight with Elon Musk over a sensitive payment system.  —  The Washington Post reports that David Lebryk, who has worked in the department … ",
    "url": "https://newrepublic.com/post/190983/top-treasury-official-quit-elon-musk-fight-payment-system"
  },
  {
    "text": "FBI agents who worked on January 6 and Trump investigations are expected to be fired Friday  —  The Trump administration is set to expand a purge of career law enforcement officials, with dozens of FBI agents who worked on January 6, 2021, US Capitol attack and Trump-related investigations … ",
    "url": "https://www.cnn.com/2025/01/31/politics/fbi-agents-who-investigated-january-6-fired/"
  },
  {
    "text": "FBI considering mass purge of agents involved in Trump investigations  —  Leaders appointed by the Trump administration are identifying potentially hundreds of FBI agents for possible termination, said people familiar with the plan.  —  President Donald Trump's administration has launched … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/31/fbi-considering-mass-purge-agents-involved-trump-investigations/"
  },
  {
    "text": "Trump Administration Plans to Scrutinize F.B.I. Agents for Possible Purge  —  The move to enact the plan comes just one day after Kash Patel, President Trump's pick to lead the F.B.I., testified before Congress that the bureau would not be targeted for political reasons.",
    "url": "https://www.nytimes.com/2025/01/31/us/politics/trump-fbi-agents.html"
  },
  {
    "text": "Federal employees told to remove pronouns from email signatures by end of day  —  The mandate is the latest effort in the Trump administration's push to end DEI.  —  President Donald Trump signs executive orders in the Oval Office at the White House in Washington, Jan. 30, 2025.",
    "url": "https://abcnews.go.com/US/federal-employees-told-remove-pronouns-email-signatures-end/story?id=118310483"
  },
  {
    "text": "Trump tariffs on Canada, Mexico and China begin Saturday, White House says … In an apparent ending to weeks of intense speculation, the White House confirmed Friday that President Donald Trump will be leveling aggressive tariffs this weekend on major U.S. trading partners.",
    "url": "https://www.cnbc.com/2025/01/31/trump-tariffs-on-canada-mexico-and-china-begin-saturday-white-house-says.html"
  },
  {
    "text": "CDC site scrubs HIV content following Trump DEI policies  —  The federal health agency began removing all content related to gender identity on Friday.  —  The Centers for Disease Control and Prevention on Friday is scrubbing a swath of HIV-related content from the agency's website as a part … ",
    "url": "https://www.nbcnews.com/health/health-news/trump-dei-hiv-cdc-website-removed-lgbtq-rcna190068"
  },
  {
    "text": "New York doctor indicted for prescribing abortion pill in Louisiana  —  A New York doctor was indicted by a Louisiana grand jury on Friday for allegedly prescribing an abortion pill online in the Deep South state, which has one of the strictest near-total abortion bans in the country.",
    "url": "https://apnews.com/article/abortion-indictment-lousiana-new-york-doctor-63ff4d9da8a9b592a7ca4ec7ba538cd3"
  },
  {
    "text": "Trump administration seeking access to database of immigrant minors  —  The Office of Refugee Resettlement, which is responsible for caring for unaccompanied minors, has long operated independently of ICE.  —  The Trump administration is seeking to grant U.S. immigration officers access … ",
    "url": "https://www.washingtonpost.com/immigration/2025/01/31/administration-access-immigrant-minors-data/"
  },
  {
    "text": "CBS staff alarmed by reports of settlement talks with Trump over ‘60 Minutes’ Harris interview  —  Journalists, including some at CBS News, are expressing alarm at reports that CBS parent company Paramount Global is trying to settle a legally dubious lawsuit lodged by President Donald Trump last fall.",
    "url": "https://www.cnn.com/2025/01/31/media/cbs-trump-settlement-60-minutes"
  },
  {
    "text": "Decision to dump water from Tulare County lakes altered after sending locals into a mad scramble  —  Water managers were relieved Thursday evening after the Army Corps of Engineers agreed to back off of a sudden decision earlier in the day to dump massive amounts of water from Kaweah and Success lakes.",
    "url": "https://sjvwater.org/decision-to-dump-water-from-tulare-county-lakes-altered-after-sending-locals-in-mad-scramble/"
  },
  {
    "text": "Career prosecutors withdraw from federal criminal investigation of GOP Congressman Andy Ogles  —  Local prosecutors are not commenting, but move may signal plans to drop investigation of one of President Trump's Republican allies  —  NASHVILLE, Tenn. (WTVF) — Federal prosecutors based … ",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/career-prosecutors-withdraw-from-federal-criminal-investigation-of-gop-congressman-andy-ogles"
  },
  {
    "text": "Former ‘Meet the Press’ moderator Chuck Todd exits NBC News after nearly two decades  —  Former “Meet the Press” moderator Chuck Todd is leaving NBC News after nearly 18 years at the network.  —  Todd said in a memo to NBC News colleagues that Friday was his last day.",
    "url": "https://apnews.com/article/nbc-todd-exit-trump-welker-746b58bbd6b7eb03f6be0cbeabf84004"
  },
  {
    "text": "EPA workers receive emails warning their employment could be terminated  —  More than 1,100 employees at the Environmental Protection Agency received notice this week that they were deemed to be on probationary status and warning they could be fired immediately, according to an email obtained by CNN.",
    "url": "https://www.cnn.com/2025/01/31/politics/epa-workers-warning/"
  },
  {
    "text": "Trump Admin Emails Air Traffic Controllers: Quit Your Jobs  —  REALLY?!  —  Federal employees were told they could use their paid time off to explore “dream destinations” before quitting.",
    "url": "https://www.thedailybeast.com/trump-admin-emails-air-traffic-controllers-quit-your-jobs/"
  },
  {
    "text": "“People Will Die”: The Trump Administration Said It Lifted Its Ban on Lifesaving Humanitarian Aid.  That's Not True.  —  Organizations that provide vital care for desperate and vulnerable people around the world have been forced to halt operations, turn away patients and lay off staff.",
    "url": "https://www.propublica.org/article/trump-state-department-usaid-humanitarian-aid-freeze-ukraine-gaza-sudan"
  },
  {
    "text": "Tennessee GOP passes immigration law to criminalize elected officials' votes  —  Tennessee Republicans finalized an immigration bill Thursday establishing a new enforcement office exempt from public records law and criminalizing local officials who support sanctuary policies for immigrants.",
    "url": "https://www.tennessean.com/story/news/politics/2025/01/30/tennessee-republicans-pass-immigration-measures-during-special-session/78021305007/"
  },
  {
    "text": "Groyperfication  —  I'm working on something long-ish on the “vibe shift” discourse that I'm hoping will come in lieu of the Sunday Reading, Watching supplement.  But I just wanted to quickly remark again on what I think is an underreported key to understanding contemporary politics … ",
    "url": "https://www.unpopularfront.news/p/groyperfication"
  },
  {
    "text": "Interim U.S. attorney fires more than 2 dozen Jan. 6 prosecutors in D.C.  —  Interim U.S. Attorney Ed Martin is dismissing more than two dozen federal prosecutors in his D.C. office who worked on Capitol riot cases over the past four years.",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/01/31/jan6-prosecutors-fired-dc-martin/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4Mjk5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NjgxOTk5LCJpYXQiOjE3MzgyOTk2MDAsImp0aSI6ImIzY2MwNGRkLWQwMzAtNDA5My05OTk3LTk5NTZjM2FlOTY4OCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS8yMDI1LzAxLzMxL2phbjYtcHJvc2VjdXRvcnMtZmlyZWQtZGMtbWFydGluLyJ9.3pq78sZul7y2sSaXNwbUu0TbWvTi3dJOHosFwnfH8EY&itid=gfta"
  },
  {
    "text": "SCOOP: Robert F. Kennedy Jr. Admits Settlement for “Misconduct” Accusation  —  Robert F. Kennedy Jr. has admitted to the US Senate that he has reached at least one settlement agreement in which he was accused of misconduct or inappropriate behavior.  —  After the Senate Finance Committee … ",
    "url": "https://www.motherjones.com/politics/2025/01/robert-f-kennedy-jr-admits-settlement-for-misconduct-accusation-senate-confirmation/"
  },
  {
    "text": "Trump administration directs 70% cut to internal OPM staffing, programs  —  Trump administration officials are taking major steps to cut down the size of the workforce and federal programs at the Office of Personnel Management.  —  During an internal meeting Friday morning … ",
    "url": "https://federalnewsnetwork.com/management/2025/01/trump-administration-directs-opm-career-leaders-to-prepare-for-70-cut-to-staffing-programs/"
  },
  {
    "text": "We've Now Learned the Three Principles of Trumpism, and They're Ugly … We're nearing the end of week two of Trump 2.0, and several things are already manifestly clear.  First and foremost, that the new Trump administration was more than ready to hit the ground running at noon on January 20.",
    "url": "https://newrepublic.com/post/190987/three-principles-trumpism-chaos-democrats"
  },
  {
    "text": "Mark Robinson drops CNN lawsuit, says he has no plans to run again  —  The scandal-plagued politician had sued CNN over a report on his controversial online activity.  —  Mark Robinson, the former North Carolina lieutenant governor whose scandal-plagued candidacy doomed his gubernatorial bid last year … ",
    "url": "https://www.politico.com/news/2025/01/31/mark-robinson-cnn-lawsuit-010143"
  },
  {
    "text": "USDA ordered to scrub climate change from websites  —  The directive could affect information across dozens of programs including climate-smart agriculture initiatives.  —  Agriculture Department employees have been ordered to delete landing pages discussing climate change across agency websites … ",
    "url": "https://www.politico.com/news/2025/01/31/usda-climate-change-websites-00201826"
  },
  {
    "text": "DEI not to blame in crash, says top Republican overseeing FAA  —  Rep. Sam Graves, the Missouri Republican in charge of overseeing the Federal Aviation Administration in the House, said Friday that diversity initiatives at the agency had nothing to do with a crash between a commercial airplane … ",
    "url": "https://www.politico.com/live-updates/2025/01/31/congress/dei-not-to-blame-crash-graves-00201777"
  }
]