[
  {
    "text": "Lisa Murkowski says it was ‘agonizing’ to vote for the megabill  —  Sen. Lisa Murkowski made the “agonizing” decision to vote for Senate Republicans' version of the “big, beautiful” bill after winning key concessions on federal health and food-aid programs for her state.  “Did I get everything I wanted?",
    "url": "https://www.politico.com/live-updates/2025/07/01/congress/lisa-murkowski-repulican-megabill-alaska-00435150"
  },
  {
    "text": "Senate Republicans narrowly pass Trump megabill after marathon voting session  —  The revised package now heads back to the House, where Republican leaders are hoping to approve it and send it to Trump before a self-imposed July 4 deadline.  But it faces hurdles.",
    "url": "https://www.nbcnews.com/politics/congress/senate-final-vote-trump-big-beautiful-bill-republicans-rcna216096"
  },
  {
    "text": "Poorest Americans Would Be Hurt By Trump's Big Bill  —  Small improvements in taxes are overshadowed by cuts to health insurance and other federal aid, resulting in a package favoring the wealthy.  —  Millions of low-income Americans could experience staggering financial losses under … ",
    "url": "https://www.nytimes.com/2025/07/01/business/poor-americans-senate-legislation.html?unlocked_article_code=1.TE8.CbLZ.zxYOJHMcFkJ8&smid=url-share"
  },
  {
    "text": "Republican Bill Puts Nation on New, More Perilous Fiscal Path  —  Among the most expensive pieces of legislation in years, the Republican legislation could reshape the country's finances for a generation.  —  Washington has not exactly won a reputation for fiscal discipline over the last few decades … ",
    "url": "https://www.nytimes.com/2025/07/01/us/politics/republican-policy-bill-perilous-fiscal-path.html"
  },
  {
    "text": "At least 17 million Americans would lose insurance under Trump plan  —  GOP legislation would set back years of progress in expanding health care coverage, unwinding key parts of the Affordable Care Act.  —  The Senate version of President Donald Trump's massive tax and immigration spending plan … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/01/least-17-million-americans-would-lose-insurance-under-trump-plan/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUxMzQyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUyNzI0Nzk5LCJpYXQiOjE3NTEzNDI0MDAsImp0aSI6IjRmNmE0NTM1LWRlOTYtNDViMS1hZWIxLTIzYjQwOGVkODFkNCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA3LzAxL2xlYXN0LTE3LW1pbGxpb24tYW1lcmljYW5zLXdvdWxkLWxvc2UtaW5zdXJhbmNlLXVuZGVyLXRydW1wLXBsYW4vIn0.ocr08DvIPpFyQTant2DT9gT22fhxmBBk88-HeQ8Xt2U&itid=gfta"
  },
  {
    "text": "This Is a Shameful Way to Make Law  —  No time for throat-clearing fripperies!  The Senate is probably going to do something insane that renders our analysis obsolete five minutes after we send this!  Hurry up and read it!  Happy Tuesday.  —  Time's Up, Pencils Down  —  by Andrew Egger",
    "url": "https://www.thebulwark.com/p/this-is-a-shameful-way-to-make-law-trump-republicans-senate-congress-big-beautiful-bill-medicaid-spending-debt-deficit"
  },
  {
    "text": "US won't send some weapons pledged to Ukraine following a Pentagon review of military assistance  —  The U.S. is halting some shipments of weapons to Ukraine amid concerns that its own stockpiles have declined too much, officials said Tuesday.  The munitions were previously promised to Ukraine … ",
    "url": "https://apnews.com/article/ukraine-us-weapons-shipments-halt-review-48229eb7c814419631a16067a38d6a1d"
  },
  {
    "text": "Pentagon halts weapons shipment to Ukraine amid concerns over U.S. stockpile  —  The move “was made to put America's interests first,” a White House spokeswoman said, as U.S. munitions have been depleted in recent years.  —  Secretary of Defense Pete Hegseth has ordered a pause on sending … ",
    "url": "https://www.nbcnews.com/politics/national-security/pentagon-halts-weapons-shipment-ukraine-concerns-us-stockpile-rcna216358"
  },
  {
    "text": "Pentagon halting some promised munitions for Ukraine … The people were granted anonymity to discuss current operations.  The Pentagon did not respond to a request for comment.  —  In a statement following the publication of this story, White House Deputy Press Secretary Anna Kelly said that the decision … ",
    "url": "https://www.politico.com/news/2025/07/01/pentagon-munitions-ukraine-halt-00436048"
  },
  {
    "text": "U.S. Department of Education Announces the University of Pennsylvania Has Entered into a Resolution Agreement to Resolve its Title IX Violations  —  Today, the U.S. Department of Education (the Department) announced the University of Pennsylvania (UPenn) has entered into a Resolution Agreement … ",
    "url": "https://www.ed.gov/about/news/press-release/us-department-of-education-announces-university-of-pennsylvania-has-entered-resolution-agreement-resolve-its-title-ix-violations"
  },
  {
    "text": "Pardoned Jan. 6 Rioter Who Threatened Police Joins Justice Dept.  —  The pardoned rioter, a former F.B.I. agent who was charged with encouraging the mob that stormed the Capitol, is a counselor to Ed Martin, the director of the so-called weaponization committee.",
    "url": "https://www.nytimes.com/2025/07/01/us/politics/justice-department-rioter-weaponization.html?unlocked_article_code=1.TU8.f4oR.otlThwYIrbnU&smid=url-share"
  },
  {
    "text": "Mamdani on Trump's deportation threat: We won't ‘accept this intimidation’  —  “His statements don't just represent an attack on our democracy but an attempt to send a message to every New Yorker who refuses to hide in the shadows: if you speak up, they will come for you.",
    "url": "https://www.washingtonpost.com/politics/2025/07/01/trump-threatens-deport-zohran-mamdani/"
  },
  {
    "text": "Making Foreign Aid Great Again  —  Author: U.S. Secretary of State Marco Rubio  —  Every public servant has an obligation to American citizens to ensure any programs they fund advance our nation's interests.  During the Trump Administration's thorough review of thousands of programs … ",
    "url": "https://statedept.substack.com/p/making-foreign-aid-great-again"
  },
  {
    "text": "Trump OKs using National Guard as immigration judges at Florida detention center  —  President Donald Trump said Tuesday he would approve Florida's plan to expedite deportations by having qualified National Guard members work as immigration judges.  —  Trump made the announcement during … ",
    "url": "https://www.miamiherald.com/news/local/immigration/article309792865.html"
  },
  {
    "text": "Gillibrand apologizes to Mamdani over ‘jihad’ comments … Mamdani would be the city's first Muslim mayor. … Mamdani has declined to condemn people using the phrase “globalize the intifada,” even though he said he doesn't use it himself, and once rapped his support for the “Holy Land Five” … ",
    "url": "https://www.politico.com/news/2025/07/01/kirsten-gillibrand-zohran-mamdani-00436031"
  },
  {
    "text": "Man Who Helped Florida Shark Attack Victim Now Facing Deportation  —  PAYBACK  —  Luis Alvarez was reportedly arrested days after rushing into the water to help after a child was mauled by a shark.  —  A man who rushed into the water to help after a 9-year-old girl was bitten by a shark … ",
    "url": "https://www.thedailybeast.com/man-who-helped-florida-shark-attack-victim-now-facing-deportation/"
  },
  {
    "text": "Televangelist Jimmy Swaggart, whose ministry was toppled by prostitution scandals, dies at 90  —  Televangelist Jimmy Swaggart, whose multimillion-dollar ministry and huge audience dwindled following his prostitution scandals, has died.  He was 90.  —  Swaggart death was announced Tuesday on his public Facebook page.",
    "url": "https://apnews.com/article/jimmy-swaggart-dies-obituary-ae4b9f551dc141cc820437ab7c194766"
  },
  {
    "text": "LA mayor: Trump administration lawsuit ‘an attempt to overturn the will of the city’  —  Los Angeles Mayor Karen Bass bemoaned the Trump administration's lawsuit challenging the city's sanctuary status and attacking its immigration policies.  —  “The lawsuit is an attempt to overturn the will of the city … ",
    "url": "https://thehill.com/homenews/state-watch/5380096-la-mayor-trump-administration-lawsuit/"
  },
  {
    "text": "Justice Department Charges Two Individuals with Acting as Agents of the PRC Government  —  For Immediate Release  —  Arrests Disrupted Clandestine PRC Ministry of State Security Intelligence Network Operating in the United States  —  Two nationals of the People's Republic of China (PRC) … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-charges-two-individuals-acting-agents-prc-government"
  },
  {
    "text": "Inside Trump's $75B ICE gulag nightmare  —  The great thing about turning 100 is that you get to celebrate...a lot.  After the quiet satisfaction of the Philadelphia Daily News' actual centennial on March 25, scores of alums of the 1925-born People Paper gathered Saturday night at the iconic Pen … ",
    "url": "https://www.inquirer.com/columnists/attytood/ice-dhs-trump-budget-deportations-wnba-20250701.html"
  },
  {
    "text": "RFK Jr. Says AI Will Approve New Drugs at FDA ‘Very, Very Quickly’  —  “We need to stop trusting the experts,” Kennedy told Tucker Carlson. … Robert F. Kennedy Jr. appeared on the latest episode of Tucker Carlson's podcast on Monday and it's filled with the ramblings of a man completely detached from reality.",
    "url": "https://gizmodo.com/rfk-jr-says-ai-will-approve-new-drugs-at-fda-very-very-quickly-2000622778"
  },
  {
    "text": "Columbia University Applicant Personal Data Stolen by Hacker  —  Personal information about Columbia University students and applicants — including whether they were accepted or rejected by the school — has been stolen, according to a Bloomberg News review of data provided by a person who claimed to have hacked the school in June.",
    "url": "https://www.bloomberg.com/news/articles/2025-07-01/columbia-university-applicants-personal-data-stolen-by-hacker?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc1MTQxMjgwNiwiZXhwIjoxNzUyMDE3NjA2LCJhcnRpY2xlSWQiOiJTWUlZSEVUMEcxS1cwMCIsImJjb25uZWN0SWQiOiJGMUM1Mzc1OEY5Qjg0MDZCOUJCNzMyODRDN0RBMEY3QyJ9.o9xPoIloekMS3v1t1CPNB8CqzIZ79e6Qs7ABNcM3R_U"
  },
  {
    "text": "Issue 87 - SO ORDERED  —  Listen to me read this post here (not an AI-generated voice!), subscribe to the feed in your podcast app, or download the recording for later.  —  It feels like every week I write something along the lines of “Trump's crypto conflicts surge to new heights” … ",
    "url": "https://www.citationneeded.news/issue-87/"
  },
  {
    "text": "EXCLUSIVE: Convicted sex offender from Kenya avoids deportation, lands state job  —  A Kenyan national convicted of sexually assaulting a sleeping woman in Minnesota wasn't deported after his prison sentence — he was promoted.  —  Wilson Tindi holds a director position at the Minnesota Department … ",
    "url": "https://alphanews.org/exclusive-convicted-sex-offender-from-kenya-avoids-deportation-lands-state-job/"
  },
  {
    "text": "Senate leaders scrap new tax on renewable energy … Senate leaders have agreed to remove a new excise tax on wind and solar projects from their megabill in order to secure enough support for passage.  —  The new tax was based on a project's compliance with strict sourcing requirements.",
    "url": "https://www.eenews.net/articles/senate-leaders-scrap-new-tax-on-renewable-energy/"
  },
  {
    "text": "Iran Likely to Have Moved Nuclear Components Ahead of Fordow Attack: Iranian Nuclear Scientist  —  Despite the Trump administration's claims, Iran's nuclear program has not been “totally obliterated.”  —  After a series of airstrikes ordered by President Donald Trump against three key Iranian nuclear sites … ",
    "url": "https://www.dropsitenews.com/p/iran-nuclear-program-united-states-attacks-israel"
  },
  {
    "text": "Trump administration keeps FBI headquarters in D.C., upending planned move  —  The agency's new headquarters, which had been slated to move to Maryland, will be inside the Ronald Reagan Building and International Trade Center, the former home to USAID.  —  The Trump administration announced plans Tuesday … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/01/trump-fbi-headquarters-dc/"
  },
  {
    "text": "HHS layoffs were likely unlawful and must be halted, US judge says  —  A federal judge has ruled that recent mass layoffs at the U.S. Department of Health and Human Services were likely unlawful and ordered the Trump administration to halt plans to downsize and reorganize the nation's health workforce.",
    "url": "https://apnews.com/article/trump-hhs-layoffs-restructuring-maha-rfk-7adbc357bf25b2c92b94e012ba3d8316"
  },
  {
    "text": "Court suspends PM Paetongtarn from office in Hun Sen phone call case  —  Charter court accepts senators' petition for consideration; Suriya now acting PM  —  The Constitutional Court on Tuesday suspended Prime Minister Paetongtarn Shinawatra from duty pending its consideration of the case … ",
    "url": "https://www.bangkokpost.com/thailand/politics/3061392/court-suspends-pm-paetongtarn-from-office-in-hun-sen-phone-call-case"
  }
]