[
  {
    "text": "RFK Jr says Texas measles outbreak a ‘call to action’  —  Robert F. Kennedy Jr., secretary of the Department of Health and Human Services (HHS), said the measles outbreak in west Texas is a “call to action,” as he encouraged parents to consider whether to get their children vaccinated.",
    "url": "https://thehill.com/policy/healthcare/5172168-rfk-jr-says-texas-measles-outbreak-a-call-to-action/"
  },
  {
    "text": "Amid West Texas measles outbreak, vaccine resistance hardens  —  A child has died in an outbreak that has grown to 146 cases.  —  SEMINOLE, Texas — When the local hospital warned of a brewing measles outbreak, Kaleigh Brantner urged fellow residents of this rural West Texas community to beware of vaccinating their children.",
    "url": "https://www.washingtonpost.com/health/2025/03/02/measles-outbreak-texas-vaccine-hesitancy-death/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwODkxNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyMjcwMzk5LCJpYXQiOjE3NDA4OTE2MDAsImp0aSI6ImEyZWVlMTA3LTc3Y2MtNDBlNy04ZjdjLTNhNmE0ZmJjYWM4MSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9oZWFsdGgvMjAyNS8wMy8wMi9tZWFzbGVzLW91dGJyZWFrLXRleGFzLXZhY2NpbmUtaGVzaXRhbmN5LWRlYXRoLyJ9.fMDWpTMGus_hFPo7_qd6ywjZV0yb0s5PiQsdxCQPMrU&itid=gfta"
  },
  {
    "text": "Hegseth Orders Pentagon to Stop Offensive Cyberoperations Against Russia  —  The defense secretary's instructions, which were given before President Trump's blowup with the Ukrainian president, are apparently part of an effort to draw Russia into talks on the war.",
    "url": "https://www.nytimes.com/2025/03/02/us/politics/hegseth-cyber-russia-trump-putin.html?unlocked_article_code=1.004.B7lh.Cy2TjG3-0IlO&smid=url-share"
  },
  {
    "text": "Defense Secretary Pete Hegseth has paused cyber offensive against Russia  —  Multiple U.S. officials tell CBS News that Defense Secretary Pete Hegseth has issued a directive to U.S. Cyber Command to pause planning against Russia, including offensive digital actions.",
    "url": "https://www.cbsnews.com/news/pete-hegseth-russia-cyber-command-pause/"
  },
  {
    "text": "Zelensky must mend the breach with Trump — or resign  —  Zelensky's stubbornness has badly hurt Ukraine.  —  On Thursday, President Donald Trump was publicly pledging to help Ukrainian President Volodymyr Zelensky regain Russian-occupied territory at the peace table.",
    "url": "https://www.washingtonpost.com/opinions/2025/03/02/zelensky-trump-ukraine-clash-vance/"
  },
  {
    "text": "Zelenskyy says minerals deal is ready to be signed as he seeks to move conversation on from White House spat - live  —  Keir Starmer announces additional £1.6bn package for Ukraine, allowing it ‘to buy more than 5,000 air defence missiles’  —  ‘We understand the importance of America,’ Zelenskyy says",
    "url": "https://www.theguardian.com/world/live/2025/mar/02/ukraine-war-volodymyr-zelenskyy-keir-starmer-donald-trump-us-europe-eu-russia-defence-latest-live-news"
  },
  {
    "text": "Macron urges Europe to boost defense spending to over 3 percent of GDP  —  The EU needs to find ways to massively ramp up defense spending, the French president says.  —  PARIS — French President Emmanuel Macron called on Europeans to dramatically increase their yearly defense spending … ",
    "url": "https://www.politico.eu/article/macron-urges-europe-to-boost-defense-spending-to-over-3-percent-of-gdp/"
  },
  {
    "text": "The Trump administration may exclude government spending from GDP, obscuring the impact of DOGE cuts  —  Commerce Secretary Howard Lutnick said Sunday that government spending could be separated from gross domestic product reports in response to questions about whether the spending cuts pushed … ",
    "url": "https://apnews.com/article/trump-gdp-economy-government-spending-lutnick-7414ba1bd441bd4bf64620bfd66923b2"
  },
  {
    "text": "Washington now ‘largely aligns’ with Moscow's vision, Kremlin says  —  Tension between the United States and Ukraine, laid bare in the Oval Office meeting of Trump and Zelensky, is seen in Moscow as a “gift.”  —  MOSCOW — The Trump administration's rewrite of decades of U.S. foreign policy on Russia … ",
    "url": "https://www.washingtonpost.com/world/2025/03/02/russia-ukraine-trump-zelensky-clash/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwODkxNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyMjcwMzk5LCJpYXQiOjE3NDA4OTE2MDAsImp0aSI6IjFjNjE2YTc5LWIzM2UtNDE1Zi1hMjRiLTA5ZDI3OTlkZmQ1NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI1LzAzLzAyL3J1c3NpYS11a3JhaW5lLXRydW1wLXplbGVuc2t5LWNsYXNoLyJ9.DRtHRu1YRJtS00MBp5WSQv6SH7HP45VF-evySDShuYA&itid=gfta"
  },
  {
    "text": "Crypto Prices Jump After Trump Announces Five Tokens for Strategic Reserve  —  Bitcoin, ether, solana, Ripple-linked XRP and cardano will be in the stockpile  —  Crypto prices surged Sunday after President Trump said he would move forward on a U.S. crypto strategic reserve that would include bitcoin … ",
    "url": "https://www.wsj.com/finance/currencies/crypto-prices-jump-after-trump-announces-five-tokens-for-strategic-reserve-636f31d7?st=iLbGRS&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Senior USAID official ousted as he details problems providing lifesaving aid  —  The memo contradicts claims by Secretary of State Marco Rubio that he has put in place a functioning system for exempting lifesaving assistance from the aid freeze.  —  just now",
    "url": "https://www.washingtonpost.com/national-security/2025/03/02/usaid-memo-official-leave/"
  },
  {
    "text": "Trump Is Breaking Things We Can't Just Fix  —  President Trump is doing damage to America that could take a generation or more to repair.  The next election cannot fix what Trump is breaking.  Neither can the one after that.  —  To understand the gravity of the harm Trump has inflicted … ",
    "url": "https://www.nytimes.com/2025/03/02/opinion/trump-ukraine-zelensky-usaid.html"
  },
  {
    "text": "Elon Musk Thinks U.S. Should Leave NATO And The United Nations  —  Elon Musk has been tasked with cutting government spending.  —  Elon Musk, who holds no official cabinet position in the administration, wrote on social media that he agrees the United States should leave NATO and the United Nations.",
    "url": "https://www.huffpost.com/entry/elon-musk-nato-united-nations_n_67c48962e4b0bb60c6988d5a"
  },
  {
    "text": "Democrats Invite Fired Federal Workers to Trump's Congressional Address  —  The move comes as lawmakers hear from constituents over President Trump's and Elon Musk's efforts to slash federal spending and cull the civil service ranks.  —  Rather than boycott President Trump's address … ",
    "url": "https://www.nytimes.com/2025/03/02/us/politics/democrats-trump-federal-workers.html"
  },
  {
    "text": "Rubio Bypasses Congress to Send Israel $4 Billion in Arms  —  Secretary of State Marco Rubio's emergency declaration calls for sending 2,000-pound bombs and other weapons to Israel as the war in Gaza continues.  —  Secretary of State Marco Rubio has invoked “emergency authorities” … ",
    "url": "https://www.nytimes.com/2025/03/02/us/politics/rubio-arms-israel.html?unlocked_article_code=1.004.Tiic.RCDf8rCeRXrU"
  },
  {
    "text": "Pentagon guts national security program that harnessed social science  —  Dozens of U.S. academics lose grants from Minerva program for studies related to terrorism, drug trafficking, and other threats  —  The U.S. Department of Defense (DoD) is gutting a landmark project designed … ",
    "url": "https://www.science.org/content/article/pentagon-guts-national-security-program-harnessed-social-science"
  },
  {
    "text": "Johnson says Zelenskyy may need to resign  —  Speaker Mike Johnson said Zelenskyy either needs to “come to his senses” or step down to end the war in Ukraine.  —  Speaker Mike Johnson on Sunday said that Ukrainian President Volodymyr Zelenskyy might need to resign to bring peace … ",
    "url": "https://www.politico.com/news/2025/03/02/mike-johnson-ukraine-zelenskyy-00206885"
  },
  {
    "text": "Wyden to skip Trump's first speech to Congress, hold town hall instead  —  Democratic Oregon U.S. Sen/ Ron Wyden has announced he will be skipping President Trump's first first speech to Congress in his second term to hold an online town hall.  —  During his constitutionally-required address … ",
    "url": "https://www.portlandtribune.com/news/wyden-to-skip-trump-s-first-speech-to-congress-hold-town-hall-instead/article_d1ebb628-f6e9-11ef-9b85-c7aa45e931b8.html"
  },
  {
    "text": "FAA staff reportedly ordered to find funding for deal with Musk's Starlink  —  Discussions about the deal, which could upend a $2.4 billion Verizon contract with the US, have happened verbally, reports Rolling Stone. … Officials at the Federal Aviation Administration (FAA) on Friday ordered staff … ",
    "url": "https://www.theverge.com/news/622502/faa-orders-staff-find-funding-starlink-verizon-deal"
  },
  {
    "text": "N.Y. State Police Investigate Death of Another Inmate at Upstate Prison  —  A 22-year-old inmate at Mid-State Correctional Facility in Marcy, N.Y., died Saturday.  Nine inmates said he was viciously beaten by corrections officers.  —  The State Police are investigating the death of a prisoner … ",
    "url": "https://www.nytimes.com/2025/03/02/nyregion/prison-inmate-death-marcy.html?unlocked_article_code=1.1E4.ypE5.Nqcg5nD-NVDw&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump Has Glossed Over High Prices.  Republicans Worry It Will Cost Them.  —  The president talks more often about federal workers, diversity programs and foreign policy than the price of eggs  —  WASHINGTON—President Trump promised during the campaign to lower prices on day one of his presidency.",
    "url": "https://www.wsj.com/politics/policy/trump-lower-prices-inflation-republican-concern-a5bf923a"
  },
  {
    "text": "Zelenskiy Signals He Would Meet With Trump If Invited Back  — Ukrainian leader is ready to sign natural resources deal  — Says he's convinced his clash with Trump will blow over  —  Ukrainian President Volodymyr Zelenskiy said he's willing to meet Donald Trump if the US president invites him again … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-02/zelenskiy-says-he-s-ready-to-meet-trump-again-if-invited-to-us"
  },
  {
    "text": "Trump Moves to Increase Logging in National Forests  —  The president wants to circumvent environmental regulations to expand timber production, something sought by homebuilders and the construction industry.  —  President Trump has promised to “drill, baby, drill.”  Now, he also wants to log.",
    "url": "https://www.nytimes.com/2025/03/02/climate/trump-logging-national-forests.html"
  },
  {
    "text": "‘Full on Fight Club’: How Trump Is Crushing U.S. Climate Policy … The Biden strategy was to erect legal and other barriers intended to make it tough to undo its work.  Trump has already broken through many of them.Al Drago for The New York Times  —  In a few short weeks … ",
    "url": "https://www.nytimes.com/2025/03/02/climate/trump-us-climate-policy-changes.html"
  },
  {
    "text": "Sen. Bernie Sanders says calls for Zelenskyy to resign are ‘horrific’: Full interview  —  In an exclusive interview with Meet the Press, Sen. Bernie Sanders (I-Vt.) says many Americans are “embarrassed or ashamed” of President Trump's hostile meeting with Ukrainian President Volodymyr Zelenskyy.",
    "url": "https://www.nbcnews.com/meet-the-press/video/sen-bernie-sanders-says-calls-for-zelenskyy-to-resign-are-horrific-full-interview-233292869592"
  }
]