[
  {
    "text": "Biden breaks with Netanyahu but sticks with Israel … But in many ways, Biden sees Netanyahu as the one responsible for the deal slipping away. … - Biden has given the Israeli government unprecedented support over the past five months, at the cost of strong pushback from the president's party during an election year.",
    "url": "https://www.axios.com/2024/03/10/biden-netanyahu-hurting-israel-red-line"
  },
  {
    "text": "Biden team brings in $10 million in the 24 hours after the State of the Union  —  First to NBC News: The financial haul dwarfs some of the president's biggest fundraising days in 2023, before his rematch with Donald Trump was set.  —  President Joe Biden's re-election machine brought … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-raises-10-million-24-hours-state-union-rcna142624"
  },
  {
    "text": "Fine, Call It a Comeback  —  If the Joe Biden who showed up to deliver the State of the Union address last week is the Joe Biden who shows up for the rest of the campaign, you're not going to have any more of those weak-kneed pundits suggesting he's not up to running for re-election.  Here's hoping he does.",
    "url": "https://www.nytimes.com/2024/03/10/opinion/biden-state-union-message.html"
  },
  {
    "text": "Biden hits out at Trump in Georgia rally: 'He's been sucking up to dictators all over the world'  —  Biden took the State of the Union to the battleground state that was critical to his 2020 win ahead of Tuesday's primary  —  The question isn't whether Democrats in Georgia will vote for President Joe Biden … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/10/biden-georgia-rally"
  },
  {
    "text": "Americans split on who they trust to do a better job as president: POLL  —  An ABC News/Ipsos poll finds a near-even split between Biden, Trump and neither.  —  President Joe Biden delivers the annual State of the Union address before a joint session of Congress in the House chamber at the Capital building … ",
    "url": "https://abcnews.go.com/Politics/biden-trump-americans-trust-president-poll/story?id=107938351"
  },
  {
    "text": "Trump backtracks on statement that Georgia polls are rigged because now he is ‘winning by so much’  —  At a rally in Rome, Ga., on Saturday, former President Trump backtracked on his previous statements that polls in the state are rigged since he now is “winning by so much.”",
    "url": "https://thehill.com/homenews/campaign/4521748-trump-backtracks-on-statement-that-georgia-polls-are-rigged-because-now-he-is-winning-by-so-much/"
  },
  {
    "text": "Katie Britt used decades-old example of rapes in Mexico as Republican attack on Biden border policy  —  The Republican senator who gave the party's response to President Joe Biden's State of the Union address used a harrowing account of a young woman's sexual abuse to attack his border policies … ",
    "url": "https://apnews.com/article/katie-britt-mexico-border-sex-trafficking-f74c95d1f7e3e5b9a660d9efc51ab214"
  },
  {
    "text": "Major US corporations threaten to return labor to ‘law of the jungle’  —  Trader Joe's and SpaceX are among businesses challenging the constitutionality of the National Labor Relations Board  —  Upset by the surge in union drives, several of the best-known corporations in the US are seeking … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/10/starbucks-trader-joes-spacex-challenge-labor-board"
  },
  {
    "text": "$91M Bond Didn't Stop Trump From Trashing E. Jean Carroll Again  —  Donald Trump just had to post a $91.6 million bond while he appeals the verdict in the defamation case won by his rape accuser, E. Jean Carroll.  But that whopping sum wasn't enough to get him to stop trashing her.",
    "url": "https://www.thedailybeast.com/dollar91m-bond-didnt-stop-donald-trump-from-trashing-e-jean-carroll-again"
  },
  {
    "text": "After Trump ballot ruling, critics say Supreme Court is selectively invoking conservative originalist approach  —  Some legal scholars criticized the court for ignoring arguments based on the text and original understanding of Section 3 of the 14th Amendment in a ruling that kept Trump on the ballot.",
    "url": "https://www.nbcnews.com/politics/supreme-court/trump-ballot-ruling-critics-say-supreme-court-selectively-invoking-con-rcna142020"
  },
  {
    "text": "Scoop: Trump's team hires lawyer to “watch the money” at RNC … - Trump campaign co-campaign manager and incoming RNC chief operating officer Chris LaCivita is bringing on Sean Cairncross to be his number two at the RNC.  — Cairncross is a lawyer with a reputation of enforcing financial discipline … ",
    "url": "https://www.axios.com/2024/03/10/trump-republicans-rnc-money"
  },
  {
    "text": "Kari Lake Tries a New Tactic: Mending Fences  —  The close Trump ally is courting former foes and trying to mend fences as she runs for Senate in Arizona.  But bad blood from her 2022 campaign simmers at home.  —  Conciliatory messages on social media.  Open invitations for coffee.",
    "url": "https://www.nytimes.com/2024/03/10/us/politics/kari-lake-arizona-senate.html"
  },
  {
    "text": "600 Activision QA workers just formed the biggest videogame union in the US  —  Quality assured.  —  First reported by The Verge, 600 Activision QA workers have formed a new union at the publisher.  It was organized through the Communications Workers of America (CWA), like other unions at the company … ",
    "url": "https://www.pcgamer.com/gaming-industry/600-activision-qa-workers-just-formed-the-biggest-videogame-union-in-the-us/"
  },
  {
    "text": "Nervous about November?  Stop listening to pundits and start defending the president  —  It's the only way that we are going to defeat the anti-democratic forces that are looking to transform our nation  —  This past week's State of the Union, and the incredibly powerful performance by the President … ",
    "url": "https://www.salon.com/2024/03/10/nervous-about-november-stop-listening-to-pundits-and-start-defending-the/"
  }
]