[
  {
    "text": "The Wrecking-Ball Caucus: How the Far Right Brought Washington to Its Knees  —  Right-wing Republicans who represent a minority in their party and in Congress have succeeded in sowing mass dysfunction, spoiling for a shutdown, an impeachment and a House coup.",
    "url": "https://www.nytimes.com/2023/09/23/us/republicans-congress-freedom-caucus.html"
  },
  {
    "text": "McCarthy stares into the shutdown abyss  —  The speaker has only one clear exit route away from a government closure: working with Democrats.  It's a path he still refuses to take.  —  Speaker Kevin McCarthy has only one way out of next week's impending government shutdown: working with Democrats.",
    "url": "https://www.politico.com/news/2023/09/23/mccarthy-stares-into-shutdown-abyss-00117658"
  },
  {
    "text": "Was McCarthy distracted from governing by impeachment inquiry?  —  House Republicans pledge a slow, methodical pace on the Biden impeachment inquiry, but some rank-and-file believe that their leaders have missed the target on priorities  —  Congressional bureau chief",
    "url": "https://www.washingtonpost.com/politics/2023/09/23/house-impeachment-shutdown/"
  },
  {
    "text": "Misinformation research is buckling under GOP legal attacks  —  An escalating campaign, led by Rep. Jim Jordan (R-Ohio) and other Republicans, has cast a pall over programs that study political disinformation and the quality of medical information online  —  Academics, universities … ",
    "url": "https://www.washingtonpost.com/technology/2023/09/23/online-misinformation-jim-jordan/"
  },
  {
    "text": "Clarence Thomas' Latest Pay-to-Play Scandal Finally Connects All the Dots  —  ProPublica released a new report on Friday detailing Justice Clarence Thomas' close relationship with the Koch brothers with previously undisclosed and extraordinarily damning new details.",
    "url": "https://slate.com/news-and-politics/2023/09/clarence-thomas-chevron-ethics-kochs.html"
  },
  {
    "text": "U.S. Provided Canada With Intelligence on Killing of Sikh Leader  —  American intelligence gave assistance, but communications intercepted by Canada were more definitive in linking India to the killing of Hardeep Singh Nijjar.  —  American spy agencies provided information to Ottawa … ",
    "url": "https://www.nytimes.com/2023/09/23/us/politics/canada-sikh-leader-killing-intelligence.html"
  },
  {
    "text": "Cassidy Hutchinson Reappears.  She Has More Trump Stories to Tell.  —  “I would like not to be a hermit,” the former White House aide says upon the publication of a memoir about her journey down a political rabbit hole.  —  Cassidy Hutchinson dropped out of sight last year after she testified … ",
    "url": "https://www.nytimes.com/2023/09/23/us/politics/cassidy-hutchinson-trump.html"
  },
  {
    "text": "US mother sentenced to two years in prison for giving daughter abortion pills  —  Jessica Burgess pleaded guilty in July to providing an abortion after 20 weeks and tampering with human remains  —  Jessica Burgess, a Nebraska mother accused of helping her teenage daughter use pills to end her pregnancy … ",
    "url": "https://www.theguardian.com/us-news/2023/sep/22/burgess-abortion-pill-nebraska-mother-daughter"
  },
  {
    "text": "McCarthy backtracks, says he will keep Ukraine aid in Pentagon funding bill  —  Speaker Kevin McCarthy (R-Calif.) on Saturday said he will keep Ukraine aid in the Pentagon funding bill, a reversal from his announcement one day earlier that he would strip the money out due to opposition from Rep. Marjorie Taylor Greene (R-Ga.).",
    "url": "https://thehill.com/homenews/house/4220034-mccarthy-backtracks-says-he-will-keep-ukraine-aid-in-pentagon-funding-bill/"
  },
  {
    "text": "Burgum makes late break for GOP's second debate  —  No candidate's participation is official until confirmed by the RNC.  —  North Dakota Gov. Doug Burgum is making a last-minute charge to the primary debate stage next week.  —  Burgum appears to have qualified for the second GOP debate … ",
    "url": "https://www.politico.com/news/2023/09/23/burgum-qualifies-second-debate-00117792"
  },
  {
    "text": "‘This is horrifying’: Top New Jersey Democrats call on Bob Menendez to resign after his second indictment  —  Democrats figured there would be new developments in the Bob Menendez investigation, but the charges are far more serious than any of them anticipated.",
    "url": "https://www.politico.com/news/2023/09/22/new-jersey-democrats-menendez-indictment-00117693"
  },
  {
    "text": "Statement by Governor Murphy on Today's Indictment Against U.S. Senator Robert Menendez  —  “The allegations in the indictment against Senator Menendez and four other defendants are deeply disturbing.  These are serious charges that implicate national security and the integrity of our criminal justice system.",
    "url": "https://nj.gov/governor/news/news/562023/approved/20230922a.shtml"
  },
  {
    "text": "Robert F. Kennedy Jr. Flirts With the Libertarian Party  —  Mr. Kennedy sat down with the party's chair in July, a previously undisclosed meeting, as Democrats fret about a third party bid.  —  For months, Robert F. Kennedy Jr. has said he plans to continue his long-shot challenge … ",
    "url": "https://www.nytimes.com/2023/09/23/us/politics/robert-f-kennedy-jr-libertarian-party.html"
  },
  {
    "text": "Newsom vetoes bill that would require parents to affirm child's gender identity in custody battles  —  Assemblywoman Lori Wilson, who introduced the bill, said she is ‘extremely disappointed’ in Newsom's veto  —  California Gov. Gavin Newsom, a Democrat, vetoed a bill late Friday night … ",
    "url": "https://www.foxnews.com/politics/newsom-vetoes-bill-would-require-parents-affirm-childs-gender-identity-custody-battles"
  }
]