[
  {
    "text": "E. Jean Carroll's Lawyer: Trump Told Me ‘See You Next Tuesday’  —  ALL CLASS  —  Roberta Kaplan, the attorney who represented E. Jean Carroll in her successful lawsuit against Donald Trump, says the ex-president used a vulgarity on her at the end of a deposition at Mar-a-Lago.",
    "url": "https://www.thedailybeast.com/e-jean-carrolls-lawyer-roberta-kaplan-trump-told-me-see-you-next-tuesday"
  },
  {
    "text": "Most Republicans aren't aware of Trump's various legal issues  —  There is an assumption, probably particularly among those who cover the news and those who read it, that Donald Trump's legal travails are common knowledge.  We talk about things like the potential effects of a Trump conviction … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/02/most-republicans-arent-aware-trumps-various-legal-issues/"
  },
  {
    "text": "Biden's economy keeps messing up Trump's message  —  “You can't blame the president when policies go wrong, and then say he's not responsible if things are going right.”  —  The U.S. economy just keeps getting better.  And it's forcing Donald Trump and his allies to contort the talking points … ",
    "url": "https://www.politico.com/news/2024/02/02/trump-and-his-allies-adjust-their-messaging-on-the-economy-as-it-steadily-improves-00139447"
  },
  {
    "text": "Trump Campaign Paid $20K to Fake a Union Rally  —  When Joe Biden became the first president to join a picket line this past September for the UAW, the Trump campaign scrambled to do something to counter the move.  Michigan is a critical state for both campaigns, and when auto workers went … ",
    "url": "https://www.meidastouch.com/news/trump-campaign-paid-20k-to-fake-a-union-rally"
  },
  {
    "text": "After Speedy Start, Appeals Court Slows Down on Trump Immunity Decision  —  The implications have started coming into focus with the scrapping of March 4 as the start date for the former president's federal trial on charges of trying to overturn the 2020 election.",
    "url": "https://www.nytimes.com/2024/02/03/us/politics/trump-immunity-appeals-court.html"
  },
  {
    "text": "At R.N.C. Meeting, Talk Is of Coming Trump Merger and Chairwoman's Fate  —  Donald Trump has long worked closely with Ronna McDaniel, the head of the Republican National Committee.  In private, he has begun to question its direction under her leadership.  —  In early 2021, when former … ",
    "url": "https://www.nytimes.com/2024/02/03/us/politics/trump-ronna-mcdaniel-rnc.html"
  },
  {
    "text": "The ‘runt’ of Trump cases now likely to be his first criminal trial  —  A trial about 2016 hush money will be the first criminal charges to test Trump in 2024  —  Of the four criminal cases former president Donald Trump is facing, charges filed in New York over 2016 hush money payments … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/02/trump-new-york-trial-first/"
  },
  {
    "text": "Special counsel mounts forceful — and unusual — defense of Trump classified documents case  —  The routine filing features a public rebuttal of “misimpressions” allegedly fueled by the former president.  —  Special counsel Jack Smith used a routine legal filing Friday to offer … ",
    "url": "https://www.politico.com/news/2024/02/02/special-counsel-mounts-forceful-and-unusual-defense-of-trump-classified-documents-case-00139456"
  },
  {
    "text": "U.S. retaliatory strikes start in Iraq and Syria in first response to Jordan drone attack  —  The military action is a significant escalation in Washington's bid to deter the growing threat from Iran-backed groups across the Middle East.  —  The United States launched attacks in the Iraq … ",
    "url": "https://www.nbcnews.com/news/world/us-retaliatory-strikes-start-iraq-syria-first-response-jordan-drone-at-rcna136928"
  },
  {
    "text": "It's The Impunity, Stupid  —  The very first time I decided to actually look into whether Tesla was doing what it said it was doing, I spent a long weekend discovering that its revolutionary battery swap station was a sham designed to rip off California's Zero Emission Vehicle program.",
    "url": "https://niedermeyer.io/2024/02/02/its-the-impunity-stupid/"
  },
  {
    "text": "Exclusive: Republican Hits Clarence Thomas With Lawsuit Over His Taxes  —  Republican John Anthony Castro is filing a lawsuit against Clarence Thomas, accusing the U.S. Supreme Court associate justice of failing to file his income taxes, Newsweek has learned.",
    "url": "https://www.newsweek.com/exclusive-republican-hits-clarence-thomas-lawsuit-over-his-taxes-1866488"
  },
  {
    "text": "The wild probe into investors of DWAC, Trump Media's proposed merger ally  —  Sales of Digital World Acquisition stock triggered a widespread federal probe that involved a confidential informant, a secret airport phone scan and an elite anti-money-laundering squad.  Three people were indicted, but the investigation continues.",
    "url": "https://www.washingtonpost.com/technology/2024/02/03/trump-social-dwac-investigation/"
  },
  {
    "text": "Kamala Harris Bolsters Biden for 2024 and Lays Groundwork for 2028  —  Stumping for the president ahead of South Carolina's Democratic primary, Ms. Harris has been working to shore up his vulnerabilities with Black voters and younger voters.  —  For decades, ambitious politicians with eyes … ",
    "url": "https://www.nytimes.com/2024/02/03/us/politics/kamala-harris-biden-south-carolina-primary.html"
  },
  {
    "text": "Supreme Court won't block West Point from considering race in admissions  —  The Supreme Court ruled the U.S. Military Academy at West Point may continue using race as a factor in admissions, leaving intact the slim remains of affirmative action in higher education.",
    "url": "https://thehill.com/regulation/court-battles/4440145-supreme-court-wont-block-west-point-race-admissions/"
  },
  {
    "text": "South Dakota apologizes — and pays transgender advocacy group $300,000 for discrimination  —  The state of South Dakota has issued an apology letter and a $300,000 payment to a transgender advocacy group for the abrupt cancellation of a Department of Health contract in 2022.",
    "url": "https://www.rawstory.com/south-dakota-apologizes-and-pays-transgender-advocacy-group-300000-for-discrimination/"
  },
  {
    "text": "CENTCOM Statement on U.S. Strikes in Iraq and Syria  —  TAMPA, Fla. - At 4:00 p.m. (EST) Feb. 02, U.S. Central Command (CENTCOM) forces conducted airstrikes in Iraq and Syria against Iran's Islamic Revolutionary Guards Corps (IRGC) Quds Force and affiliated militia groups.",
    "url": "https://www.centcom.mil/MEDIA/PRESS-RELEASES/Press-Release-View/Article/3665602/centcom-statement-on-us-strikes-in-iraq-and-syria/"
  },
  {
    "text": "Tommy Tuberville May Yet Pay for His Antics, if House Dems Have Their Way  —  Democrats on the House Oversight Committee on Friday called for an investigation into Senator Tommy Tuberville's blockade on military promotions.  —  Tuberville single-handedly blocked hundreds of military promotions … ",
    "url": "https://newrepublic.com/post/178713/tommy-tuberville-pay-military-blockade-house-democrats"
  }
]