[
  {
    "text": "New Mexico governor issues order suspending the right to carry firearms in public across Albuquerque  —  New Mexico Gov. Michelle Lujan Grisham on Friday issued an emergency order suspending the right to carry firearms in public across Albuquerque and the surrounding county for at least 30 days in response to a spate of gun violence.",
    "url": "https://apnews.com/article/albuquerque-guns-governor-concealed-carry-fc5b4b79bf411b8022c3ad58975724d7"
  },
  {
    "text": "5th Circuit finds Biden White House, CDC likely violated First Amendment  —  The three judge panel found that contacts with tech companies by officials from the White House, the surgeon general's office, the CDC and the FBI likely amounted to coercion  —  The U.S. Court of Appeals … ",
    "url": "https://www.washingtonpost.com/technology/2023/09/08/5th-circuit-ruling-covid-content-moderation/"
  },
  {
    "text": "Appeals Court Rules White House Overstepped 1st Amendment on Social Media  —  A Fifth Circuit panel partly upheld restrictions on the Biden administration's communications with online platforms about their content.  —  A federal appeals court ruled on Friday that the Biden administration … ",
    "url": "https://www.nytimes.com/2023/09/08/business/appeals-court-first-amendment-social-media.html"
  },
  {
    "text": "Appeals court reverses much of judge's order blocking Biden administration officials from communicating with social media companies  —  A federal appeals court narrowed a judge's order that blocked Biden administration officials from communicating with social media companies.",
    "url": "https://www.cnn.com/2023/09/08/politics/biden-administration-social-media-lawsuit/"
  },
  {
    "text": "Trump's Resilience Leaves Anxious G.O.P. Donors in Despair and Denial  —  The party's big donors have made clear their distaste for the former president.  Now, as he barrels toward the nomination, they are reacting with a mix of hand-wringing, calls to arms and fatalism.",
    "url": "https://www.nytimes.com/2023/09/09/us/politics/gop-donors-trump-primary.html"
  },
  {
    "text": "Pennsylvania Man Found Guilty of Felony and Misdemeanor Charges Related to Capitol Breach  —  Defendant smashed glass of the Senate Wing Door windowpane and window, allowing the mob to climb into Capitol Building  —  WASHINGTON - A Pennsylvania man was found guilty in the District … ",
    "url": "https://www.justice.gov/usao-dc/pr/pennsylvania-man-found-guilty-felony-and-misdemeanor-charges-related-capitol-breach"
  },
  {
    "text": "Jan. 6 shattered her family.  Now they're trying to forgive.  —  Peyton Reffitt has watched her family come apart after her father joined the Capitol riot mob.  Now she and her family are confronting the perceived betrayals and broken relationships.  —  Deep Reads features … ",
    "url": "https://www.washingtonpost.com/politics/interactive/2023/jan-6-reffitt-family-repair-relationships/"
  },
  {
    "text": "He Was Just the I.T. Guy.  Then He Got Caught in the Trump Documents Case.  —  Yuscil Taveras is among the little-known people with links to Donald Trump to have come under scrutiny.  So far, he's the only Trump employee known to have agreed to cooperate with prosecutors after facing charges.",
    "url": "https://www.nytimes.com/2023/09/09/us/politics/yuscil-taveras-trump-documents-case.html"
  },
  {
    "text": "What an unprecedented Biden ad blitz says about his reelection fight  —  A super PAC affiliate is spending $13 million far ahead of the normal advertising timeline.  —  The cavalry is arriving extraordinarily early for President Joe Biden.  —  With poll after brutal poll showing the president … ",
    "url": "https://www.politico.com/news/2023/09/09/what-an-unprecedented-biden-ad-blitz-says-about-his-reelection-fight-00114838"
  },
  {
    "text": "Wisconsin GOP's impeachment plan: Another MAGA coup against democracy  —  Republicans in the Badger State hatch an ingenious plot to thwart voters — but ultimately, they will pay the price  —  MAGA Republicans in Wisconsin are gearing up to impeach newly elected state Supreme Court Justice … ",
    "url": "https://www.salon.com/2023/09/08/wisconsin-gops-impeachment-plan-another-maga-coup-against-democracy/"
  },
  {
    "text": "Fox News fires veteran executive John Finley for violating company rules  —  Finley's conduct was investigated by an outside law firm.  He had also been the subject of an internal probe back in 2011 that cleared him.  —  Fox News has fired veteran executive John Finley after determining … ",
    "url": "https://www.washingtonpost.com/style/media/2023/09/09/john-finley-fox-news-executive-dismissed/"
  },
  {
    "text": "Vivek Ramaswamy says he'll deport children of undocumented immigrants born in the U.S.  —  Those children, however, are American citizens under the 14th Amendment.  —  Ramaswamy says he would deport U.S.-born children of undocumented immigrants  —  ORANGE CITY, IA — Republican presidential … ",
    "url": "https://www.nbcnews.com/politics/2024-election/vivek-ramaswamy-deport-children-undocumented-immigrants-born-us-rcna104143"
  },
  {
    "text": "FACT SHEET: World Leaders Launch a Landmark India-Middle East-Europe Economic Corridor  —  Today, we the leaders of the United States, India, Saudi Arabia, the United Arab Emirates, France, Germany, Italy and the European Union announced a Memorandum of Understanding committing to work together … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/09/09/fact-sheet-world-leaders-launch-a-landmark-india-middle-east-europe-economic-corridor/"
  },
  {
    "text": "Pastor Says It Was a Mistake to Let DeSantis Speak at Shooting Vigil  —  Ron DeSantis was booed as he took the mic at a vigil for the victims of the racially motivated Dollar Store attack in Jacksonville.  —  A pastor who emceed Florida Gov. Ron DeSantis at a vigil following the racist massacre … ",
    "url": "https://www.thedailybeast.com/pastor-john-allen-newman-regrets-inviting-ron-desantis-to-shooting-vigil"
  },
  {
    "text": "Judge denies Mark Meadows effort to move Georgia case to federal court  —  The ruling is a blow to Meadows's efforts in federal court to dismiss his case and could influence former president Donald Trump as he decides whether to seek removal himself.  —  A federal judge denied a request Friday … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/08/mark-meadows-court-decision-georgia/"
  }
]