[
  {
    "text": "Embattled Rep. George Santos hit with additional charges, including identity theft  —  Prosecutors said Santos claimed he made non-existent loans to his campaign while making unauthorized charges on donors' credit cards.  —  Federal prosecutors hit Rep. George Santos, R-N.Y. … ",
    "url": "https://www.nbcnews.com/politics/congress/santos-charged-identity-theft-rcna119819"
  },
  {
    "text": "Congressman George Santos Charged With Conspiracy, Wire Fraud, False Statements, Falsification of Records, Aggravated Identity Theft, and Credit Card Fraud  —  For Immediate Release  —  U.S. Attorney's Office, Eastern District of New York  —  Santos Allegedly Filed Fraudulent Fundraising Reports … ",
    "url": "https://www.justice.gov/usao-edny/pr/congressman-george-santos-charged-conspiracy-wire-fraud-false-statements-0"
  },
  {
    "text": "Federal prosecutors file new charges against Rep. George Santos  —  Federal prosecutors filed new criminal charges against Rep. George Santos.  —  LIVE  —  Federal prosecutors on Long Island filed new criminal charges against Rep. George Santos on Tuesday, accusing him of stealing people's identities … ",
    "url": "https://abcnews.go.com/Politics/federal-prosecutors-file-new-charges-rep-george-santos/story?id=103875995"
  },
  {
    "text": "Trump's Overrated Peace Plan Helped Enable the Horrors in Israel and Gaza  —  The Abraham Accords didn't bring “the dawn of a new Middle East,” they completely ignored the Palestinians and let the Netanyahu government do almost anything it wanted. … No American president caused Hamas … ",
    "url": "https://www.thedailybeast.com/trumps-overrated-peace-plan-helped-enable-horrors-in-israel-gaza"
  },
  {
    "text": "Former OSU wrestlers say Jim Jordan betrayed them and shouldn't be House speaker  —  “Do you really want a guy in that job who chose not to stand up for his guys?” said one former wrestler who attended OSU when Jordan was assistant coach.  —  Four of the former Ohio State University wrestlers … ",
    "url": "https://www.nbcnews.com/politics/politics-news/former-osu-wrestlers-say-jim-jordan-betrayed-shouldnt-house-speaker-rcna119116"
  },
  {
    "text": "Kari Lake announces run for Arizona Senate  —  Kari Lake announced her bid for Arizona Senate on Tuesday, entering the race for Sen. Kyrsten Sinema's (I-Ariz.) seat as the heavy favorite for the GOP nomination.  —  Lake, a Trump ally who has denied her loss in last year's Arizona governor's race … ",
    "url": "https://thehill.com/homenews/campaign/4245492-kari-lake-announces-run-for-arizona-senate/"
  },
  {
    "text": "DNC sues North Carolina over Republican-backed election bill  —  The Democratic National Committee (DNC) and the North Carolina Democratic Party on Tuesday filed a lawsuit against the North Carolina State Board of Election immediately after a pair of GOP-backed election laws went into effect … ",
    "url": "https://thehill.com/regulation/court-battles/4249060-dnc-sues-north-carolina-over-republican-backed-election-bill/"
  },
  {
    "text": "A tantalizing detail in a new Trump legal filing  —  The government signals it plans to prove Donald Trump's much-debated intent for taking and keeping classified documents  —  Donald Trump's many legal problems have led to a veritable fire hose of often-mundane, procedural court filings.",
    "url": "https://www.washingtonpost.com/politics/2023/10/10/trump-classified-documents-motive/"
  },
  {
    "text": "The Anti-Israel Left Needs to Take a Hard Look at Itself  —  On Saturday morning in southern Israel, Hamas murdered hundreds of people at a music festival and kidnapped others at gunpoint to serve as human shields in Gaza.  On Sunday afternoon in Midtown Manhattan, a speaker at a rally … ",
    "url": "https://www.nytimes.com/2023/10/10/opinion/israel-hamas-protests-left.html"
  },
  {
    "text": "Judge gives Peter Navarro 24 hours to show proof of why he deserves new contempt trial  —  When former Trump White House advisor Peter Navarro asked a federal judge for a new trial, he claimed it was necessary because protesters holding signs such as, 'Bro, Should've Pled the 5th' and 'Peter … ",
    "url": "https://lawandcrime.com/high-profile/judge-gives-peter-navarro-24-hours-to-show-proof-of-why-he-deserves-new-contempt-trial/"
  },
  {
    "text": "When Hamas Tells You Who They Are, Believe Them  —  A close read of Hamas's founding documents shows their genocidal intentions … — William L. Shirer, The Rise and Fall of the Third Reich  —  How many Israelis, or Jews, or anyone else for that matter, have read the 1988 Hamas Covenant … ",
    "url": "https://www.theatlantic.com/international/archive/2023/10/hamas-covenant-israel-attack-war-genocide/675602/"
  },
  {
    "text": "Moms for Liberty meets its match: Parents in this swing suburban district are fighting back  —  Republicans hope to use education wars to turn purple suburbia red.  In one Pennsylvania district, that backfired  —  “Monster Liberty”: That's how the otherwise excellent closed-captioning service … ",
    "url": "https://www.salon.com/2023/10/10/moms-for-liberty-meets-its-match-parents-in-this-swing-suburban-district-are-fighting-back/"
  },
  {
    "text": "When People Tell You Who They Are, Believe Them  —  Look carefully at who is calling this bloodshed ‘liberation.’ And who is remaining silent.  —  Bring Back My Children: An Israeli Mother's Plea  —  ‘It Is Right to Rebel!  Israel, Go to Hell!’  —  After the worst massacre of Jews since … ",
    "url": "https://www.thefp.com/?gclid=Cj0KCQjw7JOpBhCfARIsAL3bobdjnBy5_baITfmeA6rHT060w6ycdyYAOmiIkCP7PuisA2r-CZq7yosaApLZEALw_wcB"
  },
  {
    "text": "Trump dips into internet conspiracy theories with his latest lines about Obama  —  Donald Trump had been alluding to the idea that his predecessor, Barack Obama, is still in charge before he outright said it in New Hampshire this week.  —  WOLFEBORO, N.H. — Former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-dips-internet-conspiracies-latest-lines-obama-rcna119571"
  },
  {
    "text": "Tuberville reports former CIA director Hayden to Capitol Police over tweet  —  Sen. Tommy Tuberville (R-Al.) reported the former CIA Director Michael Hayden to the Capitol Police on Tuesday over the former general's tweet suggesting the lawmaker should be removed from the human race.",
    "url": "https://thehill.com/policy/defense/4248524-tuberville-reports-former-cia-director-hayden-to-capitol-police-over-tweet/"
  },
  {
    "text": "Kevin Phillips, 82, Dies; Political Analyst Predicted G.O.P. Resurgence  —  A conservative mastermind of the race-based “Southern strategy,” he later, as a writer, had second thoughts after assessing income inequality under three Republican presidents.  —  Kevin Phillips, a self-taught … ",
    "url": "https://www.nytimes.com/2023/10/10/us/politics/kevin-phillips-dead.html"
  },
  {
    "text": "Clarence Thomas Wants to Go After Freedom of the Press  —  Amid coverage of his relationships with high-profile conservatives, the Supreme Court justice wants to reconsider a landmark First Amendment cases … Justice Clarence Thomas has some thoughts.  —  The 1964 ruling established limits … ",
    "url": "https://www.rollingstone.com/politics/politics-news/clarence-thomas-challenge-landmark-defamation-ruling-1234850483/"
  },
  {
    "text": "War in the Middle East  —  A Statement from President Claudine Gay  —  As the events of recent days continue to reverberate, let there be no doubt that I condemn the terrorist atrocities perpetrated by Hamas.  Such inhumanity is abhorrent, whatever one's individual views of the origins of longstanding conflicts in the region.",
    "url": "https://www.harvard.edu/president/news/2023/war-in-the-middle-east/"
  },
  {
    "text": "Tim Scott, please drop out, urge others to follow and unite behind Haley  —  Disclosure: The columnist's wife, Mari Will, an adviser to Republican presidential candidate Sen. Tim Scott (S.C.), disagrees with this column.  —  There is national incredulity, exhaustion, embarrassment … ",
    "url": "https://www.washingtonpost.com/opinions/2023/10/10/tim-scott-drop-out-endorse-nikki-haley/"
  },
  {
    "text": "Warner, Kaine urge DOJ to probe Gov. Youngkin's ‘purge’ of voter rolls  —  RICHMOND — Democratic Sens. Mark R. Warner and Tim Kaine of Virginia are urging Attorney General Merrick Garland to investigate whether the Youngkin administration violated the Voting Rights Act when it wiped … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/10/10/warner-kaine-doj-virginia-voter-rolls/"
  },
  {
    "text": "Tester, Manchin call on Biden to freeze $6 billion in Iranian assets  —  Sens. Jon Tester (D-Mont.) and Joe Manchin (D-W.Va.), who are both facing tough re-elections next year, on Tuesday said the Biden administration should immediately “freeze” the $6 billion in funds that are set to be released to Iran as part of a prisoner exchange.",
    "url": "https://thehill.com/homenews/senate/4248839-tester-manchin-call-on-biden-to-freeze-6-billion-in-iranian-assets/"
  },
  {
    "text": "In Search of Kamala Harris  —  After nearly three years, the vice president is still struggling to make the case for herself — and feels she shouldn't have to.  —  All the conditions seemed right for a chance to reset the narrative.  —  At the Munich Security Conference in February … ",
    "url": "https://www.nytimes.com/2023/10/10/magazine/kamala-harris.html"
  },
  {
    "text": "Heat for NYC-DSA after pro-Palestine rally  —  HAPPENING TODAY: Former Rep. Tom Suozzi is expected to launch his comeback bid for the seat now held by Rep. George Santos, three people familiar with the plan told Playbook.  The Democrat — and many other challengers — are thinking … ",
    "url": "https://www.politico.com/newsletters/new-york-playbook/2023/10/10/heat-for-nyc-dsa-after-pro-palestine-rally-00120675"
  }
]