[
  {
    "text": "Wikileaks founder Julian Assange to plead guilty, return to Australia  —  WASHINGTON (AP) — WikiLeaks founder Julian Assange will plead guilty to a felony charge in a deal with the U.S. Justice Department that will free him from prison and resolve a long-running legal saga that spanned multiple continents … ",
    "url": "https://apnews.com/article/assange-plea-deal-wikileaks-justice-department-d329ba4614dbfa77b5eb968d07fd9bd0"
  },
  {
    "text": "Julian Assange has reached a plea deal with the U.S., allowing him to go free  —  The WikiLeaks founder has been held in a prison outside London for the last five years and fought extradition to the United States.  —  WASHINGTON — WikiLeaks founder Julian Assange plans to plead guilty … ",
    "url": "https://www.nbcnews.com/politics/justice-department/julian-assange-reached-plea-deal-us-allowing-go-free-rcna158695"
  },
  {
    "text": "Julian Assange leaves UK after striking deal with US justice department  —  It is anticipated the WikiLeaks founder will plead guilty to violating US espionage law at a hearing in Saipan and will be allowed to return to Australia  —  Julian Assange has been released from a British prison … ",
    "url": "https://www.theguardian.com/media/article/2024/jun/25/julian-assange-plea-deal-with-us-free-to-return-australia"
  },
  {
    "text": "Clinton to Biden: Rebutting Trump's debate “blather” is a “waste of time” … - “He starts with nonsense and then digresses into blather,” she said of the presumptive GOP nominee for president, who defeated her in the 2016 election.  — “Yet expectations for him are so low … ",
    "url": "https://www.axios.com/2024/06/25/trump-biden-2024-debate-hillary-clinton"
  },
  {
    "text": "Two years ago today, on June 24, 2022, the U.S. Supreme Court handed down the Dobbs v. Jackson Women's Health Organization decision, overturning the 1973 Roe v. Wade decision that recognized a woman's right to terminate a pregnancy.  The vote was 6-3.  —  The three justices appointed … ",
    "url": "https://heathercoxrichardson.substack.com/p/june-24-2024"
  },
  {
    "text": "Alex Jones' Bankruptcy Trustee Plans To Shutter Infowars And ‘Liquidate Its Inventory’  —  It's the first time the trustee has said publicly he plans to close down Infowars.  —  LOADING  —  The court-appointed trustee overseeing the liquidation of Alex Jones' estate plans to shut … ",
    "url": "https://www.huffpost.com/entry/alex-jones-inforwars-liquidate-trustee_n_6679fdeee4b0604360affd9c"
  },
  {
    "text": "Infant mortality rate rose 8% in wake of Texas abortion ban, study shows  —  In the wake of Texas' abortion ban, the state's infant death rate increased and more died of birth defects, a study published Monday shows.  —  The analysis out of Johns Hopkins University is the latest research … ",
    "url": "https://apnews.com/article/abortion-texas-infant-mortality-birth-defects-b055ac35cdbc9ec13f400b4c3e1056e7"
  },
  {
    "text": "Conservative US lawmakers are pushing for an end to no-fault divorce  —  Republicans in Louisiana, Oklahoma, Nebraska and Texas have discussed eliminating or restricting such cases  —  Some prominent conservative lawmakers and commentators are advocating for ending no-fault divorce … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/25/republicans-no-fault-divorce"
  },
  {
    "text": "Conservatives win longtime Liberal stronghold Toronto-St. Paul's in shock byelection result  —  Stunning result raises questions about Prime Minister Justin Trudeau's future  —  Conservative candidate Don Stewart has won the longtime federal Liberal stronghold of Toronto-St. Paul's … ",
    "url": "https://www.cbc.ca/news/politics/byelection-polls-liberal-conservative-ballot-vote-1.7243748"
  },
  {
    "text": "Exclusive: Trump reviews plan to halt US military aid to Ukraine unless it negotiates peace with Moscow  —  Two key advisers to Donald Trump have presented him with a plan to end Russia's war in Ukraine — if he wins the presidential election — that involves telling Ukraine … ",
    "url": "https://www.reuters.com/world/us/trump-reviews-plan-halt-us-military-aid-ukraine-unless-it-negotiates-peace-with-2024-06-25/"
  },
  {
    "text": "One question Trump must be asked in the debate  —  On April 12, 2024, former president Donald Trump sat down for an interview with Time Magazine.  During the interview, Trump was asked explicitly about whether he would allow women to obtain abortion pills if he won another term as president.",
    "url": "https://popular.info/p/one-question-trump-must-be-asked"
  },
  {
    "text": "“Months she wasted”: National security lawyer says Judge Cannon's “hubris” turned case into a “mess”  —  Trump judge already made “egregiously flawed ruling” and appears to be “in over her head,” Bradley Moss told Salon  —  With no trial date in sight for Donald Trump's classified documents case … ",
    "url": "https://www.salon.com/2024/06/24/months-she-wasted-national-security-lawyer-says-cannons-hubris-turned-case-into-a-mess/"
  },
  {
    "text": "Israel supreme court rules religious seminary students must be drafted to military  —  Israel's Supreme Court ruled on Tuesday that the state must begin drafting ultra-Orthodox Jewish seminary students into the military, a decree which creates new political strains for embattled Prime Minister Benjamin Netanyahu.",
    "url": "https://www.reuters.com/world/middle-east/israel-supreme-court-rules-religious-seminary-students-must-be-drafted-military-2024-06-25/"
  },
  {
    "text": "From Virginia to Colorado, MAGA infighting during primaries puts the GOP into disarray  —  Far-right Republicans in Arizona threaten revolt against Donald Trump for being too “deep state”  —  Because the MAGA movement made kookiness a competitive sport, it was inevitable that some Republican activists … ",
    "url": "https://www.salon.com/2024/06/25/from-virginia-to-colorado-maga-infighting-during-primaries-puts-the-into-disarray/"
  },
  {
    "text": "Scoop: 16 Nobel economists see a Trump inflation bomb … - “While each of us has different views on the particulars of various economic policies, we all agree that Joe Biden's economic agenda is vastly superior to Donald Trump,” the 16 economists write in a letter, first obtained by Axios.",
    "url": "https://www.axios.com/2024/06/25/nobel-prize-winners-biden-economy-trump-inflation"
  },
  {
    "text": "Special counsel falters in push to limit Trump's attacks on FBI agents  —  Judge Cannon does not seem likely to rule ahead of this week's presidential debate on whether to bar Donald Trump from attacking agents involved in his case  —  FORT PIERCE, Fla. — Federal prosecutors struggled … ",
    "url": "https://www.washingtonpost.com/national-security/2024/06/24/trump-cannon-fbi-false-threats/"
  },
  {
    "text": "Surgeon General Declares Gun Violence a Public Health Crisis  —  Dr. Vivek Murthy is calling for a multipronged effort to reduce gun deaths, modeled on campaigns against smoking and traffic fatalities.  —  The U.S. surgeon general, Dr. Vivek Murthy, on Tuesday declared gun violence in America … ",
    "url": "https://www.nytimes.com/2024/06/25/health/gun-violence-surgeon-general.html"
  },
  {
    "text": "Von der Leyen, Costa, Kallas approved for EU top jobs by negotiators  —  The six EU leaders negotiating the bloc's top jobs have agreed that Germany's Ursula von der Leyen, Portugal's António Costa, and Estonia's Kaja Kallas should get the most senior positions at the European Commission … ",
    "url": "https://www.politico.eu/article/von-der-leyen-costa-kallas-approved-for-eu-top-jobs-by-negotiators/"
  }
]