[
  {
    "text": "Fox News Poll: Harris is ahead of Trump by 3 points in Georgia  —  Georgians trust Harris over Trump on helping the middle class by 7 points  —  In a head-to-head matchup, Vice President Kamala Harris tops former President Trump by 3 percentage points in a Fox News survey of Georgia voters.",
    "url": "https://www.foxnews.com/official-polls/fox-news-poll-harris-ahead-trump-3-points-georgia"
  },
  {
    "text": "Kamala Harris Holds Razor-Thin Lead Across Swing States in Tight 2024 Race  —  About a month before the election, the vice president is eroding Trump's advantage on the economy, the latest Bloomberg News/Morning Consult Poll finds. … Vice President Kamala Harris has all but neutralized … ",
    "url": "https://www.bloomberg.com/news/features/2024-09-26/harris-holds-thin-lead-over-trump-in-swing-state-poll-election-2024"
  },
  {
    "text": "For young men who grew up in the Trump era, the 2024 election is about one big thing  —  In two focus groups with skeptical young male voters, virtually everyone described their vote as based more about backing or opposing Trump than anything about Harris.  —  New focus groups … ",
    "url": "https://www.nbcnews.com/politics/2024-election/young-men-grew-trump-era-2024-election-one-big-thing-rcna172321"
  },
  {
    "text": "Kamala Harris's Campaign Thinks She Can Win on the Economy.  Here's How.  —  Harris advisers point to a number of brightening public polls showing that Donald Trump's lead is eroding on the critical question of whom voters trust most on the economy.  —  For many months, it has been an undisputed … ",
    "url": "https://www.nytimes.com/2024/09/26/us/politics/trump-harris-economy.html"
  },
  {
    "text": "Read the JD Vance Dossier  —  We publish what others won't.  Subscribe to support our work and for updates on this breaking story.  —  Behold the dossier.  —  It reportedly comes from an alleged Iranian government hack of the Trump campaign, and since June, the news media has been sitting on it … ",
    "url": "https://www.kenklippenstein.com/p/read-the-jd-vance-dossier"
  },
  {
    "text": "Newsmax and Smartmatic settle 2020 election defamation case on eve of trial  —  CNN  —  The pro-Trump cable channel Newsmax has settled a major 2020 election defamation lawsuit with Smartmatic in a last-minute agreement to avoid a high-stakes trial that posed a significant risk to the small outlet, according to a court official.",
    "url": "https://www.cnn.com/2024/09/26/business/newsmax-smartmatic-settle-defamation-case"
  },
  {
    "text": "Newsmax and Smartmatic settle 2020 election defamation case on eve of trial  —  The pro-Trump cable outlet Newsmax and voting technology company Smartmatic settled a major defamation lawsuit Thursday in a last-minute agreement, averting a high-stakes trial over the airing of false 2020 election claims.",
    "url": "https://www.cnn.com/2024/09/26/media/newsmax-smartmatic-settle-defamation-case"
  },
  {
    "text": "Jack Smith files evidence in Trump 2020 election subversion case  —  The special counsel's submission is being kept under wraps, for now.  —  Special counsel Jack Smith has filed a detailed compilation of evidence he's assembled to support charges that former President Donald Trump broke federal law … ",
    "url": "https://www.politico.com/news/2024/09/26/jack-smith-election-subversion-brief-00181331"
  },
  {
    "text": "Ex-Kansas GOP senator backs Harris  —  Former Kansas Republican Sen. Nancy Kassebaum (R-Kan.) is endorsing Vice President Harris in the 2024 presidential election, stating the White House contest “presents a stark choice that is not easy for any of us.”  —  Kassebaum, who served three terms … ",
    "url": "https://thehill.com/homenews/campaign/4902704-former-kansas-gop-senator-nancy-kassebaum-endorses-kamala-harris/"
  },
  {
    "text": "Ron Wyden unveils plan to overhaul and expand the “power hungry” Supreme Court  —  The sweeping plan would add six new judges to the high court, appointed over three successive presidential terms  —  A new bill proposed by Sen. Ron Wyden, D-Ore., would dramatically overhaul the Supreme Court … ",
    "url": "https://www.salon.com/2024/09/26/ron-wyden-unveils-plan-to-overhaul-and-expand-the-power-hungry/"
  },
  {
    "text": "Zelenskyy visits Washington as election year divide grows over Ukraine war  —  With American support for Ukraine at a partisan crossroads, Vice President Kamala Harris on Thursday slammed suggestions that Kyiv should cede territory for the sake of peace with Moscow as “dangerous and unacceptable.”",
    "url": "https://apnews.com/article/zelenskyy-joe-biden-kamala-harris-trump-229804fd42332c584dfbe05224634e44"
  },
  {
    "text": "McConnell: Democrats would end the filibuster if they sweep on Election Day  —  The News  —  Mitch McConnell is convinced of one thing: The Democratic Party would have the support it needs to kill the Senate filibuster if it takes full control of Washington this year.",
    "url": "https://www.semafor.com/article/09/26/2024/mcconnell-democrats-would-end-the-filibuster-if-they-win-big-this-year"
  },
  {
    "text": "North Carolina removes 747,000 from voter rolls, citing ineligibility  —  North Carolina's State Board of Elections has removed 747,000 people from its list of registered voters within the last 20 months, officials announced Thursday in a press release.  —  The State Board of Elections … ",
    "url": "https://thehill.com/homenews/campaign/4901476-north-carolina-purges-747k-voters/"
  },
  {
    "text": "Millions of Vehicles Could Be Hacked and Tracked Thanks to a Simple Website Bug  —  Researchers found a flaw in a Kia web portal that let them track millions of cars, unlock doors, and start engines at will—the latest in a plague of web bugs that's affected a dozen carmakers.",
    "url": "https://www.wired.com/story/kia-web-vulnerability-vehicle-hack-track/"
  },
  {
    "text": "A New York Court Questioned If Trump Was Correctly Nailed For Bank Fraud  —  The state appeals court is evaluating whether Letitia James went too far in the case that has Trump facing a half-billion-dollar judgment.  — Copy  —  As Donald Trump's lawyers tried on Thursday to overturn … ",
    "url": "https://www.notus.org/courts/new-york-appeals-court-trump-bank-fraud"
  },
  {
    "text": "Trump Would Totally Demolish Economy With His Plans, Says New Report  —  Donald Trump says he has a plan for the economy, but that doesn't mean it's any good.  —  According to independent nonprofit nonpartisan researchers, Trump's policies on tariffs, deportations, and the Federal Reserve would … ",
    "url": "https://newrepublic.com/post/186413/trump-demolish-economy-hike-inflation-report"
  },
  {
    "text": "Trump Media shareholder UAV dumped nearly 11 million shares … United Atlantic Ventures LLC, a major shareholder in Trump Media, has sold or otherwise gotten rid of nearly 11 million shares in the company, according to a regulatory filing Thursday.  —  The move left UAV, a partnership of former … ",
    "url": "https://www.cnbc.com/2024/09/26/trump-media-shareholder-dumped-more-than-7point5-million-shares.html"
  },
  {
    "text": "The Eric Adams Indictment Is Laden With Irony  —  The tough-on-crime mayor was, according to prosecutors, pretty easy to buy.  —  The indictment of Eric Adams, unsealed Thursday, is a colorful document, alleging over $100,000 in graft, the defrauding of $10 million in public funds, and a whole lot of subsidized travel to Turkey.",
    "url": "https://slate.com/news-and-politics/2024/09/eric-adams-indictment-turkey-hotels-airplanes-crime.html"
  },
  {
    "text": "FACT SHEET: President Biden and Vice President Harris Announce Additional Actions to Reduce Gun Violence and Save Lives  —  New Executive Order Directs Federal Agencies to Combat Emerging Firearms Threats and  —  Improve School-Based Active Shooter Drills  —  Today, President Biden … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/09/26/fact-sheet-president-biden-and-vice-president-harris-announce-additional-actions-to-reduce-gun-violence-and-save-lives/"
  },
  {
    "text": "Secret Service staffing shortage prompts Trump campaign to move Wisconsin rally  —  Former President Donald Trump's campaign scrapped plans for an upcoming outdoor rally in Wisconsin after the Secret Service said it did not have the personnel needed to secure the site, multiple sources told CBS News.",
    "url": "https://www.cbsnews.com/news/trump-wisconsin-rally-secret-service/"
  },
  {
    "text": "Hochul examining dormant power to remove a New York City mayor  —  The governor's power to remove an elected official hasn't been exercised in decades.  —  ALBANY, New York — Gov. Kathy Hochul has begun to examine a long-dormant power that lets governors remove local officials such as New York City mayors … ",
    "url": "https://www.politico.com/news/2024/09/26/hochul-new-york-city-mayor-00181349"
  },
  {
    "text": "Tim Walz will hold a fundraiser in JD Vance's Ohio hometown  —  Scott Wartman Sharon CoolidgeUSA TODAY NETWORK  —  A few days after 2024 Democratic vice presidential nominee Tim Walz debates his Republican rival JD Vance, the Minnesota governor will hold a fundraiser in the Ohio senator's current hometown Cincinnati.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/09/26/walz-fundraiser-cincinnati-jd-vance/75401364007/"
  },
  {
    "text": "Waffle House is more than a restaurant during a disaster, it's a measurement for FEMA  —  The index has three levels - Green, Yellow, and Red.  —  MIDWAY, Fla. (WTXL) — When you think of Waffle House you probably never think about the importance it has when it comes to natural disasters.",
    "url": "https://www.wtxl.com/news/local-news/in-your-neighborhood/waffle-house-is-more-than-a-restaurant-during-a-disaster-its-a-measurement-for-fema"
  },
  {
    "text": "Poverty Soars Past 50% in Argentina as Milei Austerity Hits Hard  — Nearly 53% couldn't make ends meet in first half of year  — Spokesman blames ‘crude reality’ on past populist policies  —  Poverty in Argentina reached its highest level since the aftermath of the 2001 financial crisis … ",
    "url": "https://www.bloomberg.com/news/articles/2024-09-26/poverty-soars-past-50-in-argentina-as-milei-austerity-hits-hard"
  }
]