[
  {
    "text": "Live updates: Government shutdown disarray offers preview of Trump term battles  —  Just as the government funding deadline arrived early Saturday, Congress passed an interim plan to prevent a shutdown after a chaotic few days and nights in Washington.  —  President Biden is expected to sign the funding bill on Saturday.",
    "url": "https://thehill.com/homenews/house/5051942-live-updates-government-shutdown-congress-trump/"
  },
  {
    "text": "Transition Live Updates: House Approves Stopgap Funding Bill Hours Ahead of Shutdown Deadline  —  The new legislation would keep the government open but did not include the debt ceiling increase that President-elect Donald J. Trump had demanded.  It now goes to the Senate.  —  Here are the latest developments.",
    "url": "https://www.nytimes.com/live/2024/12/20/us/government-shutdown-trump-news"
  },
  {
    "text": "House passes bill to avert government shutdown after whirlwind funding fight  —  The House approved legislation to avert a government shutdown hours before the deadline Friday, sending the bill to the Senate for consideration after a whirlwind week on Capitol Hill.",
    "url": "https://thehill.com/homenews/house/5051634-government-funding-shutdown-house-bill/"
  },
  {
    "text": "House Republicans just exposed the limits of Trump's power  —  Support independent journalism that matters — become a Vox Member today.  —  This week's installment of the long-running saga, “House Republicans cannot govern,” will soon be forgotten.  Elon Musk's decision to blow … ",
    "url": "https://www.vox.com/politics/392278/government-shutdown-fight-spending-bill-trump-musk-house-republicans"
  },
  {
    "text": "8 policies stripped from GOP bill after Trump, Musk rebellion  —  Research for children's health, a crackdown on junk fees, pay hikes for lawmakers and more were jettisoned from the legislation.  —  The House of Representatives approved legislation Friday to keep the government funded … ",
    "url": "https://www.washingtonpost.com/business/2024/12/20/musk-trump-children-health-debt/"
  },
  {
    "text": "House passes 11th-hour bill to avert government shutdown … - The vote was 366-34.  — The measure also includes a one-year Farm Bill extension and over $100 billion in disaster relief for hurricane-ravaged areas. … - The House failed to pass a bill Thursday that would have also included … ",
    "url": "https://www.axios.com/2024/12/20/house-passes-government-shutdown"
  },
  {
    "text": "Mike Johnson's magic debt ceiling promise … - Don't ask about Plan C: It lived a short, unhappy life, mostly confined to X.  — Johnson's Plan D survived because Republicans pretended the debt ceiling was in the agreement and Democrats know that it's not.",
    "url": "https://www.axios.com/2024/12/20/mike-johnson-debt-ceiling-promise-trump"
  },
  {
    "text": "Justice Thomas Did Not Disclose Additional Trips, Democrats Say  —  The revelation was included in a report by Democratic staff members on the Senate Judiciary Committee who had conducted a 20-month investigation into ethics practices at the Supreme Court.  —  Justice Clarence Thomas failed … ",
    "url": "https://www.nytimes.com/2024/12/21/us/politics/clarence-thomas-trips-disclosure-investigation.html"
  },
  {
    "text": "Senate Democrats blast Supreme Court's ‘ethical crisis’ as investigation concludes  —  With Republicans about to take control of the Senate, Democrats on the Judiciary Committee issued a report detailing alleged ethical lapses by justices.  —  WASHINGTON — A lengthy investigation … ",
    "url": "https://www.nbcnews.com/politics/congress/senate-democrats-blast-supreme-courts-ethical-crisis-investigation-rcna184987"
  },
  {
    "text": "Senate confirms Biden's 235th judge, beating Trump's record  —  It's an important milestone for Joe Biden as he tops his predecessor Donald Trump's total number of judicial nominees confirmed before handing the White House back over to him.  —  WASHINGTON — The Democratic-led Senate confirmed … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/senate-confirms-bidens-235th-judge-beating-trumps-record-rcna182832"
  },
  {
    "text": "Outrage as Elon Musk claims ‘only AfD can save Germany’  —  German health minister calls US billionaire's intervention weeks before election ‘undignified and problematic’  —  Elon Musk has caused outrage in Berlin after appearing to endorse the far-right, anti-immigrant Alternative für Deutschland.",
    "url": "https://www.theguardian.com/world/2024/dec/20/elon-musk-claims-only-afd-can-save-germany"
  },
  {
    "text": "Senate confirms 2 Biden judicial nominees, boosting total over Trump  —  President Joe Biden's diverse cohort of judges includes more women, people of color and LGBTQ+ individuals than any other U.S. president.  —  The Senate on Friday confirmed President Joe Biden's last two judicial nominees … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/20/biden-judges-trump-record/"
  },
  {
    "text": "Biden Weighs Commuting Sentences of Death Row Inmates  —  Amid pleas from religious and civil-rights groups, president is considering whether to convert death sentences to life without parole  —  WASHINGTON—President Biden is considering commuting the sentences of most, if not all … ",
    "url": "https://www.wsj.com/us-news/law/biden-weighs-commuting-sentences-of-death-row-inmates-d24fcc15?st=8q8Jmn"
  },
  {
    "text": "Senate approves bill to expand Social Security to millions of Americans  —  Legislation to expand Social Security benefits to millions of Americans passed the U.S. Senate early Saturday and is now headed to the desk of President Biden, who is expected to sign the measure into law.",
    "url": "https://www.cbsnews.com/news/social-security-fairness-act-senate-vote-passed/"
  },
  {
    "text": "Iceland's Social Democrats Reach Deal for New Government  — Three-party coalition vows prudent budgets, war on inflation  — Referendum on resuming EU entry talks seen before 2027  —  Iceland's new ruling coalition agreed on a platform of budget restraint to fight inflation … ",
    "url": "https://www.bloomberg.com/news/articles/2024-12-21/iceland-s-social-democrats-reach-deal-for-coalition-government"
  },
  {
    "text": "Sentencing closes chapter for Oath Keeper seeking redemption after Jan. 6  —  Joshua James pleaded guilty to seditious conspiracy but later became a crucial cooperator for prosecutors.  —  Joshua James earned his Purple Heart in 2007, when an IED tore through a bridge he was crossing in Baghdad … ",
    "url": "https://www.politico.com/news/2024/12/20/oath-keeper-sentencing-jan-6-00195780"
  },
  {
    "text": "San Diego official resigns suddenly over ‘security reasons’  —  Supervisor Nora Vargas was heavily involved in a recent effort to enact a “sanctuary” immigration policy in San Diego County.  —  A member of the board of supervisors in California's second-largest county abruptly resigned Friday … ",
    "url": "https://www.politico.com/news/2024/12/20/san-diego-supervisor-resigns-00195764"
  }
]