[
  {
    "text": "CNN Plots Major Overhaul as It Enters a New Trump Era  —  Mark Thompson has promised to reinvent CNN since he arrived in 2023.  Now, he is remaking the network's TV lineup and its work force.  —  Give people news when and where they want it.  —  That, says Mark Thompson, CNN's chief executive … ",
    "url": "https://www.nytimes.com/2025/01/23/business/media/cnn-layoffs-mark-thompson.html?unlocked_article_code=1.rU4.Ktql.gY13zafutkB6&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "CNN to lay off hundreds of employees as post-inauguration transformation begins, sources say … Warner Bros. Discovery's CNN plans to lay off hundreds of employees Thursday as it refocuses the business around a global digital audience, according to people familiar with the matter.",
    "url": "https://www.cnbc.com/2025/01/22/cnn-to-lay-off-hundreds-of-employees-post-inauguration.html"
  },
  {
    "text": "Donald Trump's war on DEI is not about “merit”  —  Executive orders attacking DEI are about promoting unqualified white men over diverse candidates  —  Donald Trump lies about everything, but the lies strewn throughout his executive order shutting down diversity, equity, and inclusion (DEI) … ",
    "url": "https://www.salon.com/2025/01/23/donald-on-dei-is-not-about-merit/"
  },
  {
    "text": "Trump Revokes Security Detail for Pompeo and Others Despite Threats From Iran  —  The officials had been part of an aggressive posture against Iran during President Trump's first term.  —  President Trump revoked security protection for his former secretary of state, Mike Pompeo … ",
    "url": "https://www.nytimes.com/2025/01/23/us/politics/trump-pompeo-security-iran.html"
  },
  {
    "text": "Immigrants rush to prepare for Trump deportation raids … - Trump's executive orders that began laying the groundwork for his mass deportations reversed several longstanding policies. … - The New Mexico-based immigrant rights advocacy group Somos Un Pueblo Unido said it's launching a … ",
    "url": "https://www.axios.com/2025/01/23/immigrants-scramble-trump-deportation-raids"
  },
  {
    "text": "Justice Dept. Cancels Entry-Level Job Offers in Honors Program  —  The program, which has functioned quietly for decades, is the latest target of Trump administration appointees who are eager to exert more control over who gets government jobs.  —  The Justice Department has abruptly rescinded job offers … ",
    "url": "https://www.nytimes.com/2025/01/23/us/politics/justice-honors-program-trump.html"
  },
  {
    "text": "Trump threatens to withhold aid for California wildfires in first TV interview since inauguration  —  “I don't think we should give California anything until they let water flow down,” he told Sean Hannity  —  Trump slams Biden over prosecutions, pardons  —  President Donald Trump threatened … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/22/trump-hannity-interview/"
  },
  {
    "text": "Trump Administration Temporarily Mutes Federal Health Officials  —  Scientific meetings were canceled, and research data on the bird flu outbreak was delayed, amid confusion over the directive.  —  The Trump administration, moving quickly to clamp down on health and science agencies … ",
    "url": "https://www.nytimes.com/2025/01/22/health/trump-health-communications.html?unlocked_article_code=1.rU4.ebZH.piselgtAibJA&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump hits NIH with ‘devastating’ freezes on meetings, travel, communications, and hiring  —  Researchers facing “a lot uncertainty, fear and panic”  —  Donald Trump's return to the White House is already having a big impact at the $47.4 billion U.S. National Institutes of Health (NIH) … ",
    "url": "https://www.science.org/content/article/trump-hits-nih-devastating-freezes-meetings-travel-communications-and-hiring"
  },
  {
    "text": "Playbook: Donny does Davos  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  Good Thursday morning.  This is Jack Blanchard, four days in and already running dangerously low on supplies of Yorkshire Tea.  Messages of support to [email protected].  —  DRIVING THE DAY",
    "url": "https://www.politico.com/newsletters/playbook/2025/01/23/donny-does-davos-00200181"
  },
  {
    "text": "President Trump, Crypto Billionaire  —  His new family tokens, which have soared in value, are courting legal and political trouble.  —  Donald Trump doesn't always separate his personal interests from his public obligations, and a howling example is his sudden new status as a crypto billionaire.",
    "url": "https://www.wsj.com/opinion/donald-trump-crypto-token-melania-securities-and-exchange-commission-8cb7abf2?st=HoCrCm&reflink=article_copyURL_share"
  },
  {
    "text": "The shitcoin presidency  —  $TRUMP is taking corruption to new levels.  —  Donald Trump declared on the campaign trail that he'd be a “crypto president” during his second term.  He said he'd make America “the crypto capital of the planet” and a “bitcoin superpower.”",
    "url": "https://www.publicnotice.co/p/trumps-memecoin-grift-explained"
  },
  {
    "text": "Musk mocks Nazi salute accusations with puns  —  Elon Musk referenced Adolf Hitler and other Nazi leaders in a social media post filled with puns early Thursday taunting those who accused him of doing a Nazi salute at an event after President Trump's inauguration.  —  “Don't say Hess to Nazi accusations!",
    "url": "https://thehill.com/homenews/administration/5102198-elon-musk-nazi-salute-controversy/"
  },
  {
    "text": "ChatGPT down: AI chat app not working as website goes offline  —  Your support helps us to tell the story  —  From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing.  Whether it's investigating the financials of Elon Musk's pro … ",
    "url": "https://www.the-independent.com/tech/chatgpt-down-not-working-ai-openai-latest-b2684993.html"
  },
  {
    "text": "The Vibes They Are a-Shiftin'  —  But it's really not clear what they are shifting to  —  Donald Trump winning a presidential election is, obviously, nothing new.  It literally happened in 2016.  What I think is new, eight years later, is the “vibe shift” first named by Tyler Cowen in July of 2024 and confirmed by Trump's victory.",
    "url": "https://www.slowboring.com/p/the-vibes-they-are-a-shiftin"
  },
  {
    "text": "What Republicans Could Cut to Pay for Trump's Tax Cuts: Medicaid and More  —  President Trump wants a massive tax cut and immigration crackdown bill.  Now Republicans must decide what to cut to help pay for it.  —  Top Republicans are passing around an extensive menu of ideas to cover … ",
    "url": "https://www.nytimes.com/2025/01/23/us/politics/trump-tax-cuts-immigration-house-republicans.html"
  },
  {
    "text": "Trump's agenda rests in the hands of a 91-year-old  —  With the gerontocracy under a microscope, the Senate Judiciary chair holds the keys to Donald Trump's agenda.  —  The core of President Donald Trump's agenda runs through Chuck Grassley, who has been in the chamber longer than his vice president has been alive.",
    "url": "https://www.politico.com/news/2025/01/23/chuck-grassley-age-trump-agenda-005992"
  },
  {
    "text": "Three Disturbing Signs of Fourth Estate Failure  —  Corporate executives behaving obsequiously towards Donald Trump and his lackeys may be disturbing to witness, but it is squarely within their primary charge of increasing shareholder value.  Sucking up to a transactional president who uses power … ",
    "url": "https://washingtonmonthly.com/2025/01/23/three-disturbing-signs-of-fourth-estate-failure/"
  },
  {
    "text": "Donald Trump Is Running Riot  —  I have never been more concerned about the rule of law in the United States.  —  I was born in 1969 — five years after the Civil Rights Act was passed — and I have no memory of the legal system operated in the Jim Crow South, when there was one code … ",
    "url": "https://www.nytimes.com/2025/01/23/opinion/trump-pardons-bolton-jan-6.html"
  },
  {
    "text": "Kyiv investigates another case of Russian soldiers executing Ukraine POWs  —  Prosecutor General's Office opens war crimes case after video emerges of executions in Donetsk.  —  KYIV — Ukraine's Prosecutor General's Office opened a criminal case against Russia for war crimes in Ukraine … ",
    "url": "https://www.politico.eu/article/russian-soliders-shot-disarmed-ukrainian-pows-filmed-execution/"
  },
  {
    "text": "Acting Secretary of Defense Robert Salesses Statement on DOD Actions Responding to President Trump's Executive Order on Securing our Border  —  On Monday, to protect the security and safety of United States citizens, President Trump declared that a national emergency exists at the southern border of the United States.",
    "url": "https://www.defense.gov/News/Releases/Release/Article/4037500/acting-secretary-of-defense-robert-salesses-statement-on-dod-actions-responding/"
  },
  {
    "text": "Hegseth's ex-wife gives new statement to FBI amid scrutiny over his nomination  —  Pete Hegseth's ex-wife recently gave a new statement to the FBI about the defense nominee's alcohol use, according to two sources familiar with the matter, an issue that has become a source of controversy during his confirmation process.",
    "url": "https://www.cnn.com/2025/01/22/politics/pete-hegseth-ex-wife-fbi-briefing/"
  },
  {
    "text": "Trump Calls for MSNBC to Be Shut Down in Nighttime Rant  —  The president has already sued CBS for $10 billion over its “60 Minutes” interview with Kamala Harris.",
    "url": "https://www.thedailybeast.com/now-donald-trump-wants-msnbc-to-lose-its-right-to-broadcast/"
  },
  {
    "text": "With Support Dwindling and Trump in Power, Zelensky Could Face Tough Re-election  —  The high popularity that the Ukrainian president had in the early days of the Russian invasion, with an approval rating of about 90 percent, has dipped badly.  —  Since Russia invaded his country three years ago … ",
    "url": "https://www.nytimes.com/2025/01/23/world/europe/ukraine-zelensky-trump.html?unlocked_article_code=1.rU4.P_HP.5vkz_9-3oziu&smid=url-share"
  },
  {
    "text": "China Will Be Thrilled if Trump Kills America's Green Economy  —  In its heyday in the mid-20th century, the steel mill in Weirton, W.Va., employed 13,000 people and offered workers a relatively stable blue-collar life.  In 2003, Weirton Steel filed for bankruptcy.",
    "url": "https://www.nytimes.com/2025/01/23/opinion/trump-china-ev-batteries.html"
  },
  {
    "text": "Trump's anger toward World Health Organization may reshape global health, politics  —  Public health experts say the United States' departure could cripple the WHO's operations or leave an opening for China to assume greater control over the agency.  —  For five years, Donald Trump has blamed … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/23/trump-world-health-organization/"
  },
  {
    "text": "Trump pardons police officers convicted of murder, obstruction in man's death  —  President Donald Trump pardoned two Washington, D.C. police officers convicted in the death of Karon Hylton-Brown, who was riding a moped on a sidewalk without a helmet when he ignored instructions to stop.",
    "url": "https://www.usatoday.com/story/news/politics/2025/01/22/donald-trump-pardon-convicted-police-officers/77889905007/"
  },
  {
    "text": "Federal employees are told to name colleagues who work in DEI roles or risk ‘adverse consequences’  —  Emails sent to government workers at numerous agencies gave employees 10 days to report if a colleague's job relates to diversity, equity and inclusion efforts.",
    "url": "https://www.nbcnews.com/politics/white-house/federal-workers-told-name-dei-colleagues-risk-adverse-consequences-rcna188871"
  },
  {
    "text": "RFK Jr. faces mounting bipartisan criticism  —  Pressure is mounting on Robert F. Kennedy Jr. as critics squeeze senators from both sides of the aisle to oppose President Trump's pick to be the nation's top health official.  —  Kennedy's bipartisan opponents, including liberal advocates … ",
    "url": "https://thehill.com/policy/healthcare/5101469-rkf-jr-hhs-bipartisan-opposition/"
  }
]