[
  {
    "text": "Senior USAID security officials put on leave after refusing Musk's DOGE access to agency systems  —  Two top security officials at the US Agency for International Development were put on administrative leave Saturday night after refusing to allow officials from Elon Musk's Department … ",
    "url": "https://www.cnn.com/2025/02/02/politics/usaid-officials-leave-musk-doge/"
  },
  {
    "text": "The Young, Inexperienced Engineers Aiding Elon Musk's Government Takeover  —  Engineers between 19 and 24, most linked to Musk's companies, are playing a key role as he seizes control of federal infrastructure.  —  Elon Musk's takeover of federal government infrastructure is ongoing … ",
    "url": "https://www.wired.com/story/elon-musk-government-young-engineers/"
  },
  {
    "text": "USAID security leaders on leave after trying to keep Musk's DOGE from classified info, officials say  —  The Trump administration has placed two top security chiefs at the U.S. Agency for International Development on leave after they refused to turn over classified material in restricted areas … ",
    "url": "https://apnews.com/article/doge-musk-trump-classified-information-usaid-security-35101dee28a766e0d9705e0d47958611"
  },
  {
    "text": "Trump faces backlash from business as tariffs ignite inflation fears  —  Experts warn aggressive trade measures against US allies will hurt consumers and roil supply chains  —  Donald Trump faced a backlash from business groups and some in his own Republican party after kicking off a trade war … ",
    "url": "https://www.ft.com/content/3cc26cc1-57e7-44d0-8c09-6c5dec30cc75"
  },
  {
    "text": "Doug Ford announces Ontario ban on American liquor in response to U.S. tariffs  —  U.S. President Donald Trump imposing a 25% tariff on most Canadian imports beginning Tuesday  —  Ontario Premier Doug Ford has ordered the LCBO to strip its shelves of American products in response … ",
    "url": "https://www.cbc.ca/news/canada/toronto/ford-lcbo-tariffs-trump-1.7448423"
  },
  {
    "text": "Canada, Mexico Want America to Feel the Pain of Tariffs Too  —  Both countries are planning precision strikes against U.S. exports in response to Trump's unilateral tariffs  —  in Toronto.  —  Canada and Mexico will suffer severe economic blows from the tariffs President Trump announced on Saturday.",
    "url": "https://www.wsj.com/economy/trade/canada-mexico-want-america-to-feel-the-pain-of-tariffs-too-f8119ccd?st=gNQ1nd&reflink=article_copyURL_share"
  },
  {
    "text": "Brussels vows ‘firm’ response to threatened Trump tariffs as EU braces for trade war  —  European Commission says the bloc “regrets” new U.S. tariffs on Mexico, Canada and China.  —  BRUSSELS — The European Union is warning U.S. President Donald Trump the bloc will retaliate if he imposes tariffs on EU goods.",
    "url": "https://www.politico.eu/article/brussels-vows-firm-response-potential-donald-trump-tariffs-eu-braces-trade-war/"
  },
  {
    "text": "The power of independent journalism: From her Brooklyn apartment, she ‘scooped’ the nation's media  —  First word of the Trump administration's since-rescinded order to freeze spending on federal loans and grants came not from a major news organization, but from a woman working alone in her Brooklyn apartment.",
    "url": "https://apnews.com/article/independent-journalists-trump-local-news-a60b49c97058d14f1b2e36cdc771d8f7"
  },
  {
    "text": "Trump is waging war against his own government  —  One federal employee who spoke with NBC News said that the government workforce feels like they're being attacked regularly with “psychological warfare.”  —  WASHINGTON — Less than two weeks into his term, President Donald Trump is waging war … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-waging-war-government-rcna190316"
  },
  {
    "text": "‘We Have No Coherent Message’: Democrats Struggle to Oppose Trump  —  More than 50 interviews with Democratic leaders revealed a party struggling to decide what it believes in, what issues to prioritize and how to confront an aggressive right-wing administration.",
    "url": "https://www.nytimes.com/2025/02/02/us/politics/democrats-trump.html"
  },
  {
    "text": "The Logic of Destruction  —  What is a country?  The way its people govern themselves.  America exists because its people elect those who make and execute laws.  The assumption of a democracy is that individuals have dignity and rights that they realize and protect by acting together.",
    "url": "https://snyder.substack.com/p/the-logic-of-destruction"
  },
  {
    "text": "Don't Believe Him  —  This is an edited transcript of an audio essay on “The Ezra Klein Show.”  You can listen to the conversation by following or subscribing to the show on the NYT Audio App, Apple, Spotify, Amazon Music, YouTube, iHeartRadio or wherever you get your podcasts.",
    "url": "https://www.nytimes.com/2025/02/02/opinion/ezra-klein-podcast-trump-column-read.html?unlocked_article_code=1.t04.v61j.h_eaTdRj3_sz&smid=url-share"
  },
  {
    "text": "GOP pollster says Trump voters ‘tired’ of being accused of racism  —  Republican pollster Frank Luntz said on Friday that President Trump's voters are “tired” of being accused of being sexist and racist.  —  In a discussion about Trump's remarks linking diversity, equity and inclusion (DEI) … ",
    "url": "https://thehill.com/homenews/campaign/5121413-frank-luntz-trump-voters-tired-accused-racism/"
  },
  {
    "text": "Trump Kicks Aside Congress With Sweeping Claims of Presidential Power  —  With aggressive reading of Constitution, president aims to upend balance of power in Washington  —  WASHINGTON—In laying out the checks and balances of democracy, authors of the U.S. Constitution imagined that the president … ",
    "url": "https://www.wsj.com/politics/policy/trump-kicks-aside-congress-with-sweeping-claims-of-presidential-power-a3daf68b"
  },
  {
    "text": "Sen. Schmitt dodges answering if Edward Snowden is a traitor … - “I think people are tired of these games, of sort of this ‘gotcha’ stuff. … - When asked again about Snowden, Schmitt said: “I think it's totally ridiculous to try to smear people who are trying to serve this country because, again, it's sort of ‘gotcha.’”",
    "url": "https://www.axios.com/2025/02/02/gabbard-snowden-traitor-schmitt"
  },
  {
    "text": "Trump Administration Revokes Protections for Venezuelans in the U.S.  —  The decision to revoke Temporary Protected Status signals that President Trump will continue to dismantle a program that aims to protect migrants from potentially dangerous countries.  —  The Trump administration … ",
    "url": "https://www.nytimes.com/2025/02/02/us/politics/trump-venezuela-temporary-protected-status.html"
  },
  {
    "text": "Why Write About the Illegality of What Trump and Musk are Doing?  —  NYU Law professor Noah Rosenblum posted on Bluesky yesterday that “[t]here has never been a larger gap in my (admittedly quite short) professional life between how lay folks and law profs are talking about what is happening in government right now.",
    "url": "https://buttondown.com/sbagen/archive/why-write-about-the-illegality-of-what-trump-and/"
  }
]