[
  {
    "text": "Elon Musk has said he plans to commit around $45 million a month to a new super political-action committee backing former President Donald Trump's presidential run, according to people familiar with the matter.  —  Other backers of the group, called America PAC, include Palantir Technologies … ",
    "url": "https://www.wsj.com/politics/elections/elon-musk-has-said-he-is-committing-around-45-million-a-month-to-a-new-pro-trump-super-pac-dda53823"
  },
  {
    "text": "Behind the Curtain: Why J.D. … - Youth & vigor: Vance, who turns 40 in two weeks, is half Trump's age. … - Smart: Vance can put an intellectual wrapper around Trump's red meat. … - American Dream bio: James David Vance grew up in a broken Rust Belt home in Middletown, Ohio, with deep ties to Appalachia.",
    "url": "https://www.axios.com/2024/07/16/trump-vp-pick-jd-vance-rnc"
  },
  {
    "text": "UK deputy PM dismisses ‘Islamist’ nuclear state jibe by Trump VP pick Vance  —  Britain's deputy prime minister on Tuesday played down comments by U.S. vice presidential contender J.D. Vance that Britain was an Islamist nuclear-armed country, saying he had a history of making “fruity” remarks.",
    "url": "https://www.reuters.com/world/uk-deputy-pm-dismisses-islamist-nuclear-state-jibe-by-trump-vp-pick-vance-2024-07-16/"
  },
  {
    "text": "JD Vance is Trump's gift to Putin  —  The GOP nominee may have picked the one American his second-biggest donor prefers over him.  —  1×  —  The pick of JD Vance, who underperformed Ohio's last Republican Senator by 15% and the entire Ohio GOP ticket by 11%, has made clear … ",
    "url": "https://i-know-how-much-you-care.ghost.io/jd-vance-is-donald-trumps-gift-to-putin/"
  },
  {
    "text": "The Authoritarian Ticket  —  Another one for the “weeks where decades happen” files: Hours before the Republican National Convention and Donald Trump's selection of J.D. Vance as his running mate took over the news cycle, Judge Aileen Cannon squeezed in a little news of her own … ",
    "url": "https://www.thebulwark.com/p/the-authoritarian-ticket"
  },
  {
    "text": "Who Is Usha Vance, the Wife of J.D. Vance?  —  The two met at Yale Law School, and Ms. Vance has helped him along in his political rise ever since — including now to Donald J. Trump's vice-presidential pick.  —  If you were to build a member of the American elite from scratch, she might look something like Usha Vance.",
    "url": "https://www.nytimes.com/2024/07/15/style/usha-vance-jd-vance.html"
  },
  {
    "text": "Playbook: Trump upstages Vance on Night 1  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  The first day of the GOP convention in Milwaukee was supposed to be about something mundane: economic policy.  The slogan was “Make America Wealthy Once Again.”",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/16/trump-upstages-vance-on-night-1-00168591"
  },
  {
    "text": "Special counsels are unconstitutional if they make Trump sad  —  So says Aileen Cannon, who makes a mockery of the rule of law. … It finally happened.  —  Judge Aileen Cannon, who has been telegraphing for months that she was committed to finding a way to get Trump off the hook … ",
    "url": "https://www.publicnotice.co/p/aileen-cannon-jack-smith-unconstitutional"
  },
  {
    "text": "Firefighter Corey Comperatore's widow refused Biden call after Trump rally shooting: 'Didn't want to talk to him'  —  SARVER, Pa. — The heartbroken widow of Corey Comperatore, the hero firefighter shot dead by a sniper at a Trump rally, wanted nothing to do with President Biden when he called after the tragedy, she told The Post.",
    "url": "https://nypost.com/2024/07/15/us-news/corey-comperatores-widow-refused-biden-call-after-trump-rally-shooting/"
  },
  {
    "text": "Private efforts to nudge Biden to step aside continue  —  The public calls from Democrats asking President Joe Biden to bow out of the presidential race have quieted in recent days, but private efforts to nudge the president and his top aides continue, several Democratic sources told CNN.",
    "url": "https://www.cnn.com/2024/07/15/politics/private-efforts-biden-step-aside/"
  },
  {
    "text": "Stop Pretending You Know How This Will End  —  In the immediate aftermath of the failed attempt on Donald Trump's life, pundits and politicians rushed to proclaim that they knew exactly how the awful event would affect American politics.  Commentators on the left and right predicted on social media that … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/assassination-attempt-election-predictions/679025/"
  },
  {
    "text": "FBI, DHS warn of possible retaliation for attack on Trump  —  Intelligence bulletin raises alarm about election violence.  —  U.S. authorities are concerned about possible attacks in retaliation to the attempted assassination of Donald Trump, the FBI and Department of Homeland Security … ",
    "url": "https://www.politico.com/news/2024/07/15/fbi-dhs-possible-retaliation-trump-shooting-00168549"
  },
  {
    "text": "SCOTUS Really Upped the Incentives for Judge-Shopping  —  Corporate interests in presidential elections don't disappear post-Chevron, but they do shift.  — Copy  —  When lobbyists and corporate interests want to influence policy going forward, they'll be putting more resources toward the judiciary than the president.",
    "url": "https://www.notus.org/courts/scotus-chevron-judge-shopping-brand-x"
  },
  {
    "text": "Trump 2.0 could be bad news for global inflation, analysts say … A second presidential term for former President Donald Trump could reignite global inflation as his America-first policies drive up costs across the world, analysts warned.  —  The high tariff, low tax economic agenda … ",
    "url": "https://www.cnbc.com/2024/07/16/trump-2point0-could-be-bad-news-for-global-inflation-analysts-say.html"
  },
  {
    "text": "Kennedy and West third-party ballot drives are pushed by secretive groups and Republican donors  —  WASHINGTON (AP) — Libertarians in Colorado want to put Robert F. Kennedy Jr. on the ballot to create chaos.  —  Petition drives for Cornel West in Virginia and North Carolina are being run by groups with Republican ties.",
    "url": "https://apnews.com/article/kennedy-west-third-party-2024-election-10c4c166ad4d41cab73660c33a69a58a"
  },
  {
    "text": "Scoop: How the DNC plans to run out the clock for Biden … - Once Biden receives votes from a majority of the nearly 4,000 delegates, it will become exceedingly difficult to remove him from atop the Democratic presidential ticket.  — The DNC's current plan is to train state party chairs next week … ",
    "url": "https://www.axios.com/2024/07/16/biden-dnc-vote-nomination-states-2024-election"
  },
  {
    "text": "School Vouchers Were Supposed to Save Taxpayer Money.  Instead They Blew a Massive Hole in Arizona's Budget.  —  Arizona, the model for voucher programs across the country, has spent so much money paying private schoolers' tuition that it's now facing hundreds of millions in budget cuts to critical state programs and projects.",
    "url": "https://www.propublica.org/article/arizona-school-vouchers-budget-meltdown"
  }
]