[
  {
    "text": "As Floods Hit, Key Roles Were Vacant at Weather Service Offices in Texas  —  Some experts say staff shortages might have complicated forecasters' ability to coordinate responses with local emergency management officials.  —  Crucial positions at the local offices of the National Weather Service … ",
    "url": "https://www.nytimes.com/2025/07/05/us/politics/texas-floods-warnings-vacancies.html?unlocked_article_code=1.UU8.21M8.MBBE3OCzrBAa&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Texas officials face scrutiny over response to catastrophic and deadly flooding … The destructive fast-moving waters that began before sunrise Friday in the Texas Hill Country killed at least 43 people in Kerr County, authorities said Saturday, and an unknown number of people remained missing.",
    "url": "https://www.politico.com/news/2025/07/06/texas-officials-face-scrutiny-over-response-to-catastrophic-and-deadly-flooding-00440035"
  },
  {
    "text": "The Republican Fever Must Break  —  Eight years ago, I stood on the floor of the Senate and announced that I would not run for re-election.  I spoke then of a fever in our politics, a fever that I hoped would soon break.  I noted that in today's Republican Party, anything short of complete … ",
    "url": "https://www.nytimes.com/2025/07/06/opinion/trump-tillis-senate-republicans.html"
  },
  {
    "text": "ICE Barbie Dodges Blame for Disastrous Texas Flooding on Trump's Watch  —  DODGE AND WEAVE  —  Kristi Noem was grilled over the delayed warning residents received during the flash floods in Texas.  —  Homeland Security Secretary Kristi Noem has defended the Trump administration from suggestions … ",
    "url": "https://www.thedailybeast.com/ice-barbie-kristi-noem-dodges-blame-for-disastrous-texas-flooding-on-trumps-watch/"
  },
  {
    "text": "The Party of Empathy...  I have a bookmark folder on X called “Democrat hate.”  —  When I think about it, I toss especially hateful posts into the folder as potential fodder for articles.  I rarely dip into them unless some particularly prominent person utters some particularly hateful thing.",
    "url": "https://hotair.com/david-strom/2025/07/06/the-party-of-empathy-n3804511"
  },
  {
    "text": "MAGA Congressional Candidate Calls Texas Floods ‘Fake’: It's ‘Murder’  —  ‘JESUS, GUNS & BABIES’  —  Kandiss Taylor, who is running for Congress in 2026, insists that someone manipulated the weather.  —  A MAGA congressional candidate is facing backlash after spreading conspiracy theories … ",
    "url": "https://www.thedailybeast.com/maga-congressional-candidate-kandiss-taylor-calls-texas-floods-fake-its-murder/"
  },
  {
    "text": "‘I want my vote back’: Trump-voting family stunned after Canadian mother detained over immigration status  —  Family of Cynthia Olivera reconsiders support for president after Ice detained her at green card interview  —  The family of a Canadian national who supported Donald Trump's plans … ",
    "url": "https://www.theguardian.com/us-news/2025/jul/06/trump-voting-family-canadian-mother-detained-immigration-status"
  },
  {
    "text": "Tariffs return to April rates on August 1 without deals, Bessent says  —  Countries that don't make trade deals with the U.S. by August 1 can expect tariff rates to return to the levels announced in April, Treasury Secretary Scott Bessent said Sunday.",
    "url": "https://www.axios.com/2025/07/06/trump-tariffs-letters-trade-war"
  },
  {
    "text": "Can Democrats Find Their Way on Immigration?  —  The party's leftward shift in the Biden administration arguably laid the groundwork for President Trump's aggressive approach.  Deciding the next move won't be easy.  —  Many Democratic presidential candidates in 2019 supported decriminalizing … ",
    "url": "https://www.nytimes.com/2025/07/06/us/politics/democrats-immigration-trump.html?unlocked_article_code=1.UU8.01gK.UcD_ADN9lhY7&smid=url-share"
  },
  {
    "text": "Knives, bullets and thieves: the quest for food in Gaza  —  Editor's note: Anas Baba is NPR's producer in the Gaza Strip.  His report is a rare account by a journalist inside a new food distribution site that the United States and Israel helped establish in the Palestinian territory.",
    "url": "https://www.npr.org/2025/07/06/g-s1-75874/gaza-food-hunger-ghf"
  },
  {
    "text": "Don't look away from what's happening in Iran  —  Now that a ceasefire is in place with Israel, the Islamic Republic again has turned its attention to cracking down on dissent at home.  —  Roxana Saberi is a journalist and author of “Between Two Worlds: My Life and Captivity in Iran.”",
    "url": "https://www.bostonglobe.com/2025/07/06/opinion/iran-israel-ceasefire-domestic-dissent/"
  },
  {
    "text": "Thailand to Offer US More Trade Concessions to Avert 36% Tariff  —  Thailand is making a last-ditch effort to avert a punitive 36% export levy threatened by the Trump administration with offers of greater market access for US farm and industrial goods, along with increased purchases of energy and Boeing jets.",
    "url": "https://www.bloomberg.com/news/articles/2025-07-06/thailand-to-offer-us-more-trade-concessions-to-avert-36-tariff"
  },
  {
    "text": "Trump Is Gutting Every Source of America's Greatness  —  The most lasting and catastrophic legacy of Donald Trump's presidency might well be the loss of America's strength and standing in the world—and with it, the liberal international order that has preserved global peace and security … ",
    "url": "https://www.theunpopulist.net/p/trump-is-gutting-every-source-of"
  },
  {
    "text": "Johnson on Texas floods: ‘We feel just as helpless as everyone else does’  —  Speaker Mike Johnson (R-La.) said on Sunday that there's not much more Congress can do to help victims of the Texas floods until the supplemental funding requests come in.  —  In an interview on Fox News's … ",
    "url": "https://thehill.com/homenews/state-watch/5386943-johnson-texas-floods-helpless/"
  },
  {
    "text": "Things Worth Remembering: Lady Liberty's Open Arms  —  It was a poet who transformed America's favorite statue from a celebration of independence to a symbol of welcome.  —  Upgrade to Listen … My grandfather, Lorenzo Nocera, immigrated to America in 1904 from a small town south of Naples, Italy.",
    "url": "https://www.thefp.com/p/things-worth-remembering-lady-liberty-immigration"
  },
  {
    "text": "Tony Blair's staff took part in ‘Gaza Riviera’ project with BCG  —  Former UK prime minister's institute participated in meetings on plan to turn shattered enclave into trading hub  —  The Tony Blair Institute participated in a project to develop a postwar Gaza plan that envisaged kick-starting … ",
    "url": "https://www.ft.com/content/0b1bc761-c572-4b61-882a-fb4467259dcd"
  },
  {
    "text": "From lumber to lighting: How Trump's tariffs drive up home construction costs  —  NBC News modeled out a 3-bedroom home and found tariffs added more than $4,000 to total costs.  —  Lumber from Canada?  That will be another $534.  —  Major appliances from China?  Add a cool $445.",
    "url": "https://www.nbcnews.com/specials/house-construction-cost-tariff-change/"
  },
  {
    "text": "An increasing share of American adults are going hungry  —  More Americans are going hungry, per new data from Morning Consult. … - The rise is like a slow-moving train wreck, says John Leer, chief economist at Morning Consult. … - In May, 15.6% of adults were food insecure, almost double the rate in 2021.",
    "url": "https://www.axios.com/2025/07/06/big-beautiful-bill-snap-hunger"
  },
  {
    "text": "Inside Trump's supercharged version of Bush's “War on Terror”  —  Mass surveillance. … Citing national security to hide information from the courts.  Labeling people as “terrorists” as a political and legal strategy. … But now Trump is supercharging many of the post-9/11 legal, tactical and political strategies Bush used.",
    "url": "https://www.axios.com/2025/07/06/trump-bush-war-on-terror-immigration"
  },
  {
    "text": "‘The American system is being destroyed’: academics on leaving US for ‘scientific asylum’ in France  —  Almost 300 researchers have applied for positions at Aix-Marseille University after Trump unleashed his attack on academia  —  It was on a US-bound flight in March, as Brian Sandberg stressed … ",
    "url": "https://www.theguardian.com/education/2025/jul/05/academics-leaving-us-scientific-asylum-france-trump"
  },
  {
    "text": "The Advertisers Spending Big in West Palm Beach Just to Reach Trump  —  More than a dozen groups have focused on the tiny Florida market, often with ads praising the president  —  Watching television in West Palm Beach, Fla., this year meant being a bystander to an array of groups seeking an audience with a single viewer.",
    "url": "https://www.wsj.com/business/media/west-palm-beach-ads-trump-attention-6f832f89"
  }
]