[
  {
    "text": "Is this thing on?  Harris and Trump battle over hot mics at debate.  —  Negotiations over the Sept. 10 spectacle have hit an impasse over whether to leave the microphones on.  —  With just 15 days left until the scheduled Sept. 10 presidential debate between Vice President Kamala Harris … ",
    "url": "https://www.politico.com/news/2024/08/26/kamala-harris-donald-trump-debate-abc-microphones-00176294"
  },
  {
    "text": "AP Wonders: Golly, How Is Kamala Getting Away With ‘New Way Forward’?  —  Anyone?  Anyone?  Bueller?  Bueller?  —  Kamala Harris talked repeatedly in her acceptance speech about “charting a new way forward.”  For some reason, the media has promoted that message even while Harris doesn't have a … ",
    "url": "https://hotair.com/ed-morrissey/2024/08/26/ap-wonders-golly-how-is-kamala-getting-away-with-new-way-forward-n3793669"
  },
  {
    "text": "Donald Trump Isn't Preparing for Kamala Harris Debate  —  told reporters in Virginia on Monday that he is not preparing for his September 10 debate against Vice President  —  .  —  Trump, appearing at the Eden Center, the largest Vietnamese commercial center on the East Coast … ",
    "url": "https://www.newsweek.com/donald-trump-not-preparing-kamala-harris-debate-election-1944437"
  },
  {
    "text": "How will team Trump tell him he should be muted during his debate with Harris?  —  Sometimes the pettiest of disagreements between political campaigns can reveal a world of difference in the candidates.  —  Consider the current disagreement over the rules of the September 10 debate … ",
    "url": "https://robertreich.substack.com/p/how-will-team-trump-tell-him-he-should"
  },
  {
    "text": "Trump Says We ‘Gotta’ Restrict the First Amendment  —  The former president vowed to torch free-speech protections days after RFK Jr. touted him as anti-censorship … Less than a week later, Trump is already promising to crush First Amendment protections if elected in November.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-restrict-first-amendment-1235088402/"
  },
  {
    "text": "Donald Trump Will Announce More Democratic Supporters—RFK Jr.  —  In an interview appearance on Fox News Sunday,  —  will make a “series of announcements about other  —  who are joining his 2024 campaign.  On Friday, Kennedy Jr. dropped out of this year's presidential race as an independent candidate and",
    "url": "https://www.newsweek.com/donald-trump-democratic-supporters-2024-election-rfk-jr-1944158"
  },
  {
    "text": "First to ABC: Retired 4-star general, 200 former GOP staffers endorse Harris  —  Larry Ellis said anyone in the military who acted like Trump would be dismissed.  —  Gen. (retired) Larry Ellis, a member of the National Commission on the Future of the Army, discusses the needs … ",
    "url": "https://abcnews.go.com/Politics/abc-retired-4-star-general-200-former-gop/story?id=113163960"
  },
  {
    "text": "Former Aides to Bush, Romney and McCain Back Harris Over Trump  —  The former Republican staffers' support of the Democratic ticket reflects how former President Donald J. Trump has transformed the Republican Party.  —  More than 200 people who previously worked for President George W. Bush … ",
    "url": "https://www.nytimes.com/2024/08/26/us/politics/harris-trump-bush-romney-mccain.html"
  },
  {
    "text": "More than 200 Bush, McCain, Romney alums endorse Harris for president, criticize Trump  —  WASHINGTON — More than 200 Republicans who previously worked for either former President George W. Bush, the late Sen. John McCain, R-Ariz., or Sen. Mitt Romney, R-Utah, endorsed Vice President Kamala Harris … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/26/bush-mccain-romney-trump-harris-2024/74947380007/"
  },
  {
    "text": "Texas Removes Over 1 Million Voters from Rolls Since Passage of Anti-Voting Law  —  Texas Gov. Greg Abbott (R) announced Monday the state has removed over one million people from its voter rolls since Republican legislators passed a sweeping voter suppression law three years ago.",
    "url": "https://www.democracydocket.com/news-alerts/texas-removes-over-1-million-voters-from-rolls-since-passage-of-anti-voting-law/"
  },
  {
    "text": "Governor Abbott Announces Over 1 Million Ineligible Voters Removed From Voter Rolls  —  Governor Greg Abbott today announced that since signing Senate Bill 1 into law in 2021, Texas has removed over one million people from the state's voter rolls, including people who moved out-of-state, are deceased, and are noncitizens.",
    "url": "https://gov.texas.gov/news/post/governor-abbott-announces-over-1-million-ineligible-voters-removed-from-voter-rolls"
  },
  {
    "text": "Judge blocks Biden administration from granting legal status to spouses of U.S. citizens  —  A federal judge in Texas on Monday temporarily blocked the Biden administration from granting legal status to unauthorized immigrants married to American citizens, granting a request from 16 Republican-led states who challenged the new policy.",
    "url": "https://www.cbsnews.com/news/immigration-judge-blocks-biden-administration-from-granting-legal-status-to-spouses-of-u-s-citizens/"
  },
  {
    "text": "Judge Pauses Biden Administration Program That Aids Undocumented Spouses  —  Ruling in favor of 16 Republican-led states that sued the administration, a federal judge put the program on hold while the court considers the merits of the case.  —  A federal judge in Texas temporarily blocked … ",
    "url": "https://www.nytimes.com/2024/08/26/us/undocumented-spouses-biden-administration.html"
  },
  {
    "text": "Special counsel urges appeals court to reinstate classified documents case against Trump  —  Special counsel Jack Smith urged a federal appeals court Monday to reinstate the classified documents case against former President Donald Trump, saying a judge's decision that dismissed the prosecution … ",
    "url": "https://apnews.com/article/trump-maralago-classified-documents-411e8e3b4d31923560effdd0d2082af4"
  },
  {
    "text": "Ukraine to present Biden admin with targets it could hit in Russia, given the chance  —  U.S. officials are still adamant that lifting the restrictions will not have a significant impact on the ground.  —  Ukrainian officials are preparing to present a list of long-range targets in Russia … ",
    "url": "https://www.politico.com/news/2024/08/26/ukraine-biden-targets-russia-restrictions-00176377"
  },
  {
    "text": "Texas AG raids homes of Latino civil rights group members, setting up a voting rights showdown  —  The raids have triggered outrage and cries of voter suppression in a state with a long history of discrimination against citizens of Mexican descent, which helped give rise to LULAC.",
    "url": "https://www.nbcnews.com/news/latino/house-raids-texas-democrats-ken-paxton-voting-rights-lulac-rcna168216"
  },
  {
    "text": "Man Charged with Threatening Election Officials, State Judge, and Federal Law Enforcement Agents  —  For Immediate Release  —  A Colorado man will make his initial appearance at the federal courthouse in Durango, Colorado, today on federal charges in connection with a series of online threats … ",
    "url": "https://www.justice.gov/opa/pr/man-charged-threatening-election-officials-state-judge-and-federal-law-enforcement-agents"
  },
  {
    "text": "Shouldn't Trump release his latest tax returns right about now?  —  Vice President Kamala Harris released her tax returns.  Shouldn't Donald Trump do the same?  Even if we know the answer, shouldn't he at least be asked?  —  Donald Trump's history of unfortunate money-making schemes took … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/shouldnt-trump-release-latest-tax-returns-right-now-rcna168192"
  },
  {
    "text": "‘Laugh-out-loud funny’: Experts guffaw as Times op-ed asserts Trump can win ‘on character’  —  A New York Times headline has political pundits rolling in the proverbial aisles with an assertion about Donald Trump's best bet on winning in 2024.  —  Rich Lowry, editor of the conservative National Review … ",
    "url": "https://www.rawstory.com/trumps-character/"
  },
  {
    "text": "Trump clemency recipient's arrest draws attention of judge in old drug case … A New York federal judge has ordered U.S. probation officials to investigate the recent arrest of a convicted drug dealer who was released from prison in early 2021 when his 10-year sentence was commuted by former President Donald Trump.",
    "url": "https://www.cnbc.com/2024/08/26/trump-clemency-recipient-jonathan-braun-judge.html"
  },
  {
    "text": "Mark Zuckerberg Says White House Was ‘Wrong’ to Pressure Facebook on Covid  —  Meta CEO also says he won't repeat 2020 efforts to fund local elections, which Republicans criticized as ‘Zuckerbucks’  —  WASHINGTON—Meta Platforms Chief Executive Mark Zuckerberg said it was improper … ",
    "url": "https://www.wsj.com/tech/mark-zuckerberg-neutral-politics-letter-election-2024-02b86372?st=9ktk2cf6j9g7fzh"
  },
  {
    "text": "Statement by Vice President Harris on the Anniversary of the Terrorist Attack Outside Kabul Airport  —  Three years ago today, outside of Kabul Airport, an ISIS terrorist killed 13 American servicemembers and more than 100 innocent Afghans, and wounded many more.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/08/26/statement-by-vice-president-harris-on-the-anniversary-of-the-terrorist-attack-outside-kabul-airport/"
  },
  {
    "text": "How Did a Vocal Trump Supporter End Up in CNN's ‘Undecided Voter’ Panel?  —  The incident raises questions about CNN's vetting process and the authenticity of its focus groups.  —  CNN's recent “undecided voter” panel, meant to capture reactions to Kamala Harris's speech … ",
    "url": "https://www.readtpa.com/p/how-did-a-vocal-trump-supporter-end"
  },
  {
    "text": "“Simply put, they are out of their minds”: Kamala Harris won't let Republicans hide their misogyny  —  Republicans know their views on reproductive rights and cat ladies are unpopular, but they keep taking the bait  —  CHICAGO — Despite much of the press carrying Donald Trump's water … ",
    "url": "https://www.salon.com/2024/08/26/simply-put-they-are-out-of-their-minds-kamala-harris-wont-let-hide-their-misogyny/"
  }
]