[
  {
    "text": "Waltz and staff used Gmail for government communications, officials say  —  Trump's national security adviser is trying to manage his way out of a crisis.  But new revelations about his team's operational security are piling up in the inbox.  —  Just now  —  Members of President Donald … ",
    "url": "https://www.washingtonpost.com/national-security/2025/04/01/waltz-national-security-council-signal-gmail/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzNDgwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0ODYyMzk5LCJpYXQiOjE3NDM0ODAwMDAsImp0aSI6ImNjNmE3ZmYzLTViMWYtNDdjZi05YTcwLTJlZTdjY2YxOGE1YSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA0LzAxL3dhbHR6LW5hdGlvbmFsLXNlY3VyaXR5LWNvdW5jaWwtc2lnbmFsLWdtYWlsLyJ9.B_oXWbANc-R7inHV48C9AqkmVIA-41Ip1IVrDyYc60Y&itid=gfta"
  },
  {
    "text": "Cory Booker sets a record with marathon Senate speech.  Will it rally anti-Trump resistance?  —  Watch live as U.S. Senator Cory Booker addresses the Senate floor.  Booker, a Democrat from New Jersey, has promised to speak “as long” as he's physically able on the Senate floor Monday night … ",
    "url": "https://apnews.com/article/cory-booker-new-jersey-senator-speech-ab573bb7c3c76fa107cacac7136d3823"
  },
  {
    "text": "Cory Booker Just Gave The Longest Speech In The History of The US Senate  —  Only two men have spoken on the floor of the U.S. Senate for more than 24 straight hours.  One of them fought to keep Black people out of public life, the other was a Black leader who staged a landmark protest.",
    "url": "https://talkingpointsmemo.com/news/cory-booker-just-gave-the-longest-speech-in-the-history-of-the-us-senate"
  },
  {
    "text": "Booker's speech tops 350 million likes on TikTok live  —  More than 350 million people liked Sen. Cory Booker's (D-N.J.) floor speech on TikTok live, as the senator approached 25 hours of holding the floor in the Senate chamber.  —  By 7:07 p.m. EDT on Tuesday — just over 24 hours … ",
    "url": "https://thehill.com/homenews/senate/5226903-bookers-speech-tops-350-million-likes-on-tiktok-live/"
  },
  {
    "text": "A Cory Booker Staffer Was Arrested for Carrying a Gun on Capitol Grounds, Police Said  —  The arrest comes the same day the New Jersey senator began a protest of President Donald Trump's agenda.  — Copy  —  A staffer for Sen. Cory Booker was arrested Monday by U.S. Capitol Police … ",
    "url": "https://www.notus.org/senate/cory-booker-staffer-arrested-police-say"
  },
  {
    "text": "The Lawlessness Is the Point  —  If JD Vance were capable of shame, he'd be embarrassed by what just happened.  After the news broke that President Trump's administration admitted to deporting a Maryland man in “error,” Vance lashed out at podcaster Jon Favreau, who had asked him to comment on what had transpired.",
    "url": "https://newrepublic.com/article/193442/trump-deportation-mistake-el-salvador"
  },
  {
    "text": "Some Conservative Voices Raise Alarm Over Trump's Immigration Tactics  —  The cracks in support show how seriously some conservatives are taking the administration's aggressive and at times slapdash tactics.  —  Influential figures on the right have largely cheered on the opening months of the Trump presidency.",
    "url": "https://www.nytimes.com/2025/04/01/us/politics/trump-immigration-joe-rogan-conservatives.html"
  },
  {
    "text": "Mass layoffs are underway at the nation's public health agencies  —  Employees across the massive U.S. Health and Human Services Department received notices Tuesday that their jobs were being eliminated, part of a sweeping overhaul designed to vastly shrink the agencies responsible for protecting and promoting Americans' health.",
    "url": "https://apnews.com/article/health-human-services-layoffs-restructuring-rfk-jr-ec4d7731695e4204970c7eab953b2289"
  },
  {
    "text": "'It's a bloodbath': Massive wave of job cuts underway at US health agencies  —  A massive wave of job cuts got underway at US health agencies early Tuesday, with some employees receiving early morning emails that their jobs were eliminated and some unable to access the building when they arrived at work.",
    "url": "https://cnn.com/2025/04/01/health/staff-cuts-at-federal-health-agencies-have-begun/"
  },
  {
    "text": "Republican Randy Fine wins Florida special election for Waltz seat  —  Florida state Sen. Randy Fine (R) has won the special election for Florida's 6th Congressional District on Tuesday, according to Decision Desk HQ, defeating Democrat Josh Weil in what became a closely contested race in the deep-red district.",
    "url": "https://thehill.com/homenews/campaign/5226000-florida-republican-randy-fine-special-election/"
  },
  {
    "text": "Johnson Fails to Kill Bipartisan Measure to Allow Proxy Voting for New Parents  —  The speaker tried to use an unprecedented parliamentary maneuver to deny a bipartisan majority the chance to hold a vote on their proposal to allow new parents to vote remotely in the House.",
    "url": "https://www.nytimes.com/2025/04/01/us/politics/house-proxy-voting-parents-mike-johnson.html"
  },
  {
    "text": "Adam Schiff places hold on Ed Martin's nomination to be D.C. U.S. attorney  —  President Trump's controversial choice to be the top federal prosecutor in Washington, D.C., Ed Martin, faces an uncertain future, as a Senate Democrat plans to put an indefinite hold on his nomination.",
    "url": "https://www.cbsnews.com/news/trump-nominee-u-s-attorney-in-d-c-ed-martin-blocked-adam-schiff/"
  },
  {
    "text": "Trump Is Asking the Supreme Court To Let Him Have Black Sites  —  The Trump administration inadvertently revealed on Monday that it is attempting to trap Venezuelan migrants in a catch-22 that would effectively block them from challenging their deportation and detention in an El Salvador prison.",
    "url": "https://slate.com/news-and-politics/2025/04/trump-administration-cecot-black-site-el-salvador.html"
  },
  {
    "text": "Trump Pauses Dozens of Federal Grants to Princeton  —  The Trump administration has sought to punish universities financially, saying they have not done enough to combat antisemitism or comply with other administration priorities.  —  The Trump administration moved this week to suspend dozens … ",
    "url": "https://www.nytimes.com/2025/04/01/us/trump-federal-grants-princeton.html"
  },
  {
    "text": "The CDC Has Been Gutted  —  Thousands of CDC employees who worked on things like preventing HIV and lead poisoning have been told they were subject to a reduction in force.  Experts say people will die.  —  Thousands of federal employees at the Centers for Disease Control and Prevention … ",
    "url": "https://www.wired.com/story/cdc-gutted-rif/"
  },
  {
    "text": "Elon Musk's disclosure of planned Social Security fraud arrest troubles top law enforcement officials: Sources  —  Musk seemed to boast of advance knowledge of the arrest during a tele-rally.  —  Elon Musk attends the Division 1 Men's Wrestling Championship in Philadelphia, Mar. 22, 2025.",
    "url": "https://abcnews.go.com/US/elon-musks-disclosure-planned-social-security-fraud-arrest/story?id=120379202"
  },
  {
    "text": "Top Trump USAID Staffer Accused of Violent Outbursts, Racist Remarks  —  Ten people who knew Jeremy Lewin expressed concerns about his new position due to troubling behavior in his youth … Jeremy Lewin recently became deputy administrator for policy and programs for what's left of USAID … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-usaid-jeremy-lewin-accused-violence-racist-remarks-1235307731/"
  },
  {
    "text": "Prosecutors to Seek Death Penalty for Mangione, Bondi Says  —  The attorney general said the decision to seek the death penalty for Luigi Mangione, who is accused of murdering an insurance executive, was in keeping with an executive order by President Trump.",
    "url": "https://www.nytimes.com/2025/04/01/us/politics/luigi-mangione-death-penalty.html?unlocked_article_code=1.8U4.XVsg.iGqLVtbDP2tq&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Republicans Eye $25,000 SALT Cap as Trump's Tax Cuts Take Shape  —  Republicans are in the process of drafting a tax bill behind closed doors that includes an increase of the state and local tax deduction to as high as $25,000 for an individual, according to people familiar with the plan.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-01/republicans-eye-25-000-salt-cap-as-trump-s-tax-cuts-take-shape"
  },
  {
    "text": "Doctor Behind Award-Winning Parkinson's Research Among Scientists Purged From NIH  —  Leading scientists at the National Institutes of Health, the US's leading medical research agency, were swept up Tuesday in the Trump administration's latest firing blitz.  —  Several top scientists charged … ",
    "url": "https://www.wired.com/story/doctor-breakthrough-parkinsons-research-nih-purge/"
  },
  {
    "text": "'I don't know anyone that isn't pissed off at him': Trump world turns on Lutnick  —  As ‘Liberation Day’ nears, patience for the Commerce secretary is wearing thin across the Trump administration.  —  Inside the White House, Commerce Secretary Howard Lutnick has been perhaps the biggest proponent of … ",
    "url": "https://www.politico.com/news/2025/04/01/trump-tariffs-liberation-day-lutnick-politics-00262869"
  },
  {
    "text": "House Democratic Hearing on Social Security  —  Today, the House Democratic Steering and Policy Committee will hold a hearing on the Republican scheme to destroy Social Security, featuring testimony from e...",
    "url": "https://www.youtube.com/live/5g6aP8TziL4?si=-v8686Vei1KQqaty"
  },
  {
    "text": "Inside ICE Air: Flight Attendants on Deportation Planes Say Disaster Is “Only a Matter of Time”  —  Current and former flight attendants for GlobalX, the private charter airline at the center of Trump's immigration crackdown, expressed concern about their inability to treat passengers humanely and to keep them safe.",
    "url": "https://www.propublica.org/article/inside-ice-air-deportation-flights"
  },
  {
    "text": "Elon Musk's $1 million handout winners are connected to Republican causes  —  Nicholas Jacobs and Ekaterina Diestler were presented with giant checks, but they're not exactly random voters. … On Sunday, a few thousand people in Green Bay, Wisconsin, gathered to hear Elon Musk speak … ",
    "url": "https://www.theverge.com/politics/640230/elon-musk-wisconsin-supreme-court-million-dollars-brad-schimel"
  },
  {
    "text": "Democratic Party Leaders and “Free Speech” Warriors Shrug as Trump Deports Dissidents  —  While the Trump administration targets hundreds over their constitutionally protected right to political speech, Democratic leadership and influential media pundits have largely stayed quiet.",
    "url": "https://inthesetimes.com/article/democratic-party-free-speech-trump-deportation-mahmoud-khalil"
  },
  {
    "text": "Entire staff responsible for utility assistance included in HHS cuts, sources say  —  Those who work closely with the Low Income Home Energy Assistance Program now fear for its future.  —  The Trump administration on Tuesday eliminated the entire staff of a federal program … ",
    "url": "https://www.nbcnews.com/business/business-news/trump-admin-fires-staff-liheap-agency-utilities-assistance-program-rcna199177"
  },
  {
    "text": "Federal Judge Allows DOGE to Take Over $500 Million Office Building for Free  —  It's the culmination of a weeks-long standoff between Elon Musk's DOGE team and the United States Institute of Peace.  —  On Tuesday, US district judge Beryl Howell effectively allowed the transfer … ",
    "url": "https://www.wired.com/story/judge-approves-doge-usip-office-building/"
  },
  {
    "text": "Bletchley code breaker Betty Webb dies aged 101  —  A decorated World War Two code breaker who spent her youth deciphering enemy messages at Bletchley Park has died at the age of 101.  —  Charlotte “Betty” Webb MBE - who was among the last surviving Bletchley code breakers - died on Monday night … ",
    "url": "https://www.bbc.com/news/articles/c78jd30ywv8o"
  },
  {
    "text": "The View Lauds Mystal, Claims All Laws Pre-1965 Are ‘Unconstitutional’  —  Text to Speech  —  ABC News's The View had become a home for far-left extremist politics.  That fact was obvious during Tuesday's episode where they invited far-left extremist writer Elie Mystal to promote … ",
    "url": "https://www.newsbusters.org/blogs/nb/nicholas-fondacaro/2025/04/01/view-lauds-mystal-claims-all-laws-pre-1965-are"
  },
  {
    "text": "PRAMS Shuttered for Good  —  In the first weeks of the administration, I wrote a number of pieces on the shuttering of PRAMS (the Pregnancy Risk Assessment Monitoring System), a decades-old data collection and analysis program at CDC tracking infant and maternal health from pregnancy through childbirth and postpartum.",
    "url": "https://talkingpointsmemo.com/edblog/prams-shuttered-for-good"
  },
  {
    "text": "Naval Academy removes nearly 400 books from library in new DEI purge ordered by Hegseth's office  —  The U.S. Naval Academy has removed nearly 400 books from its library after being told by Defense Secretary Pete Hegseth's office to review and get rid of ones that promote diversity, equity and inclusion, U.S officials said Tuesday.",
    "url": "https://apnews.com/article/military-academies-dei-hegseth-trump-ba9731f24b4eb4bd9c02b568209f97af"
  }
]