[
  {
    "text": "Trudeau expected to announce resignation before national caucus meeting Wednesday  —  ////Justin Trudeau is expected to announce as early as Monday that he will resign as Liberal Party Leader, three sources said Sunday, as the Prime Minister faces a caucus revolt and dismal public opinion polls … ",
    "url": "https://www.theglobeandmail.com/politics/article-trudeau-expected-to-announce-resignation-before-national-caucus/"
  },
  {
    "text": "Canada PM Trudeau to announce resignation as early as Monday, Globe and Mail reports  —  Canadian Prime Minister Justin Trudeau is expected to announce as early as Monday that he will resign as Liberal Party Leader, The Globe and Mail reported on Sunday, citing three sources.",
    "url": "https://www.reuters.com/world/americas/canada-pm-trudeau-announce-resignation-early-monday-globe-mail-reports-2025-01-06/"
  },
  {
    "text": "Sen. Adam Schiff says the New Orleans attack shows Kash Patel shouldn't lead the FBI  —  Schiff told NBC News' “Meet the Press” that it was an “easy” decision to vote against Patel, President-elect Donald Trump's pick to lead the FBI.  —  Sen. Adam Schiff, D-Calif., said Sunday that the New Year's … ",
    "url": "https://www.nbcnews.com/politics/congress/adam-schiff-new-orleans-attack-kash-patel-fbi-rcna186284"
  },
  {
    "text": "‘A Day of Love’: How Trump Inverted the Violent History of Jan. 6  —  The president-elect and his allies have spent four years reinventing the Capitol attack — spreading conspiracy theories and weaving a tale of martyrdom to their ultimate political gain.  —  In two weeks, Donald J. Trump … ",
    "url": "https://www.nytimes.com/2025/01/05/us/politics/january-6-capitol-riot-trump.html?unlocked_article_code=1.m04.Bau7.PKFnFK8BJjxA"
  },
  {
    "text": "Trump Weighs Jan. 6 Clemency With Congress Set to Ratify His Win  — Trump promised pardons for 2021 mob; form and timing unclear  — Prosecutors, judges press on as White House transition nears  —  Four years after a mob attacked the US Capitol to support Donald Trump's last-gasp effort … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-05/trump-weighs-jan-6-clemency-with-congress-set-to-ratify-his-win"
  },
  {
    "text": "Thune has privately told Trump that Hegseth has the votes to be confirmed as Defense Secretary, sources say  —  Senate Majority Leader John Thune has privately told President-elect Donald Trump that he believes Pete Hegseth will have the votes to be confirmed as Secretary of Defense, according to three sources.",
    "url": "https://www.cbsnews.com/news/pete-hegseth-votes-confirmation-defense-secretary-john-thune-donald-trump/"
  },
  {
    "text": "Trump Sees the U.S. as a ‘Disaster.’ The Numbers Tell a Different Story.  —  President Biden is bequeathing his successor a nation that by many measures is in good shape, even if voters remain unconvinced.  —  To hear President-elect Donald J. Trump tell it, he is about to take over a nation ravaged … ",
    "url": "https://www.nytimes.com/2025/01/05/us/politics/trump-us-disaster-numbers.html?unlocked_article_code=1.m04.2j5b.V9KE911Ep5nT&smid=url-share"
  },
  {
    "text": "As Trump's election is certified, Americans should declare war on stupidity  —  Shame is what keeps us in check, or at least it should.  It certainly used to.  Trump, devoid of shame, has gone to great lengths to eviscerate that societal check.  —  On the eve of Donald Trump's election certification … ",
    "url": "https://www.usatoday.com/story/opinion/columnist/2025/01/05/trump-presidential-election-certification-embrace-stupidity/77409672007/"
  },
  {
    "text": "Brennan presses Homan on Trump administration's deportation plans  —  CBS News's Margaret Brennan pressed President-elect Trump's new border czar Tom Homan on the next administration's mass deportation plans.  —  Homan joined Brennan on “Face the Nation” on Sunday, where he was asked … ",
    "url": "https://thehill.com/homenews/administration/5068050-brennan-presses-homan-over-trump-administration-deportation-plans/"
  },
  {
    "text": "No, Jeff Bezos is not “obeying in advance”  —  Ann Telnaes, a giant of the editorial cartoonist world who won the Pulitzer Prize in 2001, has resigned from The Washington Post after the paper killed a cartoon she submitted depicting Post owner Jeff Bezos (among others) negatively.  Telnaes explains:",
    "url": "https://www.findinggravity.net/p/no-jeff-bezos-is-not-obeying-in-advance"
  },
  {
    "text": "N.Y. Judge's Ruling Shows How Legal Issues Will Follow Trump Into Office  —  Donald Trump may not face a penalty for his conviction in the hush-money case, but he could still be the first felon to be president — and civil proceedings against him continue.  —  As President-elect Donald J … ",
    "url": "https://www.nytimes.com/2025/01/05/us/politics/new-york-case-trump-merchan-inauguration.html"
  },
  {
    "text": "Higher Social Security payments coming for millions of people from bill that Biden is signing  —  President Joe Biden on Sunday plans to sign into law a measure that boosts Social Security payments for current and former public employees, affecting nearly 3 million people who receive pensions … ",
    "url": "https://apnews.com/article/social-security-retirement-benefits-public-service-workers-5673001497090043e786ade8a8d0fdb4"
  },
  {
    "text": "Director Brett Ratner, marginalized after ‘#MeToo’ allegations, will direct Melania Trump documentary  —  The News  —  The director and producer Brett Ratner, forced out of Hollywood at the peak of the #MeToo movement, will direct a documentary about First Lady Melania Trump for Amazon, the studio confirmed Sunday.",
    "url": "https://www.semafor.com/article/01/05/2025/director-brett-ratner-back-from-metoo-will-direct-melania-trump-documentary"
  },
  {
    "text": "How Chinese Hackers Graduated From Clumsy Corporate Thieves to Military Weapons  —  Massive ‘Typhoon’ cyberattacks on U.S. infrastructure and telecoms sought to lay groundwork for potential conflict with Beijing, as intruders gathered data and got in position to impede response and sow chaos",
    "url": "https://www.wsj.com/tech/cybersecurity/typhoon-china-hackers-military-weapons-97d4ef95"
  },
  {
    "text": "Understanding DOGE as Procurement Capture  —  For the last few months, there's been a lot of conversation around the “Department” of Government Efficiency, which is ostensibly an effort at improving government efficency, with a primary narrative being around government spending.",
    "url": "https://www.anildash.com/2025/01/04/DOGE-procurement-capture/"
  }
]