[
  {
    "text": "Democratic Senator Says He Will Stall Trump Nominees Until USAID Is Back  —  Schatz said he would hold up Trump's diplomatic confirmations  —  WASHINGTON—Sen. Brian Schatz (D., Hawaii) said he would place a “blanket hold” on all of President Trump's State Department nominees until … ",
    "url": "https://www.wsj.com/politics/policy/democratic-senator-says-he-will-block-trump-nominees-until-usaid-is-back-94f8699e?st=iRCZyy&reflink=article_copyURL_share"
  },
  {
    "text": "Inside Musk's Aggressive Incursion Into the Federal Government  —  The billionaire is creating major upheaval as his team sweeps through agencies, in what has been an extraordinary flexing of power by a private individual.  —  The billionaire is creating major upheaval as his team sweeps through agencies … ",
    "url": "https://www.nytimes.com/2025/02/03/us/politics/musk-federal-government.html?unlocked_article_code=1.uE4.TJsg.JuW7_bu37TM7&smid=url-share"
  },
  {
    "text": "Democrats push back after Musk says Trump agrees to close USAID and workers are kept out  —  The Trump administration and billionaire ally Elon Musk moved to shutter an agency that provides crucial aid to fund education and fight starvation overseas, sparking a showdown with congressional Democrats … ",
    "url": "https://apnews.com/article/trump-musk-usaid-c0c7799be0b2fa7cad4c806565985fe2"
  },
  {
    "text": "Elon Musk Suggests Getting Rid Of All Regulations In Midnight Call  —  “If it's not possible now, it'll never be possible,” Musk said of his proposal to simply ignore all federal regulation as a baseline.  —  LOADING  —  President Donald Trump's “government efficiency” … ",
    "url": "https://www.huffpost.com/entry/elon-musk-regulations-default-gone_n_67a12742e4b09a02376043c7"
  },
  {
    "text": "USAID personnel told to stay away from headquarters after Elon Musk's shutdown comments  —  Marocco held several national security positions during the first Trump administration, including at USAID, where he tried to consolidate power and slash funding.  —  WASHINGTON — Secretary … ",
    "url": "https://www.nbcnews.com/politics/white-house/usaid-personnel-told-stay-away-headquarters-elon-musks-shutdown-commen-rcna190405"
  },
  {
    "text": "Musk's superteam of former iPad babies  —  Read to the end for Plimbo … Many other government websites faced outages throughout the weekend as they scrambled to figure out exactly how to comply with the instructions being sent out by the United States Office of Personnel Management (OPM).",
    "url": "https://www.garbageday.email/p/musk-s-superteam-of-former-ipad-babies"
  },
  {
    "text": "Democratic Sen. Brian Schatz puts a hold on Trump's State Department nominees  —  The move comes after Elon Musk said he and Trump would shut down the U.S. Agency for International Development.  —  WASHINGTON — Sen. Brian Schatz, D-Hawaii, said Monday he's placing a “blanket hold” … ",
    "url": "https://www.nbcnews.com/politics/congress/democratic-sen-brian-schatz-puts-hold-trumps-state-department-nominees-rcna190470"
  },
  {
    "text": "Trump to pause promised tariffs for 30 days after speaking with Trudeau  —  Trump, Trudeau spoke last hour for the second time today  —  Trump, Trudeau have 2nd phone call as tariff deadline nears  —  Prime Minister Justin Trudeau said Monday that U.S. President Donald Trump will hold off … ",
    "url": "https://www.cbc.ca/news/politics/trudeau-trump-speak-trade-war-1.7448805"
  },
  {
    "text": "Trump preps order to dismantle Education Dept. as DOGE probes data  —  Closing the agency would require congressional approval, so the new administration hopes to diminish it in the meantime.  —  President Donald Trump is preparing an executive order aimed at eventually closing the Education Department and … ",
    "url": "https://www.washingtonpost.com/education/2025/02/03/trump-education-department-dismantling-executive-order-draft/"
  },
  {
    "text": "Trump Advisers Weigh Plan to Dismantle Education Department  —  Administration officials are discussing executive order that could shut down key functions of the agency  —  Trump administration officials are weighing executive actions to dismantle the Education Department as part of the campaign … ",
    "url": "https://www.wsj.com/politics/policy/education-department-trump-executive-order-eeaf1cb6?st=chFDfP&reflink=article_copyURL_share"
  },
  {
    "text": "DOJ Says Trump Administration Doesn't Have to Follow Court Order Halting Funding Freeze  —  The U.S. Department of Justice (DOJ) argued Monday that a federal court order blocking President Donald Trump's federal funding freeze doesn't halt the administration's efforts.",
    "url": "https://www.democracydocket.com/news-alerts/doj-says-trump-administration-doesnt-have-to-follow-court-order-halting-funding-freeze/"
  },
  {
    "text": "Judge signals plan to further block Trump spending freeze  —  A judge said some nonprofits continued to be hampered by the freeze and still couldn't access promised funding.  —  A federal judge expressed concern Monday that the Trump administration is continuing to implement a blanket freeze … ",
    "url": "https://www.politico.com/news/2025/02/03/trump-federal-funding-freeze-011315"
  },
  {
    "text": "I'm a Federal Worker.  Elon Musk's Government Data Heist Is the Entire Ballgame.  —  On Friday night, reports emerged that Elon Musk's aides had tussled with Office of Personnel Management and Treasury staffers while demanding access to troves of information about federal employees.",
    "url": "https://slate.com/news-and-politics/2025/02/elon-musk-us-aid-social-security-data-heist-trump.html"
  },
  {
    "text": "Elon Musk Installs Illegal Server to Seize All Federal Workers' Data  —  Elon Musk has taken control of government employees' private data by having his cronies illegally install a commercial server at the Office of Personnel Management.  —  Musk and his handpicked associates at the fake … ",
    "url": "https://newrepublic.com/post/191075/elon-musk-power-grab-server-federal-worker-data"
  },
  {
    "text": "CFPB halts work after Trump appoints Bessent as acting head  —  The consumer watchdog agency was formed in the wake of the 2008 financial crisis.  Elon Musk wants to “delete” it.  —  President Donald Trump on Monday appointed Treasury Secretary Scott Bessent as the acting director … ",
    "url": "https://www.washingtonpost.com/business/2025/02/03/trump-cfpb-bessent-halt/"
  },
  {
    "text": "Trump orders creation of US sovereign wealth fund, says it could buy TikTok  —  U.S. President Donald Trump signed an executive order on Monday ordering the U.S. Treasury and Commerce Departments to create a sovereign wealth fund and said it may purchase TikTok.  —  “We're going to stand this thing up within the next 12 months.",
    "url": "https://www.reuters.com/markets/wealth/trump-signs-executive-order-create-sovereign-wealth-fund-2025-02-03/"
  },
  {
    "text": "Musk Says He's ‘Deleted’ Popular Free IRS Tax Filing Program  —  WHO ASKED FOR THIS?  —  The online tax filing option on the IRS website had a strong bipartisan 76% approval rating from registered voters.  —  Kanye West's Naked Grammys Stunt Could Cost Him $20M  —  THE NAKED TRUTH",
    "url": "https://www.thedailybeast.com/musk-says-hes-deleted-popular-free-irs-tax-filing-program/"
  },
  {
    "text": "E.P.A. Tells More Than 1,000 They Could Be Fired ‘Immediately’  —  A spokeswoman for Lee Zeldin, the new head of the agency, said the goal was to create an “effective and efficient” federal work force.  —  The Trump administration has warned more than 1,100 Environmental Protection Agency employees … ",
    "url": "https://www.nytimes.com/2025/02/03/climate/trump-epa-workers-zeldin.html"
  },
  {
    "text": "Bill Cassidy's decision on RFK Jr. could jeopardize his Senate career  —  As a doctor, Cassidy is troubled by RFK Jr. As a politician, he has reason to support him anyway.  —  Bill Cassidy is deeply torn over what to do about Robert F. Kennedy Jr.  —  As a doctor who once prescribed life … ",
    "url": "https://www.politico.com/news/2025/02/03/bill-cassidy-robert-f-kennedy-jr-confirmation-00202153"
  },
  {
    "text": "Trump appoints speechwriter fired for attending conference with White nationalists to top State Department role  —  Darren Beattie, a former Donald Trump speechwriter who was fired in 2018 after CNN revealed he spoke at a conference attended by White nationalists, has been elevated to a top job … ",
    "url": "https://www.cnn.com/2025/02/03/politics/kfile-darren-beattie-state-department-controversial-tweets-white-nationalist-conference/"
  },
  {
    "text": "State Dept. Fires About 60 Contractors Working on Democracy and Human Rights  —  The contractors helped enact programs that focus on building up civil society and democratic practices in authoritarian states such as China, Russia, Iran, North Korea, Venezuela and Cuba.",
    "url": "https://www.nytimes.com/2025/02/03/us/politics/democracy-human-rights-fired.html"
  },
  {
    "text": "Ford ‘ripping up’ Ontario's $100M contract with Elon Musk's Starlink in wake of U.S. tariffs  —  Musk part of President Donald Trump's team that wants to destroy families, Ford says  —  Progressive Conservative Leader Doug Ford is “ripping up” Ontario's nearly $100 million contract … ",
    "url": "https://www.cbc.ca/news/canada/toronto/ford-ripping-up-province-contract-with-starlink-1.7448763"
  },
  {
    "text": "Trump plans to invoke obscure 18th century wartime law in bid for mass deportations  —  President Donald Trump is set to test the limits of his immigration crackdown by invoking a wartime law to deport immigrants alleged to be gang members without court hearings, a broad authority … ",
    "url": "https://www.reuters.com/world/us/trump-plans-invoke-obscure-18th-century-wartime-law-bid-mass-deportations-2025-02-03/"
  },
  {
    "text": "No, Elon: It Isn't Illegal To Boycott X  —  While news cycles in the first Donald Trump presidency were dominated by Trump's erratic social media pretense, news cycles during Trump 2.0 seem so far to be dominated by the erratic social media titan Elon Musk.  The X CEO and leader … ",
    "url": "https://reason.com/2025/02/03/no-elon-it-isnt-illegal-to-boycott-x/"
  }
]