[
  {
    "text": "Special counsel obtained search warrant for Donald Trump's Twitter account  —  Twitter's initial resistance to complying with the warrant resulted in a federal judge holding the company in contempt and levying a $350,000 fine.  —  Special Counsel Jack Smith sought and obtained a search warrant … ",
    "url": "https://www.politico.com/news/2023/08/09/special-counsel-obtained-search-warrant-for-donald-trumps-twitter-account-00110484"
  },
  {
    "text": "Special Counsel Obtained Search Warrant for Trump's Twitter Account  —  The warrant, obtained in January, adds a new dimension to the scope of the federal inquiry into the events of Jan. 6, 2021.  —  Prosecutors working for Jack Smith, the special counsel who has twice brought indictments … ",
    "url": "https://www.nytimes.com/2023/08/09/us/politics/trump-twitter-account-search-warrant.html"
  },
  {
    "text": "Twitter was fined $350,000 for failing to turn over Trump's data  —  The social media company Twitter was forced to hand over records from former president Donald Trump's account to the special counsel investigating the events leading up to the Jan. 6, 2021, attack and pay sanctions for failing … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/08/09/twitter-fine-jan-6-trump/"
  },
  {
    "text": "Man killed during FBI raid in connection with threats against Biden, other officials  —  The Utah man was shot and killed during an FBI raid early Wednesday morning.  —  A Utah man was shot and killed during an FBI raid early Wednesday morning, the FBI confirmed to ABC News.",
    "url": "https://abcnews.go.com/Politics/man-killed-fbi-raid-connection-threats-biden-officials/story?id=102138966"
  },
  {
    "text": "FBI fatally shoots man in Utah who allegedly threatened Biden, Alvin Bragg and others  —  Agents were attempting to serve a search warrant at the Provo home of the suspect when he was shot and killed.  —  The FBI shot and killed a man Wednesday while executing a search warrant in Provo, Utah, federal officials said.",
    "url": "https://www.nbcnews.com/news/us-news/fbi-fatally-shoots-man-utah-allegedly-threatened-biden-alvin-bragg-oth-rcna99083"
  },
  {
    "text": "Ohio Vote Shows Abortion's Potency to Reshape Elections  —  The Dobbs ruling has turned a coalition of liberal, swing and moderate Republican voters into a political force.  Even in August in Ohio.  —  Gov. Mike DeWine of Ohio, a Republican, argued that Tuesday's vote over how to amend … ",
    "url": "https://www.nytimes.com/2023/08/09/us/politics/ohio-election-abortion-voters.html"
  },
  {
    "text": "Ohio's Issue 1 goes down to defeat  —  One Person One Vote spokesman Dennis Willard introducing Deidra Reese from Ohio Unity Coalition at the ‘No’ campaign party.  (Photo by Nick Evans for Ohio Capital Journal)  —  The Republican-led effort to make amending Ohio's constitution more difficult has failed.",
    "url": "https://ohiocapitaljournal.com/2023/08/08/ohios-issue-1-goes-down-to-defeat/"
  },
  {
    "text": "Atlanta-area prosecutor expected to seek more than a dozen indictments in Trump case  —  Fulton County District Attorney Fani Willis is expected to seek more than a dozen indictments when she presents her case regarding efforts by Donald Trump and his allies to overturn the 2020 presidential election results … ",
    "url": "https://www.cnn.com/2023/08/09/politics/trump-georgia-fani-willis-dozen-indictments/"
  },
  {
    "text": "Trump seeks to reestablish secure facility at Mar-a-Lago to review classified evidence  —  Donald Trump's legal team is asking the government to reestablish a secure facility at Mar-a-Lago so that the former president can review classified discovery in the documents case.",
    "url": "https://thehill.com/policy/national-security/4146042-trump-seeks-to-reestablish-scif-at-mar-a-lago-to-review-classified-evidence/"
  },
  {
    "text": "Ex-federal judge and prominent conservative: ‘There is no Republican Party’  —  J. Michael Luttig, a conservative retired federal judge and key adviser to former Vice President Mike Pence, declared on Wednesday that “there is no Republican Party” and said former President Donald Trump … ",
    "url": "https://www.cnn.com/2023/08/09/politics/michael-luttig-conservative-judge-republicans-cnntv/"
  },
  {
    "text": "Much of historic Lahaina town believed destroyed as huge wildfire sends people fleeing into water  —  LAHAINA (HawaiiNewsNow) - Eyewitnesses described an apocalyptic scene Tuesday in Lahaina town, where residents were forced to jump into the harbor waters to avoid fast-moving flames … ",
    "url": "https://www.hawaiinewsnow.com/2023/08/09/coast-guard-joins-brush-fire-response-lahaina-where-crews-continue-battle-wind-whipped-flames/"
  },
  {
    "text": "DeSantis Suspends Second Elected Prosecutor in Florida  —  The Republican governor accused Monique H. Worrell, the state attorney in Orlando and a Democrat, of leniency toward violent criminals, a charge her office has denied.  —  Reporting from Florida  —  Gov. Ron DeSantis of Florida suspended … ",
    "url": "https://www.nytimes.com/2023/08/09/us/desantis-orlando-prosecutor.html"
  },
  {
    "text": "Comer Releases Third Bank Memo Detailing Payments to the Bidens from Russia, Kazakhstan, and Ukraine  —  WASHINGTON—House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) today released a third bank records memorandum detailing new information obtained … ",
    "url": "https://oversight.house.gov/release/comer-releases-third-bank-memo-detailing-payments-to-the-bidens-from-russia-kazakhstan-and-ukraine%EF%BF%BC/"
  },
  {
    "text": "GOP donor Anton Lazzaro sentenced to 21 years for sex trafficking minors in Minnesota  —  A formerly well-connected GOP donor convicted of giving teenage girls gifts, alcohol and money in exchange for sex was sentenced Wednesday to 21 years in prison on sex trafficking charges.",
    "url": "https://thehill.com/homenews/state-watch/4146091-gop-donor-anton-lazzaro-sentenced-to-21-years-for-sex-trafficking-minors-in-minnesota/"
  },
  {
    "text": "Most Alabama voters want Tuberville to drop military hold: poll  —  A majority of likely Alabama voters want Sen. Tommy Tuberville (R-Ala.) to drop his hold on military promotions, according to a new poll.  —  The poll, conducted by Public Policy Polling and commissioned by VoteVets … ",
    "url": "https://thehill.com/homenews/senate/4145859-most-alabama-voters-want-tuberville-to-drop-military-hold/"
  },
  {
    "text": "Senator Dianne Feinstein Taken to Hospital After Tripping, Falling in San Francisco  —  EXCLUSIVE  —  873 … 7:30 AM PT — Senator Dianne Feinstein's office released this statement ... “Senator Feinstein briefly went to the hospital yesterday afternoon as a precaution after a minor fall in her home.",
    "url": "https://www.tmz.com/2023/08/09/senator-dianne-feinstein-hospitalized-trip-fall-shingles-health-san-francisco/"
  },
  {
    "text": "Pastor alarmed after Trump-loving congregants deride Jesus' teachings as ‘weak’  —  Evangelical Christian leader Russell Moore revealed this week that many evangelical pastors have become alarmed that their Trump-loving congregants have become so militant that they are even rejecting the teachings of Jesus Christ.",
    "url": "https://www.rawstory.com/trump-evangelicals-2663078391/"
  },
  {
    "text": "Fox News prime-time ratings continue to crater as Lachlan Murdoch downplays collapse to stakeholders  —  A Media Matters analysis of Fox's new prime-time lineup finds that ratings have fallen roughly 30% since Tucker Carlson's firing, and over 45% in the key 25-54 year-old demographic",
    "url": "https://www.mediamatters.org/fox-news/fox-news-prime-time-ratings-continue-crater-lachlan-murdoch-downplays-collapse"
  }
]