[
  {
    "text": "Ruling Against Trump Cuts to the Heart of His Identity  —  The finding by a judge in a New York civil case that Donald Trump committed fraud in valuing his real estate properties undermined the narrative of the business career that launched him in politics.  —  Nearly every aspect … ",
    "url": "https://www.nytimes.com/2023/09/27/us/politics/trump-fraud-ruling.html"
  },
  {
    "text": "The Republican debate is fake  —  With Trump dominating the GOP primary, the debate is a cosplay of a competitive election — and a distraction from an ugly truth.  —  Tonight's Republican primary debate is not a real event.  It is a performance, a show, a pantomime: a shiny object … ",
    "url": "https://www.vox.com/2024-elections/2023/9/27/23890683/second-republican-debate-gop-fake-rnc-trump"
  },
  {
    "text": "How much would your house be worth if the Trump Organization owned it?  —  A year offering no shortage of bad news for Donald Trump outdid itself Tuesday afternoon, with New York Supreme Court Justice Arthur Engoron ruling that the former president's namesake business, the Trump Organization … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/trump-property-inflated-values/"
  },
  {
    "text": "President Drink Bleach says what?  Trump now claims he beat George W. Bush and Barack Obama  —  The press should cover his decline anyway  —  Donald Trump is skipping another GOP primary debate this week and the theories abound as to why.  Some paint it as a smart strategy … ",
    "url": "https://www.salon.com/2023/09/27/drink-bleach-says-what-now-claims-he-beat-george-w-bush-and-barack-obama/"
  },
  {
    "text": "Let's Not Sleepwalk Into Another Trump Presidency  —  The GOP front-runner's “treason” talk makes clear, yet again, that he's a danger to democracy.  —  In late September 2016, Salena Zito wrote glowingly in The Atlantic about Donald Trump on the campaign trail in Pittsburgh and famously postulated that … ",
    "url": "https://www.vanityfair.com/news/2023/09/donald-trump-democracy-media-2024-election"
  },
  {
    "text": "UAW Leader Has No Desire at All to Talk to Trump in Michigan  —  Trump's expected appearance Wednesday at a non-union auto plant is a “pathetic irony,” Shawn Fain said on CNN.  —  The United Auto Workers union's president derided GOP presidential candidate Donald Trump as being out of touch … ",
    "url": "https://www.thedailybeast.com/united-auto-workers-unions-president-doesnt-want-to-meet-trump-in-michigan"
  },
  {
    "text": "McCarthy's new shutdown strategy: Shifting the blame  —  Good morning, Early Birds.  The New York Times's Vanessa Friedman says it's “a cliché” to wear a Patagonia fleece vest in the office if you don't work in outdoor recreation — but it's so cold in The Post's newsroom.  What's a man to do?",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/mccarthys-new-shutdown-strategy-shifting-blame/"
  },
  {
    "text": "Dems eye their price to bail out the speaker  —  Presented by With assists from POLITICO's Congress team  —  TICK TOCK: The government will shut down in 5 days if Congress can't pass a funding patch.  —  DEMS STILL WEIGHING THE COST OF SAVING MCCARTHY  —  It's the question that Capitol Hill … ",
    "url": "https://www.politico.com/newsletters/huddle/2023/09/26/dems-eye-their-price-to-bail-out-the-speaker-00118255"
  },
  {
    "text": "US secures the release of the soldier who crossed into North Korea 2 months ago  —  The U.S. has secured the release of a U.S. soldier who sprinted across a heavily fortified border into North Korea more than two months ago, the White House announced Wednesday.  U.S. ally Sweden and rival China helped with the transfer.",
    "url": "https://apnews.com/article/north-korea-us-soldier-travis-king-00c171778e378d95fe1115fe31612ec2"
  },
  {
    "text": "Target says it will close nine stores in major cities, citing violence and theft  — Target said it will close nine stores across the country after struggling with crime and safety threats at those locations.  — Target, which has nearly 2,000 stores in the U.S., has been outspoken … ",
    "url": "https://www.cnbc.com/2023/09/26/target-says-it-will-close-nine-stores-citing-violence-and-theft-.html"
  },
  {
    "text": "Menendez ordered to turn over personal passport at arraignment  —  Sen. Bob Menendez (D-N.J.), who pleaded not guilty to federal bribery charges Wednesday, must turn over his personal passport as a condition for his release, multiple reports indicated following the senator's arraignment in Manhattan.",
    "url": "https://thehill.com/regulation/court-battles/4225703-menendez-ordered-to-turn-over-personal-passport-at-arraignment/"
  },
  {
    "text": "US Senator Bob Menendez pleads not guilty to corruption charges  —  U.S. Senator Bob Menendez pleaded not guilty on Wednesday to charges of taking bribes from three New Jersey businessman, as calls for his resignation from his fellow Democrats escalated.  —  Federal prosecutors in Manhattan … ",
    "url": "https://www.reuters.com/world/us/us-senator-bob-menendez-appear-court-calls-resignation-mount-2023-09-27/"
  },
  {
    "text": "“They've already succeeded”: Will Bunch on the GOP's impeachment clown show  —  They don't have evidence.  But they don't need any for their purposes.  —  ∙ Paid … As House Republicans turn the impeachment process into a joke with their evidence-free Joe Biden fishing expedition … ",
    "url": "https://www.publicnotice.co/p/biden-impeachment-inquiry-explained-will-bunch"
  },
  {
    "text": "Biden administration announces visa-free travel for Israelis  —  Israel will be joining the US Visa Waiver Program, allowing Israeli citizens to soon enter the United States without a visa and vice versa, the Biden administration has announced.  —  Israeli citizens will be expected to be able … ",
    "url": "https://www.cnn.com/2023/09/27/politics/biden-admin-israel-visa-waiver-program/"
  },
  {
    "text": "Unraveling what's really happening in Florida school libraries  —  On Tuesday, Popular Information reported that librarians in Charlotte County, Florida, were instructed by the school district superintendent to remove all books with LGBTQ characters.  This story was based on a document dated July 24 … ",
    "url": "https://popular.info/p/update-unraveling-whats-really-happening"
  },
  {
    "text": "FCC chair proposes reinstating Obama-era net neutrality rules  —  Federal Communications Commission (FCC) Chairwoman Jessica Rosenworcel said on Tuesday that she plans to put forward a proposal to reinstate net neutrality rules that were repealed under former President Trump.",
    "url": "https://thehill.com/policy/technology/4224200-fcc-chair-proposes-reinstating-obama-era-net-neutrality-rules/"
  },
  {
    "text": "Public Wants Budget Compromise to Avoid Government Shutdown  —  Neither party in Washington is seen as looking out for average Americans  —  West Long Branch, NJ - By a 2 to 1 margin, Americans want Congress to compromise on the federal budget in order to avoid a government shutdown.",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_us_092723/"
  },
  {
    "text": "Arrest made in connection to 2015 disappearance and murder of Crystal Rogers, Kentucky mother of 5  —  A man has been arrested in connection with the 2015 disappearance and murder of Crystal Rogers, a Kentucky mother of five, the Louisville FBI office said in a statement Wednesday morning.",
    "url": "https://www.cbsnews.com/news/crystal-rogers-murder-disappearance-brooks-houck-arrested-kentucky/"
  },
  {
    "text": "Comer Reveals Wires from China Have Joe Biden's Wilmington Home as the Beneficiary Address￼  —  WASHINGTON—House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) today announced the House Oversight Committee subpoenaed and obtained two bank wires revealing Hunter … ",
    "url": "https://oversight.house.gov/release/comer-reveals-wires-from-china-have-joe-bidens-wilmington-home-as-the-beneficiary-address%EF%BF%BC/"
  }
]