[
  {
    "text": "Restricting The Entry of Foreign Nationals to Protect the United States from Foreign Terrorists and Other National Security and Public Safety Threats  —  BY THE PRESIDENT OF THE UNITED STATES OF AMERICA  —  During my first Administration, I restricted the entry of foreign nationals into the United States … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/06/restricting-the-entry-of-foreign-nationals-to-protect-the-united-states-from-foreign-terrorists-and-other-national-security-and-public-safety-threats/"
  },
  {
    "text": "Trump signs travel ban on nationals from 12 countries, restrictions on 7 more  —  President Trump on Wednesday signed a proclamation barring travelers and immigrants from a dozen countries and restricting the entry of nationals of another seven nations, citing concerns about national security.",
    "url": "https://www.cbsnews.com/news/trump-signs-travel-ban-multiple-countries/"
  },
  {
    "text": "Trump signs proclamation banning travel from 12 countries, CBS News reports  —  U.S. President Donald Trump signed a proclamation banning travel from certain countries, CBS News reported on Wednesday, citing administration officials.  —  The proclamation fully restricts and limits the entry … ",
    "url": "https://www.reuters.com/world/americas/trump-signs-proclamation-banning-travel-12-countries-cbs-news-reports-2025-06-04/"
  },
  {
    "text": "Columbia failed to meet accreditation standards, US government says  —  The U.S. Department of Education said on Wednesday it has notified a university accreditation body that Columbia University had violated federal anti-discrimination laws by its alleged failure to protect Jewish students on its campus.",
    "url": "https://www.reuters.com/world/us/us-education-department-says-columbia-university-violated-federal-anti-2025-06-04/"
  },
  {
    "text": "U.S. Department of Education Notifies Columbia University's Accreditor of Columbia's Title VI Violation  —  ED OCR and HHS OCR Found Columbia University Violated Federal Civil Rights Law  —  The U.S. Department of Education's Office for Civil Rights (OCR) today notified Middle States Commission … ",
    "url": "https://www.ed.gov/about/news/press-release/us-department-of-education-notifies-columbia-universitys-accreditor-of-columbias-title-vi-violation"
  },
  {
    "text": "Trump Pushes to Restrict Harvard's International Students From Entering U.S.  —  The university called it “yet another illegal retaliatory step” from an administration that has sought ways to circumnavigate the courts in its push to bar foreign students.  —  President Trump said on Wednesday … ",
    "url": "https://www.nytimes.com/2025/06/04/us/politics/trump-harvard-international-student-visas.html?unlocked_article_code=1.Mk8.U-n9.bw4Bw3qrLIiH"
  },
  {
    "text": "Fact Sheet: President Donald J. Trump Restricts Foreign Student Visas at Harvard University  —  RESTRICTING FOREIGN STUDENT VISAS AT HARVARD: Today, President Donald J. Trump signed a Proclamation to safeguard national security by suspending the entry of foreign nationals seeking to study … ",
    "url": "https://www.whitehouse.gov/fact-sheets/2025/06/fact-sheet-president-donald-j-trump-restricts-foreign-student-visas-at-harvard-university/"
  },
  {
    "text": "Trump orders investigation into Biden's actions as president, ratcheting up targeting of predecessor  —  President Donald Trump on Wednesday directed his administration to investigate Joe Biden's actions as president, alleging aides masked his predecessor's “cognitive decline” … ",
    "url": "https://apnews.com/article/joe-biden-investigation-autopen-james-comer-ae7013baea1f3da5417d02a6e83811ec"
  },
  {
    "text": "Karine Jean-Pierre writes book on ‘broken’ Biden White House  —  Former press secretary's tome will publish in October, and its title is a nod to her recently announced departure from the Democratic Party to become an independent.  —  Weeks after the release of a best-selling book detailing … ",
    "url": "https://www.washingtonpost.com/politics/2025/06/04/karine-jean-pierre-biden-book-leaves-democrats/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ5MDA5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwMzkxOTk5LCJpYXQiOjE3NDkwMDk2MDAsImp0aSI6IjZmZjQyYTI4LTc2MzktNDliNC05NTAyLWQyNWM0ZmY5N2NhMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA2LzA0L2thcmluZS1qZWFuLXBpZXJyZS1iaWRlbi1ib29rLWxlYXZlcy1kZW1vY3JhdHMvIn0.Bhp8a4AYPyCt6beJPqxp-XnTQ3y44A9RF4zEQWU3ixU&itid=gfta"
  },
  {
    "text": "Karine Jean-Pierre is leaving the Democratic Party.  Her former White House colleagues have some thoughts.  —  Several who worked alongside the former press secretary responded to her book announcement with derision and contempt.  —  Karine Jean-Pierre's announcement that she's leaving … ",
    "url": "https://www.politico.com/news/2025/06/04/karine-jean-pierre-leaving-democratic-party-00385060"
  },
  {
    "text": "Dems eye a villain-to-ally arc for Musk  —  Welcome to POLITICO's West Wing Playbook: Remaking Government, your guide to Donald Trump's unprecedented overhaul of the federal government — the key decisions, the critical characters and the power dynamics that are upending Washington and beyond.",
    "url": "https://www.politico.com/newsletters/west-wing-playbook-remaking-government/2025/06/04/dems-eye-a-villain-to-ally-arc-for-musk-00385945"
  },
  {
    "text": "“The Intern in Charge”: Meet the 22-Year-Old Trump's Team Picked to Lead Terrorism Prevention  —  One year out of college and with no apparent national security expertise, Thomas Fugate is the Department of Homeland Security official tasked with overseeing the government's main hub for combating violent extremism.",
    "url": "https://www.propublica.org/article/trump-dhs-thomas-fugate-cp3-terrorism-prevention"
  },
  {
    "text": "Trump Is Losing Patience With Musk's Outbursts Over Megabill  —  Billionaire's attacks on Trump's tax bill are fraying his relationship with the president  —  WASHINGTON—President Trump is losing patience with Elon Musk after the billionaire attacked Republicans' sprawling tax-and-spending bill.",
    "url": "https://www.wsj.com/politics/policy/elon-musk-trump-tax-spending-republicans-5b779d6b?st=9sSzSr&reflink=desktopwebshare_permalink"
  },
  {
    "text": "ICE Quietly Scales Back Rules for Courthouse Raids  —  A requirement that ICE agents ensure courthouse arrests don't clash with state and local laws has been rescinded by the agency.  ICE declined to explain what that means for future enforcement.  —  Immigration and Customs Enforcement … ",
    "url": "https://www.wired.com/story/ice-quietly-scales-back-rules-for-courthouse-raids/"
  },
  {
    "text": "U.S. Is Trimming Back Its Collection of Consumer Price Data  —  The cutbacks would have “minimal impact,” the government said, but economists warned of reduced confidence in inflation data produced by a struggling statistical system.  —  The Bureau of Labor Statistics is cutting back its collection … ",
    "url": "https://www.nytimes.com/2025/06/04/business/bls-price-data-collection.html"
  },
  {
    "text": "Feds sue Texas over long-standing law allowing undocumented students to receive in-state tuition  —  The lawsuit comes just days after the Legislature adjourned without repealing the first-in-the-nation law, which passed in 2001.  —  The U.S. Department of Justice is suing Texas … ",
    "url": "https://www.texastribune.org/2025/06/04/texas-justice-department-lawsuit-undocumented-in-state-tuition/"
  },
  {
    "text": "Guatemalan deportee arrives in US after judge orders Trump to facilitate return  —  A Guatemalan man who said he was deported to Mexico despite fearing he would be persecuted there was flown back to the United States on Wednesday after a judge ordered the Trump administration to facilitate his return, his lawyer said.",
    "url": "https://www.reuters.com/world/us/guatemalan-deportee-arrives-us-after-judge-orders-trump-facilitate-return-2025-06-04/"
  },
  {
    "text": "Defying Trump, National Portrait Gallery Director Kim Sajet is still at work  —  The president said he had fired the museum leader — setting up a standoff between the White House and the Smithsonian.  —  President Donald Trump's latest attempt to assert control over an elite American cultural institution … ",
    "url": "https://www.washingtonpost.com/entertainment/art/2025/06/04/national-portrait-gallery-kim-sajet-trump/"
  },
  {
    "text": "Top CDC covid vaccine adviser quits after RFK Jr. ended recommendations  —  Lakshmi Panagiotakopoulos said she could no longer help vulnerable people after officials removed recommendations to immunize children and pregnant women.  —  A top coronavirus vaccine adviser at the Centers … ",
    "url": "https://www.washingtonpost.com/health/2025/06/04/cdc-covid-vaccine-advisor-quits/"
  },
  {
    "text": "Trump's Administration Has Asked Ally Serbia to Accept Deportees  —  President Donald Trump's administration is pushing Serbia and other Balkan nations to take in migrants deported from the US, according to people familiar with the matter.  —  The requests to countries in the region are ongoing … ",
    "url": "https://www.bloomberg.com/news/articles/2025-06-05/trump-s-administration-has-asked-ally-serbia-to-accept-deportees"
  },
  {
    "text": "Gov. Tim Walz backs transgender kids as Democrats grapple with debate over bans in sports  —  The Minnesota Democrat has been critical of other members of his party who are retreating at a time when the issue has become a political lightning rod nationally and in Minnesota.",
    "url": "https://www.startribune.com/gov-tim-walz-backs-transgender-kids-as-democrats-grapple-with-debate-over-sports-ban/601366472"
  }
]