[
  {
    "text": "Supreme Court will review scope of obstruction law that Trump is charged with breaking  —  The case calls into question prosecutors' handling of an Enron-era obstruction law to punish those who stormed Congress.  —  The Supreme Court has agreed to take up a case that could derail hundreds … ",
    "url": "https://www.politico.com/news/2023/12/13/supreme-court-will-review-scope-of-obstruction-law-that-trump-is-charging-with-breaking-00131514"
  },
  {
    "text": "Trump Said Too Much Too Soon  —  DONALD TRUMP HAS CHOSEN to make “dictator” his brand.  No one made him do it.  But the fact that he did, eleven months before the election, is a good thing.  —  Trump's plans to destroy our foundational checks and balances and rule as a king hadn't penetrated … ",
    "url": "https://plus.thebulwark.com/p/trump-said-too-much-too-soon-dictator"
  },
  {
    "text": "Checks and Balances Won't Stop Trump  —  The Constitution's protections won't be able to block his abuses of executive power.  —  As we approach the 2024 primaries, some Republicans have begun arguing that the checks and balances constructed by the framers of our Constitution … ",
    "url": "https://www.wsj.com/articles/liz-cheney-checks-and-balances-wont-stop-trump-abuse-of-power-jan-6-second-term-219cc7b7?mod=followamazon"
  },
  {
    "text": "Fani Willis Responds to GOP Backlash to Trump Case: ‘They Want to Come Up With This Foolishness’  —  ‘They worry the hero is treated the same as everybody else,’ the Fulton County, Georgia district attorney said  —  Fulton County, Ga., District Attorney Fani Willis is speaking up amid pushback … ",
    "url": "https://themessenger.com/politics/fani-willis-georgia-republican-senators-trump-case"
  },
  {
    "text": "Republican Senators Say They're Weighing Biden's Immigration Offer  —  President Joe Biden has offered changes to US border policy that raises the prospects of a bipartisan deal on immigration and aid to Ukraine, Republican senators said Wednesday.  —  Republicans met behind closed doors … ",
    "url": "https://www.bloomberg.com/news/articles/2023-12-13/republican-senators-say-they-re-weighing-biden-immigration-offer"
  },
  {
    "text": "A revealing exchange on the GOP's speculative impeachment inquiry  —  It's perhaps a little too simplistic to cast the impeachment inquiry of President Biden, which the House will vote to formalize Wednesday, as a “Seinfeld”-ian impeachment “about nothing.”  —  Republicans have at the very … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/13/republican-impeachment-case-analysis/"
  },
  {
    "text": "GOP Rep. Explains Impeachment Push: ‘Donald J. Trump 2024, Baby!’  —  In video obtained by Rolling Stone, Troy Nehls touted Trump returning to the White House when asked what Republicans have to gain from a Biden impeachment inquiry … The party has struggled to gin up a legitimate rationale … ",
    "url": "https://www.rollingstone.com/politics/politics-news/troy-nehls-biden-impeachment-inquiry-donald-trump-2024-1234927472/"
  },
  {
    "text": "Federal appeals court denies Trump's presidential immunity defense in E. Jean Carroll case  —  The 2nd U.S. Circuit Court of Appeals found Trump's lawyers waited too long - three years - to try to use the defense for his upcoming civil trial.  —  A federal appeals court on Wednesday shot … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/federal-appeals-court-denies-trumps-presidential-immunity-defense-e-je-rcna129521"
  },
  {
    "text": "Hunter Biden flouts subpoena for closed-door testimony, demanding to testify publicly: ‘I am here’  —  President Joe Biden's son Hunter Biden defied Republican investigators' subpoena for closed-door testimony, demanding to testify publicly Wednesday.  —  In his first public statement since … ",
    "url": "https://www.cnn.com/2023/12/13/politics/hunter-biden-capitol-hill/"
  },
  {
    "text": "Tesla recalls nearly all vehicles sold in US to fix system that monitors drivers using Autopilot  —  Tesla is recalling nearly all vehicles sold in the U.S., more than 2 million, to update software and fix a defective system that's supposed to ensure drivers are paying attention when using Autopilot.",
    "url": "https://apnews.com/article/tesla-autopilot-recall-driver-monitoring-system-8060508627a34e6af889feca46eb3002"
  },
  {
    "text": "Supreme Court will decide access to key abortion drug mifepristone  —  The Supreme Court announced Wednesday that it will decide this term whether to limit access to a key abortion drug, returning the polarizing issue of reproductive rights to the high court for the first time since … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/13/abortion-drug-supreme-court-mifepristone-fda/"
  },
  {
    "text": "Contraception is a winning issue, conservative strategists tell GOP  —  Former Trump confidante Kellyanne Conway and other strategists are citing poll data showing strong demand among GOP voters for birth control after the fall of Roe.  —  Kellyanne Conway is going to Capitol Hill on Wednesday … ",
    "url": "https://www.politico.com/news/2023/12/13/kellyanne-conway-contraception-republicans-2024-00131410"
  },
  {
    "text": "Former global diversity executive at Facebook pleads guilty to defrauding company out of more than $4 million  —  For Immediate Release  —  U.S. Attorney's Office, Northern District of Georgia  —  ATLANTA - Barbara Furlow-Smiles, a former global diversity executive at Facebook … ",
    "url": "https://www.justice.gov/usao-ndga/pr/former-global-diversity-executive-facebook-pleads-guilty-defrauding-company-out-more-4?te=1&nl=dealbook&emc=edit_dk_20231213"
  },
  {
    "text": "Inside the Troll Army Waging Trump's Online Campaign  —  A team of meme-makers has been flooding social media with pro-Trump posts riddled with sexist and racist tropes.  Donald Trump is cheering them on.  —  The video, called “Let's Get Ready to Bumble,” is a slick mash … ",
    "url": "https://www.nytimes.com/2023/12/13/us/politics/trump-meme-trolls-2024.html"
  },
  {
    "text": "Bernie Sanders calls for Biden to cut Israel aid by $10 billion  —  The liberal senator says the Israeli military campaign in Gaza amounts to ‘mass atrocity’  —  Sen. Bernie Sanders (I-Vt.) called for President Biden to cut proposed aid to Israel by $10.1 billion in a letter that called … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/13/bernie-sanders-reduce-israel-aid-billions/"
  },
  {
    "text": "US agency will not reinstate $900 mln subsidy for SpaceX Starlink unit  —  The U.S. Federal Communications Commission on Tuesday reaffirmed its 2022 decision to deny SpaceX satellite internet unit Starlink $885.5 million in rural broadband subsidies.  —  The FCC said the decision impacting … ",
    "url": "https://www.reuters.com/technology/space/us-agency-will-not-reinstate-900-mln-subsidy-spacex-starlink-unit-2023-12-13/"
  },
  {
    "text": "Monumental, Youngkin announce deal to move Caps, Wizards to Virginia  —  Renderings show a 20,000-seat arena, practice facilities for the Wizards and Capitals, expanded esports facilities, a performing arts venue, “fan plaza” and more  —  The owner of the Wizards and Capitals has reached … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/12/13/capitals-wizards-move-alexandria-potomac-yard/"
  },
  {
    "text": "Scoop: U.S. delaying sale of M16 rifles to Israel over settler violence  —  The Biden administration is again holding up the licenses for selling more than 20,000 U.S.-made rifles to Israel over concerns about attacks by extremist Israeli settlers against Palestinian civilians in the occupied West Bank, two U.S. officials told Axios.",
    "url": "https://www.axios.com/2023/12/13/us-israel-rifle-sale-delay-west-bank-violence"
  },
  {
    "text": "NASA rover unravels history of lake on Mars that grew up to 22 miles wide, 100 feet deep  —  NASA's Perseverance rover has learned new data about a major crater on Mars, teaching researchers and astronomers about how the structure was formed and when water was present on the planet.",
    "url": "https://www.cbsnews.com/news/nasa-rover-history-lake-mars-water-jezero-crater/"
  },
  {
    "text": "Revealed: House speaker did little to fight toxic ‘burn pit’ his father campaigned against  —  Mike Johnson's creationist beliefs clash with climate facts in a district where many residents still hold deep concerns about pollution  —  Oliver Laughland in Shreveport, Louisiana and Stephanie Kirchgaessner in Washington",
    "url": "https://www.theguardian.com/us-news/2023/dec/13/mike-johnson-creationist-beliefs-clash-with-climate-facts"
  },
  {
    "text": "December 12, 2023  —  Last night, Special Counsel Jack Smith asked the Supreme Court to decide Trump's claim that he is immune from any and all criminal prosecution for anything he did while in office.  That claim is central to Trump's defense; he has requested the charges against him be dismissed because of that immunity.",
    "url": "https://heathercoxrichardson.substack.com/p/december-12-2023"
  }
]