[
  {
    "text": "‘This to Him Is the Grand Finale’: Donald Trump's 50-Year Mission to Discredit the Justice System  —  The former president is in unparalleled legal peril, but he has mastered the ability to grind down the legal system to his advantage.  It's already changing our democracy.",
    "url": "https://www.politico.com/news/magazine/2024/01/12/donald-trump-indictments-legal-system-00135151"
  },
  {
    "text": "Trump's latest about-face: He now says 2020 election was ‘long over’  —  It's a new piece of rhetoric that Trump hopes will help him win immunity from his criminal charges.  —  In the months after the 2020 election, Donald Trump leaned on his campaign to launch ad blitzes and legal challenges … ",
    "url": "https://www.politico.com/news/2024/01/12/trump-2020-election-legal-00135230"
  },
  {
    "text": "Oregon Supreme Court won't remove Trump from ballot for now, says it's waiting on SCOTUS  —  The Oregon Supreme Court on Friday declined to hear a bid to remove former President Donald Trump from the 2024 ballot based on the 14th Amendment's “insurrectionist ban,” saying it's waiting for the US Supreme Court to rule on the issue.",
    "url": "https://www.cnn.com/2024/01/12/politics/oregon-supreme-court-trump-ballot-2024"
  },
  {
    "text": "Americans divided on how SCOTUS should handle Trump ballot access: POLL  —  The U.S. Supreme Court will hear ballot access arguments on Feb. 8.  —  Former President and Republican presidential candidate Donald Trump campaigns, in Clinton, Iowa, Jan 6, 2024.",
    "url": "https://abcnews.go.com/US/americans-divided-scotus-handle-trump-ballot-access-poll/story?id=106300304"
  },
  {
    "text": "Elise Stefanik's Ugly “Hostages” Barb Points to Serious GOP Mayhem Ahead  —  GOP Representative Elise Stefanik no doubt thought it was shrewd to describe the rioters who attacked the Capitol as “January 6 hostages.”  This sort of talk hits a sweet trifecta for a GOP leader with seemingly limitless ambition.",
    "url": "https://newrepublic.com/article/178044/elise-stefanik-jan-6-hostages-gop-mayhem"
  },
  {
    "text": "The Greatest Threat Posed by Trump  —  If Donald Trump storms through Iowa and easily seizes the G.O.P. nomination, as presumed, and then goes on to win back the presidency, his victory will trigger a wild political and legal melee.  The primary motivating purpose of his campaign is vengeance.",
    "url": "https://www.nytimes.com/2024/01/12/opinion/donald-trump-culture-decline.html"
  },
  {
    "text": "Dean Phillips: I'm Being Blackballed — and It's Joe Biden's Fault  —  What the Minnesota Rep's unsurprising media struggles say about our news ecosystem.  —  “I'm appalled,” fumes U.S. Rep. and presidential hopeful Dean Phillips.  “I'm disappointed.  I'm disgusted that professionals … ",
    "url": "https://www.politico.com/news/magazine/2024/01/12/dean-phillips-msnbc-joe-biden-00135134"
  },
  {
    "text": "US, British militaries launch massive retaliatory strike against Iranian-backed Houthis in Yemen  —  WASHINGTON (AP) — The U.S. and British militaries were bombing more than a dozen sites used by the Iranian-backed Houthis in Yemen on Thursday, in a massive retaliatory strike using warship … ",
    "url": "https://apnews.com/article/yemen-houthis-biden-retaliation-attacks-0804b93372cd5e874a0dd03513fe36a2"
  },
  {
    "text": "Inside Biden's decision to strike the Houthis  —  The administration had been under pressure to respond to the Iran-backed attacks.  —  President Joe Biden was still on his holiday getaway in St. Croix when he spoke with his national security team on the first morning of 2024.",
    "url": "https://www.politico.com/news/2024/01/11/biden-houthis-strike-yemen-iran-00135242"
  },
  {
    "text": "Statement from President Joe Biden on Early Student Debt Cancellation for Borrowers Enrolled in SAVE  —  From Day One of my Administration, I vowed to fix the student loan system and make sure higher education is a pathway to the middle class - not a barrier to opportunity.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/12/statement-from-president-joe-biden-on-early-student-debt-cancellation-for-borrowers-enrolled-in-save/"
  },
  {
    "text": "Iowa blizzard cancels GOP events, threatens caucus turnout  —  Candidates are canceling events, as extreme weather shuts campaigning down.  —  WEST DES MOINES, Iowa — Every campaign takes a certain number of precautions heading into the critical stretch run of a primary.",
    "url": "https://www.politico.com/news/2024/01/12/iowa-blizzard-cancels-gop-events-threatens-caucus-turnout-00135322"
  },
  {
    "text": "Why Platformer is leaving Substack  —  After much consideration, we have decided to move Platformer off of Substack.  Over the next few days, the publication will migrate to a new website powered by the nonprofit, open-source publishing platform Ghost.  If you already subscribe to Platformer … ",
    "url": "https://www.platformer.news/p/why-platformer-is-leaving-substack"
  },
  {
    "text": "Don't Turn Away From the Charges of Genocide Against Israel  —  With the question of whether Israel is committing genocide in Gaza now before the International Court of Justice, the Biden administration has struck a tone of glib dismissal.  —  “Meritless” seems to be the agreed-upon term among U.S. officials.",
    "url": "https://www.nytimes.com/2024/01/12/opinion/israel-icj-genocide-south-africa.html"
  },
  {
    "text": "EXCLUSIVE: Here's The Tape of Roger Stone Discussing Assassination of Democrats — Which He Denied Ever Doing  —  Roger Stone has contested Mediaite's reporting this week regarding comments he made on tape floating the assassination of two members of Congress.",
    "url": "https://www.mediaite.com/politics/exclusive-heres-the-tape-of-roger-stone-discussing-assassination-of-democrats-which-he-denied-ever-doing/"
  },
  {
    "text": "Johnson confronts biggest test yet: Whether to walk away from his own funding deal  —  Conservatives are pushing him to renege.  Most of the rest of his party wants him to stand firm.  Whichever path he chooses carries real risks.  —  Speaker Mike Johnson's grip on his fractious conference slipped … ",
    "url": "https://www.politico.com/news/2024/01/12/johnson-funding-conservatives-00135152"
  },
  {
    "text": "Joe Biden Called David Axelrod a ‘Prick.’ It Won't Shut Him Up.  —  A Q&A with the former Obama strategist who's not afraid to critique the Biden campaign.  —  David Axelrod recently got a gift in the mail.  —  It was a box of political pins that captured the unique role … ",
    "url": "https://www.politico.com/news/magazine/2024/01/12/david-axelrod-obama-biden-2024-00135194"
  }
]