[
  {
    "text": "It's Johnson's decision time on Ukraine  —  Good morning, Early Birds.  There's a solar eclipse today — which means eclipse mania is almost over.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.  —  In today's edition … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/08/its-johnsons-decision-time-ukraine/"
  },
  {
    "text": "Speaker Johnson's job is on the line as the House returns  —  Deep divisions on issues like Ukraine and border security may force the speaker to once again turn to Democrats to pass his priorities  —  House Republicans are dreading their return to Washington on Tuesday … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/08/mike-johnson-speaker-congress-ukraine-marjorie-taylor-greene/"
  },
  {
    "text": "Trump's $175 Million Bond Is Even Shadier Than It Looks  —  BOILERPLATE  —  New information shows that the insurance company that swooped in and bailed out Trump with a $175 million bond isn't on a list of vetted companies—and wrote a bizarre contract.",
    "url": "https://www.thedailybeast.com/trumps-dollar175-million-bond-is-even-shadier-than-it-looks"
  },
  {
    "text": "Trump says abortion should be decided by the states, ‘will of the people’  —  Trump vows support for IVF, abortion laws should be decided by the people and the states  —  Former President Donald Trump on Monday announced his position on whether abortion should be banned … ",
    "url": "https://www.foxnews.com/politics/trump-says-abortion-should-be-decided-the-states-will-the-people"
  },
  {
    "text": "Trump says abortion should be a states' rights issue, Republicans ‘must also win elections’  —  Trump said what individual states decide “must be the law of the land.”  —  After months of dodging questions about his abortion position, former president Donald Trump rejected calls to endorse … ",
    "url": "https://abcnews.go.com/Politics/trump-abortion-states-rights-issue/story?id=108976038"
  },
  {
    "text": "Biden promises student loan relief as early as this fall through new plan  —  The president, vice president and others plan to fan out across the country this week to trumpet the administration's boldest student debt relief plan since the Supreme Court's rebuke last summer.  —  Zachary Schermele Alia WongUSA TODAY",
    "url": "https://www.usatoday.com/story/news/education/2024/04/08/biden-new-student-loan-forgiveness-proposal/73218916007/"
  },
  {
    "text": "Biden announces new student debt relief plan for millions of borrowers  —  The Biden administration on Monday announced new student loan plans that would provide relief to millions of Americans if finalized.  —  The proposed plans would largely affect those with “runaway interest” … ",
    "url": "https://thehill.com/homenews/education/4580188-biden-announces-new-student-debt-relief-plan-for-millions-of-borrowers/"
  },
  {
    "text": "Cruz's corrupt bargain  —  After the Supreme Court's 2010 decision in Citizens United, there are few restrictions on spending money in federal elections.  But Senator Ted Cruz (R-TX) may have violated one of the last legal guardrails to secure hundreds of thousands of dollars in support of his reelection campaign.",
    "url": "https://popular.info/p/cruzs-corrupt-bargain"
  },
  {
    "text": "A “wonkish” professor is Democrats' big draw in the 2024 campaign … - “We're in the fight of our lives for democracy and freedom, and those are kind of my hobby horse,” said Raskin, a former Jan. 6 committee member and Trump impeachment manager who's the leading Democrat on the House Oversight Committee.",
    "url": "https://www.axios.com/2024/04/08/raskin-big-draw-democrats-2024-campaign"
  },
  {
    "text": "Nation's leading anti-abortion group rebukes Trump  —  “We are deeply disappointed in President Trump's position,” said Marjorie Dannenfelser, president of Susan B. Anthony Pro-Life America.  —  One of the nation's most prominent anti-abortion groups rebuked former President Donald Trump Monday … ",
    "url": "https://www.politico.com/news/2024/04/08/trump-anti-abortion-group-ban-00151037"
  },
  {
    "text": "Scoop: Trump, GOP plot 2025 criminal probe of Bidens … - A source close to the Trump campaign said that “everything you have seen from the Biden DOJ,” in terms of the charges against Trump, “you can expect to see from the Trump DOJ.”  — One Trump ally argued that there is precedent … ",
    "url": "https://www.axios.com/2024/04/08/trump-gop-plot-biden-probe-2025"
  },
  {
    "text": "Trump's Cabinet was in flux.  Biden's has barely changed.  —  Former president Donald Trump saw more turnover in his Cabinet than any other recent president, and it's not close.  President Biden, on the other hand, has had relatively little change in his administration's top roles so far.",
    "url": "https://www.washingtonpost.com/politics/2024/04/08/trump-biden-cabinet-turnover/"
  },
  {
    "text": "Judge Cannon's ticking time bomb jury instructions  —  She's got a lot of ways to blow up this case, and appears to be trying this one on for size. … Last week we got an alarming look at a potential route for Judge Aileen Cannon to ruin the case against Donald Trump for stealing government documents … ",
    "url": "https://www.publicnotice.co/p/judge-aileen-cannon-jury-instructions-trump-docs"
  },
  {
    "text": "Senate Democrats look to close judicial confirmation gap  —  Biden close to matching pace of Trump appointments at this point in presidency  —  Senate Democrats have teed up floor action this week on three more of President Joe Biden's judicial nominations, whose confirmations would catch … ",
    "url": "https://rollcall.com/2024/04/08/senate-democrats-look-to-close-judicial-confirmation-gap/"
  },
  {
    "text": "Trump, at Fund-Raiser, Says He Wants Immigrants From ‘Nice’ Countries  —  At rallies, Donald Trump frequently laments migrants from a list of countries from Africa, Asia and the Middle East as he stokes fears around the surge at the border.  —  Former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/04/07/us/politics/trump-immigrants-nice-countries.html"
  },
  {
    "text": "Melania's Appearance With Donald Trump Sparks Mockery: ‘Checking the Clock’  —  Melania Trump's appearance at a fundraiser with husband Donald Trump has prompted mockery on social media.  —  The former first lady has maintained a low profile as her husband seeks to reclaim the White House in 2024.",
    "url": "https://www.newsweek.com/melania-appearance-donald-trump-mockery-1887693"
  }
]