[
  {
    "text": "We've Been Entertaining an Illusion About the Supreme Court.  It's Finally Been Shattered.  —  There will be no more self-soothing after this.  —  For three long years, Supreme Court watchers mollified themselves (and others) with vague promises that when the rubber hit the road … ",
    "url": "https://slate.com/news-and-politics/2024/04/supreme-court-immunity-arguments-which-way-now.html"
  },
  {
    "text": "Trump Melts Institutions, SCOTUS Edition  —  No topper to ease you in today; too much to get through.  Happy Friday.  —  Where's SCOTUS Going?  —  How much should people freak out over Thursday's SCOTUS oral arguments about Trump's claims that he can't be prosecuted for election crimes due to presidential immunity?",
    "url": "https://www.thebulwark.com/p/trump-melts-institutions-scotus-edition"
  },
  {
    "text": "This Whole King Trump Thing Is Getting Awfully Literal  —  Donald Trump's claim that he has absolute immunity for criminal acts taken in office as president is an insult to reason, an assault on common sense and a perversion of the fundamental maxim of American democracy: that no man is above the law.",
    "url": "https://www.nytimes.com/2024/04/26/opinion/trump-immunity-supreme-court.html"
  },
  {
    "text": "The Trumpification of the Supreme Court  —  The notion that Donald Trump's supporters believe that he should be able to overthrow the government and get away with it sounds like hyperbole, an absurd and uncharitable caricature of conservative thought.  Except that is exactly … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/04/trump-presidential-inmunity-supreme-court/678193/"
  },
  {
    "text": "Presidential Immunity  —  Today, we focus on Trump's appeal to the Supreme Court after Judge Chutkan denied his motion to dismiss the Special Counsel's election interference case, claiming he has absolute immunity from criminal prosecution as a former president.",
    "url": "https://joycevance.substack.com/p/presidential-immunity"
  },
  {
    "text": "Scoop: Biden changes walking routine to Marine One … - Weeks ago the president told aides that he'd prefer a less formal approach, a White House official told Axios. … White House staffers and reporters alike noticed the sudden change in Biden's walk routine beginning in mid-April … ",
    "url": "https://www.axios.com/2024/04/26/biden-walkers-white-house-marine-one"
  },
  {
    "text": "Thieves snatch Rep. Adam Schiff's luggage in S.F. He gives dinner speech without a suit  —  Hello to the city, goodbye to your luggage.  That was Senatorial candidate Adam Schiff's rude introduction to San Francisco's vexing reputation for car burglaries Thursday when thieves swiped the bags … ",
    "url": "https://www.sfchronicle.com/bayarea/article/car-burglars-snatch-rep-adam-schiff-s-luggage-19424026.php"
  },
  {
    "text": "Trump VP contender Kristi Noem writes of killing dog - and goat - in new book  —  South Dakota governor includes bloody tale in campaign volume - and admits 'a better politician ... wouldn't tell the story here'  —  In 1952, as a Republican candidate for vice-president … ",
    "url": "https://www.theguardian.com/books/2024/apr/26/trump-kristi-noem-shot-dog-and-goat-book"
  },
  {
    "text": "Fake electors find out in Arizona  —  These are not very bright people, and things got out of hand.  —  ∙ Paid … On Wednesday, the denizens of Trumpworld who were foolish enough to go along with Trump's hamfisted and illegal fake elector scheme in Arizona had a nine-count indictment dropped on their heads.",
    "url": "https://www.publicnotice.co/p/arizona-fake-electors-indictment"
  },
  {
    "text": "Trump Allies Draw Up Plans to Blunt Fed's Independence  —  Some Trump advisers argue that the president should be consulted on interest-rate decisions",
    "url": "https://www.wsj.com/economy/central-banking/trump-allies-federal-reserve-independence-54423c2f"
  },
  {
    "text": "Trump's isolation deepens after his coup crew is hit with Arizona criminal indictments  —  The January 6 co-conspirators are likely too wrapped up in their criminal cases to help Trump with another coup  —  Because Donald Trump himself wasn't indicted, there was a surprisingly muted response … ",
    "url": "https://www.salon.com/2024/04/26/isolation-deepens-after-his-coup-crew-is-hit-with-arizona-criminal-indictments/"
  },
  {
    "text": "A Statement From The New York Times on Presidential News Coverage  —  A spokesperson for The New York Times responds to recent reporting about a free press and reporting on the president.  —  For anyone who understands the role of the free press in a democracy, it should be troubling … ",
    "url": "https://www.nytco.com/press/a-statement-from-the-new-york-times-on-presidential-news-coverage/"
  },
  {
    "text": "Blinken tells CNN the US has seen evidence of China attempting to influence upcoming US elections  —  US Secretary of State Antony Blinken said the US has seen evidence of Chinese attempts to “influence and arguably interfere” with the upcoming US elections, despite an earlier commitment from leader Xi Jinping not to do so.",
    "url": "https://www.cnn.com/2024/04/26/politics/blinken-china-interview-intl-hnk"
  },
  {
    "text": "Daimler Truck Workers in North Carolina Are Poised to Strike  —  A walkout by employees who make Freightliner trucks and Thomas Built buses would expand the U.A.W.'s campaigns in the South.  —  Workers who make trucks and buses for Daimler Truck in North Carolina appeared poised to strike … ",
    "url": "https://www.nytimes.com/2024/04/26/business/daimler-truck-uaw-strike.html"
  },
  {
    "text": "Trump's criminal charges and Biden's age rank as voters' top worries about the candidates  —  The responses in NBC News' latest national poll also found Democrats grappling more with Biden's liabilities than Republicans do with Trump's.  —  Voters continue to rank President Joe Biden's age … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trumps-criminal-charges-bidens-age-rank-voters-top-worries-candidates-rcna149365"
  },
  {
    "text": "Election Updates: Biden says he is ‘happy to’ debate Trump, a notable shift.  —  Biden, asked if he's planning to debate Trump, says ‘I am happy to.’  —  President Biden said on Friday that he would participate in a general-election debate with former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/live/2024/04/26/us/biden-trump-election"
  },
  {
    "text": "Biden's 13th-Quarter Approval Average Lowest Historically  —  Averages 38.7% job approval  —  WASHINGTON, D.C. — President Joe Biden averaged 38.7% job approval during his recently completed 13th quarter in office, which began on Jan. 20 and ended April 19.",
    "url": "https://news.gallup.com/poll/644252/biden-13th-quarter-approval-average-lowest-historically.aspx"
  },
  {
    "text": "Team Trump Fine With Pissing Off MAGA to Compete With Biden  —  DEBASER  —  On a pair of high-profile occasions, Trump got crosswise with his MAGA base.  It's not accidental. … NOT SO BASED DON  —  It's one of the seemingly ironclad natural laws of the Trump era … ",
    "url": "https://www.thedailybeast.com/team-trump-fine-with-pissing-off-maga-to-compete-with-biden"
  },
  {
    "text": "USC cancels ‘main stage’ commencement ceremony  —  USC announced Thursday that it is canceling its main May commencement ceremony, capping a dramatic series of moves that began last week after it informed valedictorian Asna Tabassum, who had been opposed by pro-Israel groups, that she would not be delivering the traditional speech.",
    "url": "https://www.latimes.com/california/story/2024-04-25/la-me-usc-commencement-canceled"
  },
  {
    "text": "Inside the failed White House coup to oust Biden press secretary Karine Jean-Pierre  —  WASHINGTON — Top aides to President Biden secretly hatched a plan this past fall to replace White House press secretary Karine Jean-Pierre by recruiting outside allies to nudge her out the door, The Post has learned.",
    "url": "https://nypost.com/2024/04/26/us-news/inside-the-failed-white-house-coup-against-press-secretary-karine-jean-pierre/"
  },
  {
    "text": "High School AD Framed Principal With Fake AI-Generated Racist Audio: Cops  —  BRAVE NEW WORLD  —  The alleged ploy led police to arrest and charge Dazhon Darien with theft, stalking, disruption of school operations, and retaliation against a witness.  —  A Maryland high school athletic director … ",
    "url": "https://www.thedailybeast.com/high-school-athletic-director-framed-principal-with-fake-ai-generated-racist-audio"
  }
]