[
  {
    "text": "Letter With White Powder Mailed to Donald Trump Jr.'s Florida Home: Sources  —  Multiple fire trucks and men in hazmat suits were spotted outside Donald Trump Jr.'s home in Jupiter, Florida, on Monday evening. … Multiple fire trucks and men in hazmat suits were spotted outside Donald Trump Jr.'s home … ",
    "url": "https://www.thedailybeast.com/hazmat-teams-spotted-at-don-jrs-florida-home-after-white-powder-discovered"
  },
  {
    "text": "Trump seeks to block Stormy Daniels, Michael Cohen from testifying at NY hush money trial  —  Former President Trump's lawyers in his hush-money case on Monday demanded a New York judge block key witnesses from testifying in Trump's first criminal trial set to begin next month.",
    "url": "https://thehill.com/homenews/4490109-trump-block-stormy-daniels-michael-cohen-ny-hush-money-trial/"
  },
  {
    "text": "Democrats intensify their IVF messaging in new billboards, tying Trump to the Alabama ruling  —  Democrats are attacking Trump on the Alabama IVF decision in new billboard ads across eight battleground states that launch Tuesday.  —  Democrats are ramping up their messaging around … ",
    "url": "https://www.nbcnews.com/politics/2024-election/democrats-ivf-messaging-new-billboards-trump-alabama-ruling-rcna140530"
  },
  {
    "text": "Biden says temporary cease-fire in Gaza could come next week  —  Negotiators have been working for months to secure a deal to release more than 100 Israeli hostages  —  President Biden on Monday said he hoped a deal between Israel and Hamas could emerge as soon as next week … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/26/biden-cease-fire-gaza/"
  },
  {
    "text": "Jack Smith says Trump's handling of classified docs was far worse than Biden's  —  In a new filing in Trump's Florida case, Smith cited Robert Hur's report on Joe Biden's retention of classified material.  —  Special counsel Jack Smith said Monday that President Joe Biden's handling … ",
    "url": "https://www.politico.com/news/2024/02/26/jack-smith-says-trump-classified-docs-00143346"
  },
  {
    "text": "Trump Says He's Too Rich To Post Bond In Carroll Defamation Case  —  Bitch better have my money.  —  E. Jean Carroll would like her $83 million dollars, please.  —  On January 26, a jury in Manhattan returned its verdict in the advice columnist's second defamation trial against the former president.",
    "url": "https://abovethelaw.com/2024/02/trump-says-hes-too-rich-to-post-bond-in-carroll-defamation-case/"
  },
  {
    "text": "Kroger's “nefarious bargain”  —  This is a special joint edition of Popular Information and Fingers, a newsletter about drinking in America by journalist Dave Infante.  Fingers is a must-read for anyone who cares about the business, culture, and chaos of booze.  Sign up HERE.",
    "url": "https://popular.info/p/krogers-nefarious-bargain"
  },
  {
    "text": "The economy is roaring.  Immigration is a key reason.  —  Momentum in the job market picked up aggressively over the past year — all while Washington is deadlocked on a border deal.  —  Immigration has propelled the U.S. job market further than just about anyone expected … ",
    "url": "https://www.washingtonpost.com/business/2024/02/27/economy-immigration-border-biden/"
  },
  {
    "text": "Judge orders Biden informant Alexander Smirnov to remain in jail  —  The former FBI informant is accused of lying when he claimed that Joe and Hunter Biden took bribes to shield a Ukrainian energy company  —  LOS ANGELES — A former FBI informant pleaded not guilty Monday to charges … ",
    "url": "https://www.washingtonpost.com/national-security/2024/02/26/fbi-informant-biden-smirnov-not-guilty/"
  },
  {
    "text": "GOP Rep. Scott Perry Wants to Cancel Biden's SOTU Address Over Border  —  “There's no reason that we need to invite him to get more propaganda,” Perry said, even though Biden accepted the House Speaker's invitation seven weeks ago.  —  Rep. Scott Perry (R-PA) suggested Monday … ",
    "url": "https://www.thedailybeast.com/gop-rep-scott-perry-wants-to-cancel-bidens-sotu-address-over-the-border"
  },
  {
    "text": "Students Walk Out Of Oklahoma High School To Protest Nex Benedict's Death  —  Dozens of students at Owasso High said that they believe the school has not responded adequately to the 16-year-old's death and that a culture of bullying persists.  —  Dozens of students at Owasso High School … ",
    "url": "https://www.huffpost.com/entry/nex-benedict-death-oklahoma-student-walkout_n_65dd105ee4b0e4346d537fc7"
  },
  {
    "text": "Exclusive: Key figure in fake electors plot concealed damning posts on secret Twitter account from investigators  —  Kenneth Chesebro, the right-wing attorney who helped devise the Trump campaign's fake electors plot in 2020, concealed a secret Twitter account from Michigan prosecutors … ",
    "url": "https://www.cnn.com/2024/02/26/politics/kenneth-chesebro-secret-twitter-account-kfile/"
  },
  {
    "text": "Zelensky says Trump doesn't understand Putin because he has never fought him  —  Former US President Donald Trump will be “against Americans” if he chooses to support Russia over Ukraine, President Volodymyr Zelensky told CNN Sunday, in a stark warning as his country enters a third year of full-scale war.",
    "url": "https://www.cnn.com/2024/02/26/europe/zelensky-interview-ukraine-war-aid-trump-intl/"
  },
  {
    "text": "Fani Willis slammed with harassing calls after Trump lawyer puts contact info in court doc  —  Fulton County District Attorney Fani Willis and special prosecutor Nathan Wade were slammed with harassing phone calls over the weekend after one of former President Donald Trump's attorneys put … ",
    "url": "https://www.rawstory.com/fani-willis-nathan-wade-2667369713/"
  },
  {
    "text": "Navalny aides say the Russian opposition leader was close to being freed before his death  —  Associates of Russian opposition leader Alexei Navalny said Monday that talks were underway shortly before his death to exchange him for a Russian imprisoned in Germany.  —  “Alexei Navalny could have been sitting here now, today.",
    "url": "https://apnews.com/article/russia-navalny-prison-death-swap-ce214909b1088a1d67fa9cd323864f50"
  },
  {
    "text": "A Wild and Dangerous 2024 Experiment  —  “We are in this to win it,” No Labels' chief strategist, Ryan Clancy, told me one morning earlier this month.  Clancy and 16 other representatives of the beleaguered centrist group were staring at me through their respective Zoom boxes during a private briefing … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/02/no-labels-2024-election/677570/"
  },
  {
    "text": "New York Democrats reject bipartisan congressional map for a chance to draw their own lines  —  Democrats who control the New York Legislature on Monday rejected a congressional map devised by a bipartisan commission that would have given their party only a modest electoral advantage and will now have the chance to draw their own lines.",
    "url": "https://www.cnn.com/2024/02/26/politics/new-york-congressional-map/"
  },
  {
    "text": "Trump's Ex-Press Aide Makes Surprising Admission About How She Voted In 2016  —  “I think I knew full well what kind of man he was when I went to go work for him,” Sarah Matthews told MSNBC's Nicolle Wallace.  —  LOADING  —  Sarah Matthews said Monday she did not vote for Donald Trump … ",
    "url": "https://www.huffpost.com/entry/sarah-matthews-vote-trump-2016_n_65dda6d4e4b0e4346d53d18f"
  },
  {
    "text": "The House GOP's defense against hardliners is about to get weaker  —  If Republicans can hold the majority, they'll likely have to wrangle a bloc of even more emboldened conservatives who made their name by fighting their own party.  —  House Republicans are facing a growing exodus … ",
    "url": "https://www.politico.com/news/2024/02/27/bipartisan-republicans-trump-leaving-congress-00142908"
  },
  {
    "text": "For the first time in years, Sen. Graham hasn't introduced a national abortion ban  —  Sen. Lindsey Graham has introduced a federal abortion ban bill every Congress since 2013.  As Republicans scramble on abortion messaging, his legislation is conspicuously absent.",
    "url": "https://www.nbcnews.com/politics/congress/first-time-years-sen-graham-hasnt-introduced-national-abortion-ban-rcna140581"
  }
]