[
  {
    "text": "Why Chuck Todd's Scorcher Against NBC Matters  —  The revolving door between political operatives and the mainstream media has been spinning for decades.  —  As if responding to an alarm setting on a cosmic, biological clock, the press and its minders set to ringing and clanging bloody murder … ",
    "url": "https://www.politico.com/news/magazine/2024/03/25/ronna-mcdaniel-firestorm-nbc-00148799"
  },
  {
    "text": "Playbook: Inside NBC's McDaniel meltdown  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  SUDDENLY HE'S EVERYWHERE — “Big Republican Donor Jeff Yass Owned Shares in Trump Media Merger Partner,” by NYT's Matthew Goldstein: “JEFF YASS … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/03/25/inside-nbcs-mcdaniel-meltdown-00148769"
  },
  {
    "text": "NBC Guild: ‘Our journalism is tarnished’  —  The network's union alleged in a social media post that NBC News “illegally terminated” 13 union journalists two weeks prior to hiring Ronna McDaniel.  —  NBC's union accused the network of valuing former RNC chair Ronna McDaniel over its own journalists … ",
    "url": "https://www.politico.com/news/2024/03/25/nbc-guild-ronna-mcdaniel-hiring-00148863"
  },
  {
    "text": "Ronna McDaniel Was a MAGA Toadie Who Betrayed the GOP  —  SHAMELESS OPPORTUNIST  —  Now that she's an NBC News contributor, the ex-RNC chair says she was just being a team player when she did Trump's bidding.  That's completely bogus. … In case you missed it, former Republican National … ",
    "url": "https://www.thedailybeast.com/ronna-mcdaniel-was-a-maga-toadie-who-betrayed-the-gop"
  },
  {
    "text": "NBC's McDaniel mess threatens to explode  —  Network insiders are watching to see if more hosts and contributors speak out about the ex-RNC chair's hiring.  —  The uproar inside NBC over Ronna McDaniel's hiring spilled into Monday morning as more of the network's top personalities denounced … ",
    "url": "https://www.politico.com/news/2024/03/25/nbc-ronna-mcdaniel-chuck-todd-00148772"
  },
  {
    "text": "NBC stands for Now Boosting the Coup  —  Network gives aid to democracy's enemies by hiring Ronna McDaniel  —  No major television news operation is doing enough to confront right-wing extremism.  At a crisis point for our democracy, they are failing us.  —  But some are really failing us.",
    "url": "https://www.stopthepresses.news/p/nbc-stands-for-now-boosting-the-coup"
  },
  {
    "text": "Liz Cheney says ex-RNC chair Ronna McDaniel ‘enabled’ Trump's ‘criminality’  —  McDaniel 'facilitated Trump's corrupt fake elector plot', says ex-congresswoman of the newly-hired NBC News contributor  —  The Republican National Committee chair turned NBC politics analyst Ronna McDaniel … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/25/liz-cheney-ronna-mcdaniel-trump-rnc"
  },
  {
    "text": "Trump Can Post Smaller Bond in Civil Fraud Case, Court Rules  —  The former president must post a bond of $175 million within 10 days as he appeals the $454 million judgment against him.  —  With Donald J. Trump on the clock to secure a nearly half-billion-dollar bond in his civil fraud case … ",
    "url": "https://www.nytimes.com/2024/03/25/nyregion/trump-bond-reduced.html"
  },
  {
    "text": "N.Y. appeals court reduces Trump's bond in his civil fraud case to $175 million, a victory for the former president  —  The court also gave Trump an additional 10 days to post the bond, which his lawyers have said they've had trouble securing.  —  A state appeals court ruled that Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/ny-appeals-court-reduces-trumps-bond-civil-fraud-case-175-million-vict-rcna144659"
  },
  {
    "text": "Wife of Judge on Mifepristone Case Was Paid by Anti-Abortion Group  —  FRIENDS OF THE COURT  —  The fate of the abortion pill mifepristone is now before the Supreme Court, after a fifth-circuit appeals panel of three judges ruled against its distribution last summer.",
    "url": "https://www.thedailybeast.com/wife-of-james-ho-judge-on-mifepristone-case-was-paid-by-anti-abortion-group"
  },
  {
    "text": "UPDATING LIVE: Security Council passes resolution demanding ‘an immediate ceasefire’ during Ramadan  —  The UN Security Council on Monday passed a resolution demanding an immediate ceasefire for the month of Ramadan, the immediate and unconditional release of hostages and “the urgent need to expand the flow” of aid into Gaza.",
    "url": "https://news.un.org/en/story/2024/03/1147931"
  },
  {
    "text": "Live updates Hearing on new evidence in Trump N.Y. hush money case  —  New York Supreme Court Justice Juan Merchan began a hearing this morning about a late release of more than 100,000 pages of potential evidence in former president Donald Trump's trial over 2016 hush money payments.",
    "url": "https://www.washingtonpost.com/politics/2024/03/25/trump-new-york-hush-money-trial-hearing/"
  },
  {
    "text": "Judge sets Trump's hush money trial for April 15, rejecting further delay  —  NEW YORK — A New York judge scheduled former President Trump's hush money trial to begin April 15, enabling his first criminal trial to still take place this spring after a last-minute delay.",
    "url": "https://thehill.com/regulation/court-battles/4554214-judge-sets-trumps-hush-money-trial-for-april-15-rejecting-further-delay/"
  },
  {
    "text": "Florida Bans Social Media for Kids Under 14  —  Florida Governor Ron DeSantis signed a bill prohibiting minors under 14 from having social-media accounts, following similar efforts in other states that have been challenged in court.  —  The Florida law also requires parental permission … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-25/desantis-signs-ban-on-social-media-for-florida-kids-under-14"
  },
  {
    "text": "CEO Message to Employees  —  Boeing President and CEO Dave Calhoun shared the following message with all employees today:  —  Team,  —  As you all know, the Alaska Airlines Flight 1282 accident was a watershed moment for Boeing.  We must continue to respond to this accident with humility and complete transparency.",
    "url": "https://boeing.mediaroom.com/2024-03-25-CEO-Message-to-Employees"
  },
  {
    "text": "This Show Can't Go On ...  I reckon the end of my newspaper career as I'd known it ended on an ice-cold January day in 1995.  —  Back then, I was the sports editor of the Lewiston Sun-Journal in Central Maine.  It was the best job I ever had, even if there was absolutely no money in it.",
    "url": "https://dearlstephens.substack.com/p/this-show-cant-go-on"
  },
  {
    "text": "Forensic psychiatrist on physical signs of Trump's mental decline: “Changes in movement and gait”  —  “His walk appears wide-based,” Dr. Elizabeth Zoffman notes of Trump.  “He has developed a swing of his right leg.”  —  Donald Trump's obvious public challenges with speech, language, and thinking are continuing to get worse.",
    "url": "https://www.salon.com/2024/03/25/forensic-psychiatrist-on-physical-signs-of-mental-decline-changes-in-movement-and-gait/"
  },
  {
    "text": "Trump to Israel Hayom: Only a fool would have not acted like Israel on Oct. 7  —  In an exclusive interview, the 45th president blames Joe Biden for the war in Israel.  “He can't talk.  He's a very dumb person.  He's a dumb person.  His foreign policy throughout 50 years has been horrible.",
    "url": "https://www.israelhayom.com/2024/03/25/trump-to-israel-hayom-only-a-fool-would-have-not-acted-like-israel-on-oct-7/"
  },
  {
    "text": "Today Is the Day That 50 Years of Grifting Finally Comes to an End  —  Have you ever seen a millionaire begging for $5?  Me neither.  Yet I just watched Donald Trump in an internet video pleading for $5, or $10, or “even $25” from his supporters.  That's a pitch aimed at the people Trump says he loves … ",
    "url": "https://newrepublic.com/article/180078/trump-50-years-grifting-ends"
  },
  {
    "text": "Newly released transcripts reveal a MAGA betrayal: Donald Trump never cared about Ashli Babbitt  —  Trump now hypes her as a January 6 martyr, but when he was told of Babbitt's death, there was “no, like, reaction”  —  Nine people died as a result of the Jan. 6, 2021 insurrection that Republicans pretend was a “normal tourist visit.”",
    "url": "https://www.salon.com/2024/03/25/newly-released-transcripts-reveal-a-maga-betrayal-donald-never-cared-about-ashli-babbitt/"
  },
  {
    "text": "Measles outbreak 2024: CDC map and tracker shows cases have already surpassed all of 2023  —  It's not even the end of March yet, but measles cases in the United States have already surpassed the total number of measles cases in the country during all of 2023, according to new data released … ",
    "url": "https://www.fastcompany.com/91068408/measles-outbreak-2024-cdc-map-tracker-cases-states-spread-update"
  },
  {
    "text": "Trump calls on Republicans to take out DeSantis' lone Florida supporter in Congress  —  Rep. Laurel Lee previously served as the state's chief election officer — and refused demands to audit the 2020 election.  —  TALLAHASSEE, Florida — Former President Donald Trump wants a Republican … ",
    "url": "https://www.politico.com/news/2024/03/25/laurel-lee-trump-primary-desantis-00148789"
  }
]