[
  {
    "text": "Trump attorney says New York attorney general is ‘just not that bright’  —  Former President Trump's attorney Alina Habba went after New York Attorney General Letitia James on Monday, saying she's “just not that bright.”  —  James is leading the ongoing civil trial against Trump alleging … ",
    "url": "https://thehill.com/regulation/court-battles/4297060-alina-habba-hits-letitia-james-new-york-fraud-trial/"
  },
  {
    "text": "'He's a child' Trump is imploding because he thinks 'rules don't apply to him': biographer  —  Former President Donald Trump had a bad day on the witness stand at his civil fraud trial in New York, snapping at state attorneys and offering contradictory stories about his company's dubious property valuations … ",
    "url": "https://www.rawstory.com/trump-child-rules-dont-apply/"
  },
  {
    "text": "Axelrod on Biden: I didn't tell him to drop out  —  Still, the comments from the longtime Democratic operative is the latest element of friction between the Obama-Biden camps.  —  CHICAGO — Less than a day after he suggested that Joe Biden should consider dropping out of the 2024 race … ",
    "url": "https://www.politico.com/news/2023/11/07/david-axelrod-joe-biden-2024-campaign-comments-00125784"
  },
  {
    "text": "Biden's stumbles spark concerns about ad strategy and surrogate operation  —  The campaign says it's not revamping its approach amid stagnant polls and fear-filled Democrats.  —  In late August, Joe Biden's reelection campaign announced a massive ad buy to run on television and online in key battleground states.",
    "url": "https://www.politico.com/news/2023/11/07/internal-debates-in-biden-world-over-whether-to-go-harder-at-trump-00125705"
  },
  {
    "text": "Playbook: Four big Election Day questions  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  COACH BAGGAGE — Senate Republicans are set to discuss a possible resolution to Sen. TOMMY TUBERVILLE's blockade of military promotions this afternoon, and … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/11/07/four-big-election-day-questions-00125728"
  },
  {
    "text": "High court seems likely to allow gun bans for those under protective orders  —  The Supreme Court on Tuesday appeared inclined to uphold a federal statute that forbids people who are the subject of domestic-violence restraining orders from possessing firearms.",
    "url": "https://www.washingtonpost.com/politics/2023/11/07/supreme-court-guns-domestic-violence-rahimi/"
  },
  {
    "text": "Internal GOP Arizona Senate Poll Finds Lake Ahead in Three Way Race, Gallego Beating Lake Head To Head (Exclusive)  —  It's the second Republican internal poll that found Sen. Kyrsten Sinema trailing Rep. Ruben Gallego and Kari Lake  —  A new internal Republican poll shows that Independent … ",
    "url": "https://themessenger.com/politics/internal-gop-arizona-senate-poll-finds-lake-ahead-in-three-way-race-gallego-beating-lake-head-to-head-exclusive"
  },
  {
    "text": "Who are the five candidates that qualified for the third GOP debate  —  Five candidates will take the stage in the next GOP presidential primary debate, excluding former President Donald Trump who is voluntarily not attending but leading all candidates in the polls.",
    "url": "https://www.nbcnews.com/now/video/who-are-the-five-candidates-that-qualified-for-the-third-gop-debate-197303877548"
  },
  {
    "text": "Dems see a big upside to Johnson's conservative funding push  —  The new speaker has leaned into the right flank's spending crusade, giving House Democrats plenty of election messaging on cuts to education, Amtrak, LGBTQ policies and abortion rights.  —  House Democrats were already attacking … ",
    "url": "https://www.politico.com/news/2023/11/07/dems-upside-johnson-conservative-funding-push-00125486"
  },
  {
    "text": "Marjorie Taylor Greene Shows Congress How to Lose Friends and Not Influence People  —  Marjorie Taylor Greene's latest spat with her fellow Republican members is doing her no favors.  —  As House Republicans try to move past the rifts demonstrated during their three-week speakership quagmire … ",
    "url": "https://www.thedailybeast.com/marjorie-taylor-greene-shows-congress-how-to-lose-friends-and-not-influence-people"
  },
  {
    "text": "Jewish man, 69, dies after clash during dueling protests over Israel-Palestinian conflict in L.A. area  —  A 69-year-old man died after an altercation while two sides rallied over the Israel-Hamas conflict Sunday afternoon in Thousand Oaks.  —  The Ventura County Sheriff's Office identified … ",
    "url": "https://www.cbsnews.com/losangeles/news/69-year-old-jewish-man-killed-during-simultaneous-pro-israel-and-pro-palestinian-rallies/"
  },
  {
    "text": "Ted Cruz says he expects to run for president again, criticizes Democrats for pro-Palestine rhetoric  —  In an interview about his upcoming book “Unwoke: How to Defeat Cultural Marxism in America,” Cruz talks about 2024, antisemitism and “woke” politics.  —  WASHINGTON — U.S. Sen. Ted Cruz … ",
    "url": "https://www.texastribune.org/2023/11/07/ted-cruz-president-2024-woke-book/"
  },
  {
    "text": "Netanyahu to ABC's Muir: ‘No cease-fire’ without release of hostages  —  He spoke exclusively with “World News Tonight” anchor David Muir.  —  Israeli Prime Minister Benjamin Netanyahu speaks with ABC World News Tonight anchor David Muir, Nov. 6, 2023.  —  Israeli Prime Minister Benjamin Netanyahu … ",
    "url": "https://abcnews.go.com/Politics/netanyahu-abcs-muir-cease-fire-release-hostages/story?id=104661239"
  },
  {
    "text": "Democratic senator expresses worries about potential World War III  —  Sen. Tim Kaine (D-Va.) shared concerns Monday over the war between Israel and Hamas in Gaza, saying he's had to consider whether it could escalate into a global conflict amid rising tensions across the Middle East.",
    "url": "https://thehill.com/policy/defense/4297134-kaine-worries-world-war-iii-israel-hamas/"
  },
  {
    "text": "Woman arrested after driving car into Indianapolis building she thought was ‘Israel school’  —  The woman “told one officer she has been watching the news and couldn't breathe anymore.  She referenced her people back in Palestine,” according to a news release from the Indianapolis Metropolitan Police Department.",
    "url": "https://www.nbcnews.com/news/us-news/woman-arrested-driving-car-indianapolis-building-thought-was-israel-sc-rcna123974"
  },
  {
    "text": "Montana Democrat Jon Tester's First TV Spot Highlights His Roots in the State  —  He's reprising a theme that worked for him in 2018 as he gears up for his toughest race yet  —  Democratic Sen. Jon Tester, the last remaining statewide elected Democrat in Montana, is facing the toughest race of his career.",
    "url": "https://themessenger.com/politics/montana-democrat-jon-testers-first-tv-spot-highlights-his-roots-in-the-state"
  }
]