[
  {
    "text": "IRS making plans to rescind Harvard's tax-exempt status  —  The Internal Revenue Service is making plans to rescind the tax-exempt status of Harvard University, according to two sources familiar with the matter, which would be an extraordinary step of retaliation as the Trump administration seeks … ",
    "url": "https://cnn.com/2025/04/16/politics/irs-harvard-tax-exempt-status/"
  },
  {
    "text": "Trump administration asks IRS to revoke Harvard's tax-exempt status  —  The directive to the IRS is a significant escalation of President Trump's feud with Harvard University and other Ivy League institutions and other nonprofit groups his administration views as “woke.”",
    "url": "https://www.washingtonpost.com/business/2025/04/16/trump-harvard-tax-exempt-irs/"
  },
  {
    "text": "Trump administration plans to end the IRS Direct File program for free tax filing, AP sources say  —  The Trump administration plans to eliminate the IRS' Direct File program, an electronic system for filing tax returns directly to the agency for free, according to two people familiar with the decision.",
    "url": "https://apnews.com/article/irs-direct-file-tax-returns-free-trump-4bb0bca02fab9b3d06ae6f45ac67b7ab"
  },
  {
    "text": "Van Hollen speaks to press after meeting with El Salvador VP about return of Kilmar Abrego Garcia  —  Van Hollen speaks to press from El Salvador after meeting with El Salvador Vice President Félix Ulloa about return of wrongly deported Marylander Kilmar Abre...",
    "url": "https://www.youtube.com/live/pYZPzHyCtt0?si=D-7lJLKyE6SH_suO"
  },
  {
    "text": "El Salvador denies senator visit with mistakenly deported man: Van Hollen  —  The government of El Salvador denied a request from Sen. Chris Van Hollen (D-Md.) to see or speak to his Maryland constituent who was mistakenly deported there, the senator said during a visit to the country on Wednesday.",
    "url": "https://www.axios.com/2025/04/16/el-salvador-senator-mistakenly-deported-man"
  },
  {
    "text": "Maryland Sen. Van Hollen meets with El Salvador's vice president in push for Abrego Garcia's release  —  Maryland Sen. Chris Van Hollen traveled to El Salvador on Wednesday and met with the country's vice president to push for the release of Kilmar Abrego Garcia, a man who was sent … ",
    "url": "https://apnews.com/article/abrego-garcia-el-salvador-trump-deportation-van-hollen-senator-81cca0ac24a9a312be97c730679f8dd1"
  },
  {
    "text": "Judge: ‘Probable cause’ to hold U.S. in contempt over Alien Enemies Act deportations  —  Judge James Boasberg of the U.S. District Court in the District of Columbia ruled Wednesday that there is “probable cause” to find the Trump administration in criminal contempt of court after he said it violated … ",
    "url": "https://www.npr.org/2025/04/16/g-s1-60696/judge-probable-cause-to-hold-u-s-in-contempt-over-alien-enemies-act-deportations"
  },
  {
    "text": "We're About to Find Out What Mass Deportation Really Looks Like  —  This article was featured in the One Story to Read Today newsletter.  Sign up for it here.  —  The Trump administration is working hard to convince the public that its mass-deportation campaign is fully under way.",
    "url": "https://www.theatlantic.com/politics/archive/2025/04/ice-deportation-funding-increase/682480/?gift=guxsrl_dAdXUP9zqbQPWxQaHREZu2dHnmR9IBjIsyyU"
  },
  {
    "text": "Federal judge calls Trump's order targeting prominent law firm a ‘shocking abuse of power’  —  Trump, three months into his term, has moved swiftly to use the powers of the presidency in unprecedented ways to punish, weaken and silence his enemies, experts say.",
    "url": "https://www.nbcnews.com/politics/justice-department/federal-judge-calls-trumps-order-targeting-prominent-law-firm-shocking-rcna200961"
  },
  {
    "text": "Former Trump Official Targeted With Government Probe Vows to Fight  —  Chris Krebs, the top cybersecurity official in Trump's first term, resigned from his private-sector job  —  WASHINGTON—A former top Trump administration official targeted with a federal investigation by President Trump … ",
    "url": "https://www.wsj.com/politics/policy/chris-krebs-trump-cybersecurity-executive-action-31cb99cb"
  },
  {
    "text": "Internal budget document reveals extent of Trump's proposed health cuts  —  HHS would be asked to absorb a $40 billion cut, about one third of its discretionary budget.  —  Just now  —  The Trump administration is seeking to deeply slash budgets for federal health programs … ",
    "url": "https://www.washingtonpost.com/health/2025/04/16/hhs-budget-cut-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0Nzc2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2MTU4Mzk5LCJpYXQiOjE3NDQ3NzYwMDAsImp0aSI6ImMxYTdlZTA4LThhOGQtNDIwZi04MWEwLTkxMWRmZjJlMDlkOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9oZWFsdGgvMjAyNS8wNC8xNi9oaHMtYnVkZ2V0LWN1dC10cnVtcC8ifQ.JzD8TVkYSLk5F9wvq0DDPaiJQ8nawe8xWqXrO3egYMo&itid=gfta"
  },
  {
    "text": "US office that counters foreign disinformation is being eliminated  —  The only office within the US State Department that monitors foreign disinformation is to be eliminated, according to US Secretary of State Marco Rubio, confirming reporting by MIT Technology Review.",
    "url": "https://www.technologyreview.com/2025/04/16/1115256/us-office-that-counters-foreign-disinformation-is-being-eliminated-say-officials/"
  },
  {
    "text": "Astronomers Detect a Possible Signature of Life on a Distant Planet  —  Further studies are needed to determine whether K2-18b, which orbits a star 120 light-years away, is inhabited, or even habitable.  —  The search for life beyond Earth has led scientists to explore many suggestive mysteries … ",
    "url": "https://www.nytimes.com/2025/04/16/science/astronomy-exoplanets-habitable-k218b.html?unlocked_article_code=1.AE8.hY3f.UrVlChAv55KZ&smid=bs-share"
  },
  {
    "text": "Law Firms Made Deals With Trump.  Now He Wants More From Them.  —  To avoid retribution, big firms agreed to provide free legal services for uncontroversial causes.  To the White House, that could mean negotiating trade deals — or even defending the president and his allies.",
    "url": "https://www.nytimes.com/2025/04/16/us/politics/law-firms-deals-trump.html?unlocked_article_code=1.AE8.AlNm.2ztTDHVXyu4r&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump Is Sending People To The Camps  —  This is your TPM evening briefing.  —  Extraordinary times call for extraordinary and strong language.  President Trump's plan to have migrants — and potentially U.S. citizens — rounded up, flown to El Salvador, and confined there in a maximum security facility … ",
    "url": "https://talkingpointsmemo.com/where-things-stand/trump-is-sending-people-to-the-camps"
  },
  {
    "text": "Third top Pentagon official suspended in leak investigation  —  Colin Carroll, chief of staff to Deputy Defense Secretary Stephen Feinberg, was suspended a day after two other political appointees were placed on leave.  —  The Pentagon put a third top official on administrative leave Wednesday … ",
    "url": "https://www.politico.com/news/2025/04/16/pentagon-official-suspended-leak-investigation-00293473"
  },
  {
    "text": "Women, minorities fired in purge of NIH science review boards  —  Scientists, with expertise in fields that include mental health, cancer and infectious disease, typically serve five-year terms and were not given a reason for their dismissal.  —  Thirty-eight of 43 experts cut last month … ",
    "url": "https://www.washingtonpost.com/science/2025/04/16/women-and-minorities-fired-nih-board-science/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0Nzc2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2MTU4Mzk5LCJpYXQiOjE3NDQ3NzYwMDAsImp0aSI6Ijg3MTYzODg4LTA0MWQtNGVmNy04YTM1LTE3YzY0MGUxYWQwMCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9zY2llbmNlLzIwMjUvMDQvMTYvd29tZW4tYW5kLW1pbm9yaXRpZXMtZmlyZWQtbmloLWJvYXJkLXNjaWVuY2UvIn0.9ucXECyhbCx32K2kYw1qkvY7QjphfAtWIUEJI0leolc&itid=gfta"
  },
  {
    "text": "Powell Warns of ‘Challenging Scenario’ for Fed as Trade War Rages  —  Sees strong likelihood that consumers face higher prices while unemployment rises because of tariff increases  —  Federal Reserve Chair Jerome Powell warned that the central bank could have less flexibility to quickly cushion … ",
    "url": "https://www.wsj.com/economy/central-banking/powell-warns-of-challenging-scenario-for-fed-in-cushioning-trade-war-fallout-81d17965?st=sV3qBq&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump Waved Off Israeli Strike After Divisions Emerged in His Administration  —  Israel developed plans for attacking Iranian nuclear facilities that would have required U.S. assistance.  But some administration officials had doubts.  —  Israel had planned to strike Iranian nuclear sites … ",
    "url": "https://www.nytimes.com/2025/04/16/us/politics/trump-israel-iran-nuclear.html?unlocked_article_code=1.AE8.0M47.DXSxBMHg1wVm&smid=url-share"
  },
  {
    "text": "Inside the Mind of an ICE Agent  —  Is this what she signed up for?  —  ∙ Paid  —  Quick update: Yesterday it was reported Cory Booker is joining Chris Van Hollen in going to El Salvador.  John Lewis would be proud.  This is good trouble; necessary trouble.  —  1. Choices",
    "url": "https://www.thebulwark.com/p/inside-the-mind-of-an-ice-agent"
  },
  {
    "text": "DOGE Cuts Pull AmeriCorps Volunteers Off of Disaster Relief Jobs  —  Workers for the National Civilian Community Corps were sent home due to “new operational parameters.”  The program's long-term fate is unclear.  —  AmeriCorps, the US federal agency that oversees volunteerism and service work … ",
    "url": "https://www.wired.com/story/doge-cuts-americorps-volunteers-disaster-relief-jobs/"
  },
  {
    "text": "FL Governor's Former Spokesman Accused Of Exposing Himself 4 Times  —  Frederick Piccolo Jr., a former Ron DeSantis spokesman, faces charges in Sarasota and Manatee counties for exposing himself, records show.  —  SARASOTA-BRADENTON, FL — A New College of Florida official and former spokesperson … ",
    "url": "https://patch.com/florida/bradenton/former-desantis-spokesperson-exposed-himself-multiple-times-report"
  },
  {
    "text": "CDC autism report disputes RFK Jr's claims about why the condition is on the rise  —  Experts attribute increase in case numbers to improved diagnostics as Health Secretary Robert F Kennedy Jr insists ‘epidemic’ underway  —  The number of U.S. children diagnosed with autism continues to rise … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/autism-cdc-robert-f-kennedy-jr-b2734181.html"
  },
  {
    "text": "The Contempt of a Fascist Regime  —  America is officially in a massive constitutional crisis as the Trump Administration defies court orders demanding the return of immigrants who were kidnapped and deported without due process.  —  THE LEFT HOOK with Wajahat Ali and Norman Ornstein  —  Transcript",
    "url": "https://thelefthook.substack.com/p/the-contempt-of-a-fascist-regime"
  },
  {
    "text": "Pa. Gov. Shapiro was targeted for ‘what he wants to do to Palestinian people’: warrant  —  The suspect in the arson attack at the Governor's Residence targeted Josh Shapiro due to his perceived stance on Palestine, according to a search warrant obtained by PennLive.",
    "url": "https://www.pennlive.com/crime/2025/04/arson-suspect-targeted-pa-gov-shapiro-for-what-he-wants-to-do-to-palestinian-people-search-warrant.html&subscribed=auth0%7C67ff83c45c04df3168b5ed8b"
  },
  {
    "text": "Pennsylvania Gov. Josh Shapiro says he hasn't heard from Trump since the arson attack  —  After the assassination attempt on Trump in Butler, Pa., last summer, Shapiro quickly condemned the violence and worked with the Trump campaign on the investigation.  —  After a man tried … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/gov-josh-shapiro-trump-arson-attack-rcna200907"
  },
  {
    "text": "DOGE assigns staffers to work at agency where it allegedly removed sensitive data  —  The ad hoc Department of Government Efficiency team is assigning two staffers to work at the independent agency where a whistleblower alleged Tuesday DOGE may have already removed sensitive labor data from its systems.",
    "url": "https://www.npr.org/2025/04/16/nx-s1-5366851/doge-nlrb-whistleblower-musk-data"
  },
  {
    "text": "NSF halts grant awards while staff do second review  —  Action comes after DOGE team arrives at science agency  —  Skip backwardsGo ten seconds backward Skip forwardsGo ten seconds forward  —  Audio is AI-generated.  Report an issue|  Give feedback  —  The National Science Foundation … ",
    "url": "https://www.science.org/content/article/nsf-halts-grant-awards-while-staff-do-second-review"
  },
  {
    "text": "'I'm in ruins' |  MyPillow CEO Mike Lindell says he can't pay thousands in court-ordered sanctions in election defamation case  —  Voting systems company Smartmatic says Lindell should be held in civil contempt for failing to pay more than $50,000 over a frivilous counterclaim.",
    "url": "https://www.wusa9.com/article/news/legal/im-in-ruins-mypillow-ceo-mike-lindell-says-he-cant-pay-thousands-in-court-ordered-sanctions-in-election-defamation-case-dominion-smartmatic-trump/65-9de95723-81f3-40f0-8a8a-9ba2592daaeb"
  },
  {
    "text": "Trump exploiting antisemitism fears to undermine rule of law, warns Jewish coalition  —  A coalition of Jewish groups warns that the Trump administration is making Jews less safe by targeting international students who protested Israel's war in Gaza and the universities where they study.",
    "url": "https://www.npr.org/2025/04/16/nx-s1-5365980/trump-antisemitism-jewish-coalition"
  },
  {
    "text": "GOP Rep Says Arson On Shapiro's House Should Make Him ‘Tone It Down’ On Trump  —  He also compared the attack during Passover to anti-Tesla vandalism.  —  Republican Rep. Dan Meuser (Penn.) suggested that Pennsylvania Gov. Josh Shapiro was asking for it when an attacker burned down part … ",
    "url": "https://www.huffpost.com/entry/josh-shapiro-dan-meuser-arson_n_67fff3d1e4b0485a7732ab8a"
  },
  {
    "text": "Manufacturing jobs are never coming back  —  “Jobs and factories will come roaring back into our country,” President Donald Trump promised on “Liberation Day,” as he announced tariffs that have shocked global markets and set the country on course for a recession.  “We will supercharge our domestic industrial base.",
    "url": "https://www.vox.com/future-perfect/408949/manufacturing-jobs-tariffs-trump-trade-automation"
  },
  {
    "text": "A Columbia Activist Sought Middle Ground on Gaza.  The U.S. Detained Him.  —  Mohsen Mahdawi was arrested at a citizenship interview in Vermont.  He had spent a decade trying to understand the conflict that shaped his life, his supporters say.  —  As Columbia University's student protest … ",
    "url": "https://www.nytimes.com/2025/04/16/nyregion/columbia-activist-mahdawi-ice-palestinian.html"
  }
]