[
  {
    "text": "Gabbard fires intel officials who oversaw memo contradicting White House claims on Venezuelan gang  —  Democratic lawmakers criticized the firings, suggesting they were punishment for providing information that didn't support the administration's agenda.  —  Director of National Intelligence … ",
    "url": "https://www.nbcnews.com/politics/national-security/gabbard-fires-intel-officials-oversaw-memo-contradicting-white-house-c-rcna206918"
  },
  {
    "text": "Gabbard fires leaders of intelligence group that wrote Venezuela assessment  —  The director of national intelligence fired top officials weeks after their group authored an assessment contradicting President Donald Trump's legal rationale for deporting alleged Venezuelan gang members.",
    "url": "https://www.washingtonpost.com/national-security/2025/05/14/gabbard-intelligence-venezuela-tren-de-aragua/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ3MTk1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4NTc3NTk5LCJpYXQiOjE3NDcxOTUyMDAsImp0aSI6IjRlZjM3ZGUxLWVlZTktNDljZS04Y2I4LWRkYjY1ODhmNzgxZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA1LzE0L2dhYmJhcmQtaW50ZWxsaWdlbmNlLXZlbmV6dWVsYS10cmVuLWRlLWFyYWd1YS8ifQ.dhXbaQl0xEEhpOQNANxiWBUjscBSDUlXCxRWgGB6xHc&itid=gfta"
  },
  {
    "text": "House Agriculture Committee approves $300 billion in nutrition spending cuts  —  The House Agriculture Committee voted 29-25 along party lines to advance legislation that would cut as much as $300 billion in food aid spending to pay for Republicans' domestic policy megabill and some farm bill programs.",
    "url": "https://www.politico.com/live-updates/2025/05/14/congress/house-agriculture-committee-approves-300-billion-in-nutrition-spending-cuts-00350900"
  },
  {
    "text": "U.S. Charges Russian Scientist with Smuggling  —  A government lawyer told a federal judge on Wednesday that the intention is to deport Kseniia Petrova, a Harvard researcher, to Russia.  —  The Trump administration announced criminal smuggling charges on Wednesday against Kseniia Petrova … ",
    "url": "https://www.nytimes.com/2025/05/14/health/detained-russian-scientist-harvard.html?unlocked_article_code=1.HE8.eykt.Pn7-0lBqTsl3&smid=nytcore-android-share"
  },
  {
    "text": "Russian National Charged with Smuggling Biological Material Into Boston  —  For Immediate Release  —  U.S. Attorney's Office, District of Massachusetts  —  BOSTON - A Russian national has been arrested and charged for allegedly attempting to smuggle clawed frog embryos and embryonic samples into the United States.",
    "url": "https://www.justice.gov/usao-ma/pr/russian-national-charged-smuggling-biological-material-boston"
  },
  {
    "text": "Democrats rattled again by fresh claims that Biden aides hid his frailty  —  A new book and Biden's public appearances are potential distractions as the party seeks to focus on Trump.  —  A growing number of Democrats are publicly second-guessing their party's handling of the last election … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/14/biden-democrats-age-mental-health-book/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ3MTk1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4NTc3NTk5LCJpYXQiOjE3NDcxOTUyMDAsImp0aSI6Ijc3NjQ4MjI2LTgyOGMtNGQxMi04NDUzLWNmZTc4MWZlZGZjOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA1LzE0L2JpZGVuLWRlbW9jcmF0cy1hZ2UtbWVudGFsLWhlYWx0aC1ib29rLyJ9.Kku3CtC6KCXiDEB6hfgQAil2j1Oj-4j2oFWij8Ox6sY&itid=gfta"
  },
  {
    "text": "U.S. AG Pam Bondi Sold More than $1 Million in Trump Media Stock the Day Trump Announced Sweeping Tariffs  —  Attorney General Pam Bondi sold between $1 million and $5 million worth of shares of Trump Media the same day that President Donald Trump unveiled bruising new tariffs that caused … ",
    "url": "https://www.propublica.org/article/pam-bondi-trump-media-stock-tariffs"
  },
  {
    "text": "At Supreme Court, a Once-Fringe Birthright Citizenship Theory Takes the Spotlight  —  Before the Trump presidency, there was broad consensus that the 14th Amendment established birthright citizenship for children born in the United States.  —  Shortly after the Supreme Court announced … ",
    "url": "https://www.nytimes.com/2025/05/14/us/politics/supreme-court-birthright-citizenship.html?unlocked_article_code=1.HE8.Q410.yK0QeKrZnUKh&smid=url-share"
  },
  {
    "text": "Trump-Kushner Hotel Project in Serbia Hits a Snag: Alleged Forgery  —  Serbian authorities say an official admitted to forging a document allowing a protected site in Belgrade to be demolished and replaced with a Trump hotel.  —  The Trump family's $500 million luxury hotel project in Serbia … ",
    "url": "https://www.nytimes.com/2025/05/14/us/politics/trump-kushner-hotel-serbia.html?unlocked_article_code=1.HU8.0hDF.llqKSv_aGL-y"
  },
  {
    "text": "Inside Harvard's Discrimination Machine  —  The university has adopted race-conscious hiring policies, potentially in violation of civil rights law.  —  / Eye on the News / Education, Politics and Law  —  The Trump administration has escalated its battle with Harvard University … ",
    "url": "https://www.city-journal.org/article/harvard-university-discrimination-dei-hiring-trump"
  },
  {
    "text": "El Chapo's family members cross US border in apparent deal with Trump administration  —  Ex-wife of imprisoned kingpin El Chapo among 17 family members entering through San Diego border crossing  —  Join Fox News for access to this content  —  Mexican officials said Wednesday … ",
    "url": "https://www.foxnews.com/politics/el-chapos-family-members-cross-us-border-apparent-deal-trump-administration"
  },
  {
    "text": "Ben & Jerry's co-founder arrested protesting Senate hearing: ‘RFK kills people with hate’  —  Ben Cohen was among seven arrested after they disrupted the hearing, Capitol Police say  —  Ben Cohen, one of the co-founders of the ice cream company Ben & Jerry's, was arrested … ",
    "url": "https://www.foxnews.com/politics/ben-jerrys-co-founder-arrested-protesting-senate-hearing-rfk-kills-people-hate"
  },
  {
    "text": "Trump (Partially) Wins an Alien Enemies Act Case  —  For the last few weeks, there has been ongoing litigation over President Trump's effort to use the Alien Enemies Act of 1798 as a tool for mass deportation.  The AEA allows detention and deportation of foreign citizens of relevant states … ",
    "url": "https://reason.com/volokh/2025/05/14/trump-partially-wins-an-alien-enemies-act-case/"
  },
  {
    "text": "The Road to Trump's Embrace of White South Africans  —  The Trump administration's hostile approach to South Africa was shaped by a convergence of factors.  —  White South Africans at a rally outside the United States Embassy in Pretoria in February.Joao Silva/The New York Times",
    "url": "https://www.nytimes.com/2025/05/14/us/politics/trump-south-africa-afrikaners.html"
  },
  {
    "text": "Thanedar opts against forcing impeachment vote amid backlash  —  Michigan Rep. Shri Thanedar chose not to follow through on a threat to force a House vote on impeaching President Donald Trump Wednesday amid mounting pressure from fellow Democrats.  Thanedar did not call up his resolution … ",
    "url": "https://www.politico.com/live-updates/2025/05/14/congress/thanedar-pulls-impeachment-vote-00350361"
  },
  {
    "text": "Trump's sanctions on ICC prosecutor have halted tribunal's work  —  The International Criminal Court's chief prosecutor has lost access to his email, and his bank accounts have been frozen.  The Hague-based court's American staffers have been told that if they travel to the U.S. they risk arrest.",
    "url": "https://apnews.com/article/icc-trump-sanctions-karim-khan-court-a4b4c02751ab84c09718b1b95cbd5db3"
  },
  {
    "text": "Top Iranian official says Tehran would forgo highly enriched uranium in nuclear deal with Trump  —  The comments from a member of the supreme leader's inner circle appear to be the clearest public statements yet on Iran's willingness to reach an agreement with the U.S.",
    "url": "https://www.nbcnews.com/news/us-news/iran-enriched-uranium-nuclear-deal-trump-rcna206833"
  },
  {
    "text": "Day One and Thereafter  —  I was born in the house my father built.  No, no—just kidding.  That was Nixon.  (You recall that our 37th president begins his memoirs that way: “I was born in the house my father built.”  It is a great opening line—vaguely haunting or hypnotic, even.)",
    "url": "https://jaynordlinger.substack.com/p/day-one-and-thereafter"
  },
  {
    "text": "Colorado prosecutor offers unlicensed and undocumented teen probation after deadly crash  —  The Arapahoe District Attorney's Office is defending its decision to give probation and community service to a teenager who was driving illegally and, in the country illegally, when he killed a woman.",
    "url": "https://www.cbsnews.com/colorado/news/colorado-prosecutor-offers-unlicensed-undocumented-teen-probation-deadly-crash/"
  },
  {
    "text": "After Layoffs, Social Security Asks Remaining Employees To Work 10% Harder  —  Social Security faces a growing backlog of retirement claims that agency officials hope their remaining workers can clear with a little encouragement.  —  WASHINGTON — The Social Security Administration … ",
    "url": "https://www.huffpost.com/entry/social-security-claims-backlog_n_6824fca8e4b07f898ef48307"
  },
  {
    "text": "Uber to introduce fixed-route shuttles in major US cities designed for commuters  —  Ride-hail and delivery giant Uber is introducing cheap, fixed-route rides along busy corridors during weekday commute hours in major U.S. cities - one solution to a world that feels, for most people, more expensive everyday.",
    "url": "https://techcrunch.com/2025/05/14/uber-to-introduce-fixed-route-shuttles-in-major-us-cities-other-ways-to-save/"
  },
  {
    "text": "Bruce Springsteen Calls Trump Administration ‘Corrupt, Incompetent, and Treasonous’  —  After some initial reluctance, Bruce Springsteen has increasingly sounded off about the presidential administrations of Donald J. Trump.  —  Asked during a cover-story interview with Variety in 2017 … ",
    "url": "https://variety.com/2025/music/news/bruce-springsteen-calls-trump-corrupt-incompetent-treasonous-1236398433/"
  },
  {
    "text": "Drug Overdose Deaths Plummeted in 2024, C.D.C. Reports  —  The progress comes as the Trump administration is proposing to cut funding for many programs believed to have contributed to the improvement.  —  Overdose deaths in the United States fell by nearly 30,000 last year … ",
    "url": "https://www.nytimes.com/2025/05/14/health/overdose-deaths-fentanyl.html"
  },
  {
    "text": "NOAA scrambles to fill forecasting jobs as hurricane season looms  —  The agency acknowledged “urgent action is needed to sustain mission-critical operations,” as peak severe weather and hurricane season approach.  —  Some National Weather Service forecasting teams are so critically understaffed … ",
    "url": "https://www.washingtonpost.com/weather/2025/05/14/national-weather-service-vacancies-hurricane-season/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ3MTk1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4NTc3NTk5LCJpYXQiOjE3NDcxOTUyMDAsImp0aSI6IjQzNjAyYjEwLTliZDMtNDZlNi1iMDVjLWQyOWRkMjY2MDcxZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93ZWF0aGVyLzIwMjUvMDUvMTQvbmF0aW9uYWwtd2VhdGhlci1zZXJ2aWNlLXZhY2FuY2llcy1odXJyaWNhbmUtc2Vhc29uLyJ9.GsCPkvCm_1M_9gGAJtJFq7WSd83JyBU4qars8wKkxxQ&itid=gfta"
  },
  {
    "text": "Murphy says ‘no doubt’ Biden suffered cognitive decline while in office  —  Few elected Democrats have so far been as direct in their criticism of the former president.  —  Democratic Sen. Chris Murphy said there's “no doubt” that former President Joe Biden suffered cognitive decline in office … ",
    "url": "https://www.politico.com/news/2025/05/14/murphy-biden-cognitive-decline-2028-00349025"
  },
  {
    "text": "Having risked my life in war zones for the BBC, I know this: cuts to the World Service will be disastrous  —  In an age of disinformation, our broadcaster is trusted to find and tell the truth.  Now more than ever we need it  —  In a short space of time, the British government … ",
    "url": "https://www.theguardian.com/commentisfree/2025/may/14/bbc-world-service-cuts-risked-my-life-martin-bell"
  },
  {
    "text": "Montana judge strikes down law banning gender-affirming care for minors  —  A Montana court has struck down a 2023 state law banning gender-affirming medical care for transgender minors, finding the measure's prohibitions unlawful and in conflict with the state's constitution.",
    "url": "https://thehill.com/homenews/lgbtq/5300455-montana-judge-transgender-youth-gender-affirming-care/"
  },
  {
    "text": "Missouri lawmakers approve referendum to repeal abortion-rights amendment  —  Six months after Missouri voters approved an abortion-rights amendment, Republican state lawmakers on Wednesday approved a new referendum that would seek the amendment's repeal and instead ban most abortions with exceptions for rape an incest.",
    "url": "https://apnews.com/article/abortion-rights-ban-missouri-sick-leave-c4f7beb07e7b3de64f3e2460bcb539c0"
  },
  {
    "text": "An Afrikaner Refugee Has Thoughts About the Jews  —  It's a Very Special Triad today, cowritten with my buddy Will Sommer, author of our False Flag newsletter.  —JVL  —  1. White Genocide?  —  Quick catchup: This week the State Department sent an official to Dulles International Airport … ",
    "url": "https://www.thebulwark.com/p/an-afrikaner-refugee-south-africa-has-thoughts-about-jews-antisemitism-trump"
  }
]