[
  {
    "text": "2024 Race: Trump vs. Harris Too Close To Call, Trump Slightly Ahead In 6-Way Race, Quinnipiac University National Poll Finds; 62% Say Biden Dropping Out Of Race Right Thing To Do  —  mail_outline  —  One day after President Joe Biden dropped out of the 2024 presidential race … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3901"
  },
  {
    "text": "Top Dems threatened to forcibly remove Biden from office unless he dropped out, set him up to fail at Trump debate: Sources  —  Operatives at the very highest levels of the Democratic Party threatened Joe Biden with forcibly removing him from office unless he stepped down, sources told The Post.",
    "url": "https://nypost.com/2024/07/22/us-news/top-dems-threatened-to-remove-biden-unless-he-resigned/"
  },
  {
    "text": "Exclusive: Beyoncé gives Kamala Harris permission to use her song ‘Freedom’ for her presidential campaign  —  Vice President Kamala Harris made a big entrance during her first official visit to her campaign headquarters on Monday evening, walking out to Beyoncé's song “Freedom.”",
    "url": "https://www.cnn.com/2024/07/22/entertainment/beyonce-freedom-harris-campaign/"
  },
  {
    "text": "Harris Is Uniting and Energizing Democratic Voters — and Polling Better Against Trump  —  65% of Democrats support Harris replacing Biden atop the ticket, where she's more competitive against Trump",
    "url": "https://pro.morningconsult.com/analysis/kamala-harris-biden-campaign-polling"
  },
  {
    "text": "Trump's New Rival May Bring Out His Harshest Instincts  —  After years planning to face President Biden, Donald J. Trump and his team will be campaigning against Kamala Harris.  He has attacked female rivals and critics in brutal and personal terms.  —  Donald J. Trump and his political team spent nearly … ",
    "url": "https://www.nytimes.com/2024/07/23/us/politics/trump-harris-attack-lines.html"
  },
  {
    "text": "Kamala Harris is breaking Republican brains  —  MAGA lacks issues against her, so it brings up the silly and the slimy  —  The MAGA crowd doesn't like Kamala Harris because she's a strong Democratic woman and candidate of African and Asian descent.  —  Those aren't good or valid reasons to oppose her, of course.",
    "url": "https://www.stopthepresses.news/p/kamala-harris-is-breaking-republican"
  },
  {
    "text": "7/23/24 ☀️ AM:  —  GOP struggles to find its Harris message  —  Vulnerable Dems see chance for ‘reset’ with Biden out  —  Inside Johnson's assassination commission  —  GOP struggles to find its Harris message … House Republicans just got the rug pulled out from under them.",
    "url": "https://punchbowl.news/archive/72324-am/"
  },
  {
    "text": "Progressive youth voting group endorses Harris  —  The progressive youth voting group NextGen PAC is backing Vice President Kamala Harris for 2024 after President Biden made the unprecedented move to bow out of the running, giving her bid a boost with the critical bloc.",
    "url": "https://thehill.com/homenews/campaign/4787004-nextgen-pac-vice-president-kamala-harris-2024/"
  },
  {
    "text": "Biden cancels nine trips, extends Delaware stay after dropping out of 2024 race  —  President Biden has canceled nine trips that were scheduled for the next two weeks after suddenly dropping out of the 2024 race, The Post can reveal.  —  Biden was scheduled to leave Monday for the West Coast … ",
    "url": "https://nypost.com/2024/07/22/us-news/biden-cancels-nine-trips-extends-delaware-stay-after-dropping-out/"
  },
  {
    "text": "What Harris needs to do, now, to win  —  The vice president ought to explain where and why she differs from the president.  —  By the Editorial Board  —  With President Biden's exit from the race, Democrats are quickly coalescing around Vice President Harris.",
    "url": "https://www.washingtonpost.com/opinions/2024/07/22/kamala-harris-dnc-biden-differences/"
  },
  {
    "text": "Trump-Lover Elon Musk Is Already Causing Kamala Harris Problems … Following Kamala Harris's announcement that she is running for president, users on Elon's Musk X (formerly known as Twitter) found themselves banned from following the vice president's political campaign account.",
    "url": "https://newrepublic.com/post/184097/trump-elon-musk-causing-kamala-harris-problems"
  },
  {
    "text": "Harris into the whirlwind  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  Forty-eight hours ago, VP KAMALA HARRIS was focused on preparing for an upcoming debate with the Republican who wants her job.  This morning, she wakes up with enough delegate commitments … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/23/harris-into-the-whirlwind-00170544"
  },
  {
    "text": "Top Sinclair anchor resigned over concerns about biased and inaccurate content  —  Eugene Ramirez, the lead anchor of Sinclair's national evening news broadcast, resigned in January over concerns about the accuracy and right-wing bias of the content he was required to present on air, three sources told Popular Information.",
    "url": "https://popular.info/p/top-sinclair-anchor-resigned-over"
  },
  {
    "text": "JD Vance repeatedly indicated in 2016 that he believed Donald Trump had committed sexual assault  —  Ohio Sen. JD Vance, the Republican vice presidential nominee, repeatedly indicated in 2016 that he believed Donald Trump had committed sexual assault, even suggesting in one TV segment that in a … ",
    "url": "https://www.cnn.com/2024/07/23/politics/kfile-jd-vance-believed-donald-trump-sexual-assault-allegations-2016/"
  },
  {
    "text": "Exclusive: President Biden suffered an undisclosed medical emergency during his time in Las Vegas, police sources say  —  When President Joe Biden began his campaign trip in Las Vegas last week, everything seemed to be running as smoothly as it could for an 81-year-old president in physical and cognitive decline.",
    "url": "https://www.dossier.today/p/exclusive-president-biden-suffered"
  },
  {
    "text": "Mastercard, JPMorgan Get FTC Inquiry Over ‘Surveillance Pricing’  — Agency querying firms that offer pricing software to companies  — Companies more often setting individualized prices on products … The US Federal Trade Commission said it sent subpoenas to eight firms seeking information … ",
    "url": "https://www.bloomberg.com/news/articles/2024-07-23/ftc-opens-inquiry-into-mastercard-chase-over-surveillance-pricing"
  },
  {
    "text": "The Curious Case of the Missing President  —  This piece was first published in our news digest, The Front Page.  To get our latest scoops, investigations, and columns in your inbox every morning, Monday through Thursday, become a Free Press subscriber today:  —  Subscribe now",
    "url": "https://www.thefp.com/p/where-is-the-president-oliver-wiseman"
  }
]