[
  {
    "text": "Trump says he'd ‘fire’ special counsel Jack Smith in ‘two seconds’ if elected again  —  Smith has led the Justice Department's investigations into Donald Trump's efforts to overturn the 2020 presidential election and the hoarding of classified documents.  —  Former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/elections/2024/10/24/trump-fire-jack-smith/"
  },
  {
    "text": "Marist North Carolina Poll: U.S. Presidential Contest in North Carolina, October 2024  —  Trump +2 Points in North Carolina  —  Two points separate former President Donald Trump and Vice President Kamala Harris among North Carolina likely voters including those who are undecided yet leaning toward a candidate.",
    "url": "https://maristpoll.marist.edu/polls/marist-north-carolina-poll-u-s-presidential-contest-in-north-carolina-october-2024/"
  },
  {
    "text": "Waukesha mayor endorses Kamala Harris; red city mayor plans to vote blue  —  WAUKESHA, Wis. - The mayor of Waukesha, a key Republican stronghold, exclusively told FOX6 News he's voting for Democrat Kamala Harris for president.  —  It's a Republican city in Wisconsin's largest Republican county.",
    "url": "https://www.fox6now.com/news/waukesha-mayor-endorses-kamala-harris"
  },
  {
    "text": "NEW WSJ POLL: TRUMP TAKES LEAD NATIONALLY  —  Former President Donald Trump has taken a narrow lead over Vice President Kamala Harris with less than two weeks until election day, according to a Wall Street Journal poll published Thursday. … The two percentage points are within the poll's margin of error.",
    "url": "https://dailycaller.com/2024/10/24/wsj-wall-street-journal-poll-donald-trump-leads-kamala-harris-october/"
  },
  {
    "text": "Fox News edited Trump's rambling answers and false claims in barbershop interview, full video shows  —  New York CNN  —  The Fox News Channel's recent segment about Donald Trump's “surprise” visit to a barbershop in the Bronx resembled a campaign ad for the former president's reelection.",
    "url": "https://www.cnn.com/2024/10/24/media/fox-news-edit-trump-barbershop-interview/"
  },
  {
    "text": "What's Preventing Harris From Crushing Trump Is Shockingly Simple  —  As Elon Musk's rabid pro-Trump mania makes clear, billionaires are wielding their financial might in this year's presidential election far more than in any previous campaign—and far more openly, too.",
    "url": "https://slate.com/news-and-politics/2024/10/trump-kamala-harris-election-elon-musk-gates-polls-2024.html"
  },
  {
    "text": "Musk's super PAC skips daily $1 million swing state giveaway after DOJ warning … - The SpaceX CEO had pledged to give away $1 million every day to registered voters in swing states who sign the super PAC's petition in favor of the First and Second Amendments.",
    "url": "https://www.axios.com/2024/10/24/elon-musk-million-dollar-giveaway-doj-warning"
  },
  {
    "text": "Trump's Depravity Will Not Cost Him This Election  —  Many Americans know exactly who Trump is, and they like it.  —  Yesterday, The Atlantic published another astonishing story by editor in chief Jeffrey Goldberg about Trump's hatred of the military.  The reporting included, among other things … ",
    "url": "https://www.theatlantic.com/newsletters/archive/2024/10/trumps-depravity-will-not-cost-him-this-election/680352/"
  },
  {
    "text": "Washington Post staffers suspect owner Jeff Bezos holding up Kamala Harris endorsement: report  —  Washington Post staffers are growing restless over the left-leaning paper's silence on endorsing Vice President Kamala Harris for president — with many suspecting that owner Jeff Bezos is behind the delay, according to a report.",
    "url": "https://nypost.com/2024/10/24/media/washington-post-staffers-suspect-jeff-bezos-holding-up-harris-endorsement/"
  },
  {
    "text": "There Are Four Anti-Trump Pathways We Failed to Take.  There Is a Fifth.  —  Democratic self-rule contains a paradox.  It is a system premised on openness and competition.  Any ambitious party or politician should have a shot at running for office and winning.  But what if a major candidate seeks to dismantle that very system?",
    "url": "https://www.nytimes.com/2024/10/24/opinion/democracy-defense-us-authoritarian.html?unlocked_article_code=1.Uk4.fPjE.y_WhudBhUHpo&smid=url-share"
  },
  {
    "text": "Donald Trump groped me in what felt like a ‘twisted game’ with Jeffrey Epstein, former model alleges  —  Stacey Williams says the ex-president, whose spokesperson denied the allegations, touched her in an unwanted sexual way in 1993, after Epstein introduced them",
    "url": "https://www.theguardian.com/us-news/2024/oct/23/donald-trump-accuser-stacey-williams-jeffrey-epstein"
  },
  {
    "text": "Franklin & Marshall Poll Release: October 2024  —  I'm writing to share our summary report for the October 2024 Franklin & Marshall College Poll.  I've highlighted a few of the key findings below, but I encourage you to read the full report, which is also included.",
    "url": "https://www.fandmpoll.org/franklin-marshall-poll-release-october-2024/"
  },
  {
    "text": "'There's People That Are Absolutely Ready to Take on a Civil War'  —  Tucker Carlson's eyes narrowed as he conjured the image.  A Donald Trump victory, he said at a campaign event in Gwinnett County, Georgia, last night, “will be a middle finger wagging in the face of the worst people in the English-speaking world.”",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/trump-duluth-georgia-rally/680354/"
  },
  {
    "text": "Kamala Harris' husband Doug Emhoff slapped me in the face so hard I spun around ... I'm disgusted by his fake ‘perfect spouse’ persona  — Second Gentleman's accuser bravely breaks her silence on ‘slap’  —  Doug Emhoff's ex-girlfriend has spoken exclusively to DailyMail.com claiming … ",
    "url": "https://www.dailymail.co.uk/news/article-13981101/doug-emhoff-ex-girlfriend-slap-flirt-allegations-kamala-harris.html"
  },
  {
    "text": "What Is Usha Vance Thinking?  —  The veep candidate's wife is the child of immigrants, a former Democrat, a highly skilled lawyer — and a total mystery.  —  In the fall of 2018, during the convulsive, unformed days after Christine Blasey Ford went public to accuse Brett Kavanaugh of sexual assault … ",
    "url": "https://www.thecut.com/article/usha-vance-trump-jd-vance-interview.html"
  },
  {
    "text": "McConnell says ‘MAGA movement is completely wrong’ and Reagan 'wouldn't recognize' Trump's GOP  —  Senate Minority Leader Mitch McConnell delivered a scathing assessment of the modern Republican Party in an upcoming biography, saying the “MAGA movement is completely wrong” and that Ronald Reagan “wouldn't recognize” the party today.",
    "url": "https://www.cnn.com/2024/10/23/politics/mcconnell-trump-gop-new-book"
  },
  {
    "text": "Election-Betting Site Polymarket Says Trump Whale Identified as French Trader  — User hasn't attempted to manipulate the market, probe shows  — Betting platform shows higher chance of Trump win than rivals  —  A trader who spent more than $45 million on Polymarket bets that Donald Trump … ",
    "url": "https://www.bloomberg.com/news/articles/2024-10-24/polymarket-says-trump-whale-identified-as-french-trader"
  },
  {
    "text": "Arrest made after Phoenix USPS collection mailbox fire damages ballots overnight  —  Phoenix Fire Department's arson task force now investigating the fire  —  PHOENIX — An arrest has reportedly been made after a Phoenix United States Postal Service mailbox was believed to have been set on fire overnight … ",
    "url": "https://www.abc15.com/news/region-phoenix-metro/central-phoenix/ballots-damaged-after-usps-mail-collection-box-fire-near-7th-avenue-and-indian-school-road"
  },
  {
    "text": "Gay voters are smitten with Kamala Harris  —  Republicans are uninterested in, or hostile to, a growing voter bloc  —  In the days after President Joe Biden announced his withdrawal from the election, a short clip from 2013 went viral on Twitter.  It showed the then attorney-general … ",
    "url": "https://www.economist.com/united-states/2024/10/24/gay-voters-are-smitten-with-kamala-harris"
  },
  {
    "text": "Beyoncé expected to perform at Harris rally in Houston  —  The pop star is from Houston and her appearance there comes amid a tightening Senate race between Republican Sen. Ted Cruz and Democratic Rep. Colin Allred.  —  Pop superstar Beyoncé will appear with Vice President Kamala Harris … ",
    "url": "https://www.nbcnews.com/politics/2024-election/beyonce-expected-perform-harris-rally-houston-rcna177048"
  },
  {
    "text": "Trump says he's open to pardoning Hunter Biden  —  Donald Trump said Thursday he's open to pardoning Hunter Biden if he's reelected — a significant reversal after years of lobbing attacks at the legal issues faced by the president's son as part of his “Biden crime family” talking point.",
    "url": "https://www.politico.com/live-updates/2024/10/24/2024-elections-live-coverage-updates-analysis/donald-trump-pardon-hunter-biden-00185320"
  },
  {
    "text": "Biden set to apologize to Native Americans for Indian boarding schools  —  The president's apology would come less than two weeks before the election and mark the first formal acknowledgement by a U.S. president of the government's role in atrocities against Native children.",
    "url": "https://www.washingtonpost.com/investigations/2024/10/24/biden-set-apologize-native-americans-indian-boarding-schools/"
  },
  {
    "text": "‘Take Back the States’: The Far-Right Sheriffs Ready to Disrupt the Election  —  Constitutional Sheriffs are duly elected lawmen who believe they answer only to god.  They've spent the last six months preparing to stop a “stolen” election—by any means necessary.",
    "url": "https://www.wired.com/story/constitutional-sheriffs-disrupt-election/"
  },
  {
    "text": "Without Knowledge or Consent  —  For years, America's most iconic gun-makers turned over sensitive personal information on hundreds of thousands of customers to political operatives.  —  Those operatives, in turn, secretly employed the details to rally firearm owners to elect pro-gun politicians running … ",
    "url": "https://www.propublica.org/article/gunmakers-owners-sensitive-personal-information-glock-remington-nssf"
  }
]