[
  {
    "text": "How not to interview Trump  —  This free edition of Public Notice is made possible by paid subscribers.  If you aren't one already, please sign up to support our work.  We're currently offering free trials for all new signups.  Just click the button below.  —  Subscribe now",
    "url": "https://www.publicnotice.co/p/kristen-welker-trump-interview-meet-the-press"
  },
  {
    "text": "Trump shares post bashing ‘liberal Jews who voted to destroy America’  —  Former President Donald Trump late Sunday shared an image on Truth Social telling “liberal Jews” to “make better choices” amid celebrations of the Jewish New Year.  —  Trump shared a photo on Sunday evening without any caption of his own.",
    "url": "https://thehill.com/homenews/campaign/4209650-trump-shares-post-bashing-liberal-jews-who-voted-to-destroy-america/"
  },
  {
    "text": "The unchanging malleability of Donald Trump  —  Donald Trump's success in the 2016 Republican nominating contest was, at its essence, uncomplicated.  —  Running against a cadre of sitting and former elected officials, Trump said things they wouldn't — mostly the things … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/18/trump-welker-interview/"
  },
  {
    "text": "Trump Throws Anti-Abortion Activists Under the Bus … Donald Trump has been signaling for months that he considers the Republican Party's anti-abortion stance to be his party's greatest liability.  On Sunday, he explicitly severed himself from his party's position on the issue.",
    "url": "https://nymag.com/intelligencer/2023/09/trump-abortion-compromise-dobbs-roe.html"
  },
  {
    "text": "Rep. Jennifer Wexton will not seek reelection as diagnosis changes  —  Wexton was diagnosed this summer with progressive supranuclear palsy, a rare neurological condition for which there is no cure  —  Rep. Jennifer Wexton (D-Va.) promised this spring to persevere as she revealed … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/09/18/jennifer-wexton-parkinsons-diagnosis-progressive-supranuclear-palsy/"
  },
  {
    "text": "Could McCarthy really lose his job?  —  Good morning, Early Birds.  If you're looking to brush up on Bibi ahead of President Biden's meeting with him in New York on Wednesday, allow us to suggest David Remnick's 1998 profile in which Benjamin Netanyahu smokes a Davidoff in his office without offering Remnick one.",
    "url": "https://www.washingtonpost.com/politics/2023/09/18/could-mccarthy-really-lose-his-job/"
  },
  {
    "text": "I Was Attacked by Trump and Musk.  It Was a Strategy to Change What You See Online.  —  When I worked at Twitter, I led the team that placed a fact-checking label on one of Donald Trump's tweets for the first time.  Following the violence of Jan. 6, I helped make the call to ban his account from Twitter altogether.",
    "url": "https://www.nytimes.com/2023/09/18/opinion/trump-elon-musk-twitter.html"
  },
  {
    "text": "Her students reported her for a lesson on race.  Can she trust them again?  —  Mary Wood's school reprimanded her for teaching a book by Ta-Nehisi Coates.  Now she hopes her bond with students can survive South Carolina's politics.  —  CHAPIN, S.C. — As gold sunlight filtered into her kitchen … ",
    "url": "https://www.washingtonpost.com/education/2023/09/18/south-carolina-teacher-ta-nehisi-coates-racism-lesson/"
  },
  {
    "text": "Hunter Biden sues IRS over disclosures  —  The lawsuit over IRS agent interviews with Congress and the press comes as a special counsel weighs charging him with tax crimes  —  President Biden's son Hunter Biden filed a lawsuit Monday against the Internal Revenue Service … ",
    "url": "https://www.washingtonpost.com/national-security/2023/09/18/hunter-biden-lawsuit-irs/"
  },
  {
    "text": "Five Americans released from Iranian detention are en route to the US  —  Doha and Washington CNN  —  Five Americans freed from Iranian detention on Monday are on their way back to the United States after initially stopping in Doha, Qatar, according to a US official and a source familiar with the matter.",
    "url": "https://www.cnn.com/2023/09/18/politics/iran-us-prisoner-release-intl/"
  },
  {
    "text": "California Dems consider unique approach to getting Trump off ballot  —  California lawmakers urge AG Bonta to expedite court action against former president.  —  Democrats in the California Legislature are trying a novel approach to remove former President Donald Trump from the state's March 5 primary ballot.",
    "url": "https://www.politico.com/news/2023/09/18/democrats-effort-kick-trump-off-california-ballot-00116476"
  },
  {
    "text": "U.S. asks for help finding missing F-35 fighter jet after pilot ejects during ‘mishap’  —  Joint Base Charleston in South Carolina appealed to the public for information in its bid to “locate an F-35 that was involved in a mishap” on Sunday afternoon.  —  A U.S. fighter jet's stealth abilities appear … ",
    "url": "https://www.nbcnews.com/news/us-news/f-35-fighter-jet-missing-pilot-ejects-mishap-rcna105534"
  },
  {
    "text": "'He's 100% in': Matt Gaetz widely expected to run for Florida governor  —  The Florida congressman, however, told NBC News that his only political goal at the moment is getting Donald Trump elected president in 2024.  —  TALLAHASSEE, Fla.— The idea that Rep. Matt Gaetz will run … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/-100-matt-gaetz-widely-expected-run-florida-governor-rcna105629"
  },
  {
    "text": "Billionaire Ken Griffin, former DeSantis donor, on sidelines for GOP presidential primary  — Billionaire and Citadel CEO Ken Griffin says he is sitting on the sidelines for the 2024 Republican presidential primary.  — Griffin explained that so far he's not impressed with what he's seeing … ",
    "url": "https://www.cnbc.com/2023/09/18/billionaire-ken-griffin-former-desantis-donor-sits-out-gop-primary.html"
  }
]