[
  {
    "text": "The Key to Mike Johnson's Christian Extremism Hangs Outside His Office  —  The newly elected House Speaker has ties to the far-right New Apostolic Reformation — which is hell-bent on turning America into a religious state  —  THE AMERICAN PUBLIC has had much to learn about Mike Johnson over the past two weeks.",
    "url": "https://www.rollingstone.com/politics/political-commentary/mike-johnson-christian-nationalist-appeal-to-heaven-flag-1234873851/"
  },
  {
    "text": "Why Is Mike Johnson Flying a Christian Nationalist Flag Outside His Office?  —  House Speaker Mike Johnson has three flags hanging outside his office: the American flag, the Louisiana state flag, and a flag representing a movement that wants to turn the United States into a religious Christian nation.",
    "url": "https://newrepublic.com/post/176861/mike-johnson-flying-christian-nationalist-flag-outside-office"
  },
  {
    "text": "F.B.I. Seizes Eric Adams's Phones as Campaign Investigation Intensifies  —  Days after a raid at Mr. Adams's chief fund-raiser's home, federal agents took the mayor's phones and iPad, two people with knowledge of the matter said.  —  F.B.I. agents seized Mayor Eric Adams's electronic devices early … ",
    "url": "https://www.nytimes.com/2023/11/10/nyregion/adams-fbi-investigation-phones.html"
  },
  {
    "text": "Ohio Republicans Say It's Their ‘God Given Right’ to Restrict Abortion Access  —  Republicans in Ohio want to undermine the will of voters who approved a measure enshrining reproductive freedom into the state's constitution  —  Ohio Republicans are claiming a constitutional amendment … ",
    "url": "https://www.rollingstone.com/politics/politics-news/ohio-republicans-stop-issue-1-abortion-rights-1234875333/"
  },
  {
    "text": "Alarmed by Off-Year Losses, Mainstream Republicans Balk at Abortion Curbs  —  Worried about alienating critical blocs of voters, House Republicans from competitive districts are digging in against using spending bills for abortion and contraception restrictions.",
    "url": "https://www.nytimes.com/2023/11/10/us/politics/house-republicans-abortion.html"
  },
  {
    "text": "Joe Manchin hits the road to ‘save the nation’ amid 2024 speculation  —  Fresh off his announcement that he wouldn't seek a third term in his coveted Senate seat next year, Sen. Joe Manchin (D-WV) is taking his show on the road.  —  Manchin, who was widely viewed as the most vulnerable incumbent … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/joe-manchin-post-senate-2024-speculation"
  },
  {
    "text": "Rep. Elise Stefanik files ethics complaint against judge in Trump's civil fraud trial  —  The senior House Republican and close Trump ally accused Judge Arthur Engoron of “weaponized law fare” against the former president and called on the judge to recuse himself.",
    "url": "https://www.nbcnews.com/politics/donald-trump/stefanik-files-ethics-complaint-judge-engoron-trump-trial-rcna124554"
  },
  {
    "text": "Tennessee man admits to conspiring with Jan. 6 defendant to kill FBI agents  —  Austin Carter said that he plotted with Edward Kelley, who is awaiting trial on Jan. 6 charges, to kill as many as 37 people.  Kelley has pleaded not guilty to murder conspiracy charges.",
    "url": "https://www.nbcnews.com/politics/justice-department/tennessee-man-says-conspired-jan-6-defendant-kill-fbi-agents-rcna124683"
  },
  {
    "text": "Ex-National Guardsman wanted on Jan. 6 charges surrenders after FBI manhunt  —  Gregory Yetman turned himself into police in New Jersey following a 48-hour manhunt.  —  A former New Jersey National Guard police sergeant accused of pepper spraying officers during the Jan. 6 Capitol attack turned himself … ",
    "url": "https://www.nbcnews.com/politics/justice-department/ex-national-guardsman-wanted-jan-6-charges-surrenders-fbi-manhunt-rcna124621"
  },
  {
    "text": "Statement From Gerald Rosberg, Chair of the Special Committee on Campus Safety  —  Columbia University is suspending Students for Justice in Palestine (SJP) and Jewish Voice for Peace (JVP) as official student groups through the end of the fall term.  This decision was made after the two … ",
    "url": "https://news.columbia.edu/news/statement-gerald-rosberg-chair-special-committee-campus-safety"
  },
  {
    "text": "Inside Mike Johnson's Ties to a Far-Right Movement to Gut the Constitution  —  The new House speaker has longstanding ties to the evangelical inspired Convention of States cause.  —  As the interregnum without a speaker of the House came to an end last month, people from across … ",
    "url": "https://www.politico.com/news/magazine/2023/11/10/mike-johnson-rewrite-constitution-00126157"
  },
  {
    "text": "Judge in classified documents case rejects Trump's request to delay May trial date  —  The federal judge had announced in July that the trial would begin on May 20 in Fort Pierce, Florida.  —  A federal judge on Friday declined former President Donald Trump's request to postpone the May start date … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-classified-documents-case-rejects-trumps-request-delay-may-trial-rcna124614"
  },
  {
    "text": "How the GOP muzzled the quiet coalition that fought foreign propaganda  —  The FBI put a pause on briefings with tech companies due to an ongoing lawsuit, adding to a broader breakdown in a system meant to guard against influence operations and to ensure election integrity.",
    "url": "https://www.nbcnews.com/tech/tech-news/gop-muzzled-quiet-coalition-fought-foreign-propaganda-rcna103373"
  },
  {
    "text": "Where's Melania?  —  The former first lady isn't too hard to find.  So why does it feel like she's hiding?  —  PALM BEACH, Fla. — On an October morning, before the club had opened for its winter season, all was quiet at Mar-a-Lago.  The five clay tennis courts were unblemished.",
    "url": "https://www.washingtonpost.com/style/power/2023/11/10/where-is-melania-trump/"
  },
  {
    "text": "Moody's cuts U.S. outlook to negative, citing deficits and political polarization  — Moody's Investors Service lowered its ratings outlook on the United States' government to negative from stable, pointing to rising risks to the nation's fiscal strength.  — The ratings agency has affirmed … ",
    "url": "https://www.cnbc.com/2023/11/10/moodys-cuts-usa-outlook-to-negative-citing-higher-interest-rates-and-deficits.html"
  },
  {
    "text": "Ocasio-Cortez, Greene among lawmakers urging Biden to drop Assange extradition, prosecution  —  A group of lawmakers including Rep. Alexandria Ocasio-Cortez (D-N.Y.) and Rep. Marjorie Taylor Greene (R-Ga.) called on President Biden to drop the extradition and prosecution of WikiLeaks founder Julian Assange.",
    "url": "https://thehill.com/homenews/house/4304418-lawmakers-urge-biden-drop-assange-extradition-prosecution/"
  },
  {
    "text": "A lot of Americans embrace Trump's authoritarianism  —  With every hour that passes, Donald Trump's grip on the Republican Party's 2024 presidential nomination grows tighter.  Every day in which his opponents aren't gaining ground on his position is a day in which he gets nearer to appearing … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/10/lot-americans-embrace-trumps-authoritarianism/"
  },
  {
    "text": "Suspicious letters sent to election offices being investigated by federal law enforcement  —  Federal law enforcement officials are investigating reports of suspicious letters sent to public officials, a Justice Department spokesperson said Thursday.  —  “We are aware of the reports and the FBI … ",
    "url": "https://www.cnn.com/2023/11/09/politics/suspicious-letters-fentanyl-election-offices/"
  },
  {
    "text": "France's Macron urges Israel to ‘stop this bombing’ in Gaza  —  French President Emanuel Macron strongly rebuked Israel's bombing campaign and ground offensive in Gaza on Friday, saying there is “no justification” for the effort in a BBC interview.  —  Macron said “we do urge them to stop this bombing” … ",
    "url": "https://thehill.com/policy/international/4304882-emanuel-macron-urges-israel-to-stop-bombing-gaza/"
  },
  {
    "text": "The House is most definitely not in order  —  Before Mike Johnson became speaker, the House of Representatives had voted to censure one of its own members only seven times in 100 years.  Since Johnson became speaker, members of the House have tried to censure each other eight times in two weeks.",
    "url": "https://www.washingtonpost.com/opinions/2023/11/10/new-speaker-mike-johnson-censure-resolutions-tlaib-shutdown/"
  },
  {
    "text": "Trump turns to oil barons to boost his White House bid  —  At fundraisers, Trump has been wooing oil billionaires with a variety of pitches, including false claims about electric cars  —  Earlier this summer, oil billionaire Harold Hamm called for Donald Trump to drop out of the presidential race.",
    "url": "https://www.washingtonpost.com/nation/2023/11/10/trump-oil-gas-donors-climate/"
  },
  {
    "text": "Texas judge rules against GOP lawsuit seeking to toss 2022 election result in Houston area  —  A Texas judge has denied a Republican effort to overturn election results in the nation's third-most populous county, a Democratic stronghold that's been beset by GOP efforts to dictate how ballots are cast.",
    "url": "https://apnews.com/article/election-lawsuit-texas-harris-county-67dc7dc3055c684fed1349060de69d6f"
  }
]