[
  {
    "text": "Robert Hur will testify as private citizen with help from Trumpworld figures  —  EXCLUSIVE: Ex-Special Counsel arranged to leave Justice Department the day before his appearance with the House Judiciary Committee  —  Special Counsel Robert Hur to testify on Biden's handling of classified documents",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/robert-hur-trump-special-counsel-b2510944.html"
  },
  {
    "text": "Special Counsel Who Investigated Biden to Defend Report by Saying He Needed to ‘Show My Work’  —  Republicans are likely to pepper Robert K. Hur about his justifications for not charging the president.  Democrats will almost certainly slam him for making broad assertions about Mr. Biden's memory.",
    "url": "https://www.nytimes.com/2024/03/12/us/politics/robert-hur-biden-report.html"
  },
  {
    "text": "Boeing whistleblower found dead in US  —  Prior to his death, whistleblower John Barnett was testifying against Boeing over concerns about standards.",
    "url": "https://www.bbc.com/news/business-68534703"
  },
  {
    "text": "Trump's renewed attacks against E. Jean Carroll open the door for new lawsuit, lawyer says  —  An attorney for a longtime advice columnist who won an $83.3 million defamation award against Donald Trump suggested Monday that a new defamation lawsuit was possible against the ex-president … ",
    "url": "https://apnews.com/article/e-jean-carroll-trump-defamation-columnist-9a9932b83d2f7dcae1b63701f6405352"
  },
  {
    "text": "Calling Out a Would-Be Bully In Chief  —  To ignore bad behavior is to normalize it.  Here at Steady we will continue to publicize Donald Trump's outrageous conduct as long as he exhibits it.  —  Insecurity Parading as Strength  —  At a Saturday campaign rally in Georgia, Trump mocked President Biden's stutter.",
    "url": "https://steady.substack.com/p/calling-out-a-would-be-bully-in-chief"
  },
  {
    "text": "Who posted the $91 million bond for Trump?  Follow the Russian connections.  —  Trump Posts $92 Million Bond to Support Jury Award to E. Jean Carroll in Defamation Suit - Time  —  Where did the money for the bond come from?  Read Seth Abaramson's article.",
    "url": "https://thedemlabs.org/2024/03/11/chubb-posts-91-million-bond-for-trump-defamation-case-follow-russian-connections/"
  },
  {
    "text": "RNC fires dozens of employees after Trump-backed leadership takes over  —  About 60 people were told they were no longer employed, according to a person with direct knowledge  —  The new leadership team at the Republican National Committee — handpicked by former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/11/rnc-trump-firings/"
  },
  {
    "text": "‘Absolute bloodbath’ at RNC as new leadership loyal to Trump purges staff  —  Chair Michael Whatley and co-chair Lara Trump move to reorganize the party, with an expected cull of 60 members  —  Donald Trump's new leadership team at the Republican National Committee started the process … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/11/new-rnc-leadership-trump-loyals-purge-staff"
  },
  {
    "text": "Trump's Biden Mockery Upsets People Who Stutter: 'We've Heard This Before'  —  The former president mimicked his rival while at a rally over the weekend.  For those who stutter, his remark “hits that familiar humiliation feeling.”  —  Róisín McManus has stuttered her whole life.",
    "url": "https://www.nytimes.com/2024/03/11/us/politics/trump-mocks-biden-stutter.html"
  },
  {
    "text": "Trump asked Elon Musk if he wanted to buy Truth Social  —  The idea went nowhere, but the former president and the billionaire X owner have continued to communicate more than was previously known  —  Former president Donald Trump asked Elon Musk last summer whether the billionaire industrialist … ",
    "url": "https://www.washingtonpost.com/technology/2024/03/12/trump-musk-truth-social-sale/"
  },
  {
    "text": "Republicans say Britt being treated like Sarah Palin 2.0  —  Alabama Sen. Katie Britt's (R) debut on the national political stage is prompting comparisons to another fiery conservative mom: former Alaska Gov. Sarah Palin (R).  —  The comparisons took a new life late Saturday … ",
    "url": "https://thehill.com/homenews/senate/4524885-republicans-say-britt-being-treated-like-sarah-palin-2-0/"
  },
  {
    "text": "Exclusive: ‘Trump Employee 5,’ who unknowingly helped move classified documents, speaks out  —  Watch the full interview with Kaitlan Collins at 9 p.m. ET Monday on “The Source.”  —  CNN  —  A longtime Mar-a-Lago employee who is a central witness in the investigation … ",
    "url": "https://www.cnn.com/2024/03/11/politics/trump-employee-5-classified-documents-mar-a-lago/"
  },
  {
    "text": "House GOP report aims to undermine Jan. 6 committee … - A senior Democratic congressional aide called the report “yet another attempt to rewrite the history of January 6th and whitewash the events of that horrible, bloody, and violent day.”  — Rep. Bennie Thompson (D-Miss.) … ",
    "url": "https://www.axios.com/2024/03/11/house-republican-report-jan-6-committee"
  },
  {
    "text": "Consumer prices rose 0.4% in February and 3.2% from a year ago  — The consumer price index, a broad measure of goods and services costs, increased 0.4% for the month and 3.2% from a year ago.  The monthly measure was in line with expectations while the 12-month reading was slightly higher.",
    "url": "https://www.cnbc.com/2024/03/12/cpi-inflation-report-february-2024-.html"
  },
  {
    "text": "Does telling the truth matter anymore?  —  To say that this nation is hopelessly politically divided is the understatement of the year.  It shouts out at you in every political poll.  We no longer have two competing political parties but two armed enemy camps.",
    "url": "https://thehill.com/opinion/4525483-press-does-telling-the-truth-matter-anymore/"
  },
  {
    "text": "Florida teachers can discuss sexual orientation and gender ID under 'Don't Say Gay' bill settlement  —  Students and teachers can discuss sexual orientation and gender identity in Florida classrooms, provided it's not part of instruction, under a settlement reached Monday between Florida education officials … ",
    "url": "https://apnews.com/article/florida-dont-say-gay-bill-settlement-987904b3e19122d719cf468034746b6e"
  },
  {
    "text": "New data explodes myth of crime wave fueled by migrants  —  Republican politicians and sympathetic media outlets are claiming that America is in the midst of a violent “crime wave,” driven in part by undocumented immigrants.  New data, however, demonstrates that there was not a spike in violent crime in 2023.",
    "url": "https://popular.info/p/new-data-explodes-myth-of-crime-wave"
  },
  {
    "text": "FAA Audit of Boeing's 737 Max Production Found Dozens of Issues  —  The company failed 33 of 89 audits during an examination conducted by the Federal Aviation Administration after a panel blew off an Alaska Airlines jet in January.  —  阅读.体中文.閱讀.體中文.",
    "url": "https://www.nytimes.com/2024/03/11/us/politics/faa-audit-boeing-737-max.html"
  },
  {
    "text": "Group submits signatures to recall Wisconsin Assembly speaker targeted by Trump  —  The speaker, Robin Vos, resisted Trump's pressure to find a way to reverse the former president's reelection loss in the critical battleground state in 2020  —  A group seeking to oust the Republican speaker … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/11/wisconsin-speaker-recall-trump/"
  }
]