[
  {
    "text": "Trump speaks with Justice Alito amid push to halt criminal sentencing  —  Alito spoke to Trump to recommend an ex-clerk for a job in his administration.  —  President-elect Donald Trump speaks during a news conference at Mar-a-Lago, Jan. 7, 2024, in Palm Beach, Fla.",
    "url": "https://abcnews.go.com/US/trump-speaks-justice-alito-amid-push-halt-criminal/story?id=117386419"
  },
  {
    "text": "Biden Has Presidential Immunity.  He Should Use It.  —  1. Shiny Objects  —  I want to talk about all of the Trump insanity.  I want to talk about his insistence on “taking” Greenland.  And the Panama Canal.  And making Canada a U.S. state.  And renaming the Gulf of Mexico the “Gulf of America.”",
    "url": "https://www.thebulwark.com/p/biden-has-presidential-immunity-he"
  },
  {
    "text": "Justice Dept. to Hold Off Releasing Report on Trump Documents Case  —  But in a court filing, the department indicated that it would release a separate report about Donald J. Trump's efforts to overturn the 2020 election as soon as possible.  —  Federal prosecutors said on Wednesday … ",
    "url": "https://www.nytimes.com/2025/01/08/us/politics/trump-documents-report-jack-smith.html"
  },
  {
    "text": "Top DOJ officials may have tried to sway 2020 election to Trump: Watchdog  —  Justice Department officials who served under President-elect Trump's first administration may have influenced the 2020 presidential election through intentional media leaks targeted at Democratic state governors … ",
    "url": "https://thehill.com/homenews/administration/5074114-doj-officials-sway-2020-election-doj-ig-report/"
  },
  {
    "text": "In exclusive sit-down, Biden reveals his biggest regret and the compliment Trump gave him  —  Interviews like this one have been rare in Biden's tenure.  He has held fewer news conferences and individual sessions with reporters than any president since at least Ronald Reagan.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2025/01/08/exclusive-joe-biden-interview-donald-trump-election/77378693007/"
  },
  {
    "text": "Poking Fun at Trump, Mexico's President Suggests Renaming the U.S.  —  President Claudia Sheinbaum of Mexico also said Donald Trump was ill-informed when he said Mexico was “essentially run by the cartels.”  —  Mexico's president rejected several of President-elect Donald J. Trump's assertions … ",
    "url": "https://www.nytimes.com/2025/01/08/us/politics/mexico-president-mexican-america-trump.html?unlocked_article_code=1.nk4._okz.NQR-QhN5oSkY&smid=url-share"
  },
  {
    "text": "Mexico President Sheinbaum has dig at President-elect Trump over ‘Gulf of America’  —  Mexico's president on Wednesday responded sarcastically to Donald Trump's proposal to change the name of the Gulf of Mexico to the Gulf of America.  Standing before a global map, Claudia Sheinbaum suggested dryly … ",
    "url": "https://apnews.com/video/mexico-claudia-sheinbaum-mexico-government-andres-manuel-lopez-obrador-international-agreements-daf8791533ae4ffcbfcb2a75767b931f"
  },
  {
    "text": "Lack of water from hydrants in Palisades fire is hurting firefighters, Caruso says  —  As wildfires raged across Los Angeles on Tuesday, crews battling the Palisades blaze faced an additional burden: Scores of fire hydrants in the Pacific Palisades had little to no water flowing out.",
    "url": "https://www.latimes.com/california/story/2025-01-08/lack-of-water-from-hydrants-in-palisades-fire-is-hampering-firefighters-caruso-says"
  },
  {
    "text": "5 dead, more than 1,100 structures destroyed as firestorm besieges L.A. County  —  More than 1,100 buildings have burned and at least five people are dead in wildfires burning across L.A. County, making this one of the most destructive firestorms to hit the region in memory.",
    "url": "https://www.latimes.com/california/live/pacific-palisades-fire-updates-los-angeles"
  },
  {
    "text": "Trump camp was fed questions for Fox News town hall in advance from person inside network, new book says  —  New York CNN  —  President-elect Donald Trump's team was given the questions asked by Fox News anchors at an Iowa town hall last January in advance by someone inside the network … ",
    "url": "https://www.cnn.com/2025/01/08/media/trump-fox-news-town-hall-questions-maria-bartiromo"
  },
  {
    "text": "Prepare to Be Shocked: Los Angeles' Fire Chief Is a DEI-Obsessed ‘LGBTQ’ Woman Who Wasted Millions  —  In perhaps the most unexpected, shocking revelation to come out of the devastating Los Angeles wildfires, it turns out their Fire Chief is an “LGBTQ+” woman who is obsessed with DEI.",
    "url": "https://redstate.com/bonchie/2025/01/08/in-a-shocking-turn-of-events-las-fire-chief-is-a-dei-obsessed-lgbtq-woman-n2184093"
  },
  {
    "text": "Hawaii Gov: RFK Jr.'s Anti-Vax Misinformation Left Dozens Of Kids Dead In Samoa  —  The Senate is poised to make “an absolute life-or-death decision” in confirming Kennedy as HHS secretary, warned Gov. Josh Green, who is also a physician.  —  LOADING  —  WASHINGTON — Hawaii Gov. Josh Green … ",
    "url": "https://www.huffpost.com/entry/hawaii-governor-josh-green-rfk-jr-vaccines-hhs_n_677ebc3ce4b0f751b99402ae"
  },
  {
    "text": "House Republican bill would pave way for Trump to acquire Panama Canal for US  —  Rep. Dusty Johnson (R-S.D.) will introduce a bill that would authorize the president to purchase the Panama Canal and put it under U.S. control, an acquisition that President-elect Trump has been pushing over the last several weeks.",
    "url": "https://thehill.com/homenews/house/5074775-republican-bill-panama-canal-trump-purchase/"
  },
  {
    "text": "Gallego is latest Dem to back Laken Riley Act  —  Sen. Ruben Gallego (D-Ariz.) is the latest Democratic senator to sign on to support the Laken Riley Act, the House-passed immigration legislation with improving odds of passing in the upper chamber.  “We must give law enforcement the means … ",
    "url": "https://www.politico.com/live-updates/2025/01/08/congress/laken-riley-act-ruben-gallego-00197043"
  },
  {
    "text": "The Media Isn't Ready for Trump's Mass Deportation Moment  —  IMAGINE THIS SCENARIO: Department of Homeland Security agents storm a meatpacking plant in the South, a show of force in the largest workplace raid in a decade.  Rounding up workers, they target those who appear to be Latinos, without regard for citizenship.",
    "url": "https://www.thebulwark.com/p/the-media-isnt-ready-for-trumps-mass"
  },
  {
    "text": "Facebook Is Censoring 404 Media Stories About Facebook's Censorship  —  Instagram, Facebook, and Threads are removing 404 Media stories for “nudity” as the company is paid to put ads with explicit pornography in front of its users.  —  In early December I got the kind of tip we've been getting a lot over the past year.",
    "url": "https://www.404media.co/facebook-is-censoring-404-media-stories-about-facebooks-censorship/"
  },
  {
    "text": "Japanese Yakuza Leader Pleads Guilty to Nuclear Materials Trafficking, Narcotics, and Weapons Charges  —  For Immediate Release  —  Takeshi Ebisawa, 60, of Japan, pleaded guilty in Manhattan, New York, today to conspiring with a network of associates to traffic nuclear materials … ",
    "url": "https://www.justice.gov/opa/pr/japanese-yakuza-leader-pleads-guilty-nuclear-materials-trafficking-narcotics-and-weapons"
  },
  {
    "text": "Watchdog group accuses RFK Jr. of voter fraud  —  The former independent candidate faces scrutiny over an address he used to vote in New York.  —  With less than two weeks before Donald Trump is sworn in as President, his pick to lead Health and Human Services is facing a new legal challenge — over alleged voter fraud.",
    "url": "https://www.politico.com/news/2025/01/08/rfk-voter-ny-accusations-00196984"
  },
  {
    "text": "Trump asks the Supreme Court to place him even further above the law  —  On Wednesday, President-elect Donald Trump asked the Supreme Court to halt the criminal proceeding against him in New York state court.  —  Trump was convicted of 34 felony counts of falsifying business records … ",
    "url": "https://www.vox.com/scotus/394053/supreme-court-trump-immunity-new-york"
  },
  {
    "text": "Threatening Canada  —  Trump posted this last night on Truth Social.  —  A lot of people went off on him.  A lot of other people chided those people for chasing a bright shiny object and ignoring important things, like Senator Majority Leader John Thune's claim he has the votes to confirm … ",
    "url": "https://joycevance.substack.com/p/threatening-canada"
  },
  {
    "text": "Capitol Police arrest man with machete amid Carter visitation and ahead of Trump meeting  —  Washington — Capitol Police said officers arrested a man with a machete and other knives on Wednesday afternoon at the Capitol Visitor Center.  —  The arrest comes hours ahead of President-elect … ",
    "url": "https://www.cbsnews.com/news/capitol-police-arrest-machete-knives/"
  },
  {
    "text": "Read what Joe Biden said during his exclusive interview with USA TODAY: Transcript  —  Transcript of President Joe Biden's Oval Office interview with Susan Page, USA TODAY's Washington Bureau Chief, on Jan. 5, 2025:  —  PAGE: This is the limits of my technological ability.  —  BIDEN: Believe me...",
    "url": "https://www.usatoday.com/story/news/politics/elections/2025/01/08/joe-biden-interview-transcript/77490912007/?tbref=hp"
  },
  {
    "text": "Body of hostage Youssef Ziyadne found in Gaza  —  The IDF confirmed Ziyadne was discovered in an underground tunnel in Rafah adding that it discovered “findings relating to Youssef's son.”  —  Israeli security forces have discovered the body of hostage Youssef al-Ziyadne, 53, in the Gaza Strip, his family was told on Wednesday.",
    "url": "https://www.jpost.com/breaking-news/article-836669"
  },
  {
    "text": "Elon Musk's Boring Company Is Tunneling Beneath Las Vegas With Little Oversight  —  Given Musk's role advising President-elect Donald Trump on ways to slash regulations and government oversight, Boring and the Vegas Loop project might be a harbinger for the country.  —  Co-published with City Cast Las Vegas",
    "url": "https://www.propublica.org/article/elon-musk-boring-company-las-vegas-loop-oversight"
  },
  {
    "text": "Trump Inauguration, Awash in Cash, Runs Out of Perks for Big Donors  —  The president-elect has raised more than $170 million for his swearing-in, an inaugural record, as wealthy Americans flock to curry favor with him and some give money even without the prospect of V.I.P. access.",
    "url": "https://www.nytimes.com/2025/01/08/us/politics/trump-inauguration-donors.html"
  },
  {
    "text": "The gravity of a GOP election challenge in N.C.: ‘Invites incredible mischief’  —  Why the North Carolina state Supreme Court allowing the case to proceed two months after the election is so extraordinary.  —  When Republican Richard Dietz was running for the North Carolina state Supreme Court in 2022 … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/08/gop-election-challenge-north-carolina/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM2MzEyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM3Njk0Nzk5LCJpYXQiOjE3MzYzMTI0MDAsImp0aSI6IjgzNWYxZDA2LWMyMWUtNDIzYy1hNWVkLTExODg2ZWI5OTA5NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAxLzA4L2dvcC1lbGVjdGlvbi1jaGFsbGVuZ2Utbm9ydGgtY2Fyb2xpbmEvIn0.nDRDUrZds--y3LWFtxreQsbo9hZpP1PjpIqq6Yis4-g&itid=gfta"
  },
  {
    "text": "Annual ‘winners’ for most egregious US healthcare profiteering announced  —  Selling body parts without consent and billing desperate parents $97,599 for air transport among worst examples  —  The 2024 “winners” of the annual Shkreli awards, given each year to perpetrators of the most egregious examples … ",
    "url": "https://www.theguardian.com/us-news/2025/jan/07/annual-awards-healthcare-profiteering"
  },
  {
    "text": "The Growing Push to Ban Renewable Energy in Oklahoma  —  There's a nascent, concerted effort to make Oklahoma the first state to ban new renewable energy projects.  And it's picking up steam.  —  Across the U.S., activism against wind and solar energy has only grown in intensity, power … ",
    "url": "https://heatmap.news/plus/the-fight/spotlight/renewable-energy-ban-oklahoma"
  },
  {
    "text": "Trump is considering a national economic emergency declaration to allow for new tariff program, sources say  —  President-elect Donald Trump is considering declaring a national economic emergency to provide legal justification for a large swath of universal tariffs on allies and adversaries … ",
    "url": "https://www.cnn.com/2025/01/08/economy/trump-national-economic-emergency-tariffs/"
  }
]