[
  {
    "text": "Supreme Court Poised to Allow Emergency Abortions in Idaho  — Opinion was briefly posted on the court's website and removed  — Hospitals would be allowed to protect pregnant mother's health  —  The US Supreme Court is poised to allow abortions in medical emergencies in Idaho … ",
    "url": "https://www.bloomberg.com/news/articles/2024-06-26/us-supreme-court-poised-to-allow-emergency-abortions-in-idaho"
  },
  {
    "text": "The Supreme Court Blesses a Form of Bribery  —  The ruling can be understood only as a policy preference.  —  Kanu-bribery-062624  —  The Supreme Court just made giving this bill to a public official legal, as long as it's after they perform an official act for you.",
    "url": "https://prospect.org/justice/2024-06-26-supreme-court-blesses-form-bribery-snyder-v-us/"
  },
  {
    "text": "Errant SCOTUS abortion case document posting sparks confusion  —  On Wednesday afternoon, Bloomberg sent shockwaves throughout the country, reporting that a document appeared on the opinions page of the U.S. Supreme Court's website briefly Wednesday morning that, for all intents and purposes … ",
    "url": "https://www.lawdork.com/p/emtala-document-scotus-corruption-decision"
  },
  {
    "text": "What to Watch at the First Trump-Biden Debate  —  Both candidates have been eager for this rematch, with President Biden aiming to focus on their starkly different visions for America, and Donald Trump keen to attack his rival's record.  —  The candidates are the same.  The circumstances are very different.",
    "url": "https://www.nytimes.com/2024/06/27/us/politics/trump-biden-debate-preview.html"
  },
  {
    "text": "Trump Allies Urge Him Not To Be a ‘Raging Asshole’ at Debate  —  The former president's camp doesn't want a repeat of his last debate against Biden ahead of the 2020 election  —  AHEAD OF THURSDAY night's planned presidential debate between President Joe Biden and former President Donald Trump … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-allies-urge-raging-asshole-debate-1235046992/"
  },
  {
    "text": "A coup attempt is feared in Bolivia as troops pour into the streets  —  LA PAZ, Bolivia (AP) — Armored vehicles rammed into the doors of Bolivia's government palace Wednesday as a top government official warned of a coup attempt and President Luis Arce said “irregular” deployment of troops was taking place in the capital.",
    "url": "https://apnews.com/article/bolivia-military-deployment-arce-coup-fears-028cd88f3be1fb02164c05deb0faa099"
  },
  {
    "text": "The presidential election isn't a toss-up  —  As our model launches, either Biden or Trump could easily win — but the odds are in the ex-president's favor.  —  ∙ Paid … We hope all of this will prove to be worth your time — and money — and you can sign up using the link below.",
    "url": "https://www.natesilver.net/p/the-presidential-election-isnt-a"
  },
  {
    "text": "SCOTUS Puntalooza: Court Rejects Challenge to Government-Directed Censorship  —  Consider today a very disappointing day at the Supreme Court.  Not only did the court publish only two of the outstanding opinions in unresolved cases this term, they also chose to punt on one of the most important.",
    "url": "https://hotair.com/ed-morrissey/2024/06/26/scotus-palooza-n3790961"
  },
  {
    "text": "Trump Pulls Ahead In Presidential Race, Vast Majority Of Voters Plan To Watch Debate, 16% Open To Changing Choice For President, Quinnipiac University National Poll Finds; Voters Support Social Media Warning Label And Banning Smartphones In The Classroom  —  mail_outline",
    "url": "https://poll.qu.edu/poll-release?releaseid=3900"
  },
  {
    "text": "Local GOP Candidate In Minnesota Accused Of Tossing Tarantula At Housemate  —  Marisa Simonetti, running to be a Hennepin County commissioner, is facing an assault charge over the incident, which she said was inspired by “Home Alone.”  —  Video  —  Oh, what a tangled web we weave ...",
    "url": "https://www.huffpost.com/entry/marisa-simonetti-gop-candidate-edina-minnesota-tarantula-toss_n_667c7245e4b017bda37b6c87"
  },
  {
    "text": "Democrats groan at AIPAC “overkill” against Jamaal Bowman … - “It might change how they talk about [Israel],” one moderate House Democrat said of their colleagues, speaking on the condition of anonymity. … - AIPAC spent at least $14.5 million on anti-Bowman ads through its PAC … ",
    "url": "https://www.axios.com/2024/06/26/democrats-aipac-jamaal-bowman-george-latimer"
  },
  {
    "text": "New charges: Feeding Our Future juror was followed for days, given list of instructions with $120k in cash to acquit  —  Five people, including three who were on trial, are now being charged.  —  The defendants carefully chose the juror and followed her home, watching her for days … ",
    "url": "https://www.startribune.com/new-charges-feeding-our-future-juror-was-followed-for-days-given-list-of-instructions-with-120k-in-cash-to-acquit/600376357/"
  },
  {
    "text": "Remember Those Gay Activists Accused of Abusing Their Adopted Kids?  —  WARNING: This article contains graphic descriptions of child sexual abuse.  Reader discretion is advised.  —  Remember the self-avowed LGBTQ+ activists accused of sexually abusing their adopted sons?",
    "url": "https://townhall.com/tipsheet/miacathell/2024/06/26/zulock-tentative-trial-n2638642"
  },
  {
    "text": "Sammy Alito Makes a Great Case Trump Censored Fox News' Accurate 2020 Election Reporting  —  As Rayne noted, today a 6-Justice majority rejected the right wing conspiracy theory ginned up by Missouri and Louisiana's since promoted Attorneys General claiming that the Federal government … ",
    "url": "https://www.emptywheel.net/2024/06/26/sammy-alito-makes-a-great-case-trump-censored-fox-news-accurate-2020-election-reporting/"
  },
  {
    "text": "Pluralistic: Cleantech has an enshittification problem (26 Jun 2024)  — Cleantech has an enshittification problem: Who's gonna make a 25-year purchase from a startup with six months' worth of runway?  — Hey look at this: Delights to delectate.  — This day in history: 2004, 2009, 2014, 2019",
    "url": "https://pluralistic.net/2024/06/26/unplanned-obsolescence/"
  },
  {
    "text": "John Roberts Stood Up the Senate.  Why Is He Getting Away With It?  —  Millions of dollars in secret gifts.  Pro-insurrection flags flying on a justice's front lawn.  Recorded statements of sympathy for the Christian nationalist cause.  —  Revelations about the unethical conduct … ",
    "url": "https://slate.com/news-and-politics/2024/06/john-roberts-senate-ethics-fail-thomas-alito.html"
  },
  {
    "text": "Ketanji Brown Jackson Blasts “Absurd” Supreme Court Bribery Ruling  —  Supreme Court Justice Ketanji Brown Jackson took her conservative colleagues to task Wednesday over a ruling weakening a federal statute that prevented public officials from receiving bribes in the form of gratuities.",
    "url": "https://newrepublic.com/post/183135/ketanji-brown-jackson-absurd-supreme-court-bribery"
  },
  {
    "text": "Pyongyang Says It Will Send Troops to Ukraine Within a Month  —  The June 19 defense pact signed between Russia and North Korea included a promise to provide military assistance to one another - within days Pyongyang said it was sending troops to Ukraine.  —  Last week, President Vladimir Putin … ",
    "url": "https://www.kyivpost.com/post/34893"
  },
  {
    "text": "EXCLUSIVE: VA Senate candidate says he was ‘blown up’ in combat.  His record doesn't show that.  —  Elizabeth Beyer Tom Vanden BrookUSA TODAY  —  WASHINGTON — The Republican candidate for U.S. Senate in Virginia, a decorated Navy veteran, has made repeated references to becoming disabled after he was … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/06/26/hung-cao-military-record-purple-heart/74220141007/"
  },
  {
    "text": "Democrats question US post office about ballot delivery delays ahead of Election Day  —  WASHINGTON - A group of Senate Democrats is raising concerns that the U.S. Postal Service's decision to re-route some mail processing may hurt the delivery of mail-in ballots in select states during the 2024 elections … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/06/26/mail-ballot-delays-postal-service-senate-democrats-letter/74224443007/"
  },
  {
    "text": "Trump's Shameless, Corrupt Wooing of Plutocrats Is Suddenly Backfiring  —  Donald Trump is sometimes euphemistically described as “transactional,” when in fact the correct word is “corrupt.”  Nowhere is this truer than with his efforts to woo the plutocratic class with veiled threats and something akin to naked solicitations of bribes.",
    "url": "https://newrepublic.com/article/183147/trumps-shameless-corrupt-wooing-plutocrats-suddenly-backfiring"
  },
  {
    "text": "SPECIAL REPORT: RNC bookings “underwhelming” and a “failure,” event venues and restaurants raise concerns  —  The Riverside Theater and Pabst Theater will sit empty during the convention, and some downtown restaurant owners worry over lack of activity, with RNC just weeks away.",
    "url": "https://www.therecombobulationarea.news/p/special-report-rnc-bookings-underwhelming"
  },
  {
    "text": "The ‘Spies Who Lie’ Are Still Lying  —  Even though four years have passed, new information continues to leak out about the 51 supposed intelligence officials who signed a statement in 2020 declaring that the story about Hunter Biden's laptop had “all the hallmarks” of a Russian disinformation campaign.",
    "url": "https://hotair.com/jazz-shaw/2024/06/26/the-spies-who-lie-are-still-lying-n3790975"
  }
]