[
  {
    "text": "This Whole King Trump Thing Is Getting Awfully Literal  —  Donald Trump's claim that he has absolute immunity for criminal acts taken in office as president is an insult to reason, an assault on common sense and a perversion of the fundamental maxim of American democracy: that no man is above the law.",
    "url": "https://www.nytimes.com/2024/04/26/opinion/trump-immunity-supreme-court.html"
  },
  {
    "text": "Fake electors find out in Arizona  —  These are not very bright people, and things got out of hand.  —  ∙ Paid … On Wednesday, the denizens of Trumpworld who were foolish enough to go along with Trump's hamfisted and illegal fake elector scheme in Arizona had a nine-count indictment dropped on their heads.",
    "url": "https://www.publicnotice.co/p/arizona-fake-electors-indictment"
  },
  {
    "text": "High School AD Framed Principal With Fake AI-Generated Racist Audio: Cops  —  BRAVE NEW WORLD  —  The alleged ploy led police to arrest and charge Dazhon Darien with theft, stalking, disruption of school operations, and retaliation against a witness.  —  A Maryland high school athletic director … ",
    "url": "https://www.thedailybeast.com/high-school-athletic-director-framed-principal-with-fake-ai-generated-racist-audio"
  },
  {
    "text": "USC cancels ‘main stage’ commencement ceremony  —  USC announced Thursday that it is canceling its main May commencement ceremony, capping a dramatic series of moves that began last week after it informed valedictorian Asna Tabassum, who had been opposed by pro-Israel groups, that she would not be delivering the traditional speech.",
    "url": "https://www.latimes.com/california/story/2024-04-25/la-me-usc-commencement-canceled"
  },
  {
    "text": "Team Trump Fine With Pissing Off MAGA to Compete With Biden  —  DEBASER  —  On a pair of high-profile occasions, Trump got crosswise with his MAGA base.  It's not accidental. … NOT SO BASED DON  —  It's one of the seemingly ironclad natural laws of the Trump era … ",
    "url": "https://www.thedailybeast.com/team-trump-fine-with-pissing-off-maga-to-compete-with-biden"
  },
  {
    "text": "Republican Jewish Coalition takes on GOP who voted against Israel aid  —  with research by Toluse Olorunnipa and Tobi Raji  —  Good morning, Early Birds.  We apologize, readers.  Yesterday was not National Banana Split Day.  It is Aug. 25.  We hope you had a banana split anyway and propose that it be celebrated twice per year.",
    "url": "https://www.washingtonpost.com/politics/2024/04/26/republican-jewish-coalition-takes-gop-who-voted-against-israel-aid/"
  },
  {
    "text": "Trump VP contender Kristi Noem writes of killing dog - and goat - in new book  —  South Dakota governor includes bloody tale in campaign volume - and admits 'a better politician ... wouldn't tell the story here'  —  In 1952, as a Republican candidate for vice-president … ",
    "url": "https://www.theguardian.com/books/2024/apr/26/trump-kristi-noem-shot-dog-and-goat-book"
  },
  {
    "text": "IDF says terrorists fired mortar shells at under-construction US-led Gaza aid pier as UN officials toured site  —  Members of a terror group in the Gaza Strip launched mortars at an under-construction pier for a US-led project to bring aid into the Palestinian enclave yesterday, the military says.",
    "url": "https://www.timesofisrael.com/liveblog_entry/idf-says-mortar-fired-at-under-construction-gaza-aid-pier-as-un-officials-toured-site/"
  },
  {
    "text": "A Statement From The New York Times on Presidential News Coverage  —  A spokesperson for The New York Times responds to recent reporting about a free press and reporting on the president.  —  For anyone who understands the role of the free press in a democracy, it should be troubling … ",
    "url": "https://www.nytco.com/press/a-statement-from-the-new-york-times-on-presidential-news-coverage/"
  },
  {
    "text": "Trump Allies Draw Up Plans to Blunt Fed's Independence  —  Some Trump advisers argue that the president should be consulted on interest-rate decisions",
    "url": "https://www.wsj.com/economy/central-banking/trump-allies-federal-reserve-independence-54423c2f"
  },
  {
    "text": "DeSantis: Florida ‘will not comply’ with new Biden Title IX rules  —  Florida Gov. Ron DeSantis (R) said Thursday his state “will not comply” with recently unveiled changes to Title IX by the Biden administration.  —  “Florida rejects [President Biden's] attempt to rewrite Title IX,” … ",
    "url": "https://thehill.com/homenews/lgbtq/4621642-desantis-florida-will-not-comply-with-new-biden-title-ix-rules/"
  },
  {
    "text": "Bill that could lead to prosecution of librarians advances in Alabama House  —  Lawmakers in Alabama passed legislation that could lead to the prosecution of librarians under the state's obscenity law for providing minors with “harmful” materials.  —  The bill, approved 72-28 by the Alabama House … ",
    "url": "https://thehill.com/homenews/state-watch/4622940-bill-that-could-lead-to-prosecution-of-librarians-advances-in-alabama-house/"
  },
  {
    "text": "Scoop: Biden changes walking routine to Marine One … - Weeks ago the president told aides that he'd prefer a less formal approach, a White House official told Axios. … White House staffers and reporters alike noticed the sudden change in Biden's walk routine beginning in mid-April … ",
    "url": "https://www.axios.com/2024/04/26/biden-walkers-white-house-marine-one"
  },
  {
    "text": "COP29 climate summit host Azerbaijan defends oil and gas investments  —  Azerbaijan, host of this year's U.N. climate summit, will defend the right of oil and gas producing nations to invest in the sector, the country's president said on Friday, noting that despite climate targets, fossil fuel demand remains strong.",
    "url": "https://www.reuters.com/sustainability/climate-energy/cop29-climate-summit-host-azerbaijan-defends-oil-gas-investments-2024-04-26/"
  },
  {
    "text": "US preparing to announce $6B in weapons contracts for Ukraine  —  The package could be finalized and announced as soon as Friday, and will include Patriot systems.  —  The U.S. is putting the finishing touches on one of its largest Ukraine military aid packages to date … ",
    "url": "https://www.politico.com/news/2024/04/25/us-weapons-contract-ukraine-00154450"
  },
  {
    "text": "Blinken to meet Chinese counterpart Wang Yi in Beijing  —  U.S. Secretary of State Antony Blinken raised concerns on Friday about China's support for Russia's military, one of the many issues threatening to sour the recent improvement in relations between the world's biggest economies.",
    "url": "https://www.reuters.com/world/blinken-meet-chinese-counterpart-wang-yi-beijing-2024-04-26/"
  },
  {
    "text": "Pluralistic: Antitrust is a labor issue (25 Apr 2024)  — Antitrust is a labor issue: Banning noncompetes is huge, but it's not all the FTC is doing!  — Hey look at this: Delights to delectate.  — This day in history: 2009, 2014, 2019, 2023  — Upcoming appearances: Where to find me.",
    "url": "https://pluralistic.net/2024/04/25/capri-v-tapestry/"
  },
  {
    "text": "CNN Poll: Few think Trump is being treated the same as other defendants  —  As the first criminal prosecution of a former American president began just 13% nationwide feel Donald Trump is being treated the same as other criminal defendants, a new CNN poll conducted by SSRS finds.",
    "url": "https://www.cnn.com/2024/04/25/politics/cnn-poll-trump-trial/"
  },
  {
    "text": "Speaker Mike Johnson stands tall against hateful campus mobs  —  .  —  House Speaker Mike Johnson (R-LA) gave new evidence yesterday of having “found his voice” in defense of Western values against the threats from both international and domestic bullies and mobs.",
    "url": "https://www.washingtonexaminer.com/opinion/2980157/speaker-mike-johnson-stands-tall-against-hateful-campus-mobs/"
  }
]