[
  {
    "text": "Biden Offers to Debate Trump, With Terms, Shunning the Debate Commission  —  The president wants two debates before early voting begins, with no crowds.  Donald Trump's camp has said it would debate “anytime and anywhere.”  —  President Biden is willing to debate former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/05/15/us/politics/biden-trump-debates.html"
  },
  {
    "text": "Biden proposes June and September faceoffs with Trump, who accepts dates  —  The president said he will not participate in the traditional televised showdowns organized by the Commission on Presidential Debates.  —  President Biden said Wednesday that he will not participate … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/15/biden-trump-presidential-debates/"
  },
  {
    "text": "Biden and Trump accept CNN's invitation to debate on June 27  —  President Joe Biden and former President Donald Trump have both accepted an invitation from CNN to debate on June 27, a historically early showdown that will set the tone for the final months of the 2024 campaign.",
    "url": "https://www.cnn.com/2024/05/15/politics/joe-biden-debate/"
  },
  {
    "text": "Ron Klain, Former Chief of Staff, Will Return to Help Biden With Debate  —  Mr. Klain left the White House last year and became the chief legal officer at Airbnb.  He plans to take a vacation from his job to help President Biden prepare.  —  Ron Klain, the president's former chief of staff … ",
    "url": "https://www.nytimes.com/2024/05/15/us/politics/ron-klain-biden-trump-debate.html"
  },
  {
    "text": "Biden and Trump agree to presidential debates on June 27 on CNN and on Sept. 10 on ABC  —  President Joe Biden and former President Donald Trump on Wednesday agreed to hold two campaign debates in June and September — the first on June 27 hosted by CNN and the second on Sept. 10 hosted by ABC … ",
    "url": "https://apnews.com/article/2024-election-presidential-debates-biden-trump-6b1d1dbb2ed61c7637041b23662d7da8"
  },
  {
    "text": "‘Embarrassing’: Mitt Romney hits his fellow Republicans for traveling to Donald Trump's hush money trial  —  The parade of GOP leaders appearing outside the New York City courthouse where former President Donald Trump is on trial is “a little embarrassing,” Sen. Mitt Romney, R-Utah, said Wednesday.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/05/15/mitt-romney-donald-trump-court/73699111007/"
  },
  {
    "text": "Is Trump orchestrating a new criminal conspiracy?  —  In recent days, several high-profile Republican political figures have traveled to the Manhattan Criminal Court, where Donald Trump is on trial.  Outside the courthouse, they addressed the media and attacked key witnesses, the jury, and even the judge's daughter.",
    "url": "https://popular.info/p/is-trump-orchestrating-a-new-criminal"
  },
  {
    "text": "A GOP Texas school board member campaigned against schools indoctrinating kids.  Then she read the curriculum.  —  Courtney Gore, a Granbury ISD school board member, has disavowed the far-right platform she campaigned on.  Her defiance has brought her backlash.",
    "url": "https://www.texastribune.org/2024/05/15/texas-granbury-isd-school-board-courtney-gore/"
  },
  {
    "text": "Former far-right hard-liner says pro-voucher billionaires are using school board races to sow distrust in public education  —  The largesse from billionaires Tim Dunn and brothers Farris and Dan Wilks has made its way into local politics.  Courtney Gore, a Republican school board member in Granbury … ",
    "url": "https://www.texastribune.org/2024/05/15/texas-tim-dunn-wilks-brothers-vouchers-courtney-gore/"
  },
  {
    "text": "Warning signs for Trump: 5 takeaways from Tuesday's primaries  —  Nikki Haley's zombie presidential candidacy is still drawing a sizable slice of the Republican vote in the suburbs.  —  Donald Trump showed weakness in the suburbs in Tuesday's primaries, while Joe Biden's problem with the protest vote appeared to fade.",
    "url": "https://www.politico.com/news/2024/05/15/maryland-nebraska-west-virginia-primaries-takeaways-00158068"
  },
  {
    "text": "And then there were two: Seventh Native American tribe bans Gov. Noem  —  The Crow Creek Sioux Tribe in central South Dakota has joined six of the state's tribes in preventing Gov. Kristi Noem from coming onto their tribal land, leaving the governor just two reservations she can still travel to.",
    "url": "https://www.thedakotascout.com/p/and-then-there-were-two-seventh-native"
  },
  {
    "text": "Nikki Haley gathers her donors and ignores Trump  —  Haley didn't endorse the former president or push her supporters to back him.  —  Donald Trump may be the presumptive Republican presidential nominee, but Nikki Haley isn't offering him her support or donor network yet.",
    "url": "https://www.politico.com/news/2024/05/15/at-private-donor-event-haley-thanks-supporters-and-ignores-trump-00158058"
  },
  {
    "text": "Revealed: Magician David Copperfield accused of sexual misconduct by multiple women  —  A total of 16 women have accused Copperfield of sexual misconduct and inappropriate behavior spanning decades.  More than half said they were teenagers at the time.  Copperfield's lawyers say the allegations … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/15/david-copperfield-investigation"
  },
  {
    "text": "Bibi's rant: Israel isn't a “vassal state” of the U.S. … - It was a shot across the bow to show Netanyahu how concerned Biden remains about the prime minister continuing to say he's planning to order an invasion of Rafah, where more than 1 million displaced Palestinians have taken shelter.",
    "url": "https://www.axios.com/2024/05/15/netanyahu-israel-rant-biden-gaza-war"
  },
  {
    "text": "17% of Voters Blame Biden for the End of Roe  —  The mistaken belief, in a new poll, shows how even as abortion is mobilizing Democrats, confusion over the issue is also a challenge.  —  Nearly one in five voters in battleground states says that President Biden is responsible for ending … ",
    "url": "https://www.nytimes.com/2024/05/15/upshot/abortion-biden-trump-blame.html"
  },
  {
    "text": "Trump's run-out-the-clock legal strategy worked  —  Every case other than New York is stalled out.  Mission accomplished. … No matter what happens with Donald Trump's other criminal cases, we'll always have New York, where he's been walloped with two sets of civil penalties … ",
    "url": "https://www.publicnotice.co/p/trump-legal-delay-tactics-worked-cannon-willis"
  },
  {
    "text": "Republicans probing Jan. 6 investigation asks star witness Cassidy Hutchinson for more documents  —  A House Administration oversight panel wants Hutchinson to provide information about her book deal as well as communications with former Rep. Liz Cheney and top Trump White House officials.",
    "url": "https://www.nbcnews.com/politics/congress/gop-committee-probing-jan-6-investigation-asks-star-witness-cassidy-hu-rcna152324"
  },
  {
    "text": "US says Boeing breached 2021 737 MAX criminal prosecution deal  —  The U.S. Justice Department said late on Tuesday that Boeing Co (BA.N) had breached its obligations in a 2021 agreement that shielded the planemaker from criminal prosecution over fatal 737 MAX crashes in 2018 and 2019 that killed 346 people.",
    "url": "https://www.reuters.com/business/aerospace-defense/us-says-boeing-breached-2021-deferred-prosecution-737-max-agreement-2024-05-14/"
  }
]