[
  {
    "text": "This Crew Is Totally Beatable  —  At the climax of the Republican National Convention last night, former President Donald Trump's nomination-acceptance speech was a disheveled mess, endless and boring.  He spoke for 93 minutes, the longest such speech on record.",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/donald-trump-republican-party-nomineee/679109/"
  },
  {
    "text": "Was That the Worst Convention Speech of All Time?  —  I hope that you were not, like me, required to watch Donald Trump's speech at the Republican National Convention on Thursday night (and into Friday morning), and were instead doing something more enjoyable: Going out with friends … ",
    "url": "https://jill.substack.com/p/was-that-the-worst-convention-speech"
  },
  {
    "text": "Trump did something he's never done before with RNC speech.  Now, the election may already be over  —  I may be a Democrat, but I'm also a clear-eyed political analyst.  Donald Trump clearly rose to the occasion with his RNC speech  —  Donald Trump may well have sealed the outcome … ",
    "url": "https://www.foxnews.com/opinion/trump-did-something-hes-never-done-before-rnc-speech-now-election-may-already-over"
  },
  {
    "text": "Trump tramples unity theme in two-act convention speech … - Inside the Fiserv Forum, the ebullient mood gave way to rapt silence. … - “I stand before you in this arena only by the grace of Almighty God,” he said, echoing a long list of GOP convention speakers who had cited divine intervention for Trump's survival.",
    "url": "https://www.axios.com/2024/07/19/trump-convention-speech-unity-biden"
  },
  {
    "text": "Rep. Sean Casten: It's time for Joe Biden to pass the torch  —  Our country faces an existential threat this November.  —  On the one hand, we have Joe Biden.  A man who passed the biggest climate and infrastructure bills in our nation's history; expanded NATO; has overseen record-breaking economic growth … ",
    "url": "https://www.chicagotribune.com/2024/07/19/opinion-joe-biden-presidential-candidacy-pass-the-torch/"
  },
  {
    "text": "Biden's family starts discussing his exit plan from the 2024 race  —  The president's family members have discussed how he would want to end his re-election bid on his own timing and with a carefully calculated plan in place.  —  WASHINGTON — Members of President Joe Biden's family … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/bidens-family-starts-discussing-exit-plan-2024-race-rcna162658"
  },
  {
    "text": "AOC Issues Dire Warning on Threats to Come if Biden Drops Out  —  On Instagram Live early Friday morning, Representative Alexandria Ocasio-Cortez discussed the ongoing debate over whether President Biden is fit to run for reelection.  —  Speaking for close to an hour, the New York progressive explained … ",
    "url": "https://newrepublic.com/post/184042/aoc-alexandria-ocasio-cortez-warning-biden-drop-out-instagram-live"
  },
  {
    "text": "Global cyber outage grounds flights, hits banks, telecoms, media  —  A software update wreaked havoc on computer systems globally on Friday, grounding flights, forcing some broadcasters off air and hitting services from banking to healthcare.  —  An update to a product offered … ",
    "url": "https://www.reuters.com/technology/global-cyber-outage-grounds-flights-hits-media-financial-telecoms-2024-07-19/"
  },
  {
    "text": "Fact Checking Donald Trump's RNC Speech  —  In his latest bid for reelection, Donald Trump delivered the longest nomination acceptance speech in US history, peppered with so many falsehoods that it's impossible to fact-check them all in a single article.  Perhaps that was the point.",
    "url": "https://www.qasimrashid.com/p/fact-checking-donald-trumps-rnc-speech"
  },
  {
    "text": "Vice President Kamala Harris to Speak With Major Democratic Donors  —  The call comes as turmoil roils the party and its donor base.  —  Vice President Kamala Harris is set to address a network of major Democratic donors on short notice Friday afternoon, according to two people invited to the call.",
    "url": "https://www.nytimes.com/2024/07/19/us/politics/kamala-harris-donors.html"
  },
  {
    "text": "Charlottesville tiki torch rioter endorses Donald Trump at his Jan. 6 sentencing  —  Tyler Bradley Dykes, who prosecutors say performed a Nazi salute during the U.S. Capitol attack, was sentenced to more than four years in federal prison.  —  WASHINGTON — A far-right extremist who already served … ",
    "url": "https://www.nbcnews.com/politics/justice-department/charlottesville-tiki-torch-rioter-endorses-donald-trump-jan-6-sentenci-rcna162209"
  },
  {
    "text": "Foreign officials courted Trump allies at the Republican convention  —  A number of ambassadors from other countries came to Milwaukee to get ready for a second Trump administration.  —  MILWAUKEE — Top foreign officials courted Donald Trump's allies during the Republican National Convention … ",
    "url": "https://www.nbcnews.com/politics/2024-election/foreign-officials-courted-trump-allies-republican-convention-rcna161873"
  },
  {
    "text": "Zuckerberg Calls Trump's Response to Shooting ‘Badass’  —  Meta CEO doesn't endorse Trump or Biden for president  —  Mark Zuckerberg said that former President Donald Trump's immediate reaction after being shot was “badass” and inspiring, and helps explain his appeal to voters.",
    "url": "https://www.bloomberg.com/news/articles/2024-07-19/mark-zuckerberg-calls-donald-trump-badass-without-endorsing-for-president"
  },
  {
    "text": "George W. Bush's Attorney General Is Worried About Trump  —  Alberto Gonzales discusses the Supreme Court's ruling on presidential immunity — and the prospect of a second Trump administration with more vendettas and fewer guardrails.  —  As the onetime White House counsel … ",
    "url": "https://www.politico.com/news/magazine/2024/07/19/alberto-gonzales-interview-trump-00167350"
  },
  {
    "text": "Leaked memo shows J.D. Vance's anti-woke ideology on foreign affairs  —  Trump's VP pick froze dozens of ambassador nominations over issues like gender transition care and diversity hiring, offering a glimpse into his anti-establishment views.  —  Before J.D. Vance became Donald Trump's pick … ",
    "url": "https://www.washingtonpost.com/elections/2024/07/19/jd-vance-leaked-memo-state-department/"
  },
  {
    "text": "The Zeal of a Convert  —  Much of the coverage of JD Vance presents has implied, if not outright stated, that Vance is a hypocrite and opportunist.  How else do you explain someone who denounced Trump in a myriad of ways, and then jumped onto Trump bandwagon when struggling in his primary race?",
    "url": "https://donmoynihan.substack.com/p/the-zeal-of-a-convert"
  }
]