[
  {
    "text": "Why Kamala Harris chose Tim Walz  —  Harris and Walz didn't know each other but quickly clicked.  —  Kamala Harris loved Tim Walz's governing record in Minnesota.  His biography and record of winning tough races resonated with her.  And most of all, she just really liked him.",
    "url": "https://www.politico.com/news/2024/08/06/why-kamala-harris-chose-tim-walz-00172834"
  },
  {
    "text": "55 Things to Know About Tim Walz, Kamala Harris' Pick for VP  —  The governor of Minnesota had a career in the National Guard and as a high school teacher before he got into politics in the early 2000s.  —  Tim Walz, the governor of Minnesota, once said he never expected … ",
    "url": "https://www.politico.com/news/magazine/2024/08/06/tim-walz-55-things-harris-vp-00172790"
  },
  {
    "text": "Why Tim Walz is the Right Choice for VP  —  The Minnesota Governor is an unconventional pick, but he makes sense on the ticket.  —  ∙ Paid  —  The pick is in — Vice President Kamala Harris has chosen Minnesota Governor Tim Walz as her running mate.  Her pick was a surprise.",
    "url": "https://www.messageboxnews.com/p/why-tim-walz-is-the-right-choice"
  },
  {
    "text": "Harris decides on Tim Walz as running mate  —  Vice President Kamala Harris has made a decision on her running mate, with four people close to the process saying Gov. Tim Walz of Minnesota is her choice.  —  The selection caps the Midwestern Democrat's short but swift ascent from a relative unknown … ",
    "url": "https://www.cnn.com/2024/08/06/politics/tim-walz-harris-vice-president/"
  },
  {
    "text": "The Walz Pick and America's Urban-Rural Divide  —  AND THE WINNER of the Democratic veepstakes is . . . Tim Walz, who makes perfect sense.  He's a popular, plainspoken, moderate Midwestern governor, a former teacher, a football coach, a gun owner who hunts pheasant and turkey … ",
    "url": "https://www.thebulwark.com/p/tim-walz-vp-pick-democratic-coalition"
  },
  {
    "text": "Kamala Harris and Tim Walz Need to Pivot to the Center Right Now … When Kamala Harris emerged as the Democratic presidential nominee, I expressed cautious optimism that she had learned from her disastrous 2020 campaign, which revolved around placating left-wing activists by adopting highly unpopular issue positions.",
    "url": "https://nymag.com/intelligencer/article/kamala-harris-tim-walz-moderate-liberal-progressive-centrist.html"
  },
  {
    "text": "Tim Walz is a Minnesota Nice choice  —  It's fine.  But Shapiro was the higher-upside option that was probably worth the risk.  —  Wikipedia defines “Minnesota Nice” — the property stereotypically associated with the home state of Kamala Harris's new running mate, Gov. Tim Walz — as follows:",
    "url": "https://www.natesilver.net/p/tim-walz-is-a-minnesota-nice-choice"
  },
  {
    "text": "Walz unifies the party, will bring working class voters back into the fold  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/opinion/4813955-kamala-harris-tim-walz/"
  },
  {
    "text": "X, Owned by Elon Musk, Brings Antitrust Suit Accusing Advertisers of a Boycott  —  The company claimed that members of the Global Alliance for Responsible Media coordinated to dissuade brands from advertising on X.  —  X on Tuesday filed a lawsuit against the Global Alliance for Responsible Media … ",
    "url": "https://www.nytimes.com/2024/08/06/technology/x-antitrust-suit-advertisers-elon-musk.html"
  },
  {
    "text": "Trump's Campaign Is Drowning in Rage … There was One (very) Angry Man at the Georgia State University Convocation Center last Saturday.  Donald Trump had harsh words for everyone.  He insulted his general election opponent, “Crazy Kamala” Harris, for her “low IQ,” and jeered at President Joe Biden for … ",
    "url": "https://newrepublic.com/article/184569/trumps-campaign-drowning-rage"
  },
  {
    "text": "Walz Has Faced Criticism for His Response to George Floyd Protests  —  Some believe that Gov. Tim Walz should have deployed the Minnesota National Guard sooner when riots broke out following the police murder of George Floyd.  —  A little more than a year into Tim Walz's first term as governor, he faced his biggest test.",
    "url": "https://www.nytimes.com/2024/08/06/us/tim-walz-george-floyd-criticism.html"
  },
  {
    "text": "Harris has chosen Minnesota Gov. Tim Walz as VP pick  —  Walz, who has a record of winning over rural conservative voters, is little-known on the national stage  —  Vice President Harris has chosen Minnesota Gov. Tim Walz to be her running mate, opting for a former high school teacher … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/06/harris-walz-vp/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIyOTE2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI0Mjk5MTk5LCJpYXQiOjE3MjI5MTY4MDAsImp0aSI6IjliY2U4NjcxLTZlMzYtNDU3ZC1hODJkLWMwZjNkM2Q5YzExZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzA2L2hhcnJpcy13YWx6LXZwLyJ9.UJrMy1_qXVw1yjNDl61HYo2MEE1svNmXHnvy17nHszM&itid=gfta"
  },
  {
    "text": "FBI agents execute search warrant on Tennessee Congressman Andy Ogles, NewsChannel 5 confirms  —  NASHVILLE, Tenn. (WTVF) — FBI agents executed a search warrant late last week on Tennessee Congressman Andy Ogles as the first-term Republican faces continuing scrutiny over fraudulent campaign financial reports … ",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/revealed/fbi-agents-execute-search-warrant-on-tennessee-congressman-andy-ogles-newschannel-5-confirms"
  },
  {
    "text": "EPA Issues Emergency Order to Stop Use of Pesticide Dacthal to Address Serious Health Risk  —  WASHINGTON - Today, Aug. 6, the U.S. Environmental Protection Agency is announcing the emergency suspension of all registrations of the pesticide dimethyl tetrachloroterephthalate (DCPA or Dacthal) … ",
    "url": "https://www.epa.gov/newsreleases/epa-issues-emergency-order-stop-use-pesticide-dacthal-address-serious-health-risk-4"
  },
  {
    "text": "Potential Dem VP Picks with Low Name Recognition... Kelly & Shapiro Fare Better than Walz  —  The Democrats on Vice President Kamala Harris' Veepstakes shortlist are unknown to a good deal of Americans.  However, Mark Kelly and Josh Shapiro are better known and are more popular than Tim Walz.",
    "url": "https://maristpoll.marist.edu/polls/the-harris-veepstakes/"
  },
  {
    "text": "Republicans Resurface Tim Walz' 1995 Mugshot as Attacks Heat Up  —  DIGGING UP DIRT  —  The Minnesota governor gave up alcohol after the incident in 1995.  —  Tim Walz' mugshot from a 1995 DUI arrest went viral Tuesday just as Kamala Harris announced the Minnesota governor was joining her presidential ticket.",
    "url": "https://www.thedailybeast.com/tim-walz-old-mugshot-circulates-after-harris-picks-him-for-vp-ticket"
  },
  {
    "text": "Revealed: US neo-Nazi terror group aims to revive activities ahead of election  —  The Russia-based leader of the Base, which adheres to principles of accelerationism, seeks ‘A-team leader’ in US  —  While far-right extremists from all corners of the internet are targeting vice-president Kamala Harris … ",
    "url": "https://www.theguardian.com/world/article/2024/aug/06/us-neo-nazi-base-election-rinaldo-nazzaro"
  },
  {
    "text": "Trump says he will sit for interview with Elon Musk  —  Former President Trump said Tuesday he will be interviewed by billionaire tech and media mogul Elon Musk next week.  —  “ON MONDAY NIGHT I'LL BE DOING A MAJOR INTERVIEW WITH ELON MUSK — Details to follow,” Trump wrote in a short post on his Truth Social website.",
    "url": "https://thehill.com/homenews/media/4814097-trump-elon-musk-interview/"
  }
]