[
  {
    "text": "'I'm a black NAZI!':  NC GOP nominee for governor made dozens of disturbing comments on porn forum  —  Editor's Note: The below story contains offensive language.  —  Mark Robinson, the controversial and socially conservative Republican nominee for governor of North Carolina … ",
    "url": "https://www.cnn.com/2024/09/19/politics/kfile-mark-robinson-black-nazi-pro-slavery-porn-forum"
  },
  {
    "text": "Robinson under pressure to withdraw from gubernatorial race  —  North Carolina Republicans are bracing Thursday morning as word spreads about a damning news story looming regarding Lt. Gov. Mark Robinson.  —  Sources with direct knowledge have spoken with Carolina Journal on the condition … ",
    "url": "https://www.carolinajournal.com/robinson-under-pressure-to-withdraw-from-gubernatorial-race/"
  },
  {
    "text": "Email address belonging to Mark Robinson found on Ashley Madison  —  An adviser to the North Carolina Republican confirmed the email address belongs to him.  —  An email address belonging to North Carolina Lt. Gov. Mark Robinson was registered on Ashley Madison, a website designed for married people seeking affairs.",
    "url": "https://www.politico.com/news/2024/09/19/north-carolina-lt-governor-mark-robinson-ashley-madison-00180107"
  },
  {
    "text": "N.C. Republican vows to continue campaign for governor amid fallout of CNN story  —  Mark Robinson, the Republican nominee for governor in North Carolina, vowed to continue his campaign Thursday amid the fallout over a CNN story about comments he made on a pornographic website's message board more than a decade ago.",
    "url": "https://www.washingtonpost.com/elections/2024/09/19/mark-robinson-north-carolina-governor/"
  },
  {
    "text": "Mark Robinson vows to stay in N.C. governor race following report he made inflammatory comments on porn site  —  Robinson denied the CNN report, which stated that he referred to himself as a “black NAZI” and expressed support for bringing back slavery.  —  Mark Robinson, the Republican candidate … ",
    "url": "https://www.nbcnews.com/politics/2024-election/mark-robinson-vows-stay-north-carolina-governor-race-cnn-report-rcna171860"
  },
  {
    "text": "Robinson says he's staying in NC governor's race after bombshell CNN report  —  North Carolina Lt. Gov. Mark Robinson (R) on Thursday said he's staying in the gubernatorial race following speculation throughout the day that he might drop out in response to an explosive CNN report.",
    "url": "https://thehill.com/homenews/campaign/4889150-north-carolina-lieutenant-governor-mark-robinson/"
  },
  {
    "text": "Casey leading McCormick in Pennsylvania Senate polling  —  Pennsylvania Sen. Bob Casey (D) is leading his Republican rival Dave McCormick in new Keystone State polling.  —  In a new poll from The Philadelphia Inquirer/The New York Times/Siena College, Casey garnered 49 percent support … ",
    "url": "https://thehill.com/homenews/campaign/4889171-casey-leads-mccormick-pennsylvania-poll/"
  },
  {
    "text": "Trump and Johnson's Shocking Bid to Suppress Women's Votes  —  Republicans don't want women to vote.  They now think they may have a strategy that could help make that happen.  —  House Speaker Mike Johnson and former president Donald Trump were pushing the SAVE Act (Safeguard American Eligibility Act) … ",
    "url": "https://hartmannreport.com/p/trump-and-johnsons-shocking-bid-to-1f1"
  },
  {
    "text": "J.D. Vance's Weak Excuse for “Pet Eating” Lie Just Blew Up In His Face … Prepare to be shocked: At around the time J.D. Vance started dissembling about Haitians eating people's house pets, a Vance campaign staffer privately spoke with the city manager of Springfield, Ohio, where thousands of Haitians have settled.",
    "url": "https://newrepublic.com/series/48/jd-vances-weak-excuse-pet-eating-lie-just-blew-face"
  },
  {
    "text": "With one exaggerated anecdote, Trump kneecaps his Jan. 6 defense  —  Appearing on Fox News on Wednesday, Trump told a story he's told before — one in which a politician is threatened by angry Trump boosters and he calls them off.  —  Donald Trump's tough-guy shtick plays well on Fox News … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/19/with-one-exaggerated-anecdote-trump-kneecaps-his-jan-6-defense/"
  },
  {
    "text": "To Understand JD Vance, You Need to Meet the “TheoBros”  —  On July 15, when former President Donald Trump first appeared at the Republican National Convention in Milwaukee, he brought along two new accessories.  One was a large bandage covering his ear, which had been nicked by a would-be assassin's bullet.",
    "url": "https://www.motherjones.com/politics/2024/09/theobros-jd-vance-christian-nationalism/"
  },
  {
    "text": "Local Teamsters unions in swing states rush to endorse Harris  —  The powerful national union declared this week that it would not endorse a Democrat for the first time in nearly three decades.  —  A wave of local and regional Teamsters union branches in battleground states rushed … ",
    "url": "https://www.washingtonpost.com/business/2024/09/19/teamsters-endorsement-harris-trump/"
  },
  {
    "text": "“Delusional and unsettling”: Trump forgets there was no debate audience, claims crowd “went crazy”  —  Appearing on Fox News, the 78-year-old Republican claimed that he won over an audience that did not exist  —  Former President Donald Trump appeared on a taped segment of Fox News' “Gutfeld!”",
    "url": "https://www.salon.com/2024/09/19/delusional-and-unsettling-forgets-there-was-no-debate-audience-claims-crowd-went-crazy/"
  },
  {
    "text": "Harris Leads Trump by 13 Points, 55-42%, Similar to 53-39% in August; In Multi-Candidate Race, Harris Leads by 12 Points, Same as August  — Voters Trust Harris More on Abortion, Democracy, Economy; Immigration Tied  — Gillibrand Leads Sapraicone 54-31%; NYS Proposed ERA Favored 64-23%",
    "url": "https://scri.siena.edu/2024/09/19/harris-leads-trump-by-13-points-55-42-similar-to-53-39-in-august-in-multi-candidate-race-harris-leads-by-12-points-same-as-august/"
  },
  {
    "text": "Secret Service Probing Musk's Post About Threats to Biden and Harris  —  The Secret Service is looking into Elon Musk's post on X that suggested it was strange no one attempted to assassinate President Joe Biden or Vice President Kamala Harris.  In response to a FOIA request … ",
    "url": "https://www.bloomberg.com/news/newsletters/2024-09-19/musk-x-post-about-biden-harris-threats-leads-to-secret-service-investigation"
  },
  {
    "text": "Fact check: 12 completely fictional stories Trump has told in the last month  —  Former President Donald Trump is littering his public remarks with fictional stories.  —  This isn't run-of-the-mill political spin, the kind of statistic-twisting and accomplishment-exaggerating that political candidates of all stripes engage in.",
    "url": "https://www.cnn.com/2024/09/19/politics/fact-check-donald-trump-fictional-stories/"
  },
  {
    "text": "Producers had to heavily edit The Apprentice to stop Trump from looking like a ‘complete moron’, authors claim  —  ‘That quality that was really bad for him in business was solid gold on the show,’ author says  —  Your support helps us to tell the story  —  As your White House correspondent … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/donald-trump-the-apprentice-lucky-loser-moron-b2615226.html"
  },
  {
    "text": "Winner-take-all push gets help of Gov. Jim Pillen, Sen. Lindsey Graham, Trump  —  Nebraska Electoral College change would need 33 votes to overcome promised filibuster  —  LINCOLN — The national Republican push to help former President Donald Trump win all five of Nebraska's Electoral College votes … ",
    "url": "https://nebraskaexaminer.com/2024/09/18/winner-take-all-push-gets-help-of-gov-jim-pillen-sen-lindsey-graham-trump/"
  },
  {
    "text": "Alaska Man Arrested for Threatening U.S. Supreme Court Justices, Their Family Members  —  For Immediate Release  —  An Alaska man was arrested yesterday in Anchorage for allegedly threatening to injure and kill six U.S. Supreme Court Justices and some of their family members.",
    "url": "https://www.justice.gov/opa/pr/alaska-man-arrested-threatening-us-supreme-court-justices-their-family-members"
  },
  {
    "text": "MAGA Boat Parade Dude Snaps At CNN Reporter: ‘Nobody Gave Me S**t!’  —  The journalist prodded the Trump supporter a bit and got a sassy earful.  —  LOADING  —  A MAGA boat parade participant got salty at a CNN correspondent's suggestion that he was well off and might not be so affected by economic concerns.",
    "url": "https://www.huffpost.com/entry/elle-reeve-maga-boat-parade-nobody-gave-me-shit-cnn_n_66ec05dae4b00648275c08e9"
  }
]