[
  {
    "text": "How Far Trump Would Go  —  The former President, at Mar-a-Lago on April 12, is rallying the right at home and seeking common cause with autocratic leaders abroad.Photograph by Philip Montgomery for TIME  —  Donald Trump thinks he's identified a crucial mistake of his first term: He was too nice.",
    "url": "https://time.com/6972021/donald-trump-2024-election-interview/"
  },
  {
    "text": "Read the Full Transcripts of Donald Trump's Interviews With TIME … Over the course of the interviews, Trump discussed his agenda for a second term, which includes deporting millions of people, cutting the U.S. civil service, and intervening more directly in Justice Department prosecutions than his predecessors.",
    "url": "https://time.com/6972022/donald-trump-transcript-2024-election/"
  },
  {
    "text": "Biden and Democrats Seize on Trump's Striking Interview  —  The president and other top Democrats moved quickly to capitalize politically on Donald J. Trump's interview with Time magazine, particularly his comments on abortion.  —  The Biden campaign is mounting a concerted push … ",
    "url": "https://www.nytimes.com/2024/04/30/us/politics/biden-democrats-trump-interview.html"
  },
  {
    "text": "Here's where campus protesters have been arrested over the past day.  —  Columbia in New York and Portland State University closed their campuses after pro-Palestinian demonstrators took over buildings.  More than 1,100 protesters have been arrested across the country in recent weeks.",
    "url": "https://www.nytimes.com/live/2024/04/30/nyregion/columbia-protests-college"
  },
  {
    "text": "Northwestern Cuts Deal with Encampment Organizers, Establishes Full-Ride Scholarship for Palestinian Students  —  After five days of anti-Israel demonstrators occupying Deering Meadow on Northwestern University's campus, Northwestern president Michael Schill and the rest of the university's leadership decided … ",
    "url": "https://www.nationalreview.com/news/northwestern-cuts-deal-with-encampment-organizers-establishes-full-ride-scholarship-for-palestinian-students/"
  },
  {
    "text": "GOP senator calls for deporting certain foreign student protesters  —  Sen. Marsha Blackburn (R-Tenn.) called for the U.S. government to revoke the visas given to international students who are Hamas sympathizers and deport them as college protests continue nationwide.",
    "url": "https://thehill.com/policy/international/4634492-gop-senator-calls-for-deporting-certain-foreign-student-protesters/"
  },
  {
    "text": "US drug control agency will move to reclassify marijuana in a historic shift, AP sources say  —  The U.S. Drug Enforcement Administration will move to reclassify marijuana as a less dangerous drug, The Associated Press has learned, a historic shift to generations of American drug policy … ",
    "url": "https://apnews.com/article/marijuana-biden-dea-criminal-justice-pot-f833a8dae6ceb31a8658a5d65832a3b8"
  },
  {
    "text": "Biden administration plans to reclassify marijuana, easing restrictions nationwide  —  Cannabis is currently classified along with drugs like heroin and LSD.  The DEA is expected to reschedule it into a category that includes Tylenol and steroids.  —  WASHINGTON — The Biden administration … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-administration-plans-reclassify-marijuana-easing-restrictions-na-rcna149424"
  },
  {
    "text": "White House considers admitting some Palestinians from Gaza as refugees  —  The Biden administration is considering admitting certain Palestinians to the U.S. as refugees, a report by CBS News found.  —  Senior officials in several U.S. agencies have discussed the idea of resettling Palestinians … ",
    "url": "https://thehill.com/homenews/administration/4634560-white-house-considers-admitting-some-palestinians-gaza-refugees/"
  },
  {
    "text": "Judges Reject Map That Would Have Given Louisiana New Majority-Black House District  —  The decision is likely to be appealed to the Supreme Court, leaving Louisiana in congressional district limbo for now.  —  LOADING  —  A new congressional district map giving Louisiana … ",
    "url": "https://www.huffpost.com/entry/louisiana-congressional-district-map-rejected_n_66317c32e4b0c558f74224ce"
  },
  {
    "text": "‘Jeffrey Clark betrayed his oath’: Trump DOJ lawyer behind fake electors plot should be disbarred, disciplinary panel says  —  The District of Columbia's Office of Disciplinary Counsel issued a recommendation this week battering the credibility of former Donald Trump Justice Department attorney Jeffrey Clark … ",
    "url": "https://lawandcrime.com/high-profile/jeffrey-clark-betrayed-his-oath-trump-doj-lawyer-behind-fake-electors-plot-should-be-disbarred-disciplinary-panel-says/"
  },
  {
    "text": "After Ukraine Aid Vote, Republicans Braced for Backlash Find Little  —  Some Republicans who backed the aid encountered little resistance from voters, who were far more willing to embrace it — and less interested in ousting the speaker over it — than their right-wing colleagues.",
    "url": "https://www.nytimes.com/2024/04/30/us/politics/republicans-ukraine-aid-vote.html"
  },
  {
    "text": "Democrat Tim Kennedy wins New York special election for House seat  —  Once he is sworn in to represent the state's 26th Congressional District, the Republican majority in the chamber will temporarily fall to just one vote.  —  State Sen. Tim Kennedy (D) is projected to win the special election … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/30/new-york-special-election-house-kennedy/"
  },
  {
    "text": "Judge holds Trump in contempt for violating gag order in hush money trial  —  Prosecutors from the Manhattan District Attorney's Office accused Trump of violating the gag order numerous times since it went into effect.  —  The judge presiding over Donald Trump's hush money case on Tuesday held … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-holds-trump-contempt-violating-gag-order-hush-money-trial-rcna149101"
  },
  {
    "text": "Live Updates: Lawyer for Stormy Daniels Takes Stand in Trump Criminal Trial  —  Keith Davidson, who negotiated the $130,000 hush-money payment at the heart of the case, has begun testifying.  Earlier, the judge overseeing the trial fined Donald J. Trump $9,000 and warned he could be jailed if he continued to violate his gag order.",
    "url": "https://www.nytimes.com/live/2024/04/30/nyregion/trump-hush-money-trial"
  },
  {
    "text": "Why I'm Resigning From The Intercept  —  I resigned from The Intercept today in order to pursue a new kind of journalism here on Substack, one more hard-hitting than what's possible in the corporate world.  The Intercept has been taken over by suits who have abandoned its founding mission … ",
    "url": "https://www.kenklippenstein.com/p/why-im-resigning-from-the-intercept"
  },
  {
    "text": "USPol #USPolitics #Politics #Fascism  —  11 thoughts on “#USPol #USPolitics #Politics #Fascism”  —  @ArpComics Peaceful protesters who don't trespass or cause damage to property are for the most part left to protest peacefully.  What is happening now is an embarrassment and is in no way a protest.",
    "url": "https://whatwasidoingagain.com/notes/9a42a0bdb1/"
  },
  {
    "text": "Fox Business Host Goes There: Biden's ‘Woke’ Tax Policies Are Anti-White  —  QUIET PART OUT LOUD  —  Larry Kudlow on Tuesday made the assumption that Joe Biden's tax policies are part of a bigger scheme against conservatives.  —  Fox Business Network host and former Trump White House … ",
    "url": "https://www.thedailybeast.com/fox-business-host-larry-kudlow-labels-bidens-woke-tax-policies-as-anti-white"
  },
  {
    "text": "How a Few Secret Donors Are Fueling the New Right-Wing Infrastructure  —  The Bradley Impact Fund helps finance the work of groups led by Michael Flynn and Stephen Miller.  Most of the money can be traced to four undisclosed sources, documents show.  —  In early 2021, Stephen Miller … ",
    "url": "https://www.motherjones.com/politics/2024/04/bradly-impact-fund-michael-flynn-stephen-miller-culture-war-project-veritas-american-first-legal-cpi/"
  },
  {
    "text": "Barnard president loses vote of no confidence as criticism mounts over protest response  —  The president of Barnard College at Columbia University lost a faculty-wide vote of no confidence on Tuesday, as criticism mounts over the school's response to a pro-Palestine encampment that has sparked … ",
    "url": "https://thehill.com/homenews/education/4634350-barnard-president-loses-vote-of-no-confidence-palestine-protest-response/"
  },
  {
    "text": "Philips Agrees to Pay $1 Billion to Patients Who Say They Were Injured by Breathing Machines  —  The proposed settlement will effectively end more than 700 lawsuits filed after the 2021 recall of millions of the company's widely used sleep apnea devices and ventilators.  —  Co-published with Pittsburgh Post-Gazette",
    "url": "https://www.propublica.org/article/philips-lawsuit-settlement-cpap-breathing-machine-recall"
  },
  {
    "text": "Fox News Quietly Deletes Hunter Biden ‘Mock Trial’ Series  —  ‘HOLDING THEM ACCOUNTABLE’  —  The conservative cable giant has quickly moved to comply with the presidential scion's demands. … Fox News appears to be taking Hunter Biden's lawsuit threat quite seriously.",
    "url": "https://www.thedailybeast.com/fox-news-quietly-deletes-hunter-biden-mock-trial-special-following-lawsuit-threat"
  }
]