[
  {
    "text": "The simple reason Republican Sunday show hits are disasters  —  It's hard to defend the indefensible. … Not so long ago, the Sunday morning news shows were a vital part of the political ecosphere.  Politicians and government officials clamored for the mainstream platform provided by ABC's This Week … ",
    "url": "https://www.publicnotice.co/p/stephanopoulos-mace-sununu-gop-sunday-shows"
  },
  {
    "text": "Rubio Wants to Go From ‘Little Marco’ to Trump's VP  —  BIG GULP  —  Eight years after feuding with Trump about their relative penis sizes, Rubio is trying to glad-hand his way into The Donald's veep slot. … FROM ‘LITTLE MARCO’ TO VP CONTENDER  —  At Donald Trump's donor retreat … ",
    "url": "https://www.thedailybeast.com/rubio-wants-to-go-from-little-marco-to-trumps-vp"
  },
  {
    "text": "House Democrats' Surprise Campaign Play: Embracing Border Security  —  Republicans blamed Biden for surge in illegal crossings but blocked bipartisan deal  —  WASHINGTON—Some House Democrats are leaning into border security on the campaign trail after years of playing defense against Republican criticism … ",
    "url": "https://www.wsj.com/politics/elections/house-democrats-surprise-campaign-play-embracing-border-security-7d2bf74f"
  },
  {
    "text": "‘We would need to make choices’: Why Biden is threatening Israel now  —  Biden's announcement is an unintentional admission that his efforts to privately sway Netanyahu have had limited effects.  —  After watching Israel flatten much of Gaza, President Joe Biden decided to draw the line at the city of Rafah.",
    "url": "https://www.politico.com/news/2024/05/09/why-biden-is-threatening-israel-rafah-00157203"
  },
  {
    "text": "Biden's big donors fume over Israel criticism … - “Bad, Bad, Bad, decision, on all levels, Pls reconsider,” he wrote in a message obtained by Axios and other news outlets.  — He added: “Let's not forget that there are more Jewish voters, who care about Israel, than Muslim voters that care about Hamas.”",
    "url": "https://www.axios.com/2024/05/10/israel-gaza-biden-rafah-donors"
  },
  {
    "text": "Trump team throws out GOP plan and builds a ‘leaner’ 2024 operation  —  The new plan calls for fewer offices, less staff and a focus on new partnerships with outside groups — raising concerns among some Republicans.  —  Donald Trump's 2020 campaign called itself a “juggernaut” … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/10/trump-gop-field-operation/"
  },
  {
    "text": "Virginia school board votes to restore Confederate names to two schools  —  School board members in Virginia's Shenandoah County voted early Friday to restore the names of two schools that previously honored Confederate leaders - four years after those names had been removed.",
    "url": "https://www.cnn.com/2024/05/09/us/shenandoah-county-confederate-school-names-reaj/"
  },
  {
    "text": "Jim Jordan's quiet power play for 2025 … - Jordan privately told colleagues what he would be doing differently than Johnson during the recent fight over foreign aid funding, multiple sources told Axios.  — The Ohio Republican has been noticed handing out more campaign checks to colleagues, multiple lawmakers told Axios.",
    "url": "https://www.axios.com/2024/05/09/mike-johnson-jim-jordan-trump-speaker"
  },
  {
    "text": "Trump's trial trap: Voters to be his most important jury … - “It really is an all-or-nothing strategy in the sense that the delaying tactic could be a complete victory if he were to be elected president,” said Robert Mintz, a former federal prosecutor.  — Judges have latitude in sentencing … ",
    "url": "https://www.axios.com/2024/05/10/trump-criminal-trials-2024-election"
  },
  {
    "text": "Rick Scott tries to rewrite history on $1.7 billion Medicare fraud controversy  —  Conventional political wisdom would typically advise candidates to steer clear of mentioning their past controversies.  —  But U.S. Sen. Rick Scott went out of his way, quite literally, on Thursday … ",
    "url": "https://www.yahoo.com/news/rick-scott-attend-donald-trump-140134845.html"
  },
  {
    "text": "At a Dinner, Trump Assailed Climate Rules and Asked $1 Billion From Big Oil  —  At a private meeting at Mar-a-Lago, the former president said fossil fuel companies should donate to help him beat President Biden.  —  Former President Donald J. Trump told a group of oil executives … ",
    "url": "https://www.nytimes.com/2024/05/09/climate/trump-oil-gas-mar-a-lago.html"
  },
  {
    "text": "Medical residents are starting to avoid states with abortion bans, data shows  —  Isabella Rosario Blum was wrapping up medical school and considering residency programs to become a family practice physician when she got some frank advice: If she wanted to be trained to provide abortions, she shouldn't stay in Arizona.",
    "url": "https://www.npr.org/sections/health-shots/2024/05/09/1250057657/medical-residents-starting-avoid-states-abortion-bans"
  },
  {
    "text": "California Students Get $1 Million After They Were Expelled for Wearing Supposedly Racist Acne Masks  —  During a sleepover in August 2017, three 14-year-old boys, two of whom were about to start attending St. Francis High School in Mountain View, California, took a picture of themselves wearing dark green acne masks.",
    "url": "https://reason.com/2024/05/09/california-students-get-1-million-after-they-were-expelled-for-wearing-supposedly-racist-acne-masks/"
  },
  {
    "text": "BREAKING: President Pollack to Retire After Seven Years of Leadership  —  President Martha Pollack announced that she will retire from her position on June 30, in an email sent to the Cornell community on Thursday, May 9.  —  Provost Michael Kotlikoff will serve as interim president … ",
    "url": "https://cornellsun.com/2024/05/09/breaking-president-pollack-to-retire-after-seven-years-of-leadership/"
  },
  {
    "text": "Exclusive: Jared Kushner pitching donors on father-in-law Trump, sources say  —  Donald Trump's son-in-law, Jared Kushner, has been making calls to encourage donors to attend a Trump fundraiser in New York, two sources told Reuters, in one of the first indications of Kushner working to help re-elect his father-in-law.",
    "url": "https://www.reuters.com/world/us/jared-kushner-pitching-donors-father-in-law-trump-sources-say-2024-05-09/"
  },
  {
    "text": "Islamic State Stages Boldest Attack in Mozambique in Three Years  — Militants raided town of Macomia in Cabo Delgado province  — The insurgency has held up giant natural gas projects  —  Islamic State-linked insurgents attacked the town of Macomia in Mozambique's gas-rich Cabo Delgado province … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-10/islamic-state-stages-boldest-attack-in-mozambique-in-three-years"
  },
  {
    "text": "The Students Have Never Been the Enemy  —  Student protest movements have historically functioned as an indispensable corrective for America and the West.  That is the legacy of 1968 we should be talking about  —  Has there ever been a student protest movement that wasn't immediately derided … ",
    "url": "https://thomaszimmer.substack.com/p/the-students-have-never-been-the"
  }
]