[
  {
    "text": "Iowa Poll: Kamala Harris leapfrogs Donald Trump to take lead near Election Day.  Here's how  —  The nationally recognized Iowa Poll shows Kamala Harris picking up support from women to surpass Donald Trump in a ruby-red state he has won twice … Kamala Harris now leads Donald Trump in Iowa … ",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/2024/11/02/iowa-poll-kamala-harris-leads-donald-trump-2024-presidential-race/75354033007/"
  },
  {
    "text": "British ‘mega poll’ leans toward Harris victory  —  Election pollsters may be ‘herding’ and giving the impression Trump is stronger than he really is, Focaldata research suggests.  —  The British are a-coming.  This time, they're wielding a new polling technique with a huge survey sample … ",
    "url": "https://www.politico.com/news/2024/11/03/swing-state-mrp-mega-poll-00186941"
  },
  {
    "text": "Final NBC News poll: Harris-Trump race is neck and neck, with significant gender gap  —  Abortion and rising Democratic enthusiasm boost Harris, while the economy and the cost of living lift Trump ahead of an uncertain election.  —  The final national NBC News poll of the 2024 presidential campaign finds … ",
    "url": "https://www.nbcnews.com/politics/2024-election/final-nbc-news-poll-harris-trump-race-neck-neck-significant-gender-gap-rcna178361"
  },
  {
    "text": "Trump Tells Supporters He 'Shouldn't Have Left' the White House  —  Donald J. Trump, who sought to overturn his loss of the 2020 election, also joked that he didn't mind if reporters were shot.  —  Former President Donald J. Trump told supporters on Sunday that he “shouldn't have left” … ",
    "url": "https://www.nytimes.com/2024/11/03/us/politics/trump-pa-rally-election.html"
  },
  {
    "text": "Some Surprises in Last Battleground Polls, but Still a Deadlock  —  A rise for Kamala Harris in the Sun Belt, and a dip in the Northern swing states.  —  Kamala Harris and Donald J. Trump stayed deadlocked to the finish in the final New York Times/Siena College polls of the 2024 presidential election … ",
    "url": "https://www.nytimes.com/2024/11/03/upshot/polls-harris-trump-battlegrounds.html?unlocked_article_code=1.XE4.1qmh.hNVT64YEm95p&smid=url-share"
  },
  {
    "text": "Harris and Trump Battle to the Wire in Swing States, Times/Siena Polls Find  —  Donald J. Trump has improved his standing in Pennsylvania even as late-deciding voters appear to be breaking for Kamala Harris.  —  The presidential race appears to be hurtling toward a photo finish … ",
    "url": "https://www.nytimes.com/2024/11/03/us/politics/harris-trump-times-siena-poll.html?unlocked_article_code=1.XE4.a3Fq.Aa23IX7kAZtp&smid=url-share"
  },
  {
    "text": "FCC commissioner claims Harris on ‘SNL’ violates ‘equal time’ rule  —  A Federal Communications Commission (FCC) commissioner has claimed that Vice President Harris's recent appearance on “Saturday Night Live” violates the “equal time” rule.  —  “This is a clear and blatant effort to evade … ",
    "url": "https://thehill.com/homenews/4968217-fcc-commissioner-claims-harris-on-snl-violates-equal-time-rule/"
  },
  {
    "text": "Canvassers for Elon Musk's America PAC Were Fired and Stranded in Michigan After Speaking Out  —  A dozen Black canvassers were tricked, threatened, and driven in seatless U-Haul vans.  They were fired after WIRED reported on their plight—some without full pay or a way back home.",
    "url": "https://www.wired.com/story/canvassers-elon-musk-america-pac-fired-stranded-michigan-mistreatment/"
  },
  {
    "text": "In a bathroom stall, a simple message: Vote Harris.  No one will know.  —  In the final days of the presidential race, what started as a whisper campaign has become the subject of a controversial 30-second ad, been amplified by Michelle Obama and drawn furious backlash from the right.",
    "url": "https://www.washingtonpost.com/politics/2024/11/03/harris-wife-trump-husband-ad/"
  },
  {
    "text": "Apology Not Accepted  —  I woke up yesterday morning to learn that Don Trump—the famed rapist, convicted felon, and white christian presidential candidate—had mimed performing a blowjob on his microphone stand to the clear delight of his crowd.  —  There's a famous Christian thinker named Jesus H. Christ … ",
    "url": "https://www.the-reframe.com/apology-not-accepted/"
  },
  {
    "text": "Final Senate rankings: 5 seats most likely to flip  —  Two days remain until Election Day, and Republicans are aiming to take control of the Senate and expand their majority.  —  Democrats hold a 51-49 advantage, which Republicans have already sliced into with their pending victory in West Virginia.",
    "url": "https://thehill.com/homenews/state-watch/4966663-2024-senate-races-top-flip-targets/"
  },
  {
    "text": "Megyn Kelly presses Sheehy on bullet wound story: “So confusing” … - Sheehy, a former Navy SEAL, claims he was shot while deployed in Afghanistan. … Sheehy said: “There isn't.”  — “There's not an extensive medical record for any of this stuff,” Sheehy said.",
    "url": "https://www.axios.com/2024/11/02/megyn-kelly-sheehy-bullet-wound-story-confusing"
  },
  {
    "text": "Epstein Claimed: Trump Liked to F**k His Friends' Wives  —  In recordings taken by author Michael Wolff, Epstein claimed Trump first slept with Melania on his Lolita Express and enjoyed cuckholding.  —  'Don't Do This Again': Harrison Ford Endorses Kamala Harris  —  'WE'LL MOVE FORWARD'",
    "url": "https://www.thedailybeast.com/epstein-claimed-trump-liked-to-fk-his-friends-wives/"
  },
  {
    "text": "2024's biggest gaffe?  GOP telling the truth about what it will do to America.  —  The most wildly misunderstood yet commonly used word in American politics is “gaffe.”  The dictionary defines it as “an unintentional act or remark causing embarrassment to its originator; a blunder” — and that's not wrong.",
    "url": "https://www.inquirer.com/opinion/commentary/gop-agenda-repeal-obamacare-chips-act-20241103.html"
  },
  {
    "text": "RFK Jr. says a Trump White House would immediately push to remove fluoride from water  —  Major health groups support water fluoridation as a public health benefit and emphasize that the practice is safe.  —  WASHINGTON — Robert F. Kennedy Jr. said Saturday that a Trump administration would … ",
    "url": "https://www.nbcnews.com/politics/2024-election/rfk-jr-trump-white-house-remove-fluoride-water-rcna178543"
  },
  {
    "text": "Nearly half of 2020's electorate have already cast ballots in 2024 … - In the 2022 midterms, nearly half of voters chose to do so early, far surpassing pre-pandemic numbers. … - North Carolina's early voting turnout reflects a similar margin — more than 4.4 million have cast their ballots … ",
    "url": "https://www.axios.com/2024/11/03/early-voting-2020-turnout-2024-election"
  }
]