[
  {
    "text": "Hegseth orders makeup studio installed at Pentagon  —  Defense Secretary Pete Hegseth recently ordered modifications to a room next to the Pentagon press briefing room to retrofit it with a makeup studio that can be used to prepare for television appearances, multiple sources told CBS News.",
    "url": "https://www.cbsnews.com/news/hegseth-orders-makeup-studio-installed-pentagon/"
  },
  {
    "text": "Trump to Sign Executive Order Targeting University Accreditors  —  Move is latest in effort to remake higher education after the president and other Republicans have long criticized the accreditation process  —  President Trump is expected to sign an executive order Wednesday to shake … ",
    "url": "https://www.wsj.com/us-news/education/trump-accreditors-executive-order-universities-4e4366cc?st=jR6Cq3&reflink=article_copyURL_share"
  },
  {
    "text": "Transparency Regarding Foreign Influence at American Universities  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose and Policy.  Section 117 of the Higher Education Act of 1965 … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/04/transparency-regarding-foreign-influence-at-american-universities/"
  },
  {
    "text": "Restoring Equality of Opportunity and Meritocracy  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  A bedrock principle of the United States is that all citizens are treated equally under the law.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/04/restoring-equality-of-opportunity-and-meritocracy/"
  },
  {
    "text": "U.S. Texts Barnard Employees and Asks if They Are Jewish  —  A questionnaire from a federal commission also inquired about whether professors and other college staff members had been harassed.  —  The personal cellphones of dozens of current and former Barnard College employees pinged Monday evening … ",
    "url": "https://www.nytimes.com/2025/04/23/nyregion/barnard-faculty-eeoc-text-jewish.html"
  },
  {
    "text": "Hegseth had Signal messaging app installed on an office computer  —  The move was intended to circumvent a lack of cellphone service in much of the Pentagon and enable easier communication between Hegseth and other Trump officials, said people familiar with the matter.",
    "url": "https://www.washingtonpost.com/national-security/2025/04/23/hegseth-signal-pentagon-computer/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1MzgwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2NzYzMTk5LCJpYXQiOjE3NDUzODA4MDAsImp0aSI6IjYyMmY0OTNlLTk5ZDMtNDM0YS05Zjc2LTY0NmI0ZDcyY2NhOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA0LzIzL2hlZ3NldGgtc2lnbmFsLXBlbnRhZ29uLWNvbXB1dGVyLyJ9.A0seSxzj3gYpWQiU-qQMnb-Ho6c0B7D09djFMfTmh5M"
  },
  {
    "text": "Trump Offers Private Dinner to Top 220 Investors in His Memecoin  —  The offer, which caused President Trump's memecoin to surge in price, was his family's latest effort to profit from cryptocurrencies.  —  The flashy online announcement called it “the most EXCLUSIVE INVITATION in the World … ",
    "url": "https://www.nytimes.com/2025/04/23/technology/trump-private-dinner-crypto-memecoin.html?unlocked_article_code=1.B08.kUIm.MA2kymhX3fCb&smid=url-share"
  },
  {
    "text": "Trump to Host Dinner With Top Holders of His Memecoin  —  President Donald Trump will have dinner with the top 220 holders of the Trump memecoin, the issuers of the cryptocurrency announced on Wednesday.  —  At the “intimate private dinner” on May 22 at Trump National Golf Club near Washington … ",
    "url": "https://www.bloomberg.com/news/articles/2025-04-23/president-trump-to-host-dinner-with-top-holders-of-his-memecoin"
  },
  {
    "text": "Trump's Plan to Sell Out Ukraine to Russia  —  Donald Trump said on the campaign trail that he would make peace between Ukraine and Russia in a day.  Three months later, he's behind schedule, and his plan now is to end the fighting quickly by selling out Ukraine and its people to Russian President Vladimir Putin.",
    "url": "https://www.theatlantic.com/politics/archive/2025/04/trump-ukraine-russia-deal/682564/?gift=otEsSHbRYKNfFYMngVFweLFN1ZFL3WP0o1Tq6DrkVWE&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Scoop: Musk vs. Bessent dispute erupted into West Wing shouting match  —  Elon Musk and Treasury Secretary Scott Bessent got into a heated shouting match in earshot of President Trump and other officials in the White House last week during a dispute about the IRS, two witnesses and three sources briefed on the matter tell Axios.",
    "url": "https://www.axios.com/2025/04/23/musk-bessent-trump-white-house-irs"
  },
  {
    "text": "Abrego Garcia's Wife Forced to Go Into Hiding Thanks to DHS Slip-Up  —  The wife of Kilmar Abrego Garcia, who was mistakenly deported to El Salvador by the Trump administration, was forced to move to a safe house with her children, after the government posted their home address to social media.",
    "url": "https://newrepublic.com/post/194289/abrego-garcia-wife-hiding-dhs-address"
  },
  {
    "text": "Trump approval falls, Kilmar Abrego Garcia, 100 days, and Robert F. Kennedy, Jr.: April 19-22, 2025 Economist/YouGov Poll  —  Findings from the latest Economist/YouGov poll about:  — How much Donald Trump's approval rating has fallen in the past month  — Whether Americans … ",
    "url": "https://today.yougov.com/politics/articles/52060-trump-approval-falls-kilmar-abrego-garcia-immigration-first-100-days-term-robert-f-kennedy-jr-april-19-22-2025-economist-yougov-poll"
  },
  {
    "text": "Trump Finds Another Country to Accept His Mass Deportations  —  The U.S. government is reportedly preparing to deport immigrants to Rwanda who can't be sent back to their country of origin due to fears of prosecution.  —  The Handbasket newsletter reported Tuesday that a State Department cable sent … ",
    "url": "https://newrepublic.com/post/194312/trump-deportation-rwanda"
  },
  {
    "text": "A dozen states sue to stop Trump's tariffs  —  Democratic attorneys general from 12 states filed a joint lawsuit arguing that the president doesn't have the constitutional authority to execute his sweeping tariff agenda.  —  Twelve states filed a lawsuit Wednesday challenging the legality … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/dozen-democratic-states-sue-stop-president-trumps-tariffs-rcna202682"
  },
  {
    "text": "Laura Ingraham's Angry Rants at Dem on Fox Reveal MAGA's Dark Endgame  —  Democrats have long intensely debated whether to appear on Fox News.  Going on Fox risks providing a sheen of legitimacy to a propaganda outlet.  But not going on risks leaving Republican news consumers … ",
    "url": "https://newrepublic.com/article/194298/laura-ingraham-yassamin-ansari-deportation"
  },
  {
    "text": "STAT+: New England Journal of Medicine gets swept up in U.S. attorney inquiry into alleged bias  —  Last week, at least one scientific journal received a letter from a top U.S. attorney asking it to respond to alleged bias.  Now, one of the world's leading medical journals, has received a similar inquiry as well.",
    "url": "https://www.statnews.com/2025/04/23/new-england-journal-of-medicine-us-attorney-letter-scientific-journals/"
  },
  {
    "text": "Trump's Approval Rating Has Been Falling Steadily, Polling Average Shows  —  President Trump's approval rating has sunk to about 45 percent, down from 52 percent one week after he took office.  —  President Trump's job approval rating has fallen steadily during his first three months in office … ",
    "url": "https://www.nytimes.com/2025/04/23/us/politics/trump-approval-rating.html"
  },
  {
    "text": "Fearing Trump's Visa Crackdown, College Students Race to Scrub Op-Eds  —  Campus newspapers confront ethics debates as international students try to remove their names and opinions from past articles  —  The Harvard Crimson, the student newspaper at one of America's most prominent universities … ",
    "url": "https://www.wsj.com/us-news/education/trump-student-visas-newspaper-op-eds-61595294?st=u4vaJe&reflink=mobilewebshare_permalink"
  },
  {
    "text": "NIH autism study will pull from private medical records  —  The National Institutes of Health will begin collecting Americans' private health records as part of Health and Human Services Secretary Robert F. Kennedy Jr.'s controversial plan to discover a cause and a cure for autism.",
    "url": "https://www.npr.org/2025/04/23/nx-s1-5372695/autism-nih-rfk-medical-records"
  },
  {
    "text": "Jan Schakowsky planning May 5 retirement announcement  —  The veteran House Democrat is facing a longshot primary challenge.  —  Rep. Jan Schakowsky is planning to announce next month she won't seek reelection after 14 terms in the House and has started informing allies of her retirement decision … ",
    "url": "https://www.politico.com/news/2025/04/23/jan-schakowsky-retirement-announcement-00306181"
  },
  {
    "text": "Majorities disapprove of some key Trump administration actions  —  Post Infographics  — More disapprove than approve of the administration's government cuts, but views largely split along partisan lines  — Among Republicans, support for ending DEI policies in federal government varies across demographic groups",
    "url": "https://www.pewresearch.org/politics/2025/04/23/tariffs-dei-and-cuts-to-government-views-of-trumps-key-actions/pp_2025-4-23_trump-100-days_03-01/"
  },
  {
    "text": "Let's talk about a civic uprising  —  Mainstream media coverage of the widespread anti-Trump protests on April 19 was much more extensive than it was after the April 5 protests — despite smaller crowds.  —  Watch MSBNC's Rachel Maddow wrap up the coverage and the protests on her show Monday night - it's must-see TV.",
    "url": "https://www.headsupnews.org/p/lets-talk-about-a-civic-uprising"
  },
  {
    "text": "Yale Derecognizes Students for Justice in Palestine Chapter After Group Blocks Jewish Students' Access to Parts of Campus  —  Yale University stripped the school's Students for Justice in Palestine (SJP) chapter, Yalies4Palestine, of its status as a recognized student group on Wednesday after it established a short-lived encampment.",
    "url": "https://freebeacon.com/campus/yale-derecognizes-students-for-justice-in-palestine-chapter-after-group-blocks-jewish-students-access-to-parts-of-campus/"
  },
  {
    "text": "Mega-investor Ken Griffin: Trump's trade war ‘has devolved into a nonsensical place’  —  Billionaire investor Ken Griffin said President Trump's trade war has “devolved into a nonsensical place,” as markets see-saw on the latest signals from the White House.",
    "url": "https://thehill.com/business/5263644-trump-trade-war-markets/"
  }
]