[
  {
    "text": "4/1/25 ☀️ AM: … President Donald Trump is on the brink of levying a sweeping set of new tariffs against an unidentified number of countries.  Trump's actions are rattling financial markets, business leaders and foreign officials.  —  Now House and Senate Republicans are beginning … ",
    "url": "https://punchbowl.news/archive/4125-am/"
  },
  {
    "text": "U.S. Senate  —  The Senate will vote to advance President Trump's nomination of Matthew Whitaker to be the U.S. Ambassador to NATO.  He previously served as Acting Attorney General during the first Trump Administration.",
    "url": "https://www.c-span.org/event/us-senate/us-senate/432077"
  },
  {
    "text": "Live: Speaking on Trump, Musk, and America's Moral Moment on the Senate Floor  —  Senator Cory Booker (D-NJ) has taken the Senate floor and is speaking as long as he is physically able to lift the voices of Americans who are being harmed a...",
    "url": "https://youtube.com/live/v2utlMxAwtE?feature=share"
  },
  {
    "text": "Inside Cory Booker's Plan To Disrupt ‘Business As Usual’ On The Senate Floor  —  A member of the U.S. Senate took the floor at 7:00 p.m. on Monday evening — and he doesn't plan on leaving it any time soon.  In a text message to TPM, Sen. Cory Booker (D-NJ) said he was about to begin speaking for as long as he could stand.",
    "url": "https://talkingpointsmemo.com/news/inside-cory-bookers-plan-to-disrupt-business-as-usual-on-the-senate-floor"
  },
  {
    "text": "Democrat kicks off marathon Senate floor speech to protest Trump administration actions  —  New Jersey Sen. Cory Booker has kicked off what is expected to be a marathon speech on the Senate floor to protest actions taken by President Donald Trump's administration, saying that he will keep going “as long as I am physically able.”",
    "url": "https://cnn.com/2025/03/31/politics/booker-senate-floor-speech-trump-protest/"
  },
  {
    "text": "Booker bids for a marathon anti-Trump speech  —  The News  —  Sen. Cory Booker began a marathon speech on the Senate floor on Monday evening, vowing to speak as long as he's “physically able” to protest President Donald Trump's agenda.  —  “In just 71 days, the president has inflicted harm … ",
    "url": "https://www.semafor.com/article/03/31/2025/booker-bids-for-a-marathon-anti-trump-speech"
  },
  {
    "text": "An ‘Administrative Error’ Sends a Maryland Father to a Salvadoran Prison  —  The Trump administration acknowledged in a court filing Monday that it had grabbed a Maryland father with protected legal status and mistakenly deported him to El Salvador, but said that U.S. courts lack jurisdiction … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/03/an-administrative-error-sends-a-man-to-a-salvadoran-prison/682254/?gift=Tsjgy5hc-Y7tsZCY3EHYrWOoNzx9Xi-w5fH-zT91Z90&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "The Makeup Artist Donald Trump Deported Under the Alien Enemies Act  —  The President has invoked the law to send Venezuelans to prison in El Salvador without due process—and, in many cases, under false pretenses.  —  Throughout the fall and winter, Alexis Romero de Hernández struggled to accept a grim new routine.",
    "url": "https://www.newyorker.com/news/annals-of-immigration/the-makeup-artist-donald-trump-deported-under-the-alien-enemies-act"
  },
  {
    "text": "The Proud Boys and Militias Come to Tesla's Defense  —  After weeks of “Tesla Takedown” protests, extremist groups are showing up to back Elon Musk's beleaguered car company.  —  Over the weekend, thousands of people joined the “Tesla Takedown” protest movement at the company's showrooms across the country.",
    "url": "https://www.wired.com/story/proud-boys-and-militias-come-to-teslas-defense/"
  },
  {
    "text": "Trump Administration Will Review Billions in Funding for Harvard  —  The administration has already canceled hundreds of millions in federal grants and contracts at Columbia and the University of Pennsylvania.  —  The Trump administration said on Monday that it was reviewing roughly $9 billion … ",
    "url": "https://www.nytimes.com/2025/03/31/us/trump-administration-harvard-funding.html"
  },
  {
    "text": "Trump task force to review Harvard's funding after Columbia bows to federal demands  —  Harvard University has become the latest target in the Trump administration's approach to fight campus antisemitism, with the announcement of a new “comprehensive review” that could jeopardize billions of dollars for the Ivy League college.",
    "url": "https://apnews.com/article/harvard-investigation-antisemitism-trump-2ee1a2a9df6d09d155dac7a4e39b186c"
  },
  {
    "text": "DOGE Is Trying to Gift Itself a $500 Million Building, Court Filings Show  —  The documents reveal a DOGE affiliate is attempting to transfer the headquarters of an independent think tank, the United States Institute of Peace, to the government at no cost.  —  The DOGE-affiliated acting president … ",
    "url": "https://www.wired.com/story/doge-takes-control-usip-office-building/"
  },
  {
    "text": "Democrats Sue to Block Trump Bid to Control Elections  —  The Democratic Party is suing President Donald Trump over his sweeping executive order last week that attempted to wrest control of elections from the states.  —  Filed Monday by Elias Law Group on behalf of Senate Minority Leader Chuck Schumer … ",
    "url": "https://www.democracydocket.com/news-alerts/democrats-sue-to-block-trump-bid-to-control-elections/"
  },
  {
    "text": "Stocks Mark Worst Month in Years as Trump's Tariffs Loom  —  Markets around the world have wavered as fear and uncertainty over tariffs and trade wars rattle investors.  The S&P 500 just recorded its worst month since 2022, shedding 5.8 percent in March.  —  The S&P 500 ended March … ",
    "url": "https://www.nytimes.com/2025/03/30/business/stocks-nikkei-sp500.html"
  },
  {
    "text": "Trump is plotting the biggest tax rise in global history  —  The burden for paying the bulk of the president's Liberation Day tariffs will fall on consumers, potentially at some $600 billion a year  —  We might think of him as a tax-cutter, an enemy of big government, and an instinctive ally … ",
    "url": "https://www.telegraph.co.uk/us/comment/2025/03/31/trump-plotting-biggest-tax-rise-global-history/"
  },
  {
    "text": "Republican Operative Nicholas Jacobs Locks Twitter After Elon Musk Check Controversy  —  Jacobs received a $1M check from Musk at a rally in support of Brad Schimel  —  Nicholas Jacobs, chair of the Wisconsin College Republicans and a rising GOP operative, has locked his Twitter account … ",
    "url": "https://meidasnews.com/news/republican-operative-nicholas-jacobs-locks-twitter-after-elon-musk-check-controversy"
  },
  {
    "text": "Judge Blocks Trump Administration's Bid to End Deportation Protections for Venezuelans  —  Venezuelans with Temporary Protected Status are challenging the Trump administration's efforts to end the program for many migrants.  —  Hundreds of thousands of Venezuelan immigrants will be allowed … ",
    "url": "https://www.nytimes.com/2025/03/31/us/politics/trump-deportations-venezuelan-immigrants-ruling.html"
  },
  {
    "text": "I'm tired of being mocked and hated because I'm a conservative woman  —  As a conservative woman living in Texas, I often feel like I'm living a dual reality.  I'm a mom and a writer, but that's not all.  I go to church, laugh with friends and wave at my neighbors while we are walking our dogs.",
    "url": "https://www.yahoo.com/news/im-tired-being-mocked-hated-090530234.html"
  },
  {
    "text": "How Biden's frailties hampered Harris  —  Democratic Party officials and White House staffers were well aware of former President Biden's frailties ahead of his choice to end his ill-fated reelection bid last summer, according to exclusive excerpts of a new book released to The Hill.",
    "url": "https://thehill.com/homenews/5223484-biden-age-concerns-election/amp/"
  },
  {
    "text": "Top Officials Placed on Leave After Denying DOGE Access to Federal Payroll Systems  —  DOGE demanded full access to a US Department of the Interior system that handles even the Supreme Court's paychecks.  When top staff asked questions, they were put on leave.",
    "url": "https://www.wired.com/story/doge-access-federal-payroll-systems-officials-leave-interior/"
  },
  {
    "text": "Israel killed 15 Palestinian paramedics and rescue workers one by one, says UN  —  Workers on a mission to help colleagues were buried in mass grave in southern Gaza, says humanitarian office  —  Lorenzo Tondo in Jerusalem, Malak A Tantesh in Gaza, and Julian Borger",
    "url": "https://www.theguardian.com/world/2025/mar/31/israel-killed-15-palestinian-paramedics-and-rescue-workers-one-by-one-says-un"
  },
  {
    "text": "The Pragmatic And Moral Case To Sell Your Tesla  —  If you were waiting for a sign, this is it.  It's time to sell.  —  When I tell strangers my job is to review cars for a living, the most common response is “What do you think of Tesla?”  For well over a decade, Tesla has been the strange … ",
    "url": "https://insideevs.com/features/755057/tesla-sell-victoria-scott-musk/"
  },
  {
    "text": "How to Save a Democracy  —  Americans Can Learn From Opponents of Authoritarianism Elsewhere  —  The first few weeks of Donald Trump's second presidency have accelerated a process of democratic erosion in the United States.  In just two months, the president and his allies have issued executive orders … ",
    "url": "https://www.foreignaffairs.com/united-states/how-save-democracy-trump"
  },
  {
    "text": "Louisiana voters reject constitutional amendments championed by Republican governor  —  Louisiana voters soundly rejected four constitutional amendments championed by Republican Gov. Jeff Landry related to crime, courts and finances.  Voters said no to each amendment by margins exceeding 60% … ",
    "url": "https://apnews.com/article/louisiana-constitutional-amendments-landry-c9a48606790251bdddb84978eea382ea"
  },
  {
    "text": "Voice of America Is Broken and Can't Be Reformed  —  The U.S. international broadcaster is politically biased, confused and ineffective.  Tear it down.  —  President Trump, in a March 14 executive order, called for the elimination of the U.S. Agency for Global Media to the extent possible by law.",
    "url": "https://www.wsj.com/opinion/voice-of-america-is-broken-and-cant-be-reformed-media-policy-c4781fb0?st=MGehGw&reflink=article_imessage_share"
  }
]