[
  {
    "text": "Alabama Lawmakers Move to Protect I.V.F. Treatments  —  A court ruling declaring frozen embryos to be legally considered children has set off a scramble among leaders in both parties to preserve access to a crucial reproductive treatment.  —  Alabama lawmakers are considering legislation … ",
    "url": "https://www.nytimes.com/2024/02/23/us/politics/alabama-ivf-treatment-law.html"
  },
  {
    "text": "Confused Tuberville Isn't Sure If He Supports IVF Or Opposes it, Or What It Is, In Rambling Response To Reporters  —  Alabama Republican Senator Tommy Tuberville seemed a little confused Thursday when questioned by reporters during the CPAC Conference about his stance on IVF … ",
    "url": "https://www.meidastouch.com/news/confused-tuberville-isnt-sure-if-he-supports-ivf-or-opposes-it-or-what-it-is-in-rambling-response-to-reporters"
  },
  {
    "text": "Alabama attorney general's office says it has ‘no intention’ to prosecute IVF families, providers  —  Fallout continues in the wake of the Alabama Supreme Court's ruling last week that frozen embryos are children - an unprecedented decision that critics say could have a chilling effect on access to IVF treatments in the state.",
    "url": "https://www.cnn.com/2024/02/23/us/alabama-ivf-embryos-supreme-court-ruling-legislation/"
  },
  {
    "text": "Biden impeachment effort on the brink of collapse  —  A wide swath of House Republicans are acknowledging they likely won't have the votes, especially given their struggle to recommend booting Alejandro Mayorkas.  —  The House GOP's push to impeach Joe Biden appears close to stalling out for good.",
    "url": "https://www.politico.com/news/2024/02/23/biden-impeachment-collapse-00142689"
  },
  {
    "text": "Wisconsin ethics commission refers Trump fundraising arm for prosecution  —  The bipartisan body recommended felony charges against Donald Trump's Save America committee as well as other Republicans  —  MADISON, Wis. — Bipartisan ethics regulators in Wisconsin have recommended felony charges … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/23/wisconsin-ethics-trump-fundraising-charges/"
  },
  {
    "text": "Ethics Commission alleges Trump joint fundraising committee, Brandtjen involved in campaign finance scheme to benefit Vos challenger  —  Home » WisPolitics News » Ethics Commission alleges Trump joint fundraising committee, Brandtjen involved in campaign finance scheme to benefit Vos challenger",
    "url": "https://www.wispolitics.com/2024/ethics-commission-alleges-trump-joint-fundraising-committee-brandtjen-involved-in-campaign-finance-scheme-to-benefit-vos-challenger/"
  },
  {
    "text": "BREAKING: Cellphone data raises questions about start of Willis-Wade relationship  —  Thousands of texts between DA and special prosecutor in 2021, court filing says  —  Nathan Wade appeared to make at least 35 visits to the Hapeville neighborhood where Fani Willis was living … ",
    "url": "https://www.ajc.com/politics/breaking-cellphone-data-raise-questions-about-start-of-willis-wade-relationship/SFVMYPTD2RD3HMZYOH3377CNNE/"
  },
  {
    "text": "Trump's Defense: He Intended to Steal Boxes and Boxes of Classified Documents  —  As I have been noting for months, in all of Jack Smith's rebuttals to Trump's claims that Presidents have absolute immunity, he floated scenarios that are pretty similar to stuff that Trump is known or suspected of doing.",
    "url": "https://www.emptywheel.net/2024/02/23/trumps-defense-he-intended-to-steal-boxes-and-boxes-of-classified-documents/"
  },
  {
    "text": "Trump struggles to say ‘evangelical’ and muddles up Israel in wild, incoherent speech at Christian event  —  Republican candidate arrived late to Nashville speech looking flushed and exhausted to rant about Democrats, the Department of Education, the Capitol riot and the ‘silencing’ of religious groups",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-incoherent-speech-nashville-christians-b2501342.html"
  },
  {
    "text": "Nex Benedict's mom raises doubts about police statements: It's a “big cover”  —  The mother of Nex Benedict — the non-binary Oklahoma teen who was assaulted in a school bathroom and died the following day — is raising doubts about statements released by the local police.",
    "url": "https://popular.info/p/nex-benedicts-mom-raises-doubts-about"
  },
  {
    "text": "A New Orleans magician says a Democratic operative paid him to make the fake Biden robocall  —  Dean Phillips' presidential campaign denounced the alleged actions of one of its consultants and said it may take legal action against him.  —  NEW ORLEANS — A Democratic consultant who worked … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-robocall-new-hampshire-strategist-rcna139760"
  },
  {
    "text": "MAGA Republican Pledges “End of Democracy” to Rabid Cheers at CPAC  —  Conservative activist Jack Posobiec joyfully hailed the “end of democracy” at the Conservative Political Action Conference, further emphasizing Republicans' apparent desire to completely overthrow America as we know it.",
    "url": "https://newrepublic.com/post/179247/jack-posobiec-democracy-cpac-2024"
  },
  {
    "text": "Ken Vogel Covers Up Rudy Giuliani and His Alleged Russian Spies  —  Amid rising criticism that it is burying the Alexander Smirnov scandal while continuing to flood the market with yet more transphobia and complaints that Biden's age might be worse than Trump's promise to let Russia attack NATO states … ",
    "url": "https://www.emptywheel.net/2024/02/23/ken-vogel-covers-up-rudy-giuliani-and-his-alleged-russian-spies/"
  },
  {
    "text": "Ex-Trump White House aide Cassidy Hutchinson says photo refutes Biden impeachment witness's claims  —  Her attorney shared a photo he says refutes a claim by witness Tony Bobulinski.  —  In this Oct. 30, 2023, file photo, Cassidy Hutchinson attends an event in New York.",
    "url": "https://abcnews.go.com/US/trump-white-house-aide-cassidy-hutchinson-pushes-back/story?id=107465387"
  },
  {
    "text": "The Return of the John Birch Society  —  The organization, once relegated to the outermost edges of the conservative movement, now fits neatly into its mainstream.  —  Michael Smart chuckled as he thought back to their banishment.  —  Truthfully he couldn't say for sure what the problem had been … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/02/john-birch-society-cpac-conservatism/677542/"
  },
  {
    "text": "Netanyahu unveils plan for Gaza's future post-Hamas  —  Editor's Note: A version of this story appears in CNN's Meanwhile in the Middle East newsletter, a three-times-a-week look inside the region's biggest stories.  Sign up here.  —  Jerusalem CNN  —  Israeli Prime Minister Benjamin … ",
    "url": "https://www.cnn.com/2024/02/23/middleeast/netanyahu-unveils-future-post-hamas-gaza-plan-mime-intl/"
  },
  {
    "text": "An ectopic pregnancy put her life at risk.  A Texas hospital refused to treat her.  —  The 25-year-old woman and her mother blame the state's abortion ban for a delay in care that doctors say put her “in extreme danger of losing her life”  —  ARLINGTON, Tex. — Kelsie Norris-De La Cruz tried … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/23/texas-woman-ectopic-pregnancy-abortion/"
  },
  {
    "text": "The Americans Who Need Chaos  —  They're embracing nihilism and upending politics.  —  Several years ago, the political scientist Michael Bang Petersen, who is based in Denmark, wanted to understand why people share conspiracy theories on the Internet.  He and other researchers designed … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/02/need-for-chaos-politicsl-science-concept/677536/"
  },
  {
    "text": "Trudeau Liberals, NDP Reach Deal on National Drug Coverage Plan  —  Canadian Prime Minister Justin Trudeau's government and the New Democratic Party have reached a deal to move closer to a national medication coverage program, which will ensure the governing Liberals remain in power with the NDP's support.",
    "url": "https://www.bloomberg.com/news/articles/2024-02-23/trudeau-liberals-ndp-reach-deal-on-national-drug-coverage-plan"
  },
  {
    "text": "Nikki Haley's popularity has plummeted among GOP primary voters  —  As Haley's attacks on Trump have increased, so has her unpopularity with her party's voters.  —  Former U.N. Ambassador Nikki Haley told Fox News this week that she sees herself as Republican voters' alternative … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haleys-popularity-plummeted-gop-primary-voters-rcna140252"
  }
]