[
  {
    "text": "Pelosi: Democrats ‘have to win this election’ following Trump's ‘bloodbath’ remarks  —  Former Speaker Nancy Pelosi (D-Calif.) on Sunday underscored the stakes of the November election after former President Trump warned of a “bloodbath” for the auto industry and the country if he doesn't win a second term in the White House.",
    "url": "https://thehill.com/homenews/house/4538009-pelosi-democrats-have-to-win-this-election-following-trumps-bloodbath-remarks/"
  },
  {
    "text": "Putin bromance has US intelligence officials fearing second Trump term  —  Ex-president's support for the Russian strongman has experts fretting over American interests and security sources overseas  —  Donald Trump's continuing lavish praise and support for Russian president Vladimir Putin … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/18/us-intelligence-trump-putin-threat"
  },
  {
    "text": "Trump doubles down on call for Liz Cheney to be prosecuted  —  Former President Trump on Sunday doubled down on his push for former Rep. Liz Cheney (R-Wyo.) to be prosecuted over allegations she and the other Jan. 6 committee members purposely withheld testimony and details from their investigation … ",
    "url": "https://thehill.com/homenews/campaign/4538333-trump-doubles-down-on-call-for-liz-cheney-to-be-prosecuted/"
  },
  {
    "text": "Trump is eyeing Paul Manafort for 2024 campaign role  —  The former campaign manager was pardoned by Trump for bank and tax fraud convictions and accusations he hid millions he made consulting for pro-Russian Ukrainian politicians  —  Former president Donald Trump is expected to enlist Paul Manafort … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/18/trump-manafort-2024-campaign/"
  },
  {
    "text": "Pro-Trump disruptions in Arizona county elevate fears for the 2024 vote  —  A meeting in the state's largest county, Maricopa, ended chaotically last month, raising concern that the former president's supporters could try to undercut the election  —  PHOENIX — As the board of supervisors … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/18/trump-maricopa-arizona-supervisors-election-denial/"
  },
  {
    "text": "Adult MAGA rage is making schools more dangerous for students  —  Despite the Ethan Crumbley and Nex Benedict cases, a GOP nominee to run schools wants a “firing squad” for liberals  —  Last week saw national headlines regarding two tragic stories that illustrate how MAGA radicalization of adults endangers kids in school.",
    "url": "https://www.salon.com/2024/03/18/adult-maga-rage-is-making-schools-more-for-students/"
  },
  {
    "text": "Sonia Sotomayor Should Retire Now  —  On Election Day in 2006, Justice Antonin Scalia was 70 years old and had been serving on the Supreme Court for 20 years.  That year would have been an opportune time for him to retire—Republicans held the White House and the Senate … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/03/sonia-sotomayor-should-retire/677764/"
  },
  {
    "text": "Protesters Take to Streets in Cuba as Lights Go Out Across Island  — Blackouts spark rare demonstrations in communist-run nation  — Government accuses US seizing on crisis to foment dissent  —  Protesters took to the streets of Cuba on Sunday in a rare outburst of social unrest … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-18/cuban-protesters-take-to-streets-as-lights-go-out-across-island"
  },
  {
    "text": "Allegations UNRWA collaborated with Hamas are ‘flat-out lies’: Van Hollen  —  Sen. Chris Van Hollen (D-Md.) ripped into Israel's allegations that the U.N.'s Palestinian refugee agency, commonly referred to as UNRWA, is a proxy for the Palestinian militant group Hamas, arguing the accusations … ",
    "url": "https://thehill.com/homenews/senate/4538265-allegations-unrwa-collaborated-with-hamas-are-flat-out-lies-van-hollen/"
  },
  {
    "text": "Kushner Deal in Serbia Follows Earlier Interest by Trump  —  More than a decade ago, before running for president, Donald Trump expressed interest in developing the same site in Belgrade that his son-in-law now plans to invest $500 million in rebuilding.  —  The plan by Jared Kushner … ",
    "url": "https://www.nytimes.com/2024/03/17/us/politics/kushner-deal-serbia-trump.html"
  },
  {
    "text": "Biden to sign executive order to expand research on women's health  —  President Biden on Monday will sign an executive order aimed at expanding research and improving government initiatives on women's health, a move that will coincide with a White House Women's History Month reception.",
    "url": "https://thehill.com/homenews/administration/4538271-biden-to-sign-executive-order-to-expand-research-on-womens-health/"
  },
  {
    "text": "Exclusive: Top Republican calls for canceling future Biden SOTU speeches … - “That was about the most divisive State of the Union — I wouldn't extend him an invitation next year, if that's what we're going to get,” Emmer said during an interview at the House GOP retreat.",
    "url": "https://www.axios.com/2024/03/17/biden-state-of-the-union-invitation-republicans"
  },
  {
    "text": "Trump Doubles Down on Migrants ‘Poisoning’ the Country  —  In an interview on Fox News, the former president said again that migrants crossing the southern border were criminals from prisons and mental institutions.  —  Former President Donald J. Trump, in an interview broadcast Sunday … ",
    "url": "https://www.nytimes.com/2024/03/17/us/politics/trump-fox-interview-migrants.html"
  },
  {
    "text": "AP PHOTOS: Boston celebrates St. Patrick's Day; Biden holds White House brunch with Irish leader  —  BOSTON (AP) — While some American cities celebrated St. Patrick's Day a day early this weekend, Boston, one of the most Irish cities in the country, held its parades and festivities on Sunday, or March 17.",
    "url": "https://apnews.com/article/st-patricks-day-boston-biden-kansas-city-3f3db00d515d8696c0509f663a9256a4"
  }
]