[
  {
    "text": "Johnson weighs spending plan B as Elon Musk stokes opposition  —  Speaker Mike Johnson's leadership team is quietly discussing a plan B to fund the government amid conservative opposition and vocal criticism from incoming President Donald Trump's top ally Elon Musk.",
    "url": "https://www.politico.com/live-updates/2024/12/18/congress/johnsons-spending-plan-b-00195169"
  },
  {
    "text": "What Elon got wrong about the CR  —  With assists from POLITICO's Congress team  —  THE LATEST: House votes have been cancelled for the night as Speaker Mike Johnson regroups and tries to salvage a year-end spending plan after a mass Republican backlash led by billionaire businessman and presidential pal Elon Musk.",
    "url": "https://www.politico.com/newsletters/inside-congress/2024/12/18/what-elon-got-wrong-about-the-cr-00195226"
  },
  {
    "text": "Trump opposes funding bill, pushing government closer to a shutdown  —  Elon Musk joined a wave of right-wing fury against a bill to keep the government open.  Now, the president-elect says he wants big changes, too, before this weekend's deadline.  —  WASHINGTON — President-elect Donald … ",
    "url": "https://www.nbcnews.com/politics/congress/trump-opposes-funding-bill-pushing-government-closer-shutdown-rcna184745"
  },
  {
    "text": "Jeffries suggests Democrats will oppose a ‘clean’ funding bill after Johnson's plan falters  —  House Minority Leader Hakeem Jeffries (D-N.Y.) suggested Wednesday that Democrats will oppose any federal spending bill that strays from the bipartisan deal announced a day before … ",
    "url": "https://thehill.com/homenews/house/5047510-hakeem-jeffries-democrats-government-funding/"
  },
  {
    "text": "Mike Johnson Faces Growing GOP Backlash As Elon Musk Calls For Government Shutdown  —  Johnson's push for a short-term government funding bill met louder resistance than usual from Republicans in the House.  —  LOADING  —  WASHINGTON — House Speaker Mike Johnson (R-La.) … ",
    "url": "https://www.huffpost.com/entry/mike-johnson-government-shutdown-elon-musk_n_67632608e4b01905cf40128d"
  },
  {
    "text": "Senate passes $895B Defense bill; some Dems defect over transgender fight  —  The Senate on Wednesday voted to pass the $895 billion Defense authorization bill, despite a provision on transgender care that turned off some Democrats, moving it along to President Biden's desk to be signed into law.",
    "url": "https://thehill.com/policy/defense/5044931-senate-passes-defense-bill/"
  },
  {
    "text": "In reversal, key House panel votes to release Matt Gaetz ethics report  —  The House Ethics Committee secretly voted earlier this month to release its report into the conduct of former Rep. Matt Gaetz before the end of this Congress, according to multiple sources with knowledge of the matter.",
    "url": "https://www.cnn.com/2024/12/18/politics/matt-gaetz-ethics-report-committee/"
  },
  {
    "text": "What Do Democrats Need to Do?  Act Like an Opposition Party.  —  Democrats may be in the minority, but they are not yet an opposition.  —  What's the difference?  —  An opposition would use every opportunity it had to demonstrate its resolute stance against the incoming administration.",
    "url": "https://www.nytimes.com/2024/12/18/opinion/democrats-trump-opposition.html?unlocked_article_code=1.iU4.fXzt.xNNqTSiwCocp&smid=tw-share"
  },
  {
    "text": "Democrats' playbook to beat Republicans in 2 years: work with them now  —  “I think we are telling them that we're here to govern,” one Democrat said.  —  DCCC chair Rep. Suzan DelBene, D-Wash., speaks during the House Democrats' post-caucus meeting news conference in the Capitol, Sept. 18, 2024.",
    "url": "https://abcnews.go.com/Politics/democrats-playbook-beat-republicans-2-years-work-now/story?id=116846803"
  },
  {
    "text": "US confirms first severe human case of bird flu  —  The U.S. Centers for Disease Control and Prevention said on Wednesday that a patient has been hospitalized with a severe case of H5N1 infection in Louisiana, marking the first known instance of a severe human illness linked to the bird flu virus in the United States.",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/cdc-confirms-first-severe-case-bird-flu-us-2024-12-18/"
  },
  {
    "text": "California Declares an Emergency Over Bird Flu in Cattle  —  Officials have discovered the virus in 645 dairy herds, more than in any other state so far.  —  In a stark acknowledgment of the increasing seriousness of bird flu's spread, Gov. Gavin Newsom of California declared on Wednesday … ",
    "url": "https://www.nytimes.com/2024/12/18/health/bird-flu-emergency-california.html?unlocked_article_code=1.iU4.4Y1W.tTgy3PDgDIGw&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Health Insurance is a Racket  —  What value do these companies add, really?  —  It's not news that many Americans dislike health insurance companies.  In fact, Brian Thompson, the CEO of UnitedHealthcare who was murdered two weeks ago, reportedly warned his colleagues months ago that the industry had a public relations problem.",
    "url": "https://paulkrugman.substack.com/p/health-insurance-is-a-racket"
  },
  {
    "text": "The Wrath of Trump: House Republicans Map a Case Against Liz Cheney  —  President-elect Donald J. Trump has never been shy about his desire to see his enemies punished.  But he often shows a measure of caution about taking credit for potential prosecutions himself.",
    "url": "https://www.nytimes.com/2024/12/18/us/politics/trump-liz-cheney-report.html"
  },
  {
    "text": "Republicans scrap spending bill, under pressure from Trump and Musk  —  Unless Congress acts, a government shutdown deadline looms just past midnight Saturday.",
    "url": "https://www.washingtonpost.com/business/2024/12/18/government-shutdown-house-vote-cr/"
  },
  {
    "text": "‘There will be some cuts’ to Social Security: Republican threatens outside first DOGE meeting  —  A House Republican said Tuesday that he believes there “will be some cuts” to Social Security and Medicare as he entered a conference room at the U.S. Capitol for the first meeting of the DOGE Caucus … ",
    "url": "https://www.alternet.org/dode-cuts/"
  },
  {
    "text": "Inside Disney's Decision to Settle a Trump Defamation Suit  —  Talks started and finished on the same day, after Disney decided that fighting the lawsuit could potentially hurt the company and protections for the press.  —  When Disney reached a settlement last week with President-elect Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/12/18/business/media/disney-trump-abc-lawsuit.html?unlocked_article_code=1.iU4.g4CU.OjFnM8OqcBgm&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Massie says he's opposing Johnson  —  Rep. Thomas Massie became the first House Republican to pledge not to back Mike Johnson in the upcoming speakership fight, saying Wednesday he will vote for someone else on Jan. 3.  The Kentucky conservative is known as a prominent Johnson critic … ",
    "url": "https://www.politico.com/live-updates/2024/12/18/congress/massie-says-hes-opposing-johnson-00195146"
  },
  {
    "text": "Georgia prosecutors urge appeals court not to toss Trump election interference case  —  The Fulton County district attorney's office said the president-elect had presented the court with an “underbaked” argument for dismissing the case.  —  ATLANTA — Georgia prosecutors are calling … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/georgia-prosecutors-urge-appeals-court-not-toss-trump-election-case-rcna184735"
  },
  {
    "text": "Dow plunges more than 1,100 points and marked its longest losing streak since 1974  —  New York CNN  —  The Dow plunged Wednesday on a disappointing outlook from the Federal Reserve.  In the process, the blue-chip index extended its losing streak to 10 days — the longest such stretch since Gerald Ford was president.",
    "url": "https://www.cnn.com/2024/12/18/economy/dow-10-day-losing-streak/"
  },
  {
    "text": "LA Times owner asks editorial board to ‘take a break’ from writing about Trump - report  —  Billionaire Patrick Soon-Shiong, who said paper is ‘echo chamber’, also blocked paper's board from endorsing Harris  —  Patrick Soon-Shiong, the owner of the Los Angeles Times, reportedly asked … ",
    "url": "https://www.theguardian.com/media/2024/dec/18/la-times-patrick-soon-shiong-trump"
  },
  {
    "text": "Sexism Is a Risk Factor for Memory Decline Among Women  — Share on X (formerly Twitter)  — Share by email  —  Women born in the most sexist U.S. states experienced faster memory decline in later years compared to women born in the least sexist states, a new study by researchers … ",
    "url": "https://www.cuimc.columbia.edu/news/sexism-risk-factor-memory-decline-among-women"
  },
  {
    "text": "Transcript: Trump's Angry New Tirade on Truth Social Signals Dark 2025  —  The following is a lightly edited transcript of the December 17 episode of the  —  Daily Blast podcast.  Listen to it here.  —  Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network.",
    "url": "https://newrepublic.com/article/189507/transcript-trumps-angry-new-tirade-truth-social-signals-dark-2025"
  },
  {
    "text": "Are Democrats coconut-pilled?  Some want to see Kamala Harris run again.  —  Top officials gathered in Washington suggested an openness to backing the vice president again next time.  —  Senior Democrats aren't ruling out Kamala Harris as a presidential candidate for 2028.",
    "url": "https://www.politico.com/news/2024/12/18/kamala-harris-2028-primary-democrats-001628"
  },
  {
    "text": "Can Anyone Make Sense of Luigi Mangione?  Maybe His Favorite Writer.  —  Almost immediately after Luigi Mangione was arrested last week in connection with the killing of Brian Thompson, the chief executive of UnitedHealthcare, you could go pretty deep into the rabbit hole of Mangione's particular internet.",
    "url": "https://www.nytimes.com/2024/12/18/opinion/luigi-mangione-writer-tim-urban.html"
  }
]