[
  {
    "text": "Mitt Romney says he will not seek a second term in the Senate  —  In a Post interview, Romney is critical of both Trump and Biden, and says most Republicans are drawn to a ‘populist demagogue message.’ His decision not to seek reelection is likely to be the end of the 2012 GOP presidential nominee's political career.",
    "url": "https://www.washingtonpost.com/politics/2023/09/13/mitt-romney-senate-reelection/"
  },
  {
    "text": "What Mitt Romney Saw in the Senate  —  In an exclusive excerpt from my forthcoming biography of the senator, Romney: A Reckoning, he reveals what drove him to retire.  —  For most of his life, Mitt Romney has nursed a morbid fascination with his own death, suspecting that it might assert itself one day suddenly and violently.",
    "url": "https://www.theatlantic.com/magazine/archive/2023/11/mitt-romney-retiring-senate-trump-mcconnell/675306/"
  },
  {
    "text": "President Biden should not run again in 2024  —  Joe Biden launched his candidacy for president in 2019 with the words “we are in the battle for the soul of this nation.”  He was right.  And though it wasn't obvious at first to many Democrats, he was the best person to wage that fight.",
    "url": "https://www.washingtonpost.com/opinions/2023/09/12/biden-trump-election-step-aside/"
  },
  {
    "text": "Trump Has Been Privately Encouraging G.O.P. Lawmakers to Impeach Biden  —  The former president has talked regularly with members of the House Freedom Caucus and other congressional Republicans who pushed for impeachment.  —  On a sweeping patio overlooking the golf course at his private club in Bedminster … ",
    "url": "https://www.nytimes.com/2023/09/13/us/politics/trump-gop-biden-impeachment.html"
  },
  {
    "text": "White House sends letter to news execs urging outlets to ‘ramp up’ scrutiny of GOP's Biden impeachment inquiry ‘based on lies’  —  The White House sent a letter to top US news executives on Wednesday, urging them to intensify their scrutiny of House Republicans after Speaker Kevin McCarthy launched … ",
    "url": "https://www.cnn.com/2023/09/12/media/white-house-letter-news-executives/"
  },
  {
    "text": "Conservative mutiny forces delay in House Pentagon spending bill  —  “I don't know that this has anything to do with defense,” Rep. Steve Womack (R-Ark.) said of the GOP infighting.  —  House Republican infighting forced Speaker Kevin McCarthy to pump the brakes on the chamber's annual … ",
    "url": "https://www.politico.com/news/2023/09/13/defense-bill-house-republicans-00115530"
  },
  {
    "text": "The Right-Wing Conspiracy-Fest Is More Openly Bloodthirsty Than Before  —  The first thing I noticed at the latest stop on the ReAwaken America Tour in Las Vegas in mid-August was that the T-shirts are getting nastier.  “Size Matters” blared one man's shirt over enlarged images of bullets of various calibers.",
    "url": "https://newrepublic.com/article/175514/reawaken-america-political-violence-conference"
  },
  {
    "text": "Alaska Rep. Mary Peltola's husband dies in plane crash  —  Rep. Mary Peltola's (D-Alaska) husband has died in a plane accident in Alaska, her chief of staff announced Wednesday.  —  “We are devastated to share that Mary's husband, Eugene Peltola Jr.—'Buzzy' to all of us who knew and loved him … ",
    "url": "https://thehill.com/homenews/house/4201929-alaska-rep-mary-peltolas-husband-dies-in-plane-crash/"
  },
  {
    "text": "Trump, Meadows offer quid pro quo on speedy trial to sever Georgia election case from co-defendants  — Donald Trump offered to “exchange” his right to a speedy trial in his Georgia election-conspiracy case for an Atlanta judge ruling that would have the former president tried separately from 18 other defendants.",
    "url": "https://www.cnbc.com/2023/09/13/trump-waives-georgia-election-speedy-trial-to-sever-from-co-defendants.html"
  },
  {
    "text": "Is AOC Married?  Her Office Says No. Her Legal Filings in Congress Say Otherwise.  —  Rep. Alexandria Ocasio-Cortez's (D., N.Y.) office says she isn't married.  But she has described her fiancé, Riley Roberts, as her “spouse” in forms filed with the House Ethics Committee in 2023 … ",
    "url": "https://freebeacon.com/democrats/aoc-cites-longtime-partner-as-spouse-but-keeps-his-finances-under-wraps-a-potential-breach-of-ethics-rules/"
  },
  {
    "text": "Jury's fresh-air break could upend Navarro conviction  —  The former Donald Trump adviser was on trial for defying a subpoena from the Jan. 6 select committee.  —  An unusual outdoor excursion by the jury that convicted Peter Navarro — just 30 minutes before delivering its verdict last week … ",
    "url": "https://www.politico.com/news/2023/09/13/navarro-conviction-jury-fresh-air-break-00115556"
  },
  {
    "text": "Lauren Boebert escorted out of “Beetlejuice” musical in Denver after “causing a disturbance”  —  Boebert campaign manager says congresswoman was just “enthusiastically” enjoying Sunday's show  —  U.S. Rep. Lauren Boebert was escorted out of a Sunday night performance of the “Beetlejuice” … ",
    "url": "https://www.denverpost.com/2023/09/12/lauren-boebert-removed-beetlejuice-musical-denver/"
  },
  {
    "text": "Lauren Boebert ditches the MAGA thing in Colorado  —  With her seat in danger, the Coloradan is starting to sound like a completely different person at home.  —  FRUITA, Colo. — Lauren Boebert is one of Washington's loudest proponents of impeaching Joe Biden.",
    "url": "https://www.politico.com/news/2023/09/13/lauren-boebert-maga-colorado-election-00113943"
  },
  {
    "text": "FBI official refutes top GOP claims on Hunter Biden investigation  —  A high-ranking FBI official involved in the Hunter Biden investigation refuted key testimony from an IRS whistleblower who claimed the top prosecutor on the case was stymied by the Department of Justice (DOJ) in bringing charges outside Delaware.",
    "url": "https://thehill.com/homenews/house/4202686-fbi-official-refutes-top-gop-claims-on-hunter-biden-investigation/"
  },
  {
    "text": "Judge restricts Trump's access to classified info in docs case and limits what he can say  —  U.S. District Judge Aileen Cannon set specific parameters for how and when the former president can review the evidence in case against him in Florida.  —  The judge presiding over the federal … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-restricts-trumps-access-classified-info-docs-case-limits-can-say-rcna104742"
  },
  {
    "text": "She's 25, idealistic, and believes she has the formula to win North Carolina for Joe Biden  —  The state's Democratic Party chair is organizing youth and rural voters, and people have noticed: “They know she's fighting for them.”  —  Anderson Clayton, the youngest statewide party leader in the country … ",
    "url": "https://www.politico.com/news/2023/09/13/shes-25-idealistic-and-believes-she-has-the-formula-to-win-north-carolina-for-joe-biden-00114640"
  },
  {
    "text": "‘Alien corpses’ unveiled at Mexico's Congress as UFO speculation intensifies  —  An “alien” discovery was on the docket in Mexico's Congress on Tuesday, as “non-human” corpses were unveiled to politicians at a public hearing.  —  Prominent Mexican UFO expert and journalist Jaime Maussan presented … ",
    "url": "https://www.washingtonexaminer.com/news/alien-corpses-unveiled-mexico-congress-ufo-speculation-intensifies"
  }
]