[
  {
    "text": "Trump and his Republican base are actively scaring away undecided voters -spelling potential disaster in the election  —  Trump seems to show little interest in reaching out to Nikki Haley's voters — and that could hurt him, Eric Garcia writes  —  Upon the news that Nikki Haley would suspend her campaign … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-maga-republicans-losing-voters-b2508210.html"
  },
  {
    "text": "In Shinzo's shadow, Japan fears ‘if Trump’  —  Moshi Tora.  That's the compact phrase now spreading like wildfire in Japan.  It means “If Trump,” and is often said with a sense of foreboding.  —  This haiku-like, four-syllable phrase is short for the longer sentence: “What if Trump wins the presidency again?”",
    "url": "https://thehill.com/opinion/white-house/4513866-in-shinzos-shadow-japan-fears-if-trump/"
  },
  {
    "text": "Exclusive: Biden plans feisty economic reset … - Biden needs a cure for what some advisers call “Trump amnesia” — the notion that the chaos and unpopularity of Trump's presidency has receded from some voters' memories nearly four years on. … - Voters largely understand the contrasts between Trump … ",
    "url": "https://www.axios.com/2024/03/07/state-of-the-union-biden-us-economy"
  },
  {
    "text": "How millions in corporate cash could help a radical conspiracy theorist become governor  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  On Tuesday, Mark Robinson (R) won the Republican nomination for Governor of North Carolina.  Robinson, currently North Carolina's lieutenant governor … ",
    "url": "https://popular.info/p/how-millions-in-corporate-cash-could"
  },
  {
    "text": "The Much Vaunted Guardrails Are Failing  —  Unless America's leading institutions start acting accordingly, how can we expect enough people to believe the danger to democracy and fundamental rights is really all that severe?  —  Most of you who are reading this probably remember where you were on January 6 … ",
    "url": "https://thomaszimmer.substack.com/p/the-much-vaunted-guardrails-are-failing"
  },
  {
    "text": "Navy demoted Ronny Jackson after probe into White House behavior  —  Ronny Jackson, the former White House physician turned GOP congressman, regularly touts his military bona fides.  —  “As a retired U.S. Navy Rear Admiral with nearly three decades of military service I understand the commitment … ",
    "url": "https://www.washingtonpost.com/nation/2024/03/07/ronny-jackson-demotion-white-house-medical-unit-navy/"
  },
  {
    "text": "Steve Bannon's Refusal to Pay His Bills Is Costing Him Big  —  Bannon has refused to pay his legal bills for two years.  Now he and his current lawyer are facing fines over Bannon's refusal to make good on his debts. … For two years, Steve Bannon has refused to pay the half-million dollars he owes his former lawyer.",
    "url": "https://www.thedailybeast.com/steve-bannons-refusal-to-pay-his-bills-is-costing-him-big"
  },
  {
    "text": "Ex-Congressional Candidate Endorsed by Trump Wanted for Murder  —  A former Nevada Republican congressional candidate who was endorsed by President Donald Trump is wanted by police in relation to the murder of a man in a Las Vegas hotel.  —  An arrest warrant was issued for 45-year-old politician … ",
    "url": "https://www.mediaite.com/politics/ex-congressional-candidate-endorsed-by-trump-wanted-for-murder/"
  },
  {
    "text": "Missouri's total war on Planned Parenthood  —  Republicans aren't stopping at abortion bans.  —  ∙ Paid  —  Given the sinkhole of conspiracies that is Elon Musk's X, it shouldn't be surprising that Andrew Bailey, Missouri's hard-right attorney general, used the platform to announce … ",
    "url": "https://www.publicnotice.co/p/missouri-planned-parenthood-lawsuit"
  },
  {
    "text": "Spate of Mock News Sites With Russian Ties Pop Up in U.S.  —  The fake news organizations, experts say, represent a technological leap in the Kremlin's efforts to spread false and misleading narratives.  —  Into the depleted field of journalism in America, a handful of websites have appeared … ",
    "url": "https://www.nytimes.com/2024/03/07/business/media/russia-us-news-sites.html"
  },
  {
    "text": "FDA says to throw away these 6 cinnamon products because they contain high levels of lead  —  Consumers should not purchase half a dozen ground cinnamon products sold by retailers including Family Dollar and Dollar Tree because they contain elevated levels of lead, the U.S. Food and Drug Administration … ",
    "url": "https://www.cbsnews.com/news/lead-cinnamon-fda-applesauce-children/"
  },
  {
    "text": "Alabama Passes Law to Protect I.V.F. Treatments  —  Some doctors said the law would allow them to resume treatments quickly, though legal experts cautioned that state constitutional challenges may still arise.  —  Alabama lawmakers on Wednesday passed legislation to shield … ",
    "url": "https://www.nytimes.com/2024/03/06/us/politics/alabama-ivf-law.html"
  },
  {
    "text": "Byron Donalds wouldn't commit to certifying election results if he was VP … - Donalds also did not clarify if he would have certified the 2020 election results, during an interview with Axios' Sophia Cai.  — Trump, the GOP presidential frontrunner, has continued to push the false theory … ",
    "url": "https://www.axios.com/2024/03/07/byron-donalds-certifying-election-results-trump-vp"
  },
  {
    "text": "Profound Damage Found in Maine Gunman's Brain, Possibly From Blasts  —  A laboratory found a pattern of cell damage that has been seen in veterans exposed to weapons blasts, and said it probably played a role in symptoms the gunman displayed before the shooting.",
    "url": "https://www.nytimes.com/2024/03/06/us/maine-shooting-brain-injury.html"
  },
  {
    "text": "The White House Announces Guest List for the First Lady's Box for the 2024 State of the Union Address  —  WASHINGTON, D.C. - First Lady Jill Biden will welcome guests to join her in the viewing box for President Biden's State of the Union Address on Thursday, March 7, 2024.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/03/07/the-white-house-announces-guest-list-for-the-first-ladys-box-for-the-2024-state-of-the-union-address/"
  },
  {
    "text": "Sweden set to become NATO's 32nd member as PM visits Washington  —  Sweden joined NATO in Washington on Thursday, two years after Russia's invasion of Ukraine forced it to rethink its national security policy and conclude that support for the alliance was the Scandinavian nation's best guarantee of safety.",
    "url": "https://www.reuters.com/world/sweden-set-become-natos-32nd-member-pm-visits-washington-2024-03-07/"
  },
  {
    "text": "The hard-right wing of House GOP poised to grow even larger next year  —  Super Tuesday primaries produced several embarrassing defeats for the mainstream wing of House Republicans  —  Super Tuesday dealt another blow to the already shrinking bloc of House Republicans who prefer governance … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/06/super-tuesday-republican-house-majority/"
  },
  {
    "text": "Mike Johnson Tells Republicans To Behave During State Of The Union Address: Report  —  The House speaker made the reported request for GOP “decorum” in a closed-door meeting.  —  LOADING  —  House Speaker Mike Johnson (R-La.) privately told Republicans to behave at President Joe Biden's State … ",
    "url": "https://www.huffpost.com/entry/mike-johnson-state-of-union-decorum_n_65e9931ee4b024897f7b940a"
  }
]