[
  {
    "text": "Small airplane down in Potomac River near Ronald Reagan National Airport  —  A small aircraft is down in the Potomac River near Ronald Reagan Washington National Airport and fireboats were on the scene, the Washington fire department said.  —  The airport said late on Wednesday that all takeoffs … ",
    "url": "https://www.reuters.com/world/us/takeoffs-landings-halted-ronald-reagan-national-airport-after-aircraft-incident-2025-01-30/"
  },
  {
    "text": "Live updates: Plane crashes into Potomac River after collision with helicopter near Reagan National Airport  —  A regional jet collided in midair with a helicopter while on approach to Reagan Washington National Airport around 9 p.m., the FAA said Wednesday evening in a preliminary update.",
    "url": "https://www.nbcnews.com/news/us-news/live-blog/live-updates-plane-crashes-potomac-river-collision-helicopter-reagan-n-rcna189942"
  },
  {
    "text": "Passenger jet collides with helicopter while landing at Reagan Washington National Airport, FAA says  —  A passenger jet has collided with a helicopter while landing at Ronald Reagan National Airport near Washington.  That's according to the Federal Aviation Administration, which says the collision remains under investigation.",
    "url": "https://apnews.com/article/ronald-reagan-national-airport-crash-cebb142d24859ba0c4e0e4fd6c33773f"
  },
  {
    "text": "American Airlines plane collides midair with military helicopter, rescue efforts underway  —  According to the FAA, a Black Hawk helicopter collided into a 60-passenger flight landing at DCA midair.  —  WASHINGTON — Police are investigating a plane crash near Ronald Reagan Washington National Airport.",
    "url": "https://www.wusa9.com/article/travel/all-flights-halted-at-reagan-national-airport-due-to-plane-crash-potomac-river-dc/65-e2090f2d-0bca-4a4c-944c-215a6398a52d"
  },
  {
    "text": "American Airlines plane crashes with helicopter near Reagan National Airport  —  Video shows midair collision near Reagan National Airport  —  An American Airlines passenger plane that departed from Wichita, Kansas, and a U.S. Army Black Hawk helicopter collided near Reagan National Airport Wednesday evening … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/01/29/aircraft-crash-potomac/"
  },
  {
    "text": "Inside 45 hours of chaos: The brief life and quick death of Trump's federal spending freeze  —  The Trump administration's biggest swing at radically reshaping federal spending lasted just under 45 hours.  —  A sweeping freeze on trillions in federal spending for grants and loans … ",
    "url": "https://www.cnn.com/2025/01/29/politics/inside-brief-life-trump-federal-spending-freeze/"
  },
  {
    "text": "New Administration Highlights: Freeze on Federal Funds Rescinded, and Trump Signs Law to Ease Path to Deportations  —  Where Things Stand  — Grant freeze: The White House pulled back an order on Wednesday that froze trillions of dollars in federal grants and loans and sparked mass confusion across the country.",
    "url": "https://www.nytimes.com/live/2025/01/29/us/trump-federal-freeze-funding-news"
  },
  {
    "text": "Trump White House reverses course, rescinds freeze on federal grants  —  The budget office came under immense pressure over the impacts on a sudden pause in key government spending  —  The White House budget office on Wednesday rescinded an order freezing federal grants … ",
    "url": "https://www.washingtonpost.com/business/2025/01/29/white-house-budget-office-spending-freeze/"
  },
  {
    "text": "Trump Signs Agreement Calling for Meta to Pay $25 Million to Settle Suit  —  The president had sued the social-media company after his accounts were suspended  —  President Trump has signed settlement papers that are expected to require Meta Platforms to pay roughly $25 million to resolve … ",
    "url": "https://www.wsj.com/us-news/law/trump-signs-agreement-calling-for-meta-to-pay-25-million-to-settle-suit-6f734c8c?st=7ms8uR&reflink=article_imessage_share"
  },
  {
    "text": "Fetterman: RFK Jr.'s nomination in trouble after rocky hearing  —  Sen. John Fetterman (D-Pa.), who was thought to be open to voting for Robert F. Kennedy Jr.'s nomination to head the Department of Health and Human Services, now says the nominee is in serious trouble after his rocky confirmation hearing.",
    "url": "https://thehill.com/homenews/senate/5114271-fetterman-rfk-jr-nomination-hearing/"
  },
  {
    "text": "I Just Got Trump's “Buyout” Offer at My Job.  Let Me Tell You How That's Going.  —  The author is a federal civil servant who has been granted the use of a pen name to protect them and their family from reprisals.  —  The new Trump administration's effort to both get a grip on and dismantle … ",
    "url": "https://slate.com/news-and-politics/2025/01/donald-trump-news-executive-orders-buyout-freeze-elon-musk.html"
  },
  {
    "text": "Franklin County woman pardoned for Capitol riot is sentenced to 10 years in fatal crash  —  UNION, Mo. — The Franklin County woman pardoned for her participation in the U.S. Capitol insurrection on Jan. 6, 2021 was sentenced Wednesday to 10 years in prison for her role in a fatal drunk driving crash.",
    "url": "https://www.stltoday.com/news/local/crime-courts/emily-hernandez-pardoned-for-capitol-riot-sentenced-to-17-years-in-fatal-dwi-crash/article_bf4def6e-de51-11ef-a3a0-97de6fd4bd53.html"
  },
  {
    "text": "USDA inspector general escorted out of her office after defying White House  —  Security agents escorted the inspector general of the U.S. Department of Agriculture out of her office on Monday after she refused to comply with her firing by the Trump administration, sources familiar with the matter told Reuters.",
    "url": "https://www.usatoday.com/story/news/politics/2025/01/29/usda-inspector-general-escorted-office-trump-white-house/78024513007/"
  },
  {
    "text": "Declassified CIA Guide to Sabotaging Fascism Is Suddenly Viral  —  A declassified World War II-era government guide to “simple sabotage” is currently one of the most popular open source books on the internet.  The book, called “Simple Sabotage Field Manual,” was declassified in 2008 by the CIA and … ",
    "url": "https://www.404media.co/declassified-cia-guide-to-sabotaging-fascism-is-suddenly-viral/"
  },
  {
    "text": "Musk team's push to gut federal workforce bypassed key Trump officials  —  Billionaire Elon Musk has worked behind the scenes on an initiative aimed at depleting the civil service, prompting questions about its legality.  —  Billionaire Elon Musk's influence over a traditionally nonpartisan agency … ",
    "url": "https://www.washingtonpost.com/business/2025/01/29/elon-musk-opm-federal-workers-buyout-trump/"
  },
  {
    "text": "FBI Overhaul Off to a Rocky Start as Kash Patel Prepares to Defend His Vision  —  White House mixes up who is temporarily in charge of agency as Trump loyalist heads into Senate confirmation hearing  —  WASHINGTON—Trump officials tried to start their shake-up of the Federal Bureau … ",
    "url": "https://www.wsj.com/politics/policy/fbi-overhaul-off-to-a-rocky-start-as-kash-patel-prepares-to-defend-his-vision-1085c6f8?st=ChdHtS&reflink=mobilewebshare_permalink"
  },
  {
    "text": "Trump's Inaugural Approval Rating Is Historically Low Again  —  Americans divided over whether Trump's pace in addressing major U.S. problems is about right or too fast  —  WASHINGTON, D.C. — At 47%, President Donald Trump's initial job approval rating for his second term is similar … ",
    "url": "https://news.gallup.com/poll/655955/trump-inaugural-approval-rating-historically-low-again.aspx"
  },
  {
    "text": "Pentagon agency pauses celebrations for Martin Luther King Jr. Day, Black History Month and more  —  The Defense Department's intelligence agency has paused observances of Martin Luther King Jr. Day, Pride Month, Holocaust Days of Remembrance and other cultural or historical annual events … ",
    "url": "https://apnews.com/article/trump-holiday-mlk-day-pride-black-hispanic-dei-047bbdbfc12ea6e9a9731f5861d84e70"
  },
  {
    "text": "Ending Radical Indoctrination in K-12 Schooling  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose and Policy.  Parents trust America's schools to provide their children … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/ending-radical-indoctrination-in-k-12-schooling/"
  },
  {
    "text": "Trump plans to build mass detention camp for deportees at Guantánamo Bay  —  The president ordered construction of a facility with room for 30,000 migrants on the U.S. naval base in Cuba.  —  President Donald Trump on Wednesday ordered the construction of a detention camp with 30,000 beds … ",
    "url": "https://www.washingtonpost.com/immigration/2025/01/29/guantanamo-cuba-el-salvador-deportations/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4MTI2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NTA5MTk5LCJpYXQiOjE3MzgxMjY4MDAsImp0aSI6Ijc5NTk4MzkyLTdkMzctNGM3YS1hZWI3LThmYWM3YTZiYmExNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzAxLzI5L2d1YW50YW5hbW8tY3ViYS1lbC1zYWx2YWRvci1kZXBvcnRhdGlvbnMvIn0.p6vAFrI-7mf90ewNMEqKF2Ey47OMu5V1dELEze-eXwM&itid=gfta"
  },
  {
    "text": "Denver schools under investigation over all-gender bathroom  —  The Department of Education launched an investigation Tuesday against Denver Public Schools for converting a girl's restroom into an all-gender bathroom.  —  The department's Office for Civil Rights said it is investigating … ",
    "url": "https://thehill.com/homenews/education/5112890-denver-public-schools-all-gender-bathroom-investigation/"
  },
  {
    "text": "Elon Musk rose to the top of video game charts.  Now he has confessed to cheating.  —  The world's richest man has admitted to paying to boost his online warriors into global leaderboards, raising questions about his gaming prowess — and his need for digital praise.",
    "url": "https://www.washingtonpost.com/technology/2025/01/29/elon-musk-video-games-diablo-path-exile/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4MTI2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NTA5MTk5LCJpYXQiOjE3MzgxMjY4MDAsImp0aSI6ImE5NzNiNzFmLWZhY2ItNDM1OC04MzVjLTgxMDllYzRlOTRmZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDEvMjkvZWxvbi1tdXNrLXZpZGVvLWdhbWVzLWRpYWJsby1wYXRoLWV4aWxlLyJ9.6bhaQaNRUCuNxmd60eJAcRSeK6MxHzLlHhzT1E7HbZ4&itid=gfta"
  },
  {
    "text": "Senate's reconciliation blueprint is ready to go, Thune says  —  Down in Florida on Wednesday, House Republicans tried to coalesce around a plan to pass “one big, beautiful bill.”  Meanwhile, up in Washington, Senate Republicans are ready to go with their own Plan B. Senate Majority Leader John Thune … ",
    "url": "https://www.politico.com/live-updates/2025/01/29/congress/john-thune-senate-reconciliation-plan-00201406"
  },
  {
    "text": "Trump's Firings Could Bring Court Cases That Expand His Power  —  The prospect of legal challenges to President Trump's purges may be a feature, not a bug, for adherents of sweeping presidential authority.  —  President Trump abruptly fired dozens of officials in the past few days … ",
    "url": "https://www.nytimes.com/2025/01/29/us/politics/trump-firings-officials-legal-test.html"
  }
]