[
  {
    "text": "House Ethics panel does not agree to release the Gaetz report  —  The House Ethics Committee on Wednesday did not agree to release the long-anticipated report into Matt Gaetz.  “There was not an agreement by the committee to release the report,” Chair Michael Guest (R-Miss.) told reporters after the meeting ended.",
    "url": "https://www.politico.com/live-updates/2024/11/20/congress/ethics-panel-does-not-agree-to-release-gaetz-report-00190655"
  },
  {
    "text": "Gaetz sent over $10K in Venmo payments to 2 women who testified in House probe, records suggest  —  House investigators also obtained a $750 check from Gaetz, said sources.  —  Matt Gaetz talks before President-elect Donald Trump speaks during an America First Policy Institute gala at his Mar-a-Lago estate … ",
    "url": "https://abcnews.go.com/US/gaetz-10k-venmo-payments-2-women-testified-house/story?id=116019367"
  },
  {
    "text": "House Ethics Committee to keep Gaetz report under wraps  —  The House Ethics Committee met Wednesday but did not release its report on former Rep. Matt Gaetz (R-Fla.), resisting significant pressure to release its findings after President-elect Trump selected the controversial Florida Republican to be his attorney general.",
    "url": "https://thehill.com/homenews/house/5000250-house-ethics-committee-gaetz-report/"
  },
  {
    "text": "House Democrat pledges to force a vote to release the Gaetz report  —  Illinois Democrat Sean Casten is trying to force a vote on the House floor about releasing the House Ethics Committee's report on Matt Gaetz, who is President-elect Donald Trump's pick to lead the Justice Department.",
    "url": "https://www.politico.com/live-updates/2024/11/20/congress/matt-gaetz-investigation-floor-vote-00190706"
  },
  {
    "text": "Elon Musk and Vivek Ramaswamy: The DOGE Plan to Reform Government  —  Following the Supreme Court's guidance, we'll reverse a decadeslong executive power grab.  —  Our nation was founded on the basic idea that the people we elect run the government.  That isn't how America functions today.",
    "url": "https://www.wsj.com/opinion/musk-and-ramaswamy-the-doge-plan-to-reform-government-supreme-court-guidance-end-executive-power-grab-fa51c020?st=9M7A13&reflink=article_imessage_share"
  },
  {
    "text": "Musk, Ramaswamy lay out plans for ‘mass’ federal layoffs, rule rollbacks under Trump  —  Tech entrepreneurs Elon Musk and Vivek Ramaswamy said Wednesday that their brand-new government efficiency panel will identify “thousands” of regulations for President-elect Trump to eliminate … ",
    "url": "https://thehill.com/policy/technology/5000448-elon-musk-vivek-ramaswamy-government-efficiency/"
  },
  {
    "text": "Speaker Johnson announces policy barring trans women from Capitol bathrooms  —  Speaker Mike Johnson (R-La.) announced on Wednesday that transgender women are not permitted to use bathrooms in the Capitol that match their gender identity, taking a stance on the hot-button issue that has overtaken the Capitol in recent days.",
    "url": "https://thehill.com/homenews/house/5000006-speaker-johnson-transgender-bathroom-policy/"
  },
  {
    "text": "Mike Johnson Announces Transgender Bathroom Ban In Capitol  —  The speaker's announcement is aimed in particular at incoming transgender congresswoman Sarah McBride.  —  LOADING  —  WASHINGTON ― House Speaker Mike Johnson (R-La.) announced Wednesday that transgender lawmakers and staff … ",
    "url": "https://www.huffpost.com/entry/mike-johnson-trans-women-capitol-bathrooms_n_673e19fbe4b09ddca792b130"
  },
  {
    "text": "Trump Accidentally Helps Dems Get Key Judicial Nominees Approved By Taking Republicans To SpaceX Launch  —  If the Republican senators had been there, they likely would have been able to defeat the judicial nominations.  —  As Republicans have been trying to drag down the process … ",
    "url": "https://www.ibtimes.com/trump-accidentally-helps-dems-get-key-judicial-nominees-approved-taking-republicans-watch-spacex-3751915"
  },
  {
    "text": "NC House votes to strip power from incoming Democratic governor, AG as part of Helene aid bill  —  The state's incoming Democratic governor and attorney general Jeff Jackson would lose key powers if the Republican-backed proposal becomes law.  —  Posted 2024-11-19T16:49:26+00:00 - Updated 2024-11-20T03:55:14+00:00",
    "url": "https://www.wral.com/story/nc-house-votes-to-strip-power-from-incoming-democratic-governor-ag-as-part-of-helene-aid-bill/21729412/"
  },
  {
    "text": "4 Trump administration picks have sexual misconduct allegations in their past  —  Matt Gaetz, Pete Hegseth, Robert F. Kennedy, Jr., Elon Musk are all in line to serve as top government leaders.  —  All have faced varying degrees of sexual misconduct allegations.",
    "url": "https://www.cbsnews.com/news/4-trump-administration-picks-sexual-misconduct-allegations/"
  },
  {
    "text": "MSNBC Faces Potential for Big Changes in Comcast Cable Spin-Off  —  MSNBC fans who are disappointed in the progressive-leaning network after Donald Trump's victory in the 2024 election may no longer have it to kick around.  —  The cable-news outlet could have to consider changing its name … ",
    "url": "https://variety.com/2024/tv/news/msnbc-faces-big-changes-comcast-cable-spin-off-rachel-maddow-mark-lazarus-1236215502/"
  },
  {
    "text": "Mandate?  Fuller election results increasingly show GOP gains were small.  —  A holistic look — down to the state legislative level — reinforces the fact that early Trump and GOP claims to a huge “mandate” were overblown.  —  From the moment he claimed victory in the 2024 presidential election … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/20/mandate-fuller-election-results-increasingly-show-gop-gains-were-small/"
  },
  {
    "text": "Raimondo's urgent mission: Leave no cash for Trump  —  With a massive legacy program hanging in the balance, the Commerce secretary wants to get billions in microchip money out the door in the next two months.  —  Commerce Secretary Gina Raimondo is on an urgent mission … ",
    "url": "https://www.politico.com/news/2024/11/20/raimondo-commerce-trump-legacy-00190538"
  },
  {
    "text": "Trump's education pick once incorrectly claimed to have education degree  —  Linda McMahon, in a questionnaire for a 2009 post on a Connecticut state education board, incorrectly said she had a bachelor's degree in education, according to news reports.  —  Linda McMahon, President-elect … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/20/mcmahon-trump-education-degree/"
  },
  {
    "text": "Ukraine fires UK Storm Shadow cruise missiles into Russia, a day after using US ATACMS  —  Ukraine fired a volley of British Storm Shadow cruise missiles into Russia on Wednesday, the latest new Western weapon it has been permitted to use on Russian targets a day after it fired U.S. ATACMS missiles.",
    "url": "https://www.reuters.com/world/europe/ukraine-fires-uk-storm-shadow-cruise-missiles-into-russia-day-after-using-us-2024-11-20/"
  },
  {
    "text": "Luna: Johnson blocked proxy voting for new moms  —  Rep. Anna Paulina Luna (R-Fla.) said Wednesday that Speaker Mike Johnson has blocked her proposal to allow new mothers to vote by proxy for several months from being included in the rules package for the next Congress.",
    "url": "https://www.politico.com/live-updates/2024/11/20/congress/house-proxy-voting-blocked-00190692"
  },
  {
    "text": "Please, Mr. President, ditch this dreadful duo — Gabbard and Gaetz  —  In January 2017, shortly after taking office for the first time, President Donald Trump had already issued 19 executive actions, and this paper dubbed him DON NONSTOP.  —  To which second-term Trump says: “Hold my Diet Coke.”",
    "url": "https://nypost.com/2024/11/19/opinion/donald-trump-please-get-rid-of-matt-gaetz-and-tulsi-gabbard-from-your-cabinet/"
  },
  {
    "text": "Republicans urge college athletic conference to ban transgender athletes  —  The request made to the Mountain West Conference comes after reports of a trans student competing on the San Jose State University women's volleyball team.  —  A group of more than a dozen Republican lawmakers … ",
    "url": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/republicans-mountain-west-conference-transgender-volleyball-athlete-rcna181037"
  },
  {
    "text": "Morning Joe Hemorrhaged Viewers After Announcing Meeting With Trump  —  Based on Monday morning's hour-by-hour ratings, Morning Joe viewers were not happy with Joe Scarborough and Mika Brzezinski's announcement that they met privately with President-Elect Donald Trump at Mar-a-Lago on Friday.",
    "url": "https://www.mediaite.com/tv/new-morning-joe-hemorrhaged-viewers-after-announcing-meeting-with-trump/"
  },
  {
    "text": "Biden administration offers alternatives for Colorado River's long-term operations  —  Biden administration officials on Wednesday announced several potential alternatives for the Colorado River's long-term management, as the expiration date for the current rules approaches.",
    "url": "https://thehill.com/policy/equilibrium-sustainability/5000875-colorado-river-management-alternatives/"
  },
  {
    "text": "Trump's cabinet picks are agents of his contempt, rage and vengeance  —  With them, Trump will tear down any person or institution that tried to restrain his worst impulses or hold him accountable  —  “Shock” suddenly became the most commonly uttered word in habitually nonplussed Washington DC.",
    "url": "https://www.theguardian.com/commentisfree/2024/nov/20/trump-cabinet-picks-contempt-rage-vengeance"
  }
]