[
  {
    "text": "Donald Trump Jr. Piles On With Racist Comments About Haitians  —  After former President Donald J. Trump spread debunked claims that immigrants from Haiti were eating pets, his son cast more aspersions on Haitian immigrants.  —  Amid fallout from Donald J. Trump's debunked claim about immigrants … ",
    "url": "https://www.nytimes.com/2024/09/14/us/politics/don-jr-trump-haitian-migrants.html?unlocked_article_code=1.Kk4.NClr.x2kjJ2DpQ0tc&smid=url-share"
  },
  {
    "text": "Haitian immigrants helped revive a struggling Ohio town.  Then neo-Nazis turned up  —  Springfield's immigrant community was targeted by far-right extremists months before Trump shared racist rumors  —  While Donald Trump made baseless, dangerous claims that immigrants in Ohio … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/14/neo-nazis-springfield-ohio-haitian-immigrants"
  },
  {
    "text": "Trump's Lie Is Another Test for Christian America  —  If we're willing to see children terrorized because of a false rumor about Haitian immigrants, we should ask who abducted our conscience, not someone's pet.  —  The accusation that Haitian immigrants in a small Ohio city are abducting … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/trump-haitian-immigrants-lies/679886/?gift=Ut5zkH9vG00uzi0vmoT5f7BxqaaX_ym0VSj8ui_ApZo&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "‘It just exploded’: Springfield woman claims she never meant to spark false rumors about Haitians  —  The woman behind an early Facebook post that helped spark baseless rumors about Haitians eating pets told NBC News that she feels for the immigrant community.",
    "url": "https://www.nbcnews.com/news/us-news/-just-exploded-springfield-woman-says-never-meant-spark-rumors-haitian-rcna171099"
  },
  {
    "text": "Trump's Vile Lie About Haitians Is the Latest in a Long and Grim Tradition  —  When my family moved back to the United States from East Africa in the mid-1980s, one might have thought it was a peak time of compassion for people suffering in faraway places.  A glittering group of music superstars … ",
    "url": "https://www.nytimes.com/2024/09/14/opinion/trump-debate-haitians-pets.html"
  },
  {
    "text": "The Laura Loomer Problem Is the Same as the Vladimir Putin Problem  —  At about the same time that several of Donald Trump's most loyal supporters were warning that Laura Loomer's access to the former President threatens his presidential bid, Tim Walz was in Grand Rapids mocking how easy it is to manipulate Donald Trump.",
    "url": "https://www.emptywheel.net/2024/09/14/the-laura-loomer-problem-is-the-same-as-the-vladimir-putin-problem/"
  },
  {
    "text": "Trump's swing-state plan targets “sometimes” voters … - Trump's team is outgunned in sheer resources: The campaign says it has about 27,000 top volunteers on the ground nationwide, and “hundreds of thousands” more in various roles in battleground states.",
    "url": "https://www.axios.com/2024/09/14/trump-swing-state-voter-targets"
  },
  {
    "text": "Harris campaign targets Latinos in new ad blitz focused on boxing matches and baseball games  —  The Harris campaign is especially focused on reaching undecided Latino voters who may be persuaded by some of former President Donald Trump's economic message.  —  WASHINGTON — The Harris campaign … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-campaign-aims-bolster-latino-support-spending-blitz-rcna171113"
  },
  {
    "text": "I read the full 900-page Project 2025 manifesto - here's why it matters  —  Heritage Foundation blueprint describes an America poisoned by ‘wokeness’ and overtaken by lawlessness that only conservatives can save  —  I printed out all 900-plus pages of Project 2025 in February on my home printer … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/14/project-2025-election"
  },
  {
    "text": "Stephen Fry: Musk and Zuckerberg have ‘polluted culture’  —  Meta boss Mark Zuckerberg and X owner Elon Musk are “the worst polluters in human history”, Stephen Fry has said.  —  The actor and comedian made the claim during a lecture at Kings College, London.",
    "url": "https://www.bbc.com/news/articles/ceq5q3jlnz3o"
  },
  {
    "text": "Inside Team Trump's Plans For Mass Deportation Camps  —  A key Trump White House adviser said the operation would be “greater than any national infrastructure project we've done to date” as a country.  —  Five years ago, Kris Kobach, Kansas' former secretary of state, announced on Fox Business Network that … ",
    "url": "https://www.huffpost.com/entry/trump-deportation-camps_n_66e4793de4b03e3cc10020c3"
  },
  {
    "text": "How ‘The Apprentice’ Fueled Donald Trump's Rise to the Presidency … Donald Trump had mostly luck to credit for being discovered, at age 57, by Mark Burnett, then the hottest name in the hottest new television genre.Chester Higgins Jr./The New York Times  —  Late in the summer of 2003 … ",
    "url": "https://www.nytimes.com/2024/09/14/business/donald-trump-apprentice.html?unlocked_article_code=1.Kk4.zHgy.nLhXqvv5iELM&smid=em-share"
  },
  {
    "text": "Republicans sued three battleground states this week.  Here's what you need to know  —  Republicans are reprising efforts to legally challenge election law in three key battleground states that could help decide who wins in November.  —  Michigan, North Carolina and Nevada are targets of the blitz … ",
    "url": "https://thehill.com/regulation/court-battles/4879631-republicans-sue-battleground-states/"
  },
  {
    "text": "GOP plays blame game after funding bill failure  —  The House GOP's inability to coalesce around a strategy to address a looming government funding deadline is sparking a blame game among Republicans, after opposition from multiple factions helped thwart Speaker Mike Johnson's (R-La.) … ",
    "url": "https://thehill.com/homenews/house/4879434-republicans-frustrated-government-funding-shutdown/"
  }
]