[
  {
    "text": "As the World Smolders, the New Speaker Trolls Biden  —  It didn't take long for the new House speaker, Mike Johnson, to demonstrate to the world that he will not be a serious partner for American allies or for those who still believe that governing is not a petty little game.",
    "url": "https://www.nytimes.com/2023/11/01/opinion/mike-johnson-israel-ukraine.html"
  },
  {
    "text": "Does New Speaker of the House Mike Johnson Have a Bank Account?  —  Speaker Mike Johnson has never listed a bank account on his financial disclosure.  In fact, on his newest disclosure he doesn't list a single asset at all. … Newly elected Speaker of the House Mike Johnson (R-LA) does not have a bank account.",
    "url": "https://www.thedailybeast.com/does-new-speaker-of-the-house-mike-johnson-have-a-bank-account"
  },
  {
    "text": "Trump's Allies Want a New Style of Lawyer if He Returns to Power  —  Politically appointed lawyers sometimes frustrated Donald J. Trump's ambitions.  His allies are planning to install more aggressive legal gatekeepers if he regains the White House.  —  Close allies of Donald J. Trump … ",
    "url": "https://www.nytimes.com/2023/11/01/us/politics/trump-2025-lawyers.html"
  },
  {
    "text": "Another wave of Israeli strikes hit Gaza refugee camp as crossing opens for foreigners and wounded  —  The Hamas-run government said the strikes killed and wounded many people, but the exact toll was not yet known.  —  RAFAH, Gaza Strip — Israeli airstrikes hit apartment buildings … ",
    "url": "https://www.politico.com/news/2023/11/01/gaza-refugee-camp-israeli-strikes-00124706"
  },
  {
    "text": "Transformed Trump family will take center stage in New York courtroom  —  Once Trump's right hand, daughter Ivanka has stepped back, while Trump sons Eric and Don Jr. defend his business and political legacy  —  Donald Trump had been a pariah on Wall Street for years when a banker … ",
    "url": "https://www.washingtonpost.com/nation/2023/10/31/trump-family-new-york-civil-trial/"
  },
  {
    "text": "EXCLUSIVE: Jenna Ellis' lawyer talks guilty plea in Fulton Trump case  —  Frank Hogue says deal came together in just days  —  When Fulton County prosecutors huddled with lawyers for Jenna Ellis, they said the former Trump campaign lawyer could resolve her case by pleading guilty to being part … ",
    "url": "https://www.ajc.com/politics/exclusive-jenna-ellis-lawyer-talks-about-her-guilty-plea-in-fulton-trump-case/XBRM3YYH4BD2XERHQJZFENA6UA/"
  },
  {
    "text": "After Years of Vowing to Destroy Israel, Iran Faces a Dilemma  —  With Israel bent on crushing Iran's ally Hamas, Tehran must decide whether it and the proxy militias it arms and trains will live up to its fiery rhetoric.  —  For more than four decades, Iran's rulers have pledged to destroy Israel.",
    "url": "https://www.nytimes.com/2023/11/01/world/middleeast/iran-israel-hamas.html"
  },
  {
    "text": "“A kind of Stepford wife”: It's more than a prayer keeping Mike Johnson's wife suddenly out of view  —  The new speaker's Christian right radicalism really comes into view when looking at his marriage  —  When Rep. Mike Johnson, R-La., was elected Speaker of the House … ",
    "url": "https://www.salon.com/2023/11/01/a-kind-of-stepford-wife-its-more-than-a-prayer-keeping-mike-johnsons-wife-suddenly-out-of-view/"
  },
  {
    "text": "Republicans Are Rationalizing Cruelty Toward Gaza  —  Israel has legitimate cause to fight and defeat Hamas.  That doesn't mean we should tell our ally to embrace cruelty and brutality in their response.  —  TWENTY-TWO YEARS AGO, when terrorists massacred Americans in the name of Islam … ",
    "url": "https://plus.thebulwark.com/p/republicans-rationalizing-cruelty-toward-gaza"
  },
  {
    "text": "Christian Nationalism ‘Is No Longer Operating Beneath the Surface’  —  Mike Johnson is the first person to become speaker of the House who can be fairly described as a Christian nationalist, a major development in America history in and of itself.  Equally important, however … ",
    "url": "https://www.nytimes.com/2023/11/01/opinion/mike-johnson-christian-nationalism-speaker.html"
  },
  {
    "text": "RFK Jr.'s donor data reveals his 2024 threat  —  A POLITICO analysis of his donor base reveals a lot about who is powering this unconventional candidate.  —  Robert F. Kennedy Jr. is collecting checks from past Donald Trump donors at a much higher rate than former Joe Biden contributors … ",
    "url": "https://www.politico.com/news/2023/11/01/rfk-jr-2024-campaign-donors-00124621"
  },
  {
    "text": "The GOP voter suppression jamboree comes to North Carolina  —  The state's extreme gerrymander represents the latest Republican effort to secure permanent rule. … Republican policies are not broadly popular.  Rather than alter those policies to win elections, Republicans have chosen to alter elections.",
    "url": "https://www.publicnotice.co/p/north-carolina-gerrymandered-congressional-maps"
  },
  {
    "text": "Powerful Granger not running again for Congress  —  U.S. Rep. Kay Granger, R-Fort Worth, announced Wednesday morning she won't run for reelection.  —  She plans to serve out the remainder of her term.  —  “Serving my community has been the greatest honor, and I have always fought to improve … ",
    "url": "https://fortworthreport.org/2023/10/31/powerful-granger-not-running-again-for-congress-sources-say/"
  },
  {
    "text": "Bipartisan legislation seeks to create children's immigration court  —  A bipartisan, bicameral group of legislators introduced a bill Wednesday that would add protections for minors to immigration courts, which currently have no distinct protocols to process children.",
    "url": "https://thehill.com/latino/4287257-bipartisan-legislation-create-childrens-immigration-court/"
  },
  {
    "text": "Largest Christian university in US fined record amount  —  The largest Christian university in the U.S. is facing a record-setting fine from the Department of Education for allegedly deceiving thousands of students about the cost of its doctoral programs.  —  The department announced … ",
    "url": "https://thehill.com/homenews/education/4287149-largest-christian-university-fine-record/"
  },
  {
    "text": "Sen. John Fetterman faces a left-wing backlash over his stance on Israel.  He isn't budging.  —  The progressive senator from Pennsylvania has resisted calls from some of his supporters and former staffers to call for an immediate cease-fire in the region.  —  In the wake of Hamas' Oct. 7 attack … ",
    "url": "https://www.nbcnews.com/politics/congress/sen-john-fetterman-faces-left-wing-backlash-israel-rcna122204"
  },
  {
    "text": "Kentucky governor declares state of emergency after workers trapped, one killed in coal plant  —  Kentucky Gov. Andy Beshear (D) has declared a state of emergency in Martin County after two workers became trapped in a coal plant when it collapsed Tuesday night, killing one of them.",
    "url": "https://thehill.com/homenews/state-watch/4287324-kentucky-governor-state-emergency-workers-trapped-killed-coal-plant/"
  },
  {
    "text": "Sports betting, craps, roulette coming to Seminole Casinos in December … Ryan Nicol  —  Ryan Nicol covers news out of South Florida for Florida Politics.  Ryan is a native Floridian who attended undergrad at Nova Southeastern University before moving on to law school at Florida State.",
    "url": "https://floridapolitics.com/archives/642266-sports-betting-craps-roulette-coming-to-seminole-casinos-in-december/"
  },
  {
    "text": "AOC accuses pro-Israel PAC of being ‘extremist organization that destabilizes US democracy’  —  AIPAC torched Rep Alexandria Ocasio-Cortez over her peddling ‘of the same tired lies [and] spin’  —  Rep. Alexandria Ocasio-Cortez, D-N.Y., accused a pro-Israel political action committee (PAC) … ",
    "url": "https://www.foxnews.com/politics/aoc-accuses-pro-israel-pac-being-extremist-organization-destabilizes-us-democracy"
  },
  {
    "text": "The Virginia voter purge  —  Election officials working under Virginia Governor Glenn Youngkin (R) have admitted to removing “nearly 3,400 qualified voters from the state's rolls.”  The Youngkin administration originally discovered the mistake at the beginning of October but grossly underestimated the number of voters affected.",
    "url": "https://popular.info/p/the-virginia-voter-purge"
  },
  {
    "text": "Hungary bans teens from visiting World Press Photo exhibition over LGBTQ images  —  The prestigious global photo exhibition, on display in Hungary's National Museum in Budapest, receives over 4 million visitors from around the world every year.  —  BUDAPEST, Hungary … ",
    "url": "https://www.nbcnews.com/nbc-out/out-news/hungary-bans-teens-visiting-world-press-photo-exhibition-lgbtq-images-rcna122777"
  },
  {
    "text": "“Faith and Family” vs Democracy  —  On the normalization of Mike Johnson, the media's inclination to accommodate power, and the perpetuation of “real American” extremism  —  What animates the man who rose through the latest round of Republican Speaker chaos in the House to become one of the nation's most powerful politicians?",
    "url": "https://thomaszimmer.substack.com/p/faith-and-family-vs-democracy"
  },
  {
    "text": "The autoworkers' big win exposes the absurdity of Trump's populism  —  In September, Donald Trump's advisers leaked word that he would travel to Detroit to show support for striking members of the United Auto Workers.  In reality, he ended up addressing workers at a nonunion shop … ",
    "url": "https://www.washingtonpost.com/opinions/2023/11/01/united-auto-workers-strike-deal-big-three-trump-jd-vance/"
  }
]