[
  {
    "text": "Musk Is Going All In to Elect Trump  —  Elon Musk is planting himself in Pennsylvania, has brought his brain trust to help and may even knock on doors himself.  —  In the final weeks of the presidential campaign, the richest man in the world has involved himself in the U.S. election in a manner unparalleled in modern history.",
    "url": "https://www.nytimes.com/2024/10/11/us/politics/elon-musk-donald-trump-pennsylvania.html?unlocked_article_code=1.RU4.hLOY.jvVZPOk1gLaB&smid=url-share"
  },
  {
    "text": "The One Thing Obama Got Wrong  —  Hey, you!  Yeah, I'm talking to you, you resident of Philadelphia, Pittsburgh, Detroit, or these cities' environs!  —  We're coming your way next week—come hang out with us!  And in the meantime: Happy Friday.  —  What Obama Said  —  by Bill Kristol",
    "url": "https://www.thebulwark.com/p/the-one-thing-obama-got-wrong"
  },
  {
    "text": "What It Looks Like When One Side Rejects Democracy  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  Sign up for the email version.  —  When Democracy Itself Is On the Ballot, We've Already Lost  —  The last few weeks have been a particularly strange stretch … ",
    "url": "https://talkingpointsmemo.com/morning-memo/what-it-looks-like-when-one-side-rejects-democracy"
  },
  {
    "text": "Trump's top general calls ex-president ‘fascist to the core’ and ‘most dangerous person to this country,’ new book says  —  Your support helps us to tell the story  —  This election is still a dead heat, according to most polls.  In a fight with such wafer-thin margins … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-fascist-general-woodward-book-b2627972.html"
  },
  {
    "text": "Trump requests military aircraft and vehicles amid Iran threat  —  There is no evidence tying Iran to either of the recent assassination attempts, but the FBI has not ruled out the possibility.  —  Donald Trump's campaign requested military aircraft for Trump to fly in during the final weeks … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/11/trump-security-threats-iran-election-2024-campaign/"
  },
  {
    "text": "Scoop: Trump campaign gets a new communications chief … - It also shows the influence of co-campaign manager Susie Wiles, who in recent weeks has managed to keep several of Trump's rabble-rousing favorites — such as Corey Lewandowski and Laura Loomer — at arms-length from the center of the campaign.",
    "url": "https://www.axios.com/2024/10/11/trump-campaign-communications-new"
  },
  {
    "text": "Damning Video Shows Roger Stone Is Plotting a Coup for November  —  A nine-minute, unedited, undercover interview with Roger Stone revealed some of the MAGA ally's more disturbing goals for a second Trump administration.  —  The covert recording of a discussion between Stone … ",
    "url": "https://newrepublic.com/post/187088/roger-stone-donald-trump-coup-november-video"
  },
  {
    "text": "Battle for Swing States Is Tied, Trump Has Edge on Top Issues, WSJ Poll Shows  —  Voters prefer the Republican on economy and border security, but Harris still has a path to Electoral College win  —  WASHINGTON—Voters in the nation's seven battleground states see Donald Trump as better equipped … ",
    "url": "https://www.wsj.com/politics/elections/trump-harris-swing-state-poll-october-2024-c3ca9414?st=CEGcMA&reflink=desktopwebshare_permalink"
  },
  {
    "text": "I'm Running Out of Ways to Explain How Bad This Is … The truth is, it's getting harder to describe the extent to which a meaningful percentage of Americans have dissociated from reality.  As Hurricane Milton churned across the Gulf of Mexico last night, I saw an onslaught … ",
    "url": "https://www.theatlantic.com/technology/archive/2024/10/hurricane-milton-conspiracies-misinformation/680221/?gift=bQgJMMVzeo8RHHcE1_KM0QW0K3DKS019CAwkgCJs0j8&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Harris ad bashes Trump for criticizing Detroit  —  Vice President Harris's campaign released an ad titled “Like Detroit” on Friday, criticizing former President Trump for his unfavorable comments about the city.  —  “They said we were dead.  That our best days were behind us,” … ",
    "url": "https://thehill.com/homenews/state-watch/4929218-harris-campaign-trump-detroit-comments/"
  },
  {
    "text": "Trump ghostwriter ‘deeply unsettled’ by evidence of ex-president's ‘psychopathy’  —  Donald Trump's ghostwriter for his myth-making memoir “The Art of the Deal” explained how the new film “The Apprentice” reveals how the former president's childhood trauma warped him into a “psychopath” … ",
    "url": "https://www.rawstory.com/tony-schwartz-trump-psychopathy/"
  },
  {
    "text": "California officials reject more SpaceX rocket launches, with some citing Musk's X posts  —  SpaceX's plans to launch more rockets from the California coast were rejected by a state commission this week, with some officials citing Elon Musk's political posts on X and raising concerns … ",
    "url": "https://www.latimes.com/california/story/2024-10-11/la-me-spacex-coastal-commission"
  },
  {
    "text": "In Nevada, Democrats hedge their bets on Senate control  —  Democrats need to hang onto seats in competitive battlegrounds like Nevada to have any hope of keeping their slim majority.  —  RENO, Nev. — As union workers prepared to knock on doors to support Sen. Jacky Rosen on a sunny Thursday afternoon … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nevada-democrats-hedge-bets-senate-control-rcna174973"
  },
  {
    "text": "Democrats to swing states: A vote for Jill Stein is a vote for Trump  —  Democrats are arguing in a new pitch to swing-state voters that a vote for Green Party nominee Jill Stein would only help elect former President Trump.  —  An ad released Thursday says that Stein was “key” … ",
    "url": "https://thehill.com/homenews/campaign/4928622-democrats-swing-state-voters-jill-stein-trump-harris/"
  },
  {
    "text": "Cities seek more than $750K in unpaid bills for Trump campaign events since 2016  —  At least four cities and a county are still waiting to be reimbursed for costs associated with local law enforcement and first responders during Trump's visits.  —  Former President Donald Trump held … ",
    "url": "https://www.nbcnews.com/politics/2024-election/cities-seek-750k-unpaid-bills-trump-campaign-events-rcna174757"
  },
  {
    "text": "Rumors on X Are Becoming the Right's New Reality  —  The site formerly known as Twitter has become the center of a fantastical political culture.  —  A curious set of claims has recently emerged from the right-wing corners of the social-media platform X: FEMA is systematically abandoning … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/10/rumors-x-twitter-musk/680219/"
  },
  {
    "text": "The world according to Mike Johnson … That's longer than Kevin McCarthy lasted in the role.  —  And with 25 days until Election Day, we wanted to catch up with Johnson to discuss his views on the speakership, the upcoming lame-duck session and what 2025 will look like if Republicans keep control of the House.",
    "url": "https://punchbowl.news/article/house/mike-johnson-nearly-one-year-as-speaker/"
  },
  {
    "text": "JPMorgan Calls It: The U.S. Economy Has Made a Soft Landing  —  Bank reports better-than-expected results and raises its guidance for full-year net interest income  —  JPMorgan Chase on Friday said the U.S. economy remains strong for both consumers and big companies, a sign that the Federal Reserve … ",
    "url": "https://www.wsj.com/finance/banking/jpmorgan-chase-jpm-q3-earnings-report-2024-84b76ab9?st=T541rL"
  },
  {
    "text": "'It's mindblowing': US meteorologists face death threats as hurricane conspiracies surge  —  Storms Helene and Milton have triggered rise of misinformation stoked by Trump and fellow Republicans  —  Meteorologists tracking the advance of Hurricane Milton have been targeted by a deluge … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/11/meteorologists-death-threats-hurricane-conspiracies-misinformation"
  },
  {
    "text": "Kamala Harris Is Too Stupid To Be President  —  Democrats have fallen in line behind geriatric and mentally impaired candidates before.  They'll gladly fall in line behind a stupid one now.  —  Univision hosted a “Latinos Ask” town hall with Kamala Harris on Thursday night … ",
    "url": "https://thefederalist.com/2024/10/11/kamala-harris-is-too-stupid-to-be-president/"
  },
  {
    "text": "Texas man abandons suit against women he claimed helped ex-wife get abortion  —  The first-of-its-kind case, decried by abortion rights advocates as an attempt to deter the use of abortion pills, was dropped after a judge refused to compel the women to provide additional information.",
    "url": "https://www.washingtonpost.com/nation/2024/10/11/texas-man-abandons-suit-against-women-he-claimed-helped-ex-wife-get-abortion/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI4NjE5MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwMDAxNTk5LCJpYXQiOjE3Mjg2MTkyMDAsImp0aSI6IjNmMmE5MDBlLTQ1ZWYtNGVmMi04ODQ1LWJjYTgxM2M0OTE0ZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb24vMjAyNC8xMC8xMS90ZXhhcy1tYW4tYWJhbmRvbnMtc3VpdC1hZ2FpbnN0LXdvbWVuLWhlLWNsYWltZWQtaGVscGVkLWV4LXdpZmUtZ2V0LWFib3J0aW9uLyJ9.9E22H5k4xfvOhre23mhq0Ok0T9aTZUnUIGW6SWUU9t4&itid=gfta"
  },
  {
    "text": "U.S. Officials Race to Understand Severity of China's Salt Typhoon Hacks  —  In letters to AT&T, Verizon and Lumen, lawmakers ask about proposed measures the companies will take to protect U.S. wiretap systems  —  WASHINGTON—U.S. officials are racing to understand the full scope … ",
    "url": "https://www.wsj.com/politics/national-security/u-s-officials-race-to-understand-severity-of-chinas-salt-typhoon-hacks-6e7c3951?st=UtTL6y&reflink=desktopwebshare_permalink"
  },
  {
    "text": "FOX NEWS CHANNEL'S HARRIS FAULKNER TO PRESENT TOWN HALL ON WOMEN'S ISSUES FEATURING FORMER PRESIDENT DONALD TRUMP ON OCTOBER 16TH  —  One-Hour Town Hall to Feature All-Female Audience in Cumming, Georgia and Air on “The Faulkner Focus” at 11 AM/ET  —  NEW YORK — October 11, 2024 … ",
    "url": "https://press.foxnews.com/2024/10/fox-news-channels-harris-faulkner-to-present-town-hall-on-womens-issues-featuring-former-president-donald-trump-on-october-16th"
  },
  {
    "text": "Friday Smiles: Some Very Savvy People Break Down the Democratic Freak Out  —  Besides roaming the interwebs and combing through so many different X accounts myself, I'm lucky enough to have a dear friend from high school who once worked in Congress.  Nowadays, he does his own thing … ",
    "url": "https://hotair.com/tree-hugging-sister/2024/10/11/friday-smiles-some-very-savvy-people-break-down-the-democratic-freak-out-n3795687"
  }
]