[
  {
    "text": "Truth Social Users Are Losing Ridiculous Sums of Money to Scams  —  Read the complaints submitted to the FTC by users of Donald Trump's social media platform. … Donald Trump launched Truth Social in 2022 as a social media platform where the MAGA faithful could hang out without any liberals to spoil the fun.",
    "url": "https://gizmodo.com/truth-social-users-are-losing-ridiculous-sums-of-money-to-scams-2000506604"
  },
  {
    "text": "Trump is everywhere.  Anxious Dems wonder why Harris isn't.  —  Trump is everywhere.  Democrats are increasingly wondering why Harris isn't.  —  Democratic operatives, including some of Kamala Harris' own staffers, are growing increasingly concerned about her relatively light campaign schedule … ",
    "url": "https://www.politico.com/news/2024/10/05/harris-30-days-00182592"
  },
  {
    "text": "Where the Harris-Trump race stands 1 month out from Election Day  —  Vice President Harris and former President Trump have one month to convince voters to side with them in what appears likely to be one of the tightest presidential races in American history.",
    "url": "https://thehill.com/homenews/campaign/4917032-vice-president-harris-trump-presidential-race/"
  },
  {
    "text": "Playbook: Michigan messes mount for Harris  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  TICK TOCK — One month until Election Day.  —  RETURN TO BUTLER — Former President DONALD TRUMP heads back to Butler, Pennsylvania, today … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/10/05/michigan-messes-mount-for-harris-00182609"
  },
  {
    "text": "Interested Parties Memo: Fighting Hurricane Helene Falsehoods with Facts  —  Senior Advisor to the President and Communications Director Ben LaBolt, and Director of Digital Strategy Christian Tom  —  Under President Biden and Vice President Harris's direction, the Administration has mobilized a robust … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/10/05/interested-parties-memo-fighting-hurricane-helene-falsehoods-with-facts/"
  },
  {
    "text": "Trump Made Another Joke About Supporter Killed At Pennsylvania Rally: Report  —  The news comes as the former president is set to return to the site of his July assassination attempt.  —  LOADING  —  Donald Trump used a reference to the widow of Corey Comperatore — a supporter killed during … ",
    "url": "https://www.huffpost.com/entry/trump-joke-widow-corey-comperatore-butler-rally-tape_n_670107d0e4b0c12c1d3bf72e"
  },
  {
    "text": "The Supreme Court Is Waiting Until After the Election to Do Its Next Damage  —  The first Monday of October is the traditional start of the Supreme Court docket-harvest festival, when a handful of cases are plucked by the justices to be argued before the highest court in the land and previewed by a deferential press corps.",
    "url": "https://slate.com/news-and-politics/2024/10/supreme-court-2024-election-plans.html"
  },
  {
    "text": "Colorado judge who sentenced election denier Tina Peters to prison receives threats  —  A rural Colorado county courthouse beefed up security Friday after threats were made against staff and a judge who sentenced former county clerk Tina Peters to nearly nine years behind bars and admonished … ",
    "url": "https://apnews.com/article/tina-peters-election-clerk-sentenced-threats-d565bd42bc566d4d178491a258238765"
  },
  {
    "text": "Melania Trump Reveals Why Donald Keeps Phoning Her Personal Doctor  —  ‘GENUINE AND CARING’  —  The former first lady opens about surprising aspects of her marriage in her forthcoming memoir and confirms she is an unrepentant election denier. … Melania Trump has opened up about a surprising aspect … ",
    "url": "https://www.thedailybeast.com/melania-trump-reveals-why-donald-keeps-phoning-her-personal-doctor-and-what-she-believes-about-2020-election"
  },
  {
    "text": "Florida is nearing toss-up status as top Republican poll shows Trump's lead nearly vanished  —  Race and age of Florida respondents seemed to correlate with which candidate they supported  —  Your support helps us to tell the story  —  As your White House correspondent, I ask the tough questions and seek the answers that matter.",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/florida-trump-toss-up-state-harris-b2624445.html"
  },
  {
    "text": "Trump lost the respect of veterans - including me.  He's a risk to our democracy.  —  I am one of hundreds of former national security leaders who have endorsed Harris for president.  We have been concerned for some time about the truly troubling prospect of the return of Trump.",
    "url": "https://www.usatoday.com/story/opinion/voices/2024/10/05/trump-attacks-military-families-veterans-vote-harris/75458231007/"
  },
  {
    "text": "Biden administration sends $100 million to repair roads, bridges in NC after Helene  —  The Biden administration announced Saturday that it would be sending $100 million to help the North Carolina Department of Transportation pay for immediate emergency repairs from Hurricane Helene damage, according to a press release.",
    "url": "https://thehill.com/homenews/administration/4917788-biden-administration-100-million-nc-after-helene/"
  },
  {
    "text": "What Really Happened On Tim Walz's Trips to China  —  Former students reflect on their time in China with the would-be vice president.  —  Tim Walz would like to take Donald Trump to China — or at least that is what he said during this week's vice-presidential debate.",
    "url": "https://www.politico.com/news/magazine/2024/10/05/what-really-happened-on-tim-walzs-trips-to-china-00179326"
  },
  {
    "text": "These 2024 Republican candidates disputed the 2020 election results  —  It's not just Donald Trump and JD Vance.  Numerous other 2020 election deniers are running in 2024 elections.  —  At least 23 of this year's 51 Republican nominees for governor, state elections chief or the US Senate … ",
    "url": "https://www.cnn.com/2024/10/05/politics/republican-candidates-2020-election-results/"
  }
]