[
  {
    "text": "Clashing Over Jan. 6, Trump and Biden Show Reality Is at Stake in 2024  —  In dueling sets of speeches, Donald Trump and President Biden are framing the election as a battle for the future of democracy — with Mr. Trump brazenly casting Mr. Biden as the true menace.",
    "url": "https://www.nytimes.com/2024/01/06/us/politics/jan-6-trump-biden.html"
  },
  {
    "text": "Obama, worried about Trump, urges Biden circle to bolster campaign  —  The former president shared his thoughts about the reelection campaign during a private lunch with Biden at the White House  —  Former president Barack Obama has raised questions about the structure of President Biden's … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/06/obama-biden-meeting-campaign-2024/"
  },
  {
    "text": "Trump's promotion of debunked election report reveals divisions in his circle  —  Former president Donald Trump took to his social media website one day this past week to post a report ridden with falsehoods about fraud in the 2020 election.  And his legal team cited Trump's post in a brief … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/06/trump-debunked-report-election-advisers/"
  },
  {
    "text": "Trump Considers Making 2017 Personal Tax Cuts Permanent  — Candidate intends to keep corporate tax levels unchanged  — Trump aims to seize on Biden's economic weakness with voters  —  Donald Trump plans to make permanent the 2017 individual tax cuts that he enacted as president … ",
    "url": "https://www.bloomberg.com/news/articles/2024-01-06/trump-considers-making-2017-personal-tax-cuts-permanent"
  },
  {
    "text": "A second Trump presidency is an existential national security threat to our democracy  —  If you had told us in 2019 that a mob of Americans would be inspired by a president of the United States to ransack the U.S. Capitol, assault police officers and intimidate sitting members of Congress … ",
    "url": "https://thehill.com/opinion/4392907-a-second-trump-presidency-is-an-existential-national-security-threat-to-our-democracy/"
  },
  {
    "text": "DeSantis Says He's Looking to Make ‘Credible Case’ to Remove Biden From Florida Ballot  —  The Sunshine State governor made a similar comment recently when he warned that Maine's ruling disqualifying Trump 'opens up Pandora's box'  —  JWPlayer  —  Florida Gov. Ron DeSantis has revealed that he's … ",
    "url": "https://themessenger.com/politics/desantis-says-hes-looking-to-make-credible-case-to-remove-biden-from-florida-ballot"
  },
  {
    "text": "A tense new Jan. 6 video shows Republican congressmen admonishing rioters trying to enter House chamber  —  “You ought to be ashamed of yourself!” one Republican representative told rioters as they attempted to breach the House floor.  “I've never had people act this way.”",
    "url": "https://www.nbcnews.com/politics/justice-department/tense-new-jan-6-video-shows-republican-congressmen-admonishing-rioters-rcna132625"
  },
  {
    "text": "FBI in Florida captures 3 people linked to Jan. 6 on third anniversary of riot  —  The FBI apprehended three people accused of participating in the Jan. 6, 2021, attack on the Capitol, at a ranch in Florida, the agency announced Saturday.  —  FBI's Tampa office identified the fugitives … ",
    "url": "https://thehill.com/regulation/court-battles/4393014-fbi-captures-3-fugitives-linked-to-jan-6-riot/"
  },
  {
    "text": "What Did Josh Hawley's Jan. 6 Fist Pump Really Mean?  We Asked the Photographer Who Got the Shot.  —  A Q&A with POLITICO photographer Francis Chung on capturing an iconic moment.  —  Sen. Josh Hawley gestures toward a crowd of supporters of President Donald Trump gathered outside … ",
    "url": "https://www.politico.com/news/magazine/2024/01/06/jan-6-josh-hawley-photo-q-a-00134017"
  },
  {
    "text": "How the GOP's rewriting of Jan. 6 paved the way for Trump's comeback  —  Pressure from family members and advocates for accused rioters was amplified by online influencers and right-wing media figures, leading lawmakers to minimize, excuse and deny the violence and rehabilitate Trump",
    "url": "https://www.washingtonpost.com/national-security/2024/01/06/trump-jan-6-rewrite-presidential-election/"
  },
  {
    "text": "US Intelligence Shows Flawed China Missiles Led Xi to Purge Army  — China missiles filled with water, not fuel: US intelligence  — Xi seeking to root out corruption, prepare military for combat  —  US intelligence indicates that President Xi Jinping's sweeping military purge came … ",
    "url": "https://www.bloomberg.com/news/articles/2024-01-06/us-intelligence-shows-flawed-china-missiles-led-xi-jinping-to-purge-military"
  },
  {
    "text": "Trump Doesn't Actually Speak for the Silent Majority  —  I can't fit everything that I think into a single piece, especially when I'm writing on deadline.  My column this week, for example, was on the effort to disqualify Trump from the 2024 ballot using Section 3 of the 14th Amendment.",
    "url": "https://www.nytimes.com/2024/01/06/opinion/trump-2024-election-silent-majority.html"
  },
  {
    "text": "The Supreme Court is allowing Idaho to enforce its strict abortion ban, even in medical emergencies  —  The Supreme Court on Friday allowed Idaho to enforce its strict abortion ban, even in medical emergencies, while a legal fight continues.  The justices said they would hear arguments … ",
    "url": "https://apnews.com/article/supreme-court-abortion-medical-emergencies-idaho-8ca89d7de0c1fa9256dcd27d1847e144"
  },
  {
    "text": "House Speaker Johnson invites Biden to deliver State of the Union address on March 7 … - It will be the first State of the Union address for Johnson, who became House speaker in October after a drawn-out and bitter battle for the chair. … - He also went off script and urged Republicans … ",
    "url": "https://www.axios.com/2024/01/06/biden-state-of-the-union-address-super-tuesday"
  },
  {
    "text": "Defense Secretary Lloyd Austin recovering after being admitted to hospital  —  Defense Secretary Lloyd Austin was admitted to Walter Reed National Military Medical Center on New Year's Day for complications from an elective medical procedure, the Pentagon said Friday.",
    "url": "https://www.cnn.com/2024/01/05/politics/defense-secretary-lloyd-austin-hospital/"
  },
  {
    "text": "Nikki Haley says she would ‘maybe’ consider Ron DeSantis as her running mate  —  Haley wouldn't rule out joining forces with the Florida governor, while saying she is “not running to be vice president.”  —  Former U.N. Ambassador Nikki Haley said she would “maybe” consider Florida … ",
    "url": "https://www.nbcnews.com/politics/2024-election/haley-desantis-vice-president-trump-rcna131923"
  }
]