[
  {
    "text": "Clarence Thomas' 38 Vacations: The Other Billionaires Who Have Treated the Supreme Court Justice to Luxury Travel  —  Co-published with CNN  —  Friends of the Court: SCOTUS Justices' Beneficial Relationships With Billionaire Donors  —  Supreme Court Justice Clarence Thomas' decadeslong friendship … ",
    "url": "https://www.propublica.org/article/clarence-thomas-other-billionaires-sokol-huizenga-novelly-supreme-court"
  },
  {
    "text": "Trump unleashes on Biden as legal problems mount  —  Former President Trump on Thursday unleashed a torrent of insults against President Biden, attacking him in personal terms as Trump's legal problems continue to mount.  —  “What Crooked Joe Biden, who can't string two sentences together … ",
    "url": "https://thehill.com/homenews/administration/4147012-trump-unleashes-on-biden-as-legal-problems-mount/"
  },
  {
    "text": "‘Anonymous’ Trump critic mulled Election Day suicide  —  A Trump administration insider who waged war against the president under the moniker “Anonymous” said he considered suicide on election night 2020 when it appeared that the former president was going to win.",
    "url": "https://www.washingtonexaminer.com/news/washington-secrets/anonymous-trump-critic-mulled-election-day-suicide"
  },
  {
    "text": "Trump, aide plead not guilty in documents case.  De Oliveira does not enter plea  —  FORT PIERCE, Fla. — Donald Trump and one of his two co-defendants on Thursday pleaded not guilty in federal court to multiple charges alleging that the former president kept classified documents at his Florida property and … ",
    "url": "https://www.washingtonpost.com/national-security/2023/08/10/trump-aide-carlos-de-oliveira-arraignment/"
  },
  {
    "text": "The truth about Monique Worrell  —  On November 3, 2020, Monique Worrell (D) was elected state's attorney in Florida's 9th Judicial District, which includes Orange and Osceola counties.  Worrell won in resounding fashion, collecting 395,979 votes and defeating her opponent by a two-to-one margin.",
    "url": "https://popular.info/p/the-truth-about-monique-worrell"
  },
  {
    "text": "Suspended Soros-linked central Florida prosecutor blasts DeSantis as a ‘dictator’  —  State Attorney Monique Worrell likened Gov. Ron DeSantis (R-FL) to a “weak dictator” after he suspended her for allegedly neglecting her prosecutorial duties in central Florida.",
    "url": "https://www.washingtonexaminer.com/news/suspended-florida-prosecutor-blasts-desantis-dictator"
  },
  {
    "text": "Wildfires just destroyed a Maui town.  Next year could be worse.  —  The raging fires have killed at least 36 people and caused what is expected to be billions of dollars in damages.  Climate change could prompt more of the same.  —  This post has been updated.  —  Nelly Niumatalolo couldn't believe it when she heard it.",
    "url": "https://grist.org/wildfires/wildfires-just-destroyed-a-maui-town-next-year-could-be-worse/"
  },
  {
    "text": "Why the Ohio Special Election Backfired for the GOP  —  “AS I THOUGHT ABOUT THIS VOTE more and more, what they were trying to do and the way they were trying to do it was just kind of creepy.”  —  Outside a polling place in Cleveland on Tuesday, a thirtysomething art teacher was explaining to me her … ",
    "url": "https://plus.thebulwark.com/p/why-the-ohio-special-election-backfired-for-gop"
  },
  {
    "text": "Racing to Stop Trump, Republicans Descend on a Strange New Iowa  —  As the state fair and its Republican pageantry begin, Donald Trump's rivals face a transformed political environment in Iowa, where he holds a comfortable edge in polls despite rarely visiting.",
    "url": "https://www.nytimes.com/2023/08/10/us/politics/trump-republicans-iowa-state-fair.html"
  },
  {
    "text": "Security bolstered for judge overseeing Trump election case  —  The increase in security around U.S. District Court Judge Tanya Chutkan comes as the former president has been criticizing her on social media.  —  Judge in Trump election interference case receiving extra security in courthouse",
    "url": "https://www.nbcnews.com/politics/donald-trump/security-bolstered-judge-overseeing-trump-election-case-rcna99221"
  },
  {
    "text": "GOP Candidate Plagiarized Massive Segments of His College Thesis  —  Controversial GOP congressional candidate Anthony Sabatini appears to have lifted massive segments of his college thesis from Wikipedia and gotten away with it—until now. … Right-wing Florida Republican congressional … ",
    "url": "https://www.thedailybeast.com/gop-candidate-anthony-sabatini-plagiarized-massive-segments-of-his-college-thesis"
  },
  {
    "text": "Golf legend Phil Mickelson wagered more than $1 billion over decades, lost around $100 million, gambler claims  — Star golfer Phil Mickelson bet more than $1 billion over three decades, and sustained gambling losses of close to $100 million, Billy Walters says in a new book.",
    "url": "https://www.cnbc.com/2023/08/10/golf-legend-phil-mickelson-wagered-more-than-1-billion-over-decades.html"
  },
  {
    "text": "Anti-corruption presidential candidate slain at campaign event in Ecuador's capital  —  An Ecuadorian presidential candidate known for speaking up against corruption was shot and killed Wednesday at a political rally in the capital, an attack that comes amid a wave of startling violence in the South American country.",
    "url": "https://apnews.com/article/ecuador-villavicencio-presidential-candidate-killed-ee9c726b82c09e16e5dacde2d6f005ff"
  },
  {
    "text": "Nikki Haley signs RNC pledge to support eventual GOP nominee but makes one small edit  —  RNC Chairwoman Ronna McDaniel made the ‘Beat Biden pledge’ a requirement for candidates wishing to participate in party-sanctioned debates  —  FIRST ON FOX: GOP presidential candidate Nikki Haley … ",
    "url": "https://www.foxnews.com/politics/nikki-haley-signs-rnc-pledge-support-eventual-republican-presidential-nominee"
  },
  {
    "text": "Trump adviser groped 2 women in 2021 at Scottsdale club, one tells police  —  A woman says Boris Epshteyn, a special adviser to Donald Trump, repeatedly groped her and her sister inside a Scottsdale nightclub in 2021, according to police body camera footage obtained by The Arizona Republic.",
    "url": "https://www.azcentral.com/story/news/politics/elections/2023/08/10/trump-adviser-boris-epshteyn-groped-2-women-in-scottsdale-one-says/70562482007/"
  },
  {
    "text": "Four Americans wrongfully detained in Iran released on house arrest, signaling a potential end to their imprisonment  —  Four Americans who have been wrongfully detained in Iran have been released from prison and are now under house arrest, a lawyer for one of the prisoners told CNN on Thursday … ",
    "url": "https://www.cnn.com/2023/08/10/politics/americans-released-from-iranian-prison-house-arrest/"
  },
  {
    "text": "July CPI report shows inflation gauge rose 3.2%, less than expected  —  WATCH NOW  —  Inflation gauge rose 3.2% annually in July, less than expected  —  The consumer price index rose 3.2% from a year ago in July, a sign that inflation has lost at least some of its grip on the U.S. economy.",
    "url": "https://www.cnbc.com/2023/08/10/cpi-inflation-july-2023-.html"
  },
  {
    "text": "Indictment charges former soldier with stealing vehicle, crashing into Army facility  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of Georgia  —  Charges carry possible sentence of up to 20 years in prison  —  SAVANNAH, GA:  A retired U.S. Army soldier … ",
    "url": "https://www.justice.gov/usao-sdga/pr/indictment-charges-former-soldier-stealing-vehicle-crashing-army-facility"
  }
]