[
  {
    "text": "How Mark Meadows Pursued a High-Wire Legal Strategy in Trump Inquiries  —  The former White House chief of staff, a key witness to Donald J. Trump's efforts to remain in power after his 2020 election loss, maneuvered to provide federal prosecutors only what he had to.",
    "url": "https://www.nytimes.com/2023/08/22/us/politics/mark-meadows-trump-legal-strategy.html"
  },
  {
    "text": "Majority of likely Iowa GOP caucusgoers believe Trump won the 2020 election  —  The new NBC News/Des Moines Register/Mediacom poll shows Trump's unfounded claims he won the last election remain salient ahead of the Iowa GOP caucus.  —  More than half of likely Iowa Republican caucusgoers … ",
    "url": "https://www.nbcnews.com/politics/2024-election/majority-likely-iowa-gop-caucusgoers-say-trump-won-2020-election-rcna100955"
  },
  {
    "text": "State senator eyes new panel as way to punish Fani Willis over Trump indictments  —  Commission, starting in October, will have power to sanction and even remove prosecutors  —  X  —  Several Republican lawmakers are seeking ways to sanction Fulton County District Attorney Fani Willis … ",
    "url": "https://www.ajc.com/politics/trumps-georgia-allies-search-for-ways-to-punish-fani-willis/LYUKIOKBJJBMBAXFD3JCWO2ZTQ/"
  },
  {
    "text": "Trump attorneys guided false electors in Georgia, GOP chair says  —  The false electors were later used by Trump allies to attempt to foment a conflict on Jan. 6, 2021 and derail the transfer of power to President Joe Biden.  —  Former Georgia Republican Party Chair David Shafer said attorneys … ",
    "url": "https://www.politico.com/news/2023/08/22/trump-indictment-false-electors-00112229"
  },
  {
    "text": "Attorney John Eastman surrenders to authorities on charges in Georgia 2020 election subversion case  —  John Eastman, the conservative attorney who pushed a plan to keep Donald Trump in power, turned himself in to authorities Tuesday on charges in the Georgia case alleging an illegal plot … ",
    "url": "https://apnews.com/article/trump-georgia-election-indictment-fulton-county-clark-7641b5c61dbcc39ee3f0edbe51558925"
  },
  {
    "text": "Trump's bond set for $200,000 in Fulton County  —  X  —  Former President Donald Trump was granted a $200,000 bond on Monday ahead of the Republican's expected surrender at the Fulton County jail.  —  Under the terms of the consent bond order, Trump can't perform any acts of witness intimidation … ",
    "url": "https://www.ajc.com/politics/trumps-bond-set-for-200000-in-fulton-county/YVM7QOLFL5FDRGIVL6A7FR6JMI/"
  },
  {
    "text": "Scoop: Fox News restricts Trump team's access to debate “spin room”  —  Fox News hit back at former President Trump late Monday after he declined to appear at the GOP presidential debate the network will host Wednesday in Milwaukee. … - Trump senior aides who had indicated they'd be in the spin room … ",
    "url": "https://www.axios.com/2023/08/22/fox-news-restricts-trump-campaign-access-debate-spin-room"
  },
  {
    "text": "US businessman is wannabe ‘warlord’ of secretive far-right men's network  —  Revealed: Charles Haywood, creator of the Society for American Civic Renewal, has said he might serve as ‘warlord’ at the head of an ‘armed patronage network’  —  The founder and sponsor of a far-right network of secretive … ",
    "url": "https://www.theguardian.com/world/2023/aug/22/charles-haywood-claremont-institute-sacr-far-right"
  },
  {
    "text": "Why do Republicans disproportionately believe health misinformation?  —  Rep. Marjorie Taylor Greene (R-Ga.) had only one comment to add when sharing a wildly conspiratorial article alleging that the recent surge in covid cases could be a way to force compliance with vaccination efforts … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/22/republicans-vaccines-polls/"
  },
  {
    "text": "DNC to troll GOP debate by flying anti-MAGA banner  —  The Democratic National Committee (DNC) has plans to troll the Republican presidential primary debate in Milwaukee on Wednesday by flying a plane pulling a banner that knocks the “Make America Great Again” (MAGA) movement around the venue.",
    "url": "https://thehill.com/homenews/campaign/4164334-dnc-to-troll-gop-debate-by-flying-anti-maga-banner/"
  },
  {
    "text": "Trump vows massive new tariffs if elected, risking global economic war  —  Former president floats 10 percent tax on all foreign imports and calls for ‘ring around the collar’ of U.S. economy  —  Even in the face of growing personal legal peril, Donald Trump summoned his top economic advisers … ",
    "url": "https://www.washingtonpost.com/business/2023/08/22/trump-trade-tariffs/"
  },
  {
    "text": "State of 2024 Utah GOP Presidential Primary  —  Trump has a Double-Digit Lead in a State that Once Rejected Him  —  Toplines and Crosstabs can be Found Here  —  The 2024 Republican presidential primary is in full swing, and Noble Predictive Insights (NPI) has new data on the state of the race.",
    "url": "https://www.noblepredictiveinsights.com/post/state-of-2024-utah-gop-presidential-primary"
  },
  {
    "text": "Sen. Rick Scott picks up a Democratic challenger for 2024  —  Former Rep. Debbie Mucarsel-Powell announced Tuesday that she's taking on the incumbent Republican in what's considered an uphill climb for Democrats.  —  Former Democratic Rep. Debbie Mucarsel-Powell announced Tuesday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/rep-debbie-mucarsel-powell-challening-rick-scott-senate-2024-rcna101023"
  },
  {
    "text": "John Eastman Statement Upon Self-Surrender in Fulton County  —  I am here today to surrender to an indictment that should never have been brought.  It represents a crossing of the Rubicon for our country, implicating the fundamental First Amendment right to petition the government for redress of grievances.",
    "url": "https://www.burnhamgorokhov.com/john-eastman-statement-upon-self-surrender-in-fulton-county/"
  },
  {
    "text": "Elon Musk plans to remove headlines from news articles shared on X  —  X, the social media platform previously known as Twitter, is planning a major change in how news articles appear on the service, stripping out the headline and other text so that tweets with links display only an article's lead image … ",
    "url": "https://fortune.com/2023/08/21/elon-musk-plans-remove-headlines-news-articles-link-shared-on-x-twitter/"
  },
  {
    "text": "Supreme Court Asked To Hear Case Testing Scope of Affirmative Action Ban  —  A parents group backed by a conservative legal organization asked the U.S. Supreme Court on Monday to consider whether an admissions policy aimed at diversifying an elite Virginia high school is racially discriminatory.",
    "url": "https://freebeacon.com/latest-news/supreme-court-asked-to-hear-case-testing-scope-of-affirmative-action-ban/"
  },
  {
    "text": "Biden names former Obama-era lawyer as White House counsel  —  The appointment comes as Biden seeks to advance his legislative agenda and faces ongoing Republican-led congressional investigations.  —  WASHINGTON — President Joe Biden named former federal prosecutor and Chicago lawyer Ed Siskel … ",
    "url": "https://www.nbcnews.com/politics/white-house/biden-names-former-obama-era-lawyer-white-house-counsel-rcna101146"
  },
  {
    "text": "‘I Could Use a Little More Self-Flagellation’  —  Before Chris Christie became Donald Trump's sharpest critic, he was an important early booster.  Does he need to apologize for that?  —  Mary Beth Koeth for POLITICO  —  SOUTH MIAMI, Fla. —  Early this past Friday morning … ",
    "url": "https://www.politico.com/news/magazine/2023/08/22/chris-christie-donald-trump-critic-00112106"
  },
  {
    "text": "Popular GOP governor reveals key for candidates onstage at Republican presidential debate  —  Fox News is hosting the first Republican presidential nomination debate on Wednesday at 9pm ET in Milwaukee, Wisconsin  —  LONDONDERRY, N.H. - Republican Gov. Chris Sununu of New Hampshire … ",
    "url": "https://www.foxnews.com/politics/popular-gop-governor-reveals-key-candidates-onstage-republican-presidential-debate"
  },
  {
    "text": "Lawmakers want subpoena power in UFO inquiries  —  Lawmakers on both sides of the aisle are looking to expand their investigative power following their July hearing on unidentified aerial phenomena (UAP), or UFOs, which they say left more questions than answers.",
    "url": "https://thehill.com/homenews/house/4164741-lawmakers-want-subpoena-power-in-ufo-inquiries/"
  },
  {
    "text": "Biden admin launches new income-driven student loan repayment program  —  The Biden administration officially launched the new income-driven student loan repayment plan for borrowers on Tuesday, ahead of repayments restarting this fall.  —  The official launch of the Saving on a Valuable Education … ",
    "url": "https://thehill.com/homenews/education/4163126-biden-admin-launches-new-income-driven-student-loan-repayment-program/"
  }
]