[
  {
    "text": "‘Like Talking to Your Drunk Uncle’: Trump's Closed-Door Rant to House Republicans … Donald Trump came to the Capitol Hill Club Thursday morning supposedly to discuss his agenda for a second term with House Republicans.  Instead, Trump treated his meeting as an opportunity to deliver a behind-closed-doors … ",
    "url": "https://www.notus.org/trump-2024/like-talking-to-your-drunk-uncle-trump-closed-door-rant-house-republicans"
  },
  {
    "text": "Trump pumps himself up in session with House GOP … - Noted that nearly all of the Republicans who voted in favor of impeaching him have since either retired or lost re-election and touted polling showing him leading by a slim margin in Virginia;  — Warned House Republicans … ",
    "url": "https://www.axios.com/2024/06/13/trump-pumps-himself-up-in-session-with-house-gop"
  },
  {
    "text": "What Trump told CEOs in their private meeting … Donald Trump huddled with at least 80 CEOs on Thursday in Washington with a clear pitch to them: If he is elected president again in November, the CEOs are going to see tax cuts and a curtailment of business regulations.",
    "url": "https://www.cnbc.com/2024/06/13/what-trump-told-ceos-in-their-private-meeting.html"
  },
  {
    "text": "Supreme Court upholds broad access to key abortion pill mifepristone  —  Ever since the high court eliminated the right to abortion in 2022, medications to terminate pregnancy have grown in importance and been challenged in court.  —  The Supreme Court on Thursday refused to limit access … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/13/supreme-court-abortion-pill-ruling-mifepristone/"
  },
  {
    "text": "Harlan Crow Provided Clarence Thomas at Least 3 Previously Undisclosed Private Jet Trips, Senate Probe Finds  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Billionaire political donor Harlan … ",
    "url": "https://www.propublica.org/article/clarence-thomas-harlan-crow-private-jet-flights-senate-investigation-scotus"
  },
  {
    "text": "Supreme Court rejects effort to trademark “Trump too small” phrase … - The phrase stemmed from taunts between Trump and Sen. Marco Rubio (R-Fla.) during the 2016 Republican presidential primary. … - “Such restrictions have historically been grounded in the notion that a person has ownership … ",
    "url": "https://www.axios.com/2024/06/13/supreme-court-rejects-trump-too-small-trademark"
  },
  {
    "text": "Campaigns Can Now See What You Watch on TV.  It's Changing Everything. … Political aide turned data guru Jesse Contario works in the shadows.  His employer, MiQ, will never be mentioned at the end of a campaign ad, and it won't show up on the disclosures campaigns must post to keep the public abreast of their work.",
    "url": "https://www.notus.org/2024-election/streaming-tv-campaign-ads"
  },
  {
    "text": "World losers gather at G7 summit … - Biden's 37% approval rating positively sparkles next to Canadian PM Justin Trudeau (30%), German Chancellor Olaf Scholz (25%), U.K. Prime Minister Rishi Sunak (25%), French President Emmanuel Macron (21%) and Japanese PM Fumio Kishida (13%), per Morning Consult's tracker.",
    "url": "https://www.axios.com/2024/06/13/g7-summit-2024-unpopular-leaders-biden-trudeau"
  },
  {
    "text": "Donald Trump calls Milwaukee ‘a horrible city’ weeks before RNC comes to town  —  Molly Beck Lawrence AndreaMilwaukee Journal Sentinel  —  WASHINGTON - Donald Trump on Thursday called Milwaukee — where in a little over a month he will be declared the Republican nominee for president — a “horrible city.”",
    "url": "https://www.jsonline.com/story/news/politics/2024/06/13/trump-calls-milwaukee-host-for-the-2024-rnc-a-horrible-city/74083831007/"
  },
  {
    "text": "Record Share of U.S. Electorate Is Pro-Choice and Voting on It  —  Democrats continue to rally around abortion rights since Dobbs verdict  —  WASHINGTON, D.C. — A record-high 32% of U.S. voters say they would only vote for a candidate for major office who shares their views on abortion.",
    "url": "https://news.gallup.com/poll/645836/record-share-electorate-pro-choice-voting.aspx"
  },
  {
    "text": "Schiff repeats ‘guilty’ 34 times at hearing on Trump prosecution  —  Rep. Adam Schiff (D-Calif.) sought to make a statement about former President Trump's criminal conviction Thursday, repeating the word “guilty” 34 times in a row, once for each of the former president's guilty counts in the Manhattan hush money case.",
    "url": "https://thehill.com/homenews/house/4720436-adam-schiff-donald-trump-hearing-investigation-conviction-hush-money-34-charges/"
  },
  {
    "text": "Republican National Committee prepares for a convention Trump may not attend  —  Republican officials are working to ensure that Trump will be able to address convention attendees from afar if he chooses to do so — or if he is forced to because of his legal troubles.",
    "url": "https://www.nbcnews.com/politics/2024-election/republican-national-committee-convention-trump-may-not-attend-rcna156838?taid=666ad0faf5f56e0001ae0cda"
  },
  {
    "text": "In calling out Trump, Harris finds her mission  —  No one is better equipped to take down felon Donald Trump than the vice president.  —  Just a couple of weeks ago, Democrats were wringing their hands, worried that the Biden-Harris campaign would not do enough to highlight former president … ",
    "url": "https://www.washingtonpost.com/opinions/2024/06/13/kamala-harris-trump-conviction-hush-money/"
  },
  {
    "text": "Gen Z influencers who supported Biden in 2020 turn against him  —  The Gaza war, lack of progress on climate change and a potential TikTok ban are spawning anti-Biden content — even among former supporters.  —  In 2020, hundreds of top TikTok content creators banded together in service of a single goal: get Joe Biden elected.",
    "url": "https://www.washingtonpost.com/technology/2024/06/13/influencers-biden-tiktok-ban/"
  },
  {
    "text": "Let's Talk About Trump's Gibberish  —  Sign up for The Decision, a newsletter featuring our 2024 election coverage.  —  Perhaps the greatest trick Donald Trump ever pulled was convincing millions of people—and the American media—to treat his lapses into fantasies and gibberish as a normal, meaningful form of oratory.",
    "url": "https://www.theatlantic.com/politics/archive/2024/06/trump-sharks-las-vegas-rally-speech/678667/"
  },
  {
    "text": "Microsoft Chose Profit Over Security and Left U.S. Government Vulnerable to Russian Hack, Whistleblower Says  —  Microsoft hired Andrew Harris for his extraordinary skill in keeping hackers out of the nation's most sensitive computer networks.  In 2016, Harris was hard at work on a mystifying incident … ",
    "url": "https://www.propublica.org/article/microsoft-solarwinds-golden-saml-data-breach-russian-hackers"
  },
  {
    "text": "Electoral College Rating Changes: Half-Dozen Moves Toward Republicans in What Remains a Toss-up Race  —  KEY POINTS FROM THIS ARTICLE  — We are making six Electoral College rating changes this week, all in favor of Republicans.  — However, we don't really see a clear favorite … ",
    "url": "https://centerforpolitics.org/crystalball/electoral-college-rating-changes-half-dozen-moves-toward-republicans-in-what-remains-a-toss-up-race/"
  },
  {
    "text": "The Christian right is coming for divorce next  —  Before the 1960s, it was really hard to get divorced in America.  —  Typically, the only way to do it was to convince a judge that your spouse had committed some form of wrongdoing, like adultery, abandonment, or “cruelty” (that is, abuse).",
    "url": "https://www.vox.com/today-explained-newsletter/354635/divorce-no-fault-states-marriage-republicans"
  },
  {
    "text": "Supreme Court Backs Starbucks Over ‘Memphis 7’ Union Case  —  In a blow to the National Labor Relations Board, the justices made it more difficult to order employers to reinstate fired workers.  —  The Supreme Court ruled in favor of Starbucks on Thursday in a challenge against a labor ruling … ",
    "url": "https://www.nytimes.com/2024/06/13/business/economy/supreme-court-starbucks-nlrb.html"
  },
  {
    "text": "‘Scared to put on my mask’: Cancer patient says she was intentionally coughed on in spat over mask  —  The Republican-led state House passed a bill Tuesday that would adjust exceptions to the state law governing masks.  The bill is awaiting a decision by Gov. Roy Cooper.",
    "url": "https://www.wral.com/story/scared-to-put-on-my-mask-cancer-patient-says-she-was-intentionally-coughed-on-in-spat-over-mask/21478890/"
  }
]