[
  {
    "text": "Live Updates: One Juror Dismissed as Selection Continues in Trump Trial  —  The third day of Donald J. Trump's criminal trial began with the dismissal of one of the seven jurors who had already been seated.  The former president is accused of falsifying business records to cover up a sex scandal.",
    "url": "https://www.nytimes.com/live/2024/04/18/nyregion/trump-hush-money-trial"
  },
  {
    "text": "2 members of Trump jury excused, including woman who feared being identified  —  Two people who were selected to serve on the jury in former President Donald Trump's criminal trial in New York were excused on Thursday, including one woman who expressed concerns about being identified publicly and her ability to remain impartial.",
    "url": "https://www.cbsnews.com/news/donald-trump-new-york-court-criminal-trial/"
  },
  {
    "text": "All 12 jurors seated for Trump's historic criminal trial - as it happened  —  This live blog is now closed.  For the latest on Trump's criminal trial, read our full report:  —  Summary  —  ‘We have our jury,’ judge Juan Merchan said after all 12 jurors were selected  —  All 12 jurors seated",
    "url": "https://www.theguardian.com/us-news/live/2024/apr/18/donald-trump-trial-updates"
  },
  {
    "text": "Top Dem Goes Nuclear on GOP for ‘Diddling Around’ While People Die in Ukraine  —  ‘IT IS ON US’  —  “Don't talk about what weapons we want to give them.  We're not giving them what they need now, and it has been months in the coming!”  Rep. Rosa DeLauro pleaded.",
    "url": "https://www.thedailybeast.com/top-dem-goes-nuclear-on-gop-for-diddling-around-while-people-die-in-ukraine"
  },
  {
    "text": "Conservatives corner Mike Johnson in House floor confrontation … - The House changed its rules this Congress to allow a single member to challenge the speaker's job with a motion to vacate.  — One option being urged by Johnson allies is to change House rules in coming days to force … ",
    "url": "https://www.axios.com/2024/04/18/mike-johnson-gaetz-motion-to-vacate-ukraine"
  },
  {
    "text": "Live Updates: Police Arresting Pro-Palestinian Protesters at Columbia  —  Officers began arresting students on Thursday, a day after university officials testified about antisemitism before Congress.  —  Here's the latest on the protests.  —  The police moved Thursday afternoon to quell … ",
    "url": "https://www.nytimes.com/live/2024/04/18/nyregion/columbia-university-protests"
  },
  {
    "text": "Jan. 6 lawsuits against Trump may advance despite criminal case, judge rules  —  Instead, the judge ordered Trump to begin describing the basis for his claim that he is immune from the lawsuits.  —  Lawsuits by members of Congress and police officers against Donald Trump for his actions … ",
    "url": "https://www.politico.com/news/2024/04/18/jan-6-lawsuits-trump-00153133"
  },
  {
    "text": "Key Takeaways … Approximately half (53%) of young Americans indicate they will “definitely be voting” in the 2024 general election for president.  Young Americans' interest in voting in 2024 is now on par with Harvard Youth Poll data from 2020, which indicated that 54% would likely vote.",
    "url": "https://iop.harvard.edu/youth-poll/47th-edition-spring-2024#key-takeaway--id--1564"
  },
  {
    "text": "SENILE: Joe Biden's Painfully Awkward Trip to a Gas Station Is a Major Red Flag  —  Joe Biden had quite the day on Wednesday, and that's saying something for the often-confused president.  Traveling to Pennsylvania to once again pander to the “working class” he has no actual connection to … ",
    "url": "https://redstate.com/bonchie/2024/04/18/senile-joe-bidens-painfully-awkward-trip-to-a-gas-station-is-a-major-red-flag-n2172959"
  },
  {
    "text": "Miscalculation Led to Escalation in Clash Between Israel and Iran  —  Israeli officials say they didn't see a strike on a high-level Iranian target in Syria as a provocation, and did not give Washington a heads-up about it until right before it happened.  —  Israel was mere moments away … ",
    "url": "https://www.nytimes.com/2024/04/17/world/middleeast/iran-israel-attack.html"
  },
  {
    "text": "Far-Right Sheriffs Want a Citizen Army to Stop ‘Illegal Immigrant’ Voters  —  Speakers at a conference for Constitutional Sheriffs claimed that militias need to patrol polling stations to stop the “expected flood” of immigrant voters.  —  As the presidential election approaches … ",
    "url": "https://www.wired.com/story/constitutional-sheriffs-election-deniers-immigrants-voting/"
  },
  {
    "text": "‘They want Russia to win so badly’: GOP congressman blasts far-right House Republicans  —  A sitting Republican Congressman is harshly criticizing far-right House Republicans over their apparent support of Russia.  —  “I guess their reasoning is they want Russia to win so badly that they want to oust the Speaker over it.",
    "url": "https://www.alternet.org/dan-crenshaw-gop-russia/"
  },
  {
    "text": "The anti-abortion movement is showing its true colors  —  The facade of the anti-abortion movement is cracking, despite the movement's strenuous attempts to appear reasonable.  Evidence has been coming fast and furious this year, thanks to courts stacked with anti-abortion judges whose radical decisions … ",
    "url": "https://thehill.com/opinion/judiciary/4602554-the-anti-abortion-movement-is-showing-its-true-colors/"
  },
  {
    "text": "Kennedy Family Strongly Endorses Biden  —  “That's right, the Kennedy family endorses Joe Biden for President,” Kerry Kennedy said in a speech with President Biden flanked to her right, and 5 siblings behind her.  —  Subscribe now  —  Kerry Kennedy spoke firmly and clearly … ",
    "url": "https://www.dworkinsubstack.com/p/kennedy-family-strongly-endorses"
  },
  {
    "text": "36-year-old joins wave of House Republican retirements … - Two House Republicans told Axios they expect more retirement announcements in the coming weeks. … - “It is time to pursue other opportunities and have the benefit of spending more time with my family,” he said.",
    "url": "https://www.axios.com/2024/04/18/jake-laturner-retire-house-gop-kansas"
  },
  {
    "text": "Ilhan Omar's Daughter Isra Hirsi Allegedly Suspended From College For Anti-Israel Activity  —  Isra Hirsi, Democratic Minnesota Rep. Ilhan Omar's daughter, claimed Thursday that she had been “suspended” from Barnard College due to her pro-Palestinian activity.",
    "url": "https://dailycaller.com/2024/04/18/isra-hirsi-suspended-from-barnard-college-for-anti-israel-activity/"
  },
  {
    "text": "Trump is funneling campaign money into cash-strapped businesses.  Experts say it looks bad.  —  Donald Trump's main 2024 White House campaign fundraising operation sharply increased spending at the former president's properties in recent months, funneling money into his businesses … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/04/18/trump-campaign-funnels-money-to-his-businesses/73344744007/"
  },
  {
    "text": "Turning Point Action official resigns after accusation of election-related fraud  —  PHOENIX — A top leader of the national conservative group Turning Point Action, which has amplified false claims of election fraud by former president Donald Trump and others, resigned Thursday after being accused … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/18/austin-smith-turning-point-action-election-fraud/"
  },
  {
    "text": "The U.S. just changed how it manages a tenth of its land  —  The Interior Department rule puts conservation and clean energy development on par with drilling, mining and resource extraction on federal lands for the first time  —  For decades, the federal government has prioritized oil and gas drilling … ",
    "url": "https://www.washingtonpost.com/climate-environment/2024/04/18/biden-public-lands-conservation-rule/"
  },
  {
    "text": "Marjorie Taylor Greene would like to remind us that she is not serious  —  As recently as last month, Rep. Marjorie Taylor Greene (R-Ga.) was still sensitive about the whole “Jewish space lasers” thing.  —  You may recall — who are we kidding, you do recall — that, soon after she was first elected … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/18/marjorie-taylor-greene-lasers-israel-amendment/"
  },
  {
    "text": "Google fires 28 employees involved in sit-in protest over $1.2B Israel contract  —  Google has fired 28 employees over their participation in a 10-hour sit-in at the search giant's offices in New York and Sunnyvale, California, to protest the company's business ties with the Israel government, The Post has learned.",
    "url": "https://nypost.com/2024/04/17/business/google-fires-28-employees-involved-in-sit-in-protest-over-1-2b-israel-contract/"
  },
  {
    "text": "Wray says FBI on alert for threats against Jews ahead of Passover … - Director Christopher Wray told Jewish community security officials Wednesday the bureau is “particularly concerned” that lone actors could target gatherings and events or religious locations over the holiday.",
    "url": "https://www.axios.com/2024/04/18/fbi-alert-threats-jews-passover"
  }
]