[
  {
    "text": "Two hours after mocking Arizona's Attorney General, Rudy Giuliani is served at his own birthday party  —  The announcement came shortly after Giuliani posted a photo taunting the Arizona AG  —  PHOENIX — Arizona's Democratic Attorney General Kris Mayes on Friday announced that Rudy Giuliani … ",
    "url": "https://www.nbcnews.com/politics/politics-news/two-hours-mocking-arizonas-attorney-general-rudy-giuliani-served-birth-rcna152905"
  },
  {
    "text": "Rudy Giuliani served with Arizona ‘fake electors’ indictment during 80th birthday bash in Palm Beach  —  Rudy Giuliani's 80th birthday bash in Palm Beach was stormed “like it was Normandy” as the former New York City mayor was served with notice of his Arizona indictment, sources told The Post.",
    "url": "https://nypost.com/2024/05/18/us-news/rudy-giuliani-served-with-arizona-fake-electors-indictment-during-80th-birthday-bash-in-palm-beach/"
  },
  {
    "text": "CNN political commentator Alice Stewart dies  —  Alice Stewart, a veteran political adviser and CNN political commentator who worked on several GOP presidential campaigns, has died.  She was 58.  —  Law enforcement officials told CNN that Stewart's body was found outdoors in the Bellevue neighborhood … ",
    "url": "https://www.cnn.com/2024/05/18/politics/alice-stewart-cnn-commentator-dies"
  },
  {
    "text": "Playbook: Trump — and Fox — strike back in the debate wars  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  HAPPY BIRTHDAY RUDY — “Rudy Giuliani served with Arizona ‘fake electors’ indictment during 80th birthday bash in Palm Beach,” … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/05/18/trump-and-fox-strike-back-in-the-debate-wars-00158773"
  },
  {
    "text": "Biden and Trump Hunt for Breakthrough Moment in Stagnant Election  —  Up-for-grabs voters have tuned out the messengers, and their messages  —  WASHINGTON—Tens of millions of dollars in TV ads has failed to lift President Biden's historically weak approval ratings.",
    "url": "https://www.wsj.com/politics/elections/2024-election-biden-trump-breakthrough-moments-401aca2b"
  },
  {
    "text": "Trump amps up his vaccine rhetoric, guarding against RFK Jr.  —  The former president is accusing Kennedy of being a “fake” anti-vaxxer.  —  Donald Trump's long-fraught relationship with the Covid vaccine is again becoming a political liability for the former president as he tries to stop … ",
    "url": "https://www.politico.com/news/2024/05/19/trump-vaccine-rfk-jr-00158743"
  },
  {
    "text": "After years of Democratic dominance, Nevada could be slipping from Biden's grasp  —  The Silver State hasn't supported a Republican presidential candidate since George W. Bush in 2004, but polls this year so far show Donald Trump with a lead.  —  LAS VEGAS — For nearly two decades … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/19/biden-nevada-voters-economy-election-2024/"
  },
  {
    "text": "Gantz to Netanyahu: If you don't change course by June 8 we will withdraw from the government  —  Israeli Minister Gantz sets June 8 deadline for Gaza plan.  Threatens to exit government if demands unmet.  Netanyahu office responds with ultimatums.  —  In a move likely to aggravate political tension … ",
    "url": "https://www.jpost.com/breaking-news/article-801652"
  },
  {
    "text": "Trump at NRA convention floats a 3-term presidency  —  The former president has more recently shut down the proposition of seeking a third term, which is barred by the Constitution.  —  Former President Donald Trump on Saturday floated the idea of a third term if he wins in November.",
    "url": "https://www.politico.com/news/2024/05/18/trump-at-nra-convention-floats-a-three-term-presidency-00158786"
  },
  {
    "text": "AOC Reveals Darker Intentions Behind MTG Hearing Chaos  —  Representative Alexandria Ocasio-Cortez revealed Friday that the GOP-led House Oversight Committee abdicated normal procedures after the panel devolved into mudslinging, sparked by a characteristically bizarre outburst by Marjorie Taylor Greene.",
    "url": "https://newrepublic.com/post/181718/aoc-darker-intentions-mtg-hearing-chaos"
  },
  {
    "text": "Louisiana set to become 1st state requiring 10 Commandments be posted in schools  —  Louisiana is poised to become the first state requiring display of the Ten Commandments at all schools that receive public funding, including colleges and universities.",
    "url": "https://www.axios.com/local/new-orleans/2024/05/17/louisiana-10-commandments-classrooms"
  },
  {
    "text": "Unpacking the presidential money machines  —  A POLITICO analysis of campaign finance filings shows clear contrasts between Trump's and Biden's sprawling political operations.  —  Donald Trump's political operation had a startling weakness as the general election kicked off this year … ",
    "url": "https://www.politico.com/news/2024/05/18/trump-biden-2024-campaign-spending-00158758"
  },
  {
    "text": "Trump Plans to Reward Peter Navarro for Going to Jail Instead of Being a ‘Rat’  —  Trump wants to pardon Peter Navarro and give him a job after he went to jail for refusing to comply with the Jan. 6 congressional investigation  —  FORMER TRUMP WHITE House aide Peter Navarro was sent … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-peter-navarro-reward-jail-rat-1235023334/"
  },
  {
    "text": "Georgia president vetoes ‘foreign agent’ law  —  Governing Georgian Dream party can still force the controversial legislation through parliament.  —  TBILISI — The Georgian government's plans to brand Western-funded NGOs, media outlets and campaign groups as “foreign agents” … ",
    "url": "https://www.politico.eu/article/georgia-president-zurabishvili-vetoes-foreign-agent-law-russia-eu/"
  }
]