[
  {
    "text": "Trump deputy campaign manager identified in Arlington National Cemetery dustup  —  One of two staffers involved in the altercation at Arlington National Cemetery is a deputy campaign manager for Donald Trump's reelection bid, NPR has learned.  The former president insisted this week the incident … ",
    "url": "https://www.npr.org/2024/09/05/nx-s1-5101991/trump-campaign-arlington-national-cemetery-staff-debate"
  },
  {
    "text": "JD Vance says school shootings are a ‘fact of life,’ calls for better security  —  School shootings are a “fact of life,” so the U.S. needs to harden security to prevent more carnage like the shooting this week that left four dead in Georgia, Republican vice presidential nominee JD Vance said Thursday.",
    "url": "https://apnews.com/article/jd-vance-georgia-shooting-7d7727a1aff8491f66914a4d8a14cd8c"
  },
  {
    "text": "BREAKING: Hunter Biden Enters Open Guilty Plea in Tax Case; Sentencing Set for December  —  Hunter Biden entered an open guilty plea in a Los Angeles courtroom Thursday afternoon to nine charges brought against him in a federal indictment related to failure to pay income taxes and tax evasion.",
    "url": "https://redstate.com/jenvanlaar/2024/09/05/breaking-hunter-biden-enters-open-guilty-plea-in-tax-case-sentencing-set-for-december-n2178965"
  },
  {
    "text": "The father of the Georgia school shooting suspect has been arrested and charged, authorities say  —  The father of the Apalachee High School shooting suspect has been arrested in connection with the shooting that left four people dead, according to the Georgia Bureau of Investigation.",
    "url": "https://www.cnn.com/2024/09/05/us/winder-georgia-shooting-apalachee-high-school"
  },
  {
    "text": "Russia's useful idiots  —  The MAGA influencer ecosystem is even shadier than we thought. … On Wednesday, the Department of Justice indicted two employees of RT, formerly Russia Today, a Russian state-run media outlet, for covertly shoveling millions of dollars at MAGA influencers happy to do Russia's bidding.",
    "url": "https://www.publicnotice.co/p/russia-indictment-tim-pool-benny-johnson-rubin"
  },
  {
    "text": "U.S. labor market cools again in August, adding 142,000 jobs … - The report also shows notable revisions for months past: The economy added just 89,000 jobs in July—25,000 fewer than initially thought.  — June's gains were revised down by 61,000 to 118,000.",
    "url": "https://www.axios.com/2024/09/06/jobs-report-august-2024-economy-unemployment"
  },
  {
    "text": "‘A huge mistake’: Trump's crypto allies cringe over family's startup  —  The crypto venture is attracting what appear to be hacks and attempted scams ahead of its launch.  —  Donald Trump's sons want to turn their father's growing bromance with the cryptocurrency industry into the new family business.",
    "url": "https://www.politico.com/news/2024/09/06/trump-family-crypto-startup-00177566"
  },
  {
    "text": "Tucker Carlson and the Heterodoxy-to-Holocaust Denial Pipeline  —  This week Tucker Carlson, the former Fox News star who now hosts one of America's top podcasts, had an apologist for Adolf Hitler on his show.  Darryl Cooper, who runs a history podcast and newsletter called Martyr Made … ",
    "url": "https://www.nytimes.com/2024/09/06/opinion/tucker-carlson-holocaust-denial.html"
  },
  {
    "text": "Did the media learn nothing from its disastrous coverage of Trump and Clinton in 2016?  —  The press is still pursuing the appearance of fairness by treating the true and the false, normal and outrageous, as equally valid  —  The first thing to say about the hate and scorn currently directed … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/sep/06/trump-clinton-harris-election"
  },
  {
    "text": "Navy Secretary Broke Law With Trump-Bashing, Pro-Biden Comments: Watchdog  —  Carlos Del Toro's comments while on official duty overseas violated the Hatch Act, said the U.S. Office of Special Counsel.  —  LOADING  —  Navy Secretary Carlos Del Toro broke the law by publicly endorsing … ",
    "url": "https://www.huffpost.com/entry/navy-secretary-hatch-act_n_66dae860e4b0abbb7b447dd2"
  },
  {
    "text": "Harris's Huge Cash Edge Means Less Need for Her to Headline Fundraisers  —  Vice president raised $361 million in August and ended month with more than $400 million in the bank, giving her an advantage over Donald Trump  —  WASHINGTON—Vice President Kamala Harris's prolific fundraising … ",
    "url": "https://www.wsj.com/politics/elections/harriss-huge-cash-edge-means-less-need-for-her-to-headline-fundraisers-1654aff0"
  },
  {
    "text": "Stop letting right wing influencers cosplay as ‘independent’ media  —  We need to know who is funding the creator economy  —  Yesterday, a federal indictment revealed that a Tennessee media company working with right-wing influencers including Benny Johnson, Tim Pool, Dave Rubin … ",
    "url": "https://taylorlorenz.substack.com/p/we-need-to-know-who-is-funding-the"
  },
  {
    "text": "Inside Mike Johnson's ‘Failure Theater’ on Government Funding  —  Mike Johnson's latest government funding plan seems to be a charade.  Whether anyone will really be convinced of it is the question.  — Copy  —  House Speaker Mike Johnson is bringing lawmakers back to Washington next week … ",
    "url": "https://www.notus.org/congress/inside-mike-johnsons-failure-theater-government-funding"
  },
  {
    "text": "Vance: John McCain wouldn't support Harris if he saw the border  —  “I really don't believe that,” the Republican vice presidential nominee said.  —  Republican vice presidential nominee JD Vance said on Thursday from Arizona that he does not believe former Sen. John McCain … ",
    "url": "https://www.politico.com/news/2024/09/05/vance-mccain-arizona-harris-00177643"
  },
  {
    "text": "Harris leads Trump in four of seven swing states, Times poll says  —  Survey taken by YouGov after Democratic convention suggests the vice-president may be on course to win the electoral college  —  Kamala Harris leads Donald Trump in four of the swing states likely to decide the election … ",
    "url": "https://www.thetimes.com/world/us-world/article/polls-trump-vs-harris-2024-us-election-sx6rjw0p2"
  },
  {
    "text": "Democrats launch text message campaign in Florida Senate race to reach Latino voters  —  Debbie Mucarsel-Powell, the former U.S. House Democrat now challenging Florida Republican Sen. Rick Scott for the Senate, has launched a new campaign on WhatsApp to reach voters and attack a sea of disinformation.",
    "url": "https://www.npr.org/2024/09/05/g-s1-21160/florida-senate-mucarsel-powell-whatsapp"
  },
  {
    "text": "Eighty-eight corporate leaders endorse Harris in new letter, including CEOs of Yelp, Box  —  @IN/MEGAN-CASSELLA-BA02A160/ @MMCASSELLA  — Eighty-eight corporate leaders signed a new letter Friday endorsing Vice President Kamala Harris for president.  — Signers include former 21st … ",
    "url": "https://www.cnbc.com/2024/09/06/harris-endorsed-trump-murdoch-yelp-snap-ripple.html"
  },
  {
    "text": "Trump's federal election prosecution isn't going to trial anytime soon.  But it could still produce damaging revelations before Nov. 5.  —  A new schedule from Judge Tanya Chutkan leaves the door open for an October surprise.  —  Special counsel Jack Smith and Donald Trump … ",
    "url": "https://www.politico.com/news/2024/09/05/trump-federal-election-case-chutkan-schedule-00177619"
  },
  {
    "text": "Veterans turn away from ‘disrespectful’ Donald Trump  —  The presidential nominee has no regard for the military, say once-loyal Republicans, after his campaign filmed him at a wreath-laying ceremony  —  For Wayne Collins, the “last straw” came last week when, in his view … ",
    "url": "https://www.thetimes.com/world/us-world/article/veterans-turn-away-from-disrespectful-donald-trump-5fgjkb89h"
  },
  {
    "text": "FBI raids homes of top aides to New York City Mayor Eric Adams  —  The two deputy mayors are the highest-ranking Adams administration officials yet to be ensnared in the federal probe into Adams' 2021 campaign.  —  NEW YORK — Federal authorities have raided the homes of two of New York City Mayor Eric Adams … ",
    "url": "https://www.politico.com/news/2024/09/05/fbi-new-york-city-mayor-eric-adams-00177536"
  }
]