[
  {
    "text": "Johnson gets squeezed by Biden, Senate GOP on Ukraine, border  —  President Biden and congressional leaders in both parties are ramping up pressure on Speaker Mike Johnson (R-La.) to accept an expected deal on Ukraine funding and border security, warning national security is at risk without action by Congress.",
    "url": "https://thehill.com/homenews/senate/4414689-johnson-gets-squeezed-by-biden-senate-gop-on-ukraine-border/"
  },
  {
    "text": "Senate Republicans warn House they won't get a better immigration deal under Trump  —  “To those who think that if President Trump wins, which I hope he does, that we can get a better deal — you won't,” Sen. Lindsey Graham, R-S.C., told reporters on Wednesday.",
    "url": "https://www.nbcnews.com/politics/congress/senate-republicans-warn-house-wont-get-better-immigration-deal-trump-rcna134348"
  },
  {
    "text": "Speaker Johnson Can ‘Absolutely’ Expect to Be Toppled if He Keeps Caving, GOP Lawmaker Warns  —  Yet another GOP hardliner threatens to oust the speaker, predicting Johnson ‘will get rolled, just like we always do’  —  House Freedom Caucus member Eli Crane has joined a growing number … ",
    "url": "https://themessenger.com/politics/speaker-johnson-can-absolutely-expect-to-be-toppled-fellow-gop-lawmaker-warns"
  },
  {
    "text": "Shake-Up by a Desperate DeSantis Opens Wider Path for Haley in New Hampshire  —  Ron DeSantis's super PAC began layoffs on the same day he signaled he would largely bypass New Hampshire's primary election and train his efforts on South Carolina.  —  Straining to recover after a bruising defeat in Iowa … ",
    "url": "https://www.nytimes.com/2024/01/17/us/politics/desantis-layoffs-super-pac.html"
  },
  {
    "text": "Trump solidifies lead in NH, Haley firmly in second, new poll shows  —  Only 5% of likely Republican primary voters said they would choose Ron DeSantis, leaving him a distant third  —  Former President Donald Trump has solidified his lead in New Hampshire ahead of the state's first-in-the-nation primary … ",
    "url": "https://www.nbcboston.com/news/local/trump-solidifies-lead-in-nh-haley-firmly-in-second-new-poll-shows/3249134/"
  },
  {
    "text": "Judge threatens to throw Trump out of E. Jean Carroll defamation trial  —  The writer has sued former president Donald Trump for allegedly defaming her after she publicly accused him of sexual assault  —  NEW YORK — A federal judge threatened to throw Donald Trump out of court Wednesday … ",
    "url": "https://www.washingtonpost.com/national-security/2024/01/17/trump-defamation-trial-carroll-new-york/"
  },
  {
    "text": "The ‘Sleeping Giant’ Case that Could Upend Jack Smith's Prosecution of Trump  —  The Supreme Court has agreed to consider a case that doesn't mention the former president, but that could invalidate half of the Jan. 6 charges against him.  —  There's been a lot of attention paid … ",
    "url": "https://www.politico.com/news/magazine/2024/01/17/supreme-court-case-trump-prosecution-00135852"
  },
  {
    "text": "Supreme Court Hears Case That Could Overturn Key Chevron Precedent  —  The Supreme Court considered whether to overrule the seminal 1984 Chevron decision, which requires judges to defer to agencies' interpretations of ambiguous statutes.  —  Members of the Supreme Court's conservative … ",
    "url": "https://www.nytimes.com/2024/01/17/us/supreme-court-chevron-case.html"
  },
  {
    "text": "Jamie Dimon praises Trump, warns MAGA criticism could hurt Biden  — JPMorgan Chase CEO Jamie Dimon praised former President Donald Trump's positions on the economy, taxes and immigration.  — Dimon admonished Democrats to be “more respectful” toward Trump's supporters, or else risk hurting President Joe Biden's reelection bid.",
    "url": "https://www.cnbc.com/2024/01/17/jamie-dimon-praises-trump-warns-maga-criticism-could-hurt-biden.html"
  },
  {
    "text": "‘Survivor’ Champ Kentucky Pol Whose Incest Bill Would Let Cousins Have Sex: ‘I Made a Mistake’ (Exclusive)  —  ‘I was thinking like a lawyer, not like a legislator,’ state Rep. Nick Wilson tells The Messenger  —  A Kentucky Republican introduced a bill on Tuesday that was intended to broaden … ",
    "url": "https://themessenger.com/news/incest-kentucky-cousins-lawmaker-bill-decriminalize-sex-nick-wilson-mistake-republican"
  },
  {
    "text": "New Baltimore Sun owner insults staff in meeting, says paper should mimic Fox45  —  In a tense, three-hour meeting with staff Tuesday afternoon, new Baltimore Sun owner David Smith told employees he has only read the paper four times in the past few months, insulted the quality of their journalism … ",
    "url": "https://www.thebaltimorebanner.com/economy/baltimore-sun-david-smith-sinclair-owner-F77S3D47ORD7LNEPZ7PJCXSLWM/"
  },
  {
    "text": "Texas defies federal threat to abandon border area, setting up legal showdown  —  The attorney general of Texas on Wednesday defied federal officials who demanded state authorities abandon a public park along the U.S.-Mexico border that state National Guard soldiers seized last week … ",
    "url": "https://www.cbsnews.com/news/texas-border-us-mexico-ken-paxton-attorney-general/"
  },
  {
    "text": "Democrat Keen wins state House 35 special election over GOP's Booth  —  In a race seen as a bellwether for Democratic chances in November, Democrat Tom Keen flipped what had been a Republican state House seat in Central Florida in a special election held Tuesday.",
    "url": "https://www.orlandosentinel.com/2024/01/16/democrat-keen-wins-state-house-35-special-election-over-gops-booth/"
  },
  {
    "text": "House GOP hit with another retirement announcement  —  Rep. Jeff Duncan (R-S.C.) announced Wednesday he will not seek re-election to Congress after more than a decade in office, marking the latest in a series of GOP retirement announcements this month. … - “After 9/11, I felt a calling to serve my State or Nation in some capacity.",
    "url": "https://www.axios.com/2024/01/17/house-republicans-retirement-jeff-duncan"
  },
  {
    "text": "White House Phoned Asa Hutchinson to Apologize for DNC Slight  —  The call came after the DNC took a potshot at the former Arkansas governor, who was one of Donald Trump's biggest critics from the right.  —  President Joe Biden on Wednesday dispatched his chief of staff to call the former Arkansas … ",
    "url": "https://www.thedailybeast.com/white-house-phoned-asa-hutchinson-to-apologize-for-dnc-slight"
  },
  {
    "text": "Blinken Stranded After Boeing 737 Breaks Down on Davos Trip  —  US Secretary of State Antony Blinken was unable to fly home from Davos as scheduled on Wednesday due to a critical error with his aircraft. … An oxygen leak detected previously could not be remedied.",
    "url": "https://www.bloomberg.com/news/articles/2024-01-17/blinken-stranded-after-boeing-plane-breaks-down-on-davos-trip"
  },
  {
    "text": "Harris says ‘no denying’ America's history of racism  —  Vice President Harris said clearly that the U.S. has racism in its history, bucking remarks to the contrary from GOP presidential candidates Nikki Haley and Florida Gov. Ron DeSantis.  —  “There is no denying that we have … ",
    "url": "https://thehill.com/homenews/campaign/4414630-harris-no-denying-americas-history-racism/"
  },
  {
    "text": "Ecuadorian prosecutor probing TV studio attack is killed  —  The Ecuadorian prosecutor who was investigating an attack at a television station in Guayaquil, the country's largest and one of its most dangerous cities, was shot to death Wednesday.  Prosecutor César Suárez … ",
    "url": "https://www.nbcnews.com/news/latino/ecuadorian-prosecutor-probing-tv-studio-attack-killed-rcna134411"
  },
  {
    "text": "Arnold Schwarzenegger detained at German airport over his watch  —  Former Hollywood superstar and politician Arnold Schwarzenegger was detained at an airport in Germany on Wednesday over a watch he was traveling with.  —  Schwarzenegger, best known for his role in The Terminator franchise … ",
    "url": "https://www.washingtonexaminer.com/news/2801952/arnold-schwarzenegger-detained-germany-airport-watch/"
  },
  {
    "text": "Johnson plagued by GOP leaks as tensions escalate  —  The speaker pleaded with GOP members to stop sharing details of internal drama to the press.  It fell on deaf ears.",
    "url": "https://www.politico.com/live-updates/2024/01/17/congress/johnsons-leak-problem-00136090"
  }
]