[
  {
    "text": "Republicans close ranks around Trump as he looks to lock up his third nomination  —  Elected officials, donors and party figures who had stayed neutral or even opposed Trump in the 2024 GOP primary are starting to flock to his side.  —  MANCHESTER, N.H. — Republicans are quickly falling … ",
    "url": "https://www.nbcnews.com/politics/2024-election/republicans-close-ranks-trump-2024-gop-nomination-rcna134739"
  },
  {
    "text": "Tim Scott, the Former G.O.P. Presidential Contender, Will Back Donald Trump  —  The former president and his allies had been privately courting Mr. Scott, hoping to win his endorsement before the New Hampshire primary on Tuesday.  —  Senator Tim Scott of South Carolina will endorse Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/01/19/us/politics/tim-scott-to-endorse-trump.html"
  },
  {
    "text": "Scoop: Trump pollster predicts “smackdown” of Haley in South Carolina  —  Trump's longtime pollster told donors and select supporters Friday that the former president “is set to deliver a South Carolina smackdown to Nikki Haley in her home state where she is best known,” according to a private polling memo obtained by Axios.",
    "url": "https://www.axios.com/2024/01/19/trump-nikki-haley-south-carolina-primary-poll-2024"
  },
  {
    "text": "Deposition video shows Trump claiming he prevented “nuclear holocaust” as president  —  Combative, angry and prone to grandiose claims — newly unveiled footage of an April 2023 deposition gives a glimpse into how former President Donald Trump behaves when testifying under oath.",
    "url": "https://www.cbsnews.com/news/trump-deposition-video-testimony-new-york-fraud-case-nuclear-holocaust/"
  },
  {
    "text": "Exclusive: Attorney General Merrick Garland says there should be ‘speedy trial’ of Trump as 2024 election looms  —  Attorney General Merrick Garland said in an interview with CNN that he believes there should be a “speedy trial” in the election subversion case against Donald Trump … ",
    "url": "https://www.cnn.com/2024/01/19/politics/merrick-garland-trump-speedy-trial/"
  },
  {
    "text": "Media outlets making their own coverage decisions isn't “authoritarian”  —  Trump's call to take them off the air is  —  Sen. Marco Rubio (R-FL) is worried about creeping authoritarianism in the United States.  Not from Donald Trump, whose presidential bid Rubio endorsed Sunday despite … ",
    "url": "https://www.mediamatters.org/donald-trump/media-outlets-making-their-own-coverage-decisions-isnt-authoritarian"
  },
  {
    "text": "Inside the breakup of Haley and Trump's partnership over her U.N. role  —  Nikki Haley began her time as U.S. ambassador to United Nations with diplomatic successes.  Although she veered right on some issues to satisfy Trump, he attacks her as a ‘globalist’ in their primary fight.",
    "url": "https://www.washingtonpost.com/politics/2024/01/19/haley-trump-united-nations-frayed-relationship/"
  },
  {
    "text": "Ga. prosecutor in Trump case paid for flights with Fani Willis, filing shows  —  The lead prosecutor in the election interference case against former president Donald Trump paid for at least two airline trips with embattled Fulton County District Attorney Fani T. Willis (D) … ",
    "url": "https://www.washingtonpost.com/national-security/2024/01/19/fani-willis-nathan-wade-plane-tickets/"
  },
  {
    "text": "Bank records: DA Willis and special prosecutor traveled together during Trump probe  —  Bank records show that special prosecutor Nathan Wade purchased airline tickets in his and Fulton County District Attorney Fani Willis' name for trips to San Francisco and Miami, according to a court motion filed Friday.",
    "url": "https://www.ajc.com/live-updates/politics/bank-records-da-wills-and-special-prosecutor-traveled-together-during-trump-probe/ZNDCH5RHDFGC5CKRWNS7HI2R5M/"
  },
  {
    "text": "Sports Illustrated lays off most of its staff, threatening iconic brand's future  —  Much of the staff of Sports Illustrated, and possibly all remaining writers and editors, received layoff notices Friday, which essentially could spell the end of a publication that for decades was the gold standard of sports journalism.",
    "url": "https://www.washingtonpost.com/sports/2024/01/19/sports-illustrated-layoffs/"
  },
  {
    "text": "Dems float a trade: Ukraine-border deal for protecting Johnson  —  The longshot notion underscores the increasingly desperate thinking around getting a Senate compromise through the House.  —  With Senate negotiators expected to unveil their elusive bipartisan border deal any day now … ",
    "url": "https://www.politico.com/news/2024/01/19/democrats-johnson-ukraine-border-deal-00136568"
  },
  {
    "text": "Statement from President Joe Biden on Nearly $5 Billion in Additional Student Debt Cancellation for 74,000 Borrowers  —  Today, my Administration approved debt cancellation for another 74,000 student loan borrowers across the country, bringing the total number of people who have gotten … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/19/statement-by-president-joe-biden-on-nearly-5-billion-in-additional-student-debt-cancellation-for-74000-borrowers/"
  },
  {
    "text": "Half of recent US inflation due to high corporate profits, report finds  —  Thinktank report says ‘resounding evidence’ shows companies continue to keep prices high even as their inflationary costs drop  —  A new report claims “resounding evidence” shows that high corporate profits … ",
    "url": "https://www.theguardian.com/business/2024/jan/19/us-inflation-caused-by-corporate-profits"
  },
  {
    "text": "The DeSantis Team Ran the Worst Campaign in History  —  The bizarre decisions behind a $130 million debacle.  —  Tim Pawlenty's and Scott Walker's presidential campaigns can breathe a sigh of relief.  The mantle of Worst Republican Presidential Campaign Ever has been lifted from their shoulders … ",
    "url": "https://www.politico.com/news/magazine/2024/01/19/the-desantis-team-ran-the-worst-campaign-in-history-00136527"
  },
  {
    "text": "Outrage as Oklahoma Republican's bill labels Hispanic people ‘terrorists’  —  Lawmaker JJ Humphrey seeks punishments for ‘acts of terrorism’ and defines terrorist as ‘any person who is of Hispanic descent’  —  An Oklahoma lawmaker is facing backlash for proposing a discriminatory bill … ",
    "url": "https://www.theguardian.com/us-news/2024/jan/18/oklahoma-bill-labels-hispanic-people-terrorists"
  },
  {
    "text": "Entire Town's Newspapers Stolen On Day It Runs Story About Rape At Police Chief's Home  —  “It's pretty clear that someone didn't want the community to read the news this week,” said Ouray County Plaindealer co-publisher Erin McIntyre.  —  LOADING  —  It's an old-fashioned paper caper ― but maybe don't call the cops.",
    "url": "https://www.huffpost.com/entry/ouray-stolen-newspapers-police-chief-rape_n_65aa9f5fe4b076abd7ab6a90"
  },
  {
    "text": "How a Judge in India Prevented Americans From Seeing a Blockbuster Report  —  Free speech on the internet took a huge hit when the news agency Reuters took down an important hacking investigation to comply with an overseas legal challenge.  —  Two months ago, the news agency Reuters published … ",
    "url": "https://www.politico.com/news/magazine/2024/01/19/india-judge-reuters-story-00136339"
  },
  {
    "text": "Nikki Haley DID cheat on husband Michael - had affairs with her comms consultant and a MARRIED South Carolina lobbyist before she became governor, sworn affidavits and new witnesses claim  — Nikki Haley, 51, denied claims she cheated on her husband Michael before she became South Carolina governor … ",
    "url": "https://www.dailymail.co.uk/news/article-12970377/Nikki-Haley-cheated-affair-husband-affidavits-witnesses.html"
  },
  {
    "text": "Trump-backed Ohio Senate candidate shredded documents as he faced a lawsuit accusing him of wage theft  — Bernie Moreno, backed by Trump, is well-positioned to be the GOP nominee for Senate in Ohio.  — He settled over a dozen wage theft lawsuits before launching his campaign.",
    "url": "https://www.businessinsider.com/bernie-moreno-ohio-shredded-documents-employee-massachusetts-lawsuit-2024-1"
  },
  {
    "text": "House panel advances debt commission without shields for Medicare, Social Security  —  The House Budget Committee did not take measures to protect systems like Medicare and Social Security Thursday, despite advancing legislation to create a bipartisan fiscal commission designed to find a solution to the government's budget.",
    "url": "https://thehill.com/homenews/house/4417879-house-panel-advance-debt-commission-no-shields-medicare-social-security/"
  },
  {
    "text": "Biden administration announces new actions to boost EV sales, charging network  —  The Biden administration on Friday announced new actions to expand ownership electric vehicles, make it cheaper for people to install EV chargers at home, and accelerate the expansion of EV chargers on America's highways.",
    "url": "https://www.upi.com/Top_News/US/2024/01/19/biden-administration-electric-vehicle-costs-EV-charging-network/7821705662579/"
  },
  {
    "text": "Venezuelan immigrants boost right-wing candidates across the Americas, U.S.  —  Venezuelans in Argentina have been vocal supporters of new President Javier Milei, using social media to support far-right candidates across the region and the U.S.  —  BUENOS AIRES, Argentina … ",
    "url": "https://www.nbcnews.com/news/latino/venezuelan-immigrants-far-right-candidates-argentina-shape-us-politics-rcna134621"
  }
]