[
  {
    "text": "Liz Cheney, outspoken Trump critic, weighs third-party presidential run  —  The former congresswoman says she is determined to stop Trump.  Other Trump critics think a third-party candidacy could help him.  —  Liz Cheney, one of the most vociferous critics of Donald Trump in the Republican Party … ",
    "url": "https://www.washingtonpost.com/elections/2023/12/05/liz-cheney-trump-president-2024/"
  },
  {
    "text": "Trump Rips Drudge Report For Covering Him ‘Unfairly’: ‘Site Fell Apart’  —  The former president praised the aggregation news site's downfall: ‘I love it!’  —  Former President Donald Trump over the weekend slammed conservative news aggregation site the Drudge Report in a Truth Social post for … ",
    "url": "https://themessenger.com/politics/trump-rips-drudge-report-for-covering-him-unfairly-site-fell-apart"
  },
  {
    "text": "The Atlantic Dedicates Entire Issue to Warning ‘Fascist’ Trump Poses Dire Threat to America: Second Term ‘Will Be Much Worse’  —  The Atlantic announced that their first issue of 2024 will focus on what they believe to be the potentially disastrous consequences of Donald Trump returning to the White House.",
    "url": "https://www.mediaite.com/print/the-atlantic-dedicates-entire-issue-to-warning-fascist-trump-poses-dire-threat-to-america-second-term-will-be-much-worse/"
  },
  {
    "text": "Biden's 2024 Challenge: Taking Down Trump's Poll Numbers  —  Democrats have struggled to budge voters' views of the former president  —  WASHINGTON—With President Biden struggling to bring his polling numbers up, he and his fellow Democrats are sharpening their focus on a different task … ",
    "url": "https://www.wsj.com/politics/elections/bidens-2024-challenge-taking-down-trumps-poll-numbers-9cb9076e?mod=followamazon"
  },
  {
    "text": "The fear of a looming Trump dictatorship  —  You're reading an excerpt from the Today's WorldView newsletter.  Sign up to get the rest free, including news from around the globe and interesting ideas and opinions to know, sent to your inbox every weekday.  —  Former congresswoman Liz Cheney … ",
    "url": "https://www.washingtonpost.com/world/2023/12/04/trump-dictatorship-authoritarian-election-2024/"
  },
  {
    "text": "Comer Releases Direct Monthly Payments to Joe Biden from Hunter Biden's Business Entity  —  WASHINGTON—Today, House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) released subpoenaed bank records revealing Hunter Biden's business entity, Owasco PC, made direct monthly payments to Joe Biden.",
    "url": "https://oversight.house.gov/release/comer-releases-direct-monthly-payments-to-joe-biden-from-hunter-bidens-business-entity%EF%BF%BC/"
  },
  {
    "text": "Comer mischaracterizes Hunter Biden car payment reimbursement to his dad  —  The payments Hunter Biden made to his father came two years after the elder Biden had left the vice presidency  —  As House Republicans move toward a floor vote to authorize an impeachment inquiry against President Biden … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/04/comer-mischaracterizes-hunter-biden-car-payment-reimbursement-his-dad/"
  },
  {
    "text": "Four GOP presidential candidates qualify for fourth primary debate  —  Four Republican candidates will take the stage in Tuscaloosa on Wednesday night, and former president Donald Trump will once again skip the event.  —  Four Republican candidates will take the stage in Tuscaloosa … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/04/fourth-republican-presidential-debate-participants/"
  },
  {
    "text": "Gold bars featured in Bob Menendez bribery case linked to 2013 robbery, records show  —  The New Jersey businessman told police he was the victim of an armed robbery in 2013, and asked police recover the 22 gold bars stolen from him.  Four of those gold bars were found a decade later … ",
    "url": "https://www.nbcnewyork.com/investigations/gold-bars-featured-in-bob-menendez-bribe-case-linked-to-2013-robbery-records-show/4919801/"
  },
  {
    "text": "23andMe confirms hackers stole ancestry data on 6.9 million users  —  On Friday, genetic testing company 23andMe announced that hackers accessed the personal data of 0.1% of customers, or about 14,000 individuals.  The company also said that by accessing those accounts, hackers were also able to access … ",
    "url": "https://techcrunch.com/2023/12/04/23andme-confirms-hackers-stole-ancestry-data-on-6-9-million-users/"
  },
  {
    "text": "Steve Bannon Blasts Fox News as ‘TV for Stupid People’  —  “It's a disgrace,” Bannon raged over the right-wing network fact-checking Trump's election lies.  —  Former Trump strategist Steve Bannon tore into Fox News for cutting away from a Donald Trump speech over the weekend and fact-checking … ",
    "url": "https://www.thedailybeast.com/steve-bannon-blasts-fox-news-as-tv-for-stupid-people"
  },
  {
    "text": "Congress provided $7.5B for electric vehicle chargers.  Built so far: Zero.  —  The sluggish rollout could undermine President Joe Biden's reelection messaging promoting electric vehicles.  —  Congress at the urging of the Biden administration agreed in 2021 to spend $7.5 billion to build tens … ",
    "url": "https://www.politico.com/news/2023/12/05/congress-ev-chargers-billions-00129996"
  },
  {
    "text": "John Fetterman paid George Santos $343 for a Cameo to troll Bob Mendendez  — George Santos was expelled from Congress last week.  — Now he's on Cameo.  — John Fetterman bought a video from Santos to troll Bob Menendez, who is under investigation for bribery.",
    "url": "https://www.businessinsider.com/john-fetterman-paid-george-santos-for-cameo-bob-mendendez-2023-12"
  },
  {
    "text": "'That's authoritarianism': Florida argues school libraries are for government messaging  —  Public school libraries are “a forum for government speech,” not a “forum for free expression,” according to a legal brief.  —  Florida's government is arguing that school districts have a First Amendment right to remove LGBTQ books.",
    "url": "https://www.tallahassee.com/story/news/politics/2023/12/04/florida-says-school-libraries-have-right-to-remove-lgbtq-books/71742277007/"
  },
  {
    "text": "Top Tucker Carlson producer accused of sexually assaulting Fox staffer  —  A former Fox News staffer is suing the producer — who was fired last spring along with the host — over the alleged assault and the network over alleged sexual harassment and negligence",
    "url": "https://www.washingtonpost.com/style/media/2023/12/04/fox-news-sexual-harassment-tucker-carlson-producer-justin-wells/"
  },
  {
    "text": "U.S. Treasury Launches Counter-Fentanyl Strike Force  —  WASHINGTON — Today, the U.S. Department of the Treasury announced the launch of a Counter-Fentanyl Strike Force to marshal Treasury's resources and expertise in a coordinated and streamlined operation to combat the trafficking of illicit fentanyl.",
    "url": "https://home.treasury.gov/news/press-releases/jy1946"
  },
  {
    "text": "Elon Musk's X platform fueled far-right riots in Ireland, experts say  —  Elon Musk's social media platform X has fuelled far-right disinformation in Ireland and played a key role in riots last month in the country's capital Dublin, experts tell CBS News.  The violent clashes erupted … ",
    "url": "https://www.cbsnews.com/news/elon-musk-ireland-x-twitter-far-right-dublin-immigration/"
  }
]