[
  {
    "text": "Manhattan Prosecutors Agree to Delay Trump's Sentencing  —  Donald J. Trump's lawyers want to argue that a Supreme Court decision giving presidents immunity for official acts should void his felony conviction for covering up hush money paid to a porn star.  —  Manhattan prosecutors … ",
    "url": "https://www.nytimes.com/2024/07/02/nyregion/trump-sentencing-hush-money-trial.html"
  },
  {
    "text": "The Supreme Court's disastrous Trump immunity decision, explained  —  The Court's six Republicans handed down a decision on Monday that gives Donald Trump such sweeping immunity from prosecution that there are unlikely to be any legal checks on his behavior if he returns to the White House.",
    "url": "https://www.vox.com/scotus/358292/supreme-court-trump-immunity-dictatorship"
  },
  {
    "text": "A Better Way To Respond To The Supreme Court's Intolerable Immunity Decision  —  Sauce for the goose is sauce for the gander.  —  ∙ Paid  —  If you're about my age or older, and a subscriber to this newsletter, you're familiar with this uncanny sensation of living through a moment when history turns.",
    "url": "https://www.offmessage.net/p/biden-response-supreme-court-immunity"
  },
  {
    "text": "The Trump-SCOTUS Doom Loop  —  Orbánism is already here.  —  ∙ Paid  —  1. Clarity  —  I have a theory about the Supreme Court's reasoning:  —  Had the subject of presidential immunity come to the High Court concerning any normal president—Ford, Carter, Reagan, Bush … ",
    "url": "https://www.thebulwark.com/p/the-trump-scotus-doom-loop"
  },
  {
    "text": "'We've all enabled the situation': Dems turn on Biden's inner sanctum post debate  —  The senior team's management of Biden has grown more strictly controlled as his term has gone on.  —  Over the course of his presidency, Joe Biden's small clutch of advisers have built … ",
    "url": "https://www.politico.com/news/2024/07/02/biden-campaign-debate-inner-circle-00166160"
  },
  {
    "text": "First Democrat in Congress calls on Biden to withdraw from reelection  —  Rep. Lloyd Doggett (D-Texas) said the president needs to step aside and usher in a “new generation of leaders.”  —  Rep. Lloyd Doggett on Tuesday became the first Democrat in Congress to publicly call for President Joe Biden … ",
    "url": "https://www.politico.com/news/2024/07/02/democrats-biden-debate-fallout-00166208"
  },
  {
    "text": "CNN Poll: Most voters think Democrats have a better chance of keeping White House if Biden isn't the nominee  —  Three-quarters of US voters say the Democratic Party would have a better shot at holding the presidency in 2024 with someone other than President Joe Biden at the top of the ticket … ",
    "url": "https://www.cnn.com/2024/07/02/politics/cnn-poll-post-debate/"
  },
  {
    "text": "Democratic senator criticizes Biden campaign's ‘dismissive attitude’ after debate  —  A Democratic senator chastised President Biden's re-election campaign for their aggressive attempt to quell intensified age concerns in the wake of a disastrous debate performance which sent tremors through the Democratic Party.",
    "url": "https://www.semafor.com/article/07/01/2024/democratic-senator-criticizes-biden-campaigns-dismissive-attitude-after-debate"
  },
  {
    "text": "Manchin threatened to break with Biden before senior Democrats intervened  —  “Nobody wants to be the first one to knife Julius Caesar,” one Democratic Party official said.  —  As panic and confusion over President Biden's faltering debate performance swept the ranks of Democratic lawmakers late last week … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/02/joe-manchin-biden-debate-democrats-drop-out/"
  },
  {
    "text": "How much did debate hurt Biden's re-election bid?  New poll offers insight.  —  Trump's new, narrow advantage signals a close contest, not a decisive lead.  But other exclusive poll findings raise red flags for the president.  —  Susan Page Rachel BarberUSA TODAY",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/02/biden-trump-poll-post-debate/74263315007/"
  },
  {
    "text": "Justice Roberts buried for smug ‘sit down, little ladies’ smear of liberal colleagues  —  Lost in the shuffle of the outrage over the conservative majority Supreme Court's 6-3 decision to hand Donald Trump a get-out-of-jail-free card with their expansive presidential immunity ruling on Monday … ",
    "url": "https://www.alternet.org/news-politics/supreme-court-chief-justice-john-roberts/"
  },
  {
    "text": "SCOTUS: Actually, Presidents Are Kings  —  “With fear for our democracy, I dissent.”  With these words, Justice Sonya Sotomayor concluded her dissent from the majority opinion in Trump v. U.S. She was joined by Justices Jackson and Kagan.  She is right.  —  In today's decision … ",
    "url": "https://joycevance.substack.com/p/scotus-actually-presidents-are-kings"
  },
  {
    "text": "RFK Jr.'s Family Doesn't Want Him to Run.  Even They May Not Know His Darkest Secrets.  —  A shocking photograph.  Blowback from a Trump meeting.  Alleged sexual assault.  The Kennedys have voiced support for Joe Biden, but certain aspects of Robert F. Kennedy Jr.'s character are only just now coming to light.",
    "url": "https://www.vanityfair.com/news/story/robert-kennedy-jr-shocking-history"
  },
  {
    "text": "Behind the Curtain: The imperial presidency in waiting … - A re-elected Trump would quickly set up vast camps and deport millions of people in the U.S. illegally. … - In Washington, Trump would move to fire potentially tens of thousands of civil servants using a controversial interpretation of law and procedure.",
    "url": "https://www.axios.com/2024/07/02/trump-2025-imperial-us-presidency"
  },
  {
    "text": "‘Elites will not save you’: Rallying cry issued for mass action against ‘Dictator Trump’  —  America faces an immediate future of military occupations, political executions and concentration camps unless millions of its citizens unite against “dictator” Donald Trump, a furious and frightened political analyst wrote Tuesday.",
    "url": "https://www.rawstory.com/trump-dictator-2668670361/"
  },
  {
    "text": "President Joe Biden to sit down with ABC News on Friday for first TV interview since debate  —  The president has faced calls to drop out of the race following the debate.  —  President Joe Biden delivers remarks during the CNN Presidential Debate, June 27, 2024, in Atlanta.",
    "url": "https://abcnews.go.com/Politics/president-joe-biden-sit-abc-news-friday-interview/story?id=111618360"
  },
  {
    "text": "Rudy Giuliani disbarred over ‘false and misleading’ statements on 2020 election  —  The former New York City mayor has lost his law license.  —  Rudolph Giuliani, former mayor of New York, attends a ceremony at the National September 11 Memorial Museum in New York, Sept. 11, 2022.",
    "url": "https://abcnews.go.com/US/rudy-giuliani-disbarred-false-misleading-statements-2020-election/story?id=111611915"
  }
]