[
  {
    "text": "Nikki Haley has blunt message for Trump, GOP as Kamala Harris gains momentum: ‘Quit whining’  —  Haley says Trump and the Republican Party need to focus on policy, not petty attacks  —  Former GOP presidential candidate Nikki Haley weighed in on the state of the 2024 race Tuesday … ",
    "url": "https://www.foxnews.com/media/nikki-haley-has-blunt-message-trump-gop-kamala-harris-gains-momentum-quit-whining"
  },
  {
    "text": "Goldman Sachs says voters are shifting to Kamala Harris—and the odds of a blue wave are swelling … Kamala Harris has pulled ahead of Donald Trump in national polls as voters turn away from third parties and the odds of a blue wave increases, according to Goldman Sachs.",
    "url": "https://fortune.com/2024/08/13/goldman-sachs-kamala-harris-beating-donald-trump-polls-democrats-republicans-blue-wave/"
  },
  {
    "text": "Harris in ‘striking distance’ of Trump in Florida, pollster says  —  Vice President Harris is nipping at former President Trump's heels in his home state of Florida, a pollster from Suffolk University says after a new Sunshine State survey.  —  The USA Today/Suffolk University/WSVN-TV poll found Harris … ",
    "url": "https://thehill.com/homenews/campaign/4826106-florida-harris-trump-rfk-jr-2024/"
  },
  {
    "text": "So Donald chatted with Elon, and here's the future as they see it - losers win, incompetence rules  —  Both claim they are part of a bright new dawn, but last night the politician could only slur inanities, and the tech boss made a hash of the tech  —  Would you like to travel in the advance party … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/aug/13/donald-trump-elon-musk-x-twitter-politician-tech"
  },
  {
    "text": "Ex-Twitter staffer wins $600K over Musk's click-yes-or-resign ultimatum  —  Elon Musk's 24-hour email ultimatum unfairly dismissed Twitter staff, court says.  —  Elon Musk had no business sending Twitter employees an email giving them 24 hours to click “yes” to keep their jobs … ",
    "url": "https://arstechnica.com/tech-policy/2024/08/elon-musk-loses-fight-with-ex-twitter-staffer-must-pay-600k/"
  },
  {
    "text": "Harris campaign's Google ads rewrite news headlines … - According to Google's ad transparency center, the Trump campaign isn't running these types of ads, but this technique has been used by campaigns before.  — The ads say that they are sponsored, but it's not immediately clear … ",
    "url": "https://www.axios.com/2024/08/13/harris-campaign-google-poltical-ads-news-publishers"
  },
  {
    "text": "Missouri voters could face choice between continued abortion ban and new constitutional amendment  —  Missouri voters will decide in November whether to guarantee a right to abortion with a constitutional amendment that would reverse the state's near-total ban on the procedure.",
    "url": "https://apnews.com/article/abortion-ballot-measures-sports-betting-minimum-wage-0c0a28e5176a647b47aaca5a5d287628"
  },
  {
    "text": "Ilhan Omar fends off challengers to win primary after AIPAC stays out of the race  —  Omar defeated a challenger who had come just 2 points shy of ousting her in 2022.  —  Rep. Ilhan Omar, the final member of the progressive “Squad” to face a primary this cycle, fended off her primary opponents … ",
    "url": "https://www.politico.com/news/2024/08/13/ilhan-omar-primary-don-samuels-00173935"
  },
  {
    "text": "Hackers may have stolen the Social Security numbers of every American.  How to protect yourself  —  About four months after a notorious hacking group claimed to have stolen an extraordinary amount of sensitive personal information from a major data broker, a member of the group has reportedly released … ",
    "url": "https://www.latimes.com/business/story/2024-08-13/hacker-claims-theft-of-every-american-social-security-number"
  },
  {
    "text": "Here's What Scares Republicans Most About a Harris Win … The day after Minnesota Governor Tim Walz was announced as Kamala Harris's choice for vice president, Senate Majority Leader Mitch McConnell told a crowd of lawmakers in Louisville, Kentucky, that a Harris administration would spell certain doom for the Republican Party.",
    "url": "https://newrepublic.com/post/184816/kamala-harris-tim-walz-supreme-court-filibuster-policy"
  },
  {
    "text": "Hunter Biden Sought State Department Help for Ukrainian Company  —  After President Biden dropped his re-election bid, his administration released records showing that while he was vice president, his son solicited U.S. government assistance.  —  Hunter Biden sought assistance … ",
    "url": "https://www.nytimes.com/2024/08/13/us/politics/hunter-biden-ukrainian-company.html"
  },
  {
    "text": "J.K. Rowling and Elon Musk Named in Cyberbullying Lawsuit Filed by Algerian Boxer Imane Khelif After Olympic Win (EXCLUSIVE)  —  J.K. Rowling and Elon Musk have both been named in a criminal complaint filed to French authorities over alleged “acts of aggravated cyber harassment” … ",
    "url": "https://variety.com/2024/tv/news/jk-rowling-elon-musk-imane-khelif-lawsuit-1236105185/"
  },
  {
    "text": "Teamsters' Black caucus defies leadership with Harris endorsement  —  The vote comes as the larger union withholds its support.  —  Vice President Kamala Harris has won the endorsement of the National Black Caucus of the International Brotherhood of Teamsters — even as the larger union withholds its endorsement.",
    "url": "https://www.politico.com/news/2024/08/13/teamsters-black-caucus-harris-endorsement-00173911"
  },
  {
    "text": "Why newsrooms haven't published leaked Trump campaign documents  —  The Trump campaign said the documents from a mysterious source came from an Iranian hack.  The FBI is now investigating.  —  An alleged Iranian hacking operation that the Donald Trump campaign says leaked internal documents … ",
    "url": "https://www.washingtonpost.com/style/media/2024/08/13/iran-email-hack-republicans-media-response/"
  },
  {
    "text": "Nate Silver: Democrats more than doubled their chance of winning overnight  —  Nate Silver on Monday released an updated forecast for the presidential election, and he has Kamala Harris as a slight favorite over Donald Trump.  Silver joins Morning Joe to discuss 2024 and his new book ‘On the Edge’.",
    "url": "https://www.msnbc.com/morning-joe/watch/nate-silver-democrats-more-than-doubled-their-chance-of-winning-overnight-217058373910"
  },
  {
    "text": "Former NBA player Royce White will take on Klobuchar for Senate seat  —  Former NBA player Royce White won the Republican Senate primary to take on Democrat Sen. Amy Klobuchar in Minnesota, according to a projection from Decision Desk HQ.  —  White, backed by the state GOP … ",
    "url": "https://thehill.com/homenews/campaign/4826598-royce-white-amy-klobuchar-nba/"
  },
  {
    "text": "MAGA Election Official Immediately Spews Conspiracies After Conviction  —  GIVE IT UP ALREADY  —  Election-denying felon Tina Peters complained about “vote-flipping software that is basically in Serbia.”  —  Hours after being convicted of tampering with voting machines in Colorado in the name … ",
    "url": "https://www.thedailybeast.com/maga-election-official-immediately-spews-conspiracies-after-conviction"
  },
  {
    "text": "Walz, Harris shore up labor support, woo working class  —  Minnesota Gov. Tim Walz (D) addressed union members in Los Angeles on Tuesday in his first solo campaign stop.  The appearance by Vice President Kamala Harris's running mate at a convention of the American Federation of State … ",
    "url": "https://www.washingtonpost.com/elections/2024/08/13/2024-election-campaign-updates-harris-trump/"
  }
]