[
  {
    "text": "Six States Move Toward Trump in Electoral College Ratings  —  As of July 9, the Democratic Party is living in a state of suspended animation.  Despite growing calls from many in his party to leave the contest, President Joe Biden has made clear he has no intention of dropping out.",
    "url": "https://www.cookpolitical.com/analysis/national/national-politics/six-states-move-toward-trump-electoral-college-ratings"
  },
  {
    "text": "Democrats lose ground in 6 states with election forecaster's postdebate shift  —  Former President Trump is gaining ground in key swing states and could threaten to take states once considered to be safe for Democrats, as President Biden struggles to regain ground after a shaky debate performance … ",
    "url": "https://thehill.com/homenews/campaign/4762860-democrats-lose-ground-post-debate-election-forecaster/"
  },
  {
    "text": "A Late Play by the Biden Campaign: Running Out the Clock  —  Time is on President Biden's side.  Every day that he defies pressure to end his re-election campaign, replacing him becomes harder for Democrats.  —  President Biden's resistance to pressure to end his re-election bid appears … ",
    "url": "https://www.nytimes.com/2024/07/10/us/politics/biden-campaign-strategy.html"
  },
  {
    "text": "Biden support slips in deep blue New York: 'We're a battleground state now'  —  Democrats are worried the president is taking New York for granted as the state becomes surprisingly competitive.  —  NEW YORK — President Joe Biden has a new problem: a competitive race in deep blue New York.",
    "url": "https://www.politico.com/news/2024/07/10/biden-new-york-trouble-00167198"
  },
  {
    "text": "Behind the Curtain: Trump's new 2024 plan … (You could flip the first two, but the campaign puts Pennsylvania first because it's the biggest swing state, and because Biden desperately needs it.)  — Job 1 for the V.P. nominee, besides raising money, will be to park in Pennsylvania to try … ",
    "url": "https://www.axios.com/2024/07/10/trump-undecided-voters-plan-election-2024"
  },
  {
    "text": "George Stephanopoulos Says Biden Can't Serve Another 4 Years  —  GEORGE STEPHANOPOULOS BIDEN CAN'T SERVE 4 MORE YEARS … 6:28 PM PT — George Stephanopoulos tells TMZ, “Earlier today, I responded to a question from a passerby.  I shouldn't have.”  An ABC spokesperson tells TMZ … ",
    "url": "https://www.tmz.com/2024/07/09/george-stephanopoulos-president-joe-biden-cant-serve-4-more-years-sidewalk-election/"
  },
  {
    "text": "Playbook: Why Capitol Hill is stuck on Biden  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  FLASHING RED LIGHTS, PT. 1 — The Cook Political Report yesterday moved six states away from JOE BIDEN and toward DONALD TRUMP: Arizona, Georgia and Nevada … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/10/inertia-prevails-00167246"
  },
  {
    "text": "Scoop: Biden rebels in Congress see their revolt crumbling … - One shell-shocked lawmaker who was present at the meeting would offer only one word to characterize it: “Intense.”  — Another described the mood as “pretty much unanimous” that Biden has “got to step down,” adding … ",
    "url": "https://www.axios.com/2024/07/09/biden-house-democrats-withdraw-nominee"
  },
  {
    "text": "Trump Donors on the Brink of Civil War Over J.D. Vance for VP  —  KILLBILLY ELEGY  —  Part of what brought Vance to the dance may be his undoing.  Donors are scared of him. … In his rise from Donald Trump critic to viable contender to be the presumptive Republican nominee's running mate, Sen. J.D. Vance of Ohio has come so far.",
    "url": "https://www.thedailybeast.com/trump-donors-on-the-brink-of-civil-war-over-jd-vance-for-vp"
  },
  {
    "text": "Biden's dual NATO mission: Reassure America and the world … - More than 30 leaders have descended on D.C. to discuss critical issues like Ukraine's roadmap to NATO membership, air defenses against Russian missile and drone attacks, and the joint challenges posed by China.",
    "url": "https://www.axios.com/2024/07/10/biden-nato-summit-reassure-ukraine"
  },
  {
    "text": "Biden aimed to prove US and global doubters wrong with NATO speech  —  Biden's high-profile address served as both a political and geopolitical test for the president.  —  With the eyes of the world on him, President Joe Biden delivered a forceful speech to open the NATO summit in Washington … ",
    "url": "https://www.politico.com/news/2024/07/09/biden-nato-speech-00167186"
  },
  {
    "text": "Trump's tip trick  —  As president, Donald Trump's tax policy heavily favored corporations and the wealthy.  Trump's signature tax legislation, the Tax Cuts and Jobs Act, overwhelmingly benefited those groups.  —  But, as a presidential candidate, Trump campaigns as a populist.",
    "url": "https://popular.info/p/trumps-tip-trick"
  },
  {
    "text": "Supreme Court Justice Sotomayor's bodyguards shoot would-be carjacker outside her home  —  Two deputy US Marshals shot a would-be carjacker who pulled a gun on him while they were guarding Supreme Court Justice Sonia Sotomayor's home in Washington, DC, authorities said.",
    "url": "https://nypost.com/2024/07/09/us-news/supreme-court-justice-sotomayors-bodyguard-shoots-would-be-carjacker-outside-her-home/"
  },
  {
    "text": "Russia aims to undermine Biden in November election, intel officials say  —  Previous U.S. intelligence assessments dating to 2016 concluded that Russia sought to weaken support for the Democratic Party and boost Donald Trump's candidacy.  —  Russia's efforts to influence … ",
    "url": "https://www.nbcnews.com/investigations/russia-aims-undermine-biden-november-election-intel-officials-say-rcna161011"
  },
  {
    "text": "There's a Reason Trump Is Suddenly Lying About Project 2025  —  With all the focus in recent weeks on President Joe Biden's age-related limitations, it's worth remembering that Donald Trump's incessant falsehoods and self-proclaimed desire to be a dictator on Day 1 make him far more unfit for the presidency.",
    "url": "https://slate.com/news-and-politics/2024/07/why-donald-trump-lying-project-2025.html"
  },
  {
    "text": "Navy sailor tried to access Biden's medical records multiple times  —  A junior Navy sailor attempted to access the medical records of President Biden from a military medical database three times in February but was unable to do so, the U.S. Navy confirms to CBS News.",
    "url": "https://www.cbsnews.com/news/navy-sailor-tries-to-access-biden-medical-records/"
  },
  {
    "text": "House passes measures targeting Biden appliance regulations  —  The House passed measures preventing the Energy Secretary from enforcing energy efficiency standards for various kitchen appliances, an effort by Republicans to portray the Biden administration's regulations as a war on consumers.",
    "url": "https://www.washingtonexaminer.com/policy/energy-and-environment/3075161/house-passes-measures-targeting-biden-appliance-regulations/"
  },
  {
    "text": "George Norcross pleads not guilty to corruption charges brought by NJ Attorney General  —  South Jersey political kingmaker George E. Norcross III and five co-defendants pleaded not guilty Tuesday to racketeering charges accusing them of using illegal threats, extortion and political muscle … ",
    "url": "https://www.northjersey.com/story/news/new-jersey/2024/07/09/george-norcross-iii-not-guilty-pleas-in-nj-corruption-case/74336805007/"
  },
  {
    "text": "“Worry less”: Biden camp tries to rally demoralized staff … - “I think there is an old African proverb that says, 'You wanna go fast, go alone. … - He added: “There's never been a president in our lifetimes — I don't know if there ever will be again — that's delivered more than President Biden.",
    "url": "https://www.axios.com/2024/07/10/biden-campaign-staff-morale-election-2024"
  },
  {
    "text": "Former US Sen. Jim Inhofe, defense hawk who called human-caused climate change a ‘hoax,’ dies at 89  —  OKLAHOMA CITY (AP) — Former Sen. Jim Inhofe, a conservative firebrand known for his strong support of defense spending and his denial that human activity is responsible for the bulk of climate change, has died.",
    "url": "https://apnews.com/article/republican-senator-jim-inhofe-obit-2a3ac758737845c0aa2e05ae2036005b"
  }
]