[
  {
    "text": "Trump team argues assassination of rivals is covered by presidential immunity  —  Former President Trump's legal team suggested Tuesday that even a president directing SEAL Team Six to kill a political opponent would be an action barred from prosecution given a former executive's broad immunity to criminal prosecution.",
    "url": "https://thehill.com/regulation/court-battles/4398223-trump-team-argues-assassination-of-rivals-is-covered-by-presidential-immunity/"
  },
  {
    "text": "Trump intends to deliver part of closing himself, say sources  —  Former President Trump intends to personally deliver part of the defense's closing argument at the conclusion of his civil fraud trial in New York on Thursday, sources familiar with the former president's strategy tell ABC News.",
    "url": "https://abcnews.go.com/US/live-updates/trump-fraud-trial/trump-intends-to-deliver-part-of-closing-himself-say-sources-106237800?id=103642561"
  },
  {
    "text": "Trump warns of ‘bedlam,’ declines to rule out violence after court hearing  —  The former president spoke after his lawyers argued he should be immune from prosecution for trying to overturn the 2020 election  —  Republican polling leader Donald Trump on Tuesday threatened unrest … ",
    "url": "https://www.washingtonpost.com/national-security/2024/01/09/trump-comments-violence-bedlam/"
  },
  {
    "text": "Biden struggling in Michigan as Trump grabs strong lead, poll shows  —  President Joe Biden's support is on shaky ground in Michigan, and he trails Republican Donald Trump by 8 percentage points in a head-to-head matchup 10 months before the Nov. 5 election, according to a new statewide poll commissioned … ",
    "url": "https://www.detroitnews.com/story/news/politics/2024/01/09/michigan-poll-finds-biden-support-shaky-trump-strong-lead/72152924007/"
  },
  {
    "text": "Defense Secretary Lloyd Austin diagnosed with prostate cancer  —  Austin was diagnosed with prostate cancer in December and underwent a minimally invasive procedure, officials from Walter Reed said in a statement Tuesday.  —  WASHINGTON — Defense Secretary Lloyd Austin was diagnosed … ",
    "url": "https://www.nbcnews.com/politics/white-house/defense-secretary-lloyd-austin-diagnosed-prostate-cancer-rcna133120"
  },
  {
    "text": "Trump Georgia co-defendant alleges DA Fani Willis had improper relationship with prosecutor  —  Fulton County District Attorney Fani Willis hired an alleged romantic partner to lead the Atlanta prosecution of former President Donald Trump and 18 others on election conspiracy charges … ",
    "url": "https://www.usatoday.com/story/news/politics/2024/01/09/trump-georgia-da-fani-willis-improper-relationship/72163839007/"
  },
  {
    "text": "More delays for NASA's astronaut moonshots, with crew landing off until 2026  —  Astronauts will have to wait until next year before flying to the moon and at least two years before landing on it, under the latest round of delays announced by NASA on Tuesday.",
    "url": "https://apnews.com/article/nasa-moon-landings-artemis-delay-23e425d490c0c9e65ae774ec2e00f090"
  },
  {
    "text": "Republican Officials Openly Insult Women Nearly Killed by Abortion Bans  —  Red states would rather let a patient die than let her terminate a dangerous pregnancy.  And they're barely pretending otherwise.  —  For many years before S.B. 8 passed in Texas and was then swept into existence … ",
    "url": "https://slate.com/news-and-politics/2024/01/republican-abortion-bans-pregnant-women-deaths.html"
  },
  {
    "text": "X's fresh temporary ban of several prominent journalists raises alarm  —  “We do sweeps for spam/scam accounts and sometimes real accounts get caught up in them,” Elon Musk wrote on X, responding to the temporary ban of at least 8 accounts, including those of a handful of journalists.",
    "url": "https://www.nbcnews.com/tech/social-media/x-temporary-ban-journalist-accounts-raises-alarm-rcna133084"
  },
  {
    "text": "RFK Jr. won't attend birthday party fundraiser after celebrity blowback  —  Independent presidential candidate Robert F. Kennedy Jr. won't attend a birthday party fundraiser, his campaign said, after multiple celebrities who had been announced as attendees denied that they ever planned to attend.",
    "url": "https://thehill.com/homenews/campaign/4398472-rfk-jr-birthday-party-fundraiser-celebrity-2024/"
  },
  {
    "text": "US Rep. Greg Pence of Indiana, former VP Mike Pence's older brother, won't seek reelection  —  Republican U.S. Rep. Greg Pence of Indiana said Tuesday he will not seek reelection this year to a fourth term, becoming the latest House member to announce that they won't run for reelection.",
    "url": "https://apnews.com/article/congress-us-rep-greg-pence-no-reelection-b787bba3e2506c60d672ef3bb7655f82"
  },
  {
    "text": "Investigation into why a panel blew off a Boeing Max 9 jet focuses on missing bolts  —  A woman aboard the Alaska Airlines plane that had a hole blown out of its fuselage recounts the experience, including talking to one of the passengers seated on the row where it happened (Jan. 8)",
    "url": "https://apnews.com/article/boeing-investigation-ntsb-safety-airplanes-d9e28fe1a11dafe4f639268504bdb85f"
  },
  {
    "text": "Blinken urges Israel to engage with region on postwar plans that include path to Palestinian state  —  Palestinians continue to flee to southern Gaza  —  U.S. Secretary of State Antony Blinken on Tuesday called on Israel to work with moderate Palestinians and neighboring countries on plans for postwar Gaza … ",
    "url": "https://apnews.com/article/israel-hamas-war-news-01-09-2024-017066376ac06026622ee0b83dc2b65e"
  },
  {
    "text": "The Electoral College is a ‘bad’ and ‘undemocratic’ system.  So why does the US still use it?  —  In the most powerful democracy in the world, two of its last four leaders have been chosen by a minority of voters.  The US's Electoral College system is now functioning far … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/electoral-college-trump-biden-2024-b2475958.html"
  },
  {
    "text": "Lauren Boebert's Ex-Husband Arrested on Weapons and Assault Charges  —  In addition to the assault and weapons counts, Boebert was also charged with harassment (\"strikes shoves, kicks\"), disorderly conduct, and trespassing, jail records show.  —  Jayson Boebert, the former husband of Rep. Lauren Boebert … ",
    "url": "https://www.thedailybeast.com/lauren-boeberts-ex-husband-arrested-on-weapons-and-assault-charges"
  },
  {
    "text": "Election 2024: Most Democrats Approve Removing Trump From Ballot  —  Voters are divided over efforts to remove former President Donald Trump from election ballots, but Democrats overwhelmingly approve such efforts  —  The latest Rasmussen Reports national telephone and online survey finds … ",
    "url": "https://www.rasmussenreports.com/public_content/politics/biden_administration/election_2024_most_democrats_approve_removing_trump_from_ballot"
  },
  {
    "text": "Exclusive: Investor Ackman backs bid by dissidents for Harvard board seats  —  Billionaire hedge fund manager William Ackman, who joined other Harvard graduates in successfully calling for the university's president Claudine Gay to resign, is pressing forward with his efforts to reshape … ",
    "url": "https://www.reuters.com/world/us/investor-ackman-backs-bid-by-dissidents-harvard-board-seats-2024-01-09/"
  },
  {
    "text": "Lauren Boebert's Ex-Husband Gives His Side of Restaurant Fight Story: “I Was Telling Her I Want Her Back”  —  Jayson Boebert says that he regrets calling the police Saturday following his public spat with Colorado's most infamous lawmaker. … “I wish this all hadn't happened.”",
    "url": "https://www.westword.com/news/lauren-boeberts-ex-husband-gives-his-side-of-restaurant-fight-story-18805078"
  },
  {
    "text": "In the fight over abortion rights, the government bans its first company from tracking medical visits  —  The settlement is the FTC's first ban on selling sensitive location data.  —  The Biden administration stopped a company from selling data on people's medical visits on Tuesday … ",
    "url": "https://www.politico.com/news/2024/01/09/in-the-fight-over-abortion-rights-the-government-bans-its-first-company-from-tracking-medical-visits-00134510"
  },
  {
    "text": "REVEALED: Tennessee Rep. Andy Ogles faces ethics complaint, comparison to George Santos  —  Non-partisan Campaign Legal Center ask federal ethics agency to investigate irregularities uncovered by NewsChannel 5  —  NASHVILLE, Tenn. (WTVF) — A nonpartisan watchdog group has asked … ",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/revealed/revealed-tennessee-rep-andy-ogles-faces-ethics-complaint-comparison-to-george-santos"
  }
]