[
  {
    "text": "CBS News poll: Haley gains on Trump in New Hampshire while he continues to dominate in Iowa  —  Donald Trump still leads in New Hampshire, but Nikki Haley has consolidated much of the non-Trump vote and has emerged as the top alternative to him there.  Among the top candidates … ",
    "url": "https://www.cbsnews.com/news/poll-haley-trump-new-hampshire-iowa/"
  },
  {
    "text": "Fox News Poll: Trump's lead in GOP primary widens  —  Voters split over whether impeachment of Biden is legit or bogus  —  Former President Donald Trump keeps gaining ground in the Republican presidential nomination contest, as fewer than one third of GOP primary voters now back all his rivals combined … ",
    "url": "https://www.foxnews.com/official-polls/fox-news-poll-trumps-lead-gop-primary-widens"
  },
  {
    "text": "Biden campaign says Trump ‘parroted Adolf Hitler’ in New Hampshire rally remarks  —  The Biden campaign late Saturday sharply criticized former President Trump for invoking rhetoric it referred to as “parroting Adolf Hitler” in the wake of remarks in which Trump said immigrants were “poisoning the blood of our country.”",
    "url": "https://thehill.com/homenews/campaign/4364825-biden-campaign-trump-parroted-adolf-hitler-new-hampshire-rally/"
  },
  {
    "text": "Florida GOP votes to strip Chair Christian Ziegler of authority amid rape allegation  —  The Florida GOP on Sunday began the process of removing Chair Christian Ziegler amid a sexual assault allegation, with the party's executive board voting during an emergency meeting to censure the chair … ",
    "url": "https://www.heraldtribune.com/story/news/politics/state/2023/12/17/florida-republicans-take-steps-toward-removing-chair-christian-ziegler/71933027007/"
  },
  {
    "text": "Florida Republican Party suspends chairman and demands his resignation amid rape investigation  —  TALLAHASSEE, Fla. (AP) — The Republican Party of Florida suspended Chairman Christian Ziegler and demanded his resignation during an emergency meeting Sunday, adding to calls by Gov. Ron DeSantis … ",
    "url": "https://apnews.com/article/christian-ziegler-rape-accusation-florida-republican-party-8d1cb7c6f2f3e009a88e47a735eacc4c"
  },
  {
    "text": "Florida Republicans Strip Powers of Embattled Party Chairman  —  The party on Sunday removed almost all the authority of Christian Ziegler, who faces a criminal investigation and has resisted calls to resign.  —  The embattled chairman of the Republican Party of Florida was censured … ",
    "url": "https://www.nytimes.com/2023/12/17/us/florida-republican-chairman-christian-ziegler.html"
  },
  {
    "text": "Biden safe after car collides with motorcade  —  President Joe Biden was safe on Sunday night after a car collided with a motorcade SUV that was part of the president's security detail, a Reuters witness said.  —  Biden and First Lady Jill Biden had just left his campaign headquarters when the collision occurred.",
    "url": "https://www.reuters.com/world/us/car-collides-with-vehicle-president-bidens-motorcade-delaware-witness-2023-12-18/"
  },
  {
    "text": "Dean Phillips' standing on Capitol Hill has all but collapsed  —  As Rep. Dean Phillips ramps up his long-shot bid for president, his Democratic colleagues back in Washington are fuming at what they see as the Minnesotan's betrayal of his party. … - Democrats “who see the same polls that I see … ",
    "url": "https://www.axios.com/2023/12/17/dean-phillips-standing-on-capitol-hill-has-all-but-collapsed"
  },
  {
    "text": "Israel invites journalists into a car-width tunnel beneath Gaza, not far from its border.  —  U.S. to Push Israel to Scale Back War … Amid anguish over the accidental killing of hostages, Netanyahu vows to keep fighting.  —  Prime Minister Benjamin Netanyahu vowed on Sunday to keep fighting in Gaza … ",
    "url": "https://www.nytimes.com/live/2023/12/17/world/israel-hamas-war-gaza-news"
  },
  {
    "text": "No Beliefs, Just Intentions  —  Victims of abuse create language to name both abuse and abusers.  Inevitably, abusers use that same language to deny what they're doing.  Navigating false equivalence in an age of rising fascism. … Two families got fed up and moved away.  The Nobles of Iowa moved to blue Minnesota.",
    "url": "https://armoxon.substack.com/p/no-beliefs-just-intentions"
  },
  {
    "text": "Canada will soon announce an all-EV sales requirement for 2035: reports  —  Canada is expected to announce new regulations this week that will require all vehicles sold in the country to be zero-emissions by 2035, according to news reports.  —  The new regulations, which will reportedly … ",
    "url": "https://thehill.com/policy/energy-environment/4364936-canada-will-soon-announce-an-all-ev-sales-requirement-for-2035-reports/"
  },
  {
    "text": "Jeff Roe, Top Strategist for Star-Crossed DeSantis Super PAC, Resigns  —  Mr. Roe, who helped lead Never Back Down, the super PAC behind the Florida governor's presidential campaign, resigned Saturday, the latest shake-up in the group.  —  Jeff Roe, the chief strategist for the leading super PAC supporting … ",
    "url": "https://www.nytimes.com/2023/12/16/us/politics/desantis-never-back-down-jeff-roe-resigns.html"
  },
  {
    "text": "Majority of Chileans reject new conservative constitution - early results  —  Early results show that a majority of Chileans voted to reject a new conservative constitution to replace its dictatorship-era text.  —  A total of 54.30% voted against the text while 45.70% voted in favor of it with 7.97% of ballot boxes tallied.",
    "url": "https://www.reuters.com/world/americas/majority-chileans-reject-new-conservative-constitution-early-results-2023-12-17/"
  },
  {
    "text": "Lindsey Graham Is Suddenly Bored of Biden Impeachment Probe  —  BACKTRACK!  —  Sen. Lindsey Graham (R-S.C.) said on Sunday he hasn't “really been paying that much attention” to the House impeachment inquiry into President Joe Biden's connection to his son Hunter's business dealings … ",
    "url": "https://www.thedailybeast.com/lindsey-graham-suddenly-bored-of-joe-biden-impeachment-probe-in-hunter-scandal"
  }
]