[
  {
    "text": "Supreme Court Justice Alito's Beach House Displayed ‘Appeal to Heaven’ Flag … The “Appeal to Heaven” flag flew outside the Alitos' New Jersey vacation home last summer, along with a “2022” Phillies flag and a Long Beach Island flag.  —  Last summer, two years after an upside-down American flag … ",
    "url": "https://www.nytimes.com/2024/05/22/us/justice-alito-flag-appeal-to-heaven.html"
  },
  {
    "text": "Another Flag for Alito  —  Don't Despair, Vote  —  My God.  —  Tonight, more reporting from Jodi Kantor, joined by Aric Toler and Judy Tate at The New York Times, on Justice Alito's flag-flying practices.  It turns out that in the summer of 2023, the Alitos flew an “Appeal to Heaven” flag at their summer beach house in New Jersey.",
    "url": "https://joycevance.substack.com/p/another-flag-for-alito"
  },
  {
    "text": "Sam Alito is a problem  —  Chief Justice John Roberts must take responsibility for his court.  If he does not, what follows will be his legacy — and we'll have to deal with the fallout.  —  It's been clear for some time that Justice Sam Alito was the Fox News (or an even further right-wing channel) … ",
    "url": "https://www.lawdork.com/p/sam-alito-is-a-problem"
  },
  {
    "text": "A Unique Election Driven by a Traditional Issue  —  There are a lot of unique and untested variables in this upcoming presidential election.  It is the first race in more than 100 years between an incumbent and former incumbent president (both of whom would be the oldest ever to be inaugurated).",
    "url": "https://www.cookpolitical.com/survey-research/2024-swing-state-project/unique-election-driven-traditional-issue"
  },
  {
    "text": "Nikki Haley Surrendered, but Not Her Voters  —  The views of Nikki Haley Republicans—pro-Ukraine, pro-Israel, pro-market—reflect all those things that Republicans used to think in that bygone era when Reagans and Bushes and Romneys roamed the Earth.  But few feel any emotional bond to Haley.",
    "url": "https://www.theatlantic.com/politics/archive/2024/05/nikki-haley-trump-endorse/678461/"
  },
  {
    "text": "Joe Biden and the Inversion of Reality  —  Americans are terribly misinformed about the state of the economy—at the expense of Joe Biden—and the media is partly to blame for it. … I: Ignorance is not bliss  —  One of the problems with democracy is that people vote … ",
    "url": "https://www.forkingpaths.co/p/joe-biden-and-the-inversion-of-reality"
  },
  {
    "text": "Judge Outlines ‘Shell Game’ Played with Classified Docs at Mar-a-Lago  —  THIS WEEK'S MOST IMPORTANT NEWS is barely making headlines: On Tuesday, it was revealed that a federal judge found over a year ago that there is sufficient evidence, if believed by a jury, to find that Donald J. Trump … ",
    "url": "https://www.thebulwark.com/p/judge-outlines-mar-a-lago-shell-game-classified"
  },
  {
    "text": "Natalie Harp: Gatekeeper to the Reich  —  I want to unpack a Marc Caputo story about Natalie Harp, who he says is the person who posted the Reich meme video to Trump's Truth Social account this week.  —  Trump's account posted the Reich video on Monday.  —  On Tuesday, AP identified a troll … ",
    "url": "https://www.emptywheel.net/2024/05/23/natalie-harp-gatekeeper-to-the-reich/"
  },
  {
    "text": "They're all election deniers now  —  Trump's veep hopefuls are saying it over and over. … Lately, Republicans have been getting one simple question: “Will you accept the results of the 2024 election, regardless of its outcome?”  Their responses keep exposing that election denialism has taken over the party.",
    "url": "https://www.publicnotice.co/p/election-denial-marco-rubio-lara-trump-burgum"
  },
  {
    "text": "Political consultant indicted for AI robocalls with fake Biden voice made to New Hampshire voters  —  MANCHESTER, N.H. —  A man who admitted to sending out robocalls mimicking President Joe Biden's voice on the day of the New Hampshire primary is now facing criminal charges.",
    "url": "https://www.wmur.com/article/steve-kramer-ai-robocalls-biden-indictment-52224/60875422"
  },
  {
    "text": "Supreme Court Sides With Republicans Over South Carolina Voting Map  —  The case concerned a constitutional puzzle: how to distinguish the roles of race and partisanship in drawing voting maps when Black voters overwhelmingly favor Democrats.  —  The Supreme Court cleared the way on Thursday … ",
    "url": "https://www.nytimes.com/2024/05/23/us/supreme-court-south-carolina-voting-map.html"
  },
  {
    "text": "Will RFK Jr. Swing the Election to Biden?  —  Third parties never win, but on occasion they've been known to determine the loser.  —  No third-party candidate will win the 2024 presidential election or even a single state.  But a third-party candidate could decide the election's outcome.",
    "url": "https://www.wsj.com/articles/will-rfk-jr-swing-the-election-to-biden-307b113e"
  },
  {
    "text": "Congressman Andy Ogles admits his claims to have loaned $320,000 to his campaign were not true  —  GOP opponent Courtney Johnston: 'If Andy Ogles is willing to lie about his own money, what won't he lie about?'  —  NASHVILLE, Tenn. (WTVF) — Tennessee Congressman Andy Ogles filed 11 amendments … ",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/revealed/congressman-andy-ogles-admits-his-claims-to-have-loaned-320-000-to-his-campaign-were-not-true"
  },
  {
    "text": "The Minnesota GOP endorsed an anti-semite for U.S. Senate.  Republicans are silent.  —  Earlier this month, Congressman Tom Emmer (R-MN) blasted college students protesting Israel's military operations in Gaza.  “By these students' own admission, they're not just standing in solidarity with this pro-Hamas … ",
    "url": "https://popular.info/p/the-minnesota-gop-endorsed-an-anti"
  },
  {
    "text": "Do you need a college degree to succeed?  Here's what the data shows.  —  College was once widely viewed as a pathway to success, but today only about 1 in 4 Americans say a bachelor's degree is necessary to secure a well-paying job, according to a new survey from the Pew Research Center.",
    "url": "https://www.cbsnews.com/news/college-degree-income-is-college-worth-it-pew/"
  },
  {
    "text": "Far-right ID group expels Alternative for Germany  —  The AfD has been hit by scandals, including potential connections to China and Russia.  —  Germany's far-right Alternative for Germany party (AfD) has been expelled from its pan-European group Identity and Democracy in the European Parliament following … ",
    "url": "https://www.politico.eu/article/far-right-identity-and-democracy-group-expels-alternative-for-germany/"
  },
  {
    "text": "Crypto's ‘huge moment’ scrambling US politics  —  Recent votes surfaced household names like Chuck Schumer and Nancy Pelosi as unexpected allies.  —  Cryptocurrency is used by a fraction of the American electorate.  But it's starting to have an outsize impact on U.S. politics and policy.",
    "url": "https://www.politico.com/news/2024/05/23/crypto-2024-election-impact-00159506"
  },
  {
    "text": "House Democrat Banned From Speaking for Simply Listing Trump's Trials  —  SPITTING FACTS  —  Lawmakers apparently aren't allowed to speak about Trump's trials on the House floor—unless they're backing him.  —  Rep. Jim McGovern (D-MA) was temporarily banned from speaking on the House floor Wednesday … ",
    "url": "https://www.thedailybeast.com/house-democrat-banned-from-speaking-for-simply-listing-trumps-trials"
  },
  {
    "text": "Trump gears up for unique South Bronx rally … - It will be his first large-scale campaign rally in New York since 2016. … - It has been working with the predominantly Hispanic members of the Bodega Association and the National Supermarket Association, made up of independent supermarket owners.",
    "url": "https://www.axios.com/2024/05/23/trump-south-bronx-rally-new-york"
  },
  {
    "text": "You Can Get Anything You Want at Joe Biden's Restaurant  —  If you are younger than my current age of 57 years, you are probably guessing this is going to be a post about skyrocketing food prices.  But if you're my age or older, you are probably bracing for a reference to Alice's Restaurant Massacree … ",
    "url": "https://hotair.com/generalissimo/2024/05/23/you-can-get-anything-you-want-at-joe-bidens-restaurant-n3788916"
  },
  {
    "text": "Florida attorney general says state will investigate Starbucks for DEI practices  —  Florida's top legal officer on Wednesday said the state will investigate Starbucks, the multinational chain of coffeehouses, for its diversity, equity and inclusion practices.",
    "url": "https://www.usatoday.com/story/news/nation/2024/05/23/florida-investigates-dei-starbucks/73816554007/"
  },
  {
    "text": "The Trumpire Strikes Back  —  Joe Biden, the Democrats, and the mainstream media (but I repeat myself) have been banging on the “Trump is an existential threat to democracy” drum for years now.  —  The mantra worked for quite a while, but according to the polls, the sting has been taken out of this thorn.",
    "url": "https://hotair.com/david-strom/2024/05/23/the-trumpire-strikes-back-n3788904"
  },
  {
    "text": "Trump vows to “NEVER” take away birth control — except he spent four years doing just that  —  Trump's attacks on contraception were unrelenting.  He even asked the Supreme Court to block women's access  —  If he's elected president, Donald Trump will try to take away your birth control.",
    "url": "https://www.salon.com/2024/05/23/vows-to-never-take-away-birth-control--except-he-spent-four-years-doing-just-that/"
  },
  {
    "text": "The Biden administration has a plan to shut down the border.  But it needs Mexico's help.  —  The administration hopes to unveil a series of executive actions that President Biden can sign but will likely have to wait for the outcome of Mexico's June 2 presidential election.",
    "url": "https://www.nbcnews.com/politics/immigration/biden-administration-plan-shut-border-needs-mexicos-help-rcna153620"
  }
]