[
  {
    "text": "Chief justice pushes back against calls to impeach judges who rule against Trump  —  Chief Justice John Roberts issued a statement following President Donald Trump's call for a judge to be impeached for ruling against the administration.  —  WASHINGTON — Chief Justice John Roberts issued … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/chief-justice-pushes-back-calls-impeach-judges-rule-trump-rcna196922"
  },
  {
    "text": "Chief Justice Roberts Rebukes Trump Call to Impeach Judges for Rulings  —  Trump Says Xi Will Visit Washington in ‘Not Too Distant Future’  —  Trump Branding Migrants as Criminals Is Complicating Plans to Bring Them Home  —  Guatemala wants to help returning migrants prepare for a new life … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-18/us-chief-justice-calls-impeaching-judges-over-rulings-improper"
  },
  {
    "text": "House GOP moves swiftly to impeach judge targeted by Trump  —  Just hours after President Trump called for the impeachment of a federal judge who ruled against his deportation of hundreds of Venezuelans over the weekend, House Republicans introduced a measure to do just that.",
    "url": "https://www.axios.com/2025/03/18/donald-trump-impeach-judge-house-republicans"
  },
  {
    "text": "‘Move Fast’: Inside Team Trump's Furious Defiance of the Courts  —  Trump's advisers are attacking judges for daring to “control” him.  The president wants the one objecting to his deportation plans to be “IMPEACHED!!!”  —  During the past two months of Donald Trump and Elon Musk's power grabs … ",
    "url": "https://www.rollingstone.com/politics/politics-features/inside-team-trump-attack-judges-defiance-court-orders-1235298463/"
  },
  {
    "text": "This is why Kamala Harris really lost  —  Democrats have spent months debating how and why they lost the 2024 election.  But the full picture of what happened on Election Day is only now coming into view.  —  The most authoritative election analyses draw on a variety of different data sources … ",
    "url": "https://www.vox.com/politics/403364/tik-tok-young-voters-2024-election-democrats-david-shor"
  },
  {
    "text": "Democrats Need to Face Why Trump Won  —  This is an edited transcript of an episode of “The Ezra Klein Show.”  You can listen to the conversation by following or subscribing to the show on the NYT Audio App, Apple, Spotify, Amazon Music, YouTube, iHeartRadio or wherever you get your podcasts.",
    "url": "https://www.nytimes.com/2025/03/18/opinion/ezra-klein-podcast-david-shor.html?unlocked_article_code=1.404.SS55.0qpFRuWoH3Jj&smid=url-share"
  },
  {
    "text": "Judge finds Elon Musk and DOGE's shutdown of USAID likely unconstitutional  —  Washington — A federal judge on Tuesday found that Elon Musk and the White House's Department of Government Efficiency likely violated the Constitution when they unilaterally acted to shut down the U.S. Agency for International Development.",
    "url": "https://www.cbsnews.com/news/judge-finds-doges-usaid-shutdown-likely-unconstitutional/"
  },
  {
    "text": "GOP leaders call on Sen. Eichorn to resign after arrest for allegedly soliciting a minor  —  Minnesota state Sen. Justin Eichorn was arrested Monday in Bloomington for allegedly soliciting a minor for prostitution.  —  Bloomington police said Eichorn was arrested near the 8300 block … ",
    "url": "https://www.mprnews.org/story/2025/03/18/state-senator-eichorn-arrested-suspicion-of-soliciting-a-minor"
  },
  {
    "text": "Wired is dropping paywalls for FOIA-based reporting.  Others should follow  —  The news business isn't just any business — it serves a vital role in our democracy, recognized by the First Amendment.  But media outlets can't serve that role if they're bankrupt.",
    "url": "https://freedom.press/issues/wired-is-dropping-paywalls-for-foia-based-reporting-others-should-follow/"
  },
  {
    "text": "MAGA Brocasters Grow Suspicious of the Jews  —  Bro podcast antisemitism  —  The bro-comedy podcasts that helped Trump win the election and set off much agonizing about the right's overwhelming podcast advantage have taken up a hot new topic: antisemitism and even, in one case, general Adolf Hitler apologia.",
    "url": "https://www.thebulwark.com/p/maga-brocasters-grow-suspicious-of-the-jews-joe-rogan-theo-von-antisemitism"
  },
  {
    "text": "The Faces of Trump's Anti-Immigrant Crusade  —  The government deported a 10-year-old American citizen with brain cancer.  —  ∙ Paid  —  First: I'll be live on Substack today at 1:00 p.m. EDT with epidemiologist Katelyn Jetelina to talk about measles, vaccines … ",
    "url": "https://www.thebulwark.com/p/the-faces-of-trumps-anti-immigrant"
  },
  {
    "text": "Trump to declare “illicit” fentanyl “Weapon of Mass Destruction,” per draft EO  —  The Handbasket is subscriber-funded.  If you want to support independent media during these dark times for democracy, become a paid subscriber today!  —  Video  —  The heads of the US Departments of Commerce … ",
    "url": "https://www.thehandbasket.co/p/trump-fentanyl-weapon-of-mass-destruction-executive-order-draft-scoop"
  },
  {
    "text": "Firing federal employees was swift.  Unwinding the terminations is proving complicated  —  Federal agencies continue to unwind the firings of federal employees to comply with court orders, in a labor-intensive process affecting more than 24,000 people nationwide.",
    "url": "https://www.npr.org/2025/03/18/nx-s1-5332139/fired-federal-employees-reinstate-leave"
  },
  {
    "text": "For four Venezuelan friends, Alien Enemies Act cuts short an American dream  —  The men had just begun new lives in Dallas when officers arrived at their home and arrested them.  Their relatives deny that they have any connection to the Tren de Aragua gang.  —  Just now",
    "url": "https://www.washingtonpost.com/immigration/2025/03/18/trump-migrants-venezuelans-deportation-bukele/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyMjcwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzNjUyNzk5LCJpYXQiOjE3NDIyNzA0MDAsImp0aSI6ImUzNDc4YTAyLTdmZmEtNDBhYy05OWY5LThlZjU4MzRlNDUxOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzAzLzE4L3RydW1wLW1pZ3JhbnRzLXZlbmV6dWVsYW5zLWRlcG9ydGF0aW9uLWJ1a2VsZS8ifQ.58UWY6jz_YvKWHmHZZUgOVSFOk0TtcxSGIdRFq8ns34&itid=gfta"
  },
  {
    "text": "DOJ refuses to respond to some questions from the judge who blocked Alien Enemies Act deportations  —  “The Government maintains that there is no justification to order the provision of additional information,” the Justice Department said in a court filing.  —  The Justice Department … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/doj-refuses-respond-questions-judge-blocked-alien-enemies-act-deportat-rcna196883"
  },
  {
    "text": "Kennedy's Alarming Prescription for Bird Flu on Poultry Farms  —  The health secretary has suggested allowing the virus to spread, so as to identify birds that may be immune.  Such an experiment would be disastrous, scientists say.  —  Robert F. Kennedy Jr., the nation's top health official … ",
    "url": "https://www.nytimes.com/2025/03/18/health/kennedy-bird-flu.html?unlocked_article_code=1.404.zYYP.HXW7t7VL8EuF&smid=url-share"
  },
  {
    "text": "Pentagon is cutting up to 60,000 civilian jobs.  About a third of those took voluntary resignations  —  Roughly 50,000 to 60,000 civilian jobs will be cut in the Defense Department, but fewer than 21,000 workers who took a voluntary resignation plan are leaving in the coming months, a senior defense official told reporters Tuesday.",
    "url": "https://apnews.com/article/pentagon-doge-civilian-job-cuts-fbcb154fbe9d5904f456aa3655e57c44"
  },
  {
    "text": "Elon Musk's Starlink Expands Across White House Complex  —  Trump administration officials said the company donated the internet service, saying the gift had been vetted by the lawyer overseeing ethics issues in the White House Counsel's Office.  —  Starlink, the satellite internet service operated … ",
    "url": "https://www.nytimes.com/2025/03/17/us/politics/elon-musk-starlink-white-house.html?unlocked_article_code=1.404.YQoK.rMD9xAA-77wW&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Some Americans Have Already Been Caught in Trump's Immigration Dragnet.  More Will Be.  —  Federal immigration authorities have a history of wrongfully detaining U.S. citizens.  Advocates warn that the Trump administration's immigration policies mean that more citizens will get caught up in raids and sweeps.",
    "url": "https://www.propublica.org/article/more-americans-will-be-caught-up-trump-immigration-raids"
  },
  {
    "text": "‘Segregated facilities’ are no longer explicitly banned in federal contracts  —  After a recent change by the Trump administration, the federal government no longer explicitly prohibits contractors from having segregated restaurants, waiting rooms and drinking fountains.",
    "url": "https://www.npr.org/sections/shots-health-news/2025/03/18/nx-s1-5326118/segregation-federal-contracts-far-regulation-trump"
  },
  {
    "text": "‘Airport Theory’ Will Make You Miss Your Flight  —  This delusional airport trend only appeals to those who have no concept of how time or space work.  Here's how to actually travel like a pro. … If airports weren't already a hellscape, TikTok has found a way to make them worse.",
    "url": "https://www.wired.com/story/airport-theory-aka-what-happens-if-you-miss-your-flight/"
  },
  {
    "text": "US Institute of Peace says DOGE has broken into its building  —  President Trump targeted the organization and a few others in a Feb. 19 executive order aiming to shrink the federal government  —  Employees of Elon Musk's Department of Government Efficiency entered the U.S. Institute … ",
    "url": "https://www.nbcwashington.com/news/president-trump-politics/us-institute-of-peace-doge-trump-administration/3869923/"
  },
  {
    "text": "Trump Says a Recession Might Be Worth the Cost.  Economists Disagree.  —  President Trump and his advisers say his policies may cause short-term pain but will produce big gains over time.  Many economists are skeptical of those arguments.  —  Presidents usually do all they can to avoid recessions … ",
    "url": "https://www.nytimes.com/2025/03/18/business/economy/trump-recession-tariffs-inflation.html"
  },
  {
    "text": "MAGA already looking to anoint Vance for 2028  —  Just eight months after President Trump picked JD Vance to be his vice president, Vance is already positioned to be MAGA's heir apparent for 2028.  — “I think it's inevitable at this point that Vance will be the [GOP] nominee in 2028,” … ",
    "url": "https://www.axios.com/2025/03/18/vance-trump-maga-2028"
  },
  {
    "text": "Tesla board members, executive sell off over $100 million of stock in recent weeks  —  Shares of Tesla have plunged nearly 50% since a peak in mid-December.  —  Stickers protesting Tesla CEO Elon Musk are shown on a Tesla Supercharger, on March 12, 2025, in San Anselmo, Calif.",
    "url": "https://abcnews.go.com/Business/tesla-board-members-executive-sell-off-100-million/story?id=119889047"
  },
  {
    "text": "Social Security chief says he will ‘continue to make mistakes’ but vows to ‘learn from them’  —  Lee Dudek, the acting Social Security Administration commissioner, sent a memo to staff Tuesday outlining his vision for the agency moving forward.  —  Leland Dudek, the acting commissioner … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/social-security-chief-mistakes-memo-rcna196888"
  },
  {
    "text": "The Stages of Trumpist Economic Grief  —  Or, how Scott Bessent (sort of) became spiritual  —  While much of MAGA is motivated by hatred of an open society — by racism, misogyny and the desire to end all things woke — the swing voters who put Donald Trump over the top thought they were supporting … ",
    "url": "https://paulkrugman.substack.com/p/the-stages-of-trumpist-economic-grief"
  },
  {
    "text": "HIV could infect 1,400 infants every day because of US aid disruptions  —  Around 1,400 infants are being infected by HIV every day as a result of the new US administration's cuts to funding to AIDS organizations, new modeling suggests.  —  In an executive order issued January 20 … ",
    "url": "https://www.technologyreview.com/2025/03/18/1113288/hiv-could-infect-1400-infants-every-day-due-to-disruptions-in-aid-from-the-us/"
  },
  {
    "text": "There Is No Method to Trump's Madness.  He's Simply Insane.  —  “They say an old man is twice a child,” Rosencrantz remarks in Shakespeare's Hamlet, as he and the prince of Denmark observe Polonius.  It's a borrowed line, dating back to antiquity: Sophocles wrote, “For the aged man is once again a child.”",
    "url": "https://newrepublic.com/article/192786/trump-tariffs-insane-method-madness"
  },
  {
    "text": "DOJ Asserts Trump Hypothetically Has Power To Purge All Female Agency Heads, Or Those Over 40  —  The Trump Department of Justice asserted in court Tuesday that, under their theories, the President's removal power is so all-encompassing that he could fire all female agency heads, as well as those over 40 years old.",
    "url": "https://talkingpointsmemo.com/news/doj-trump-fire-women-over-40-agency"
  },
  {
    "text": "Report: mRNA vaccines are in RFK Jr's crosshairs; funding in question … Federal support for mRNA vaccine research appears in jeopardy after KFF Health News reported Sunday that officials at the National Institutes of Health have directed scientists to remove all references to the lifesaving technology from their grant applications.",
    "url": "https://arstechnica.com/health/2025/03/federal-funding-for-mrna-vaccine-research-in-jeopardy-under-rfk-jr/"
  }
]