[
  {
    "text": "How Far Trump Would Go  —  The former President, at Mar-a-Lago on April 12, is rallying the right at home and seeking common cause with autocratic leaders abroad.Photograph by Philip Montgomery for TIME  —  Donald Trump thinks he's identified a crucial mistake of his first term: He was too nice.",
    "url": "https://time.com/6972021/donald-trump-2024-election-interview/"
  },
  {
    "text": "Read the Full Transcripts of Donald Trump's Interviews With TIME … Over the course of the interviews, Trump discussed his agenda for a second term, which includes deporting millions of people, cutting the U.S. civil service, and intervening more directly in Justice Department prosecutions than his predecessors.",
    "url": "https://time.com/6972022/donald-trump-transcript-2024-election/"
  },
  {
    "text": "Biden and Democrats Seize on Trump's Striking Interview  —  The president and other top Democrats moved quickly to capitalize politically on Donald J. Trump's interview with Time magazine, particularly his comments on abortion.  —  The Biden campaign is mounting a concerted push … ",
    "url": "https://www.nytimes.com/2024/04/30/us/politics/biden-democrats-trump-interview.html"
  },
  {
    "text": "Trump Wants to Prosecute Biden.  He Also Thinks Presidents Deserve Immunity.  —  In arguing to the Supreme Court that he cannot be charged for acts while in office, Donald Trump has asked the justices to enforce a norm that he has long threatened to shatter.",
    "url": "https://www.nytimes.com/2024/04/30/us/politics/trump-biden-president-immunity.html"
  },
  {
    "text": "US drug control agency will move to reclassify marijuana in a historic shift, AP sources say  —  The U.S. Drug Enforcement Administration will move to reclassify marijuana as a less dangerous drug, The Associated Press has learned, a historic shift to generations of American drug policy … ",
    "url": "https://apnews.com/article/marijuana-biden-dea-criminal-justice-pot-f833a8dae6ceb31a8658a5d65832a3b8"
  },
  {
    "text": "Biden administration plans to reclassify marijuana, easing restrictions nationwide  —  Cannabis is currently classified along with drugs like heroin and LSD.  The DEA is expected to reschedule it into a category that includes Tylenol and steroids.  —  WASHINGTON — The Biden administration … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-administration-plans-reclassify-marijuana-easing-restrictions-na-rcna149424"
  },
  {
    "text": "After Ukraine Aid Vote, Republicans Braced for Backlash Find Little  —  Some Republicans who backed the aid encountered little resistance from voters, who were far more willing to embrace it — and less interested in ousting the speaker over it — than their right-wing colleagues.",
    "url": "https://www.nytimes.com/2024/04/30/us/politics/republicans-ukraine-aid-vote.html"
  },
  {
    "text": "Judge holds Trump in contempt for violating gag order in hush money trial  —  Prosecutors from the Manhattan District Attorney's Office accused Trump of violating the gag order numerous times since it went into effect.  —  The judge presiding over Donald Trump's hush money case on Tuesday held … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-holds-trump-contempt-violating-gag-order-hush-money-trial-rcna149101"
  },
  {
    "text": "‘Jeffrey Clark betrayed his oath’: Trump DOJ lawyer behind fake electors plot should be disbarred, disciplinary panel says  —  The District of Columbia's Office of Disciplinary Counsel issued a recommendation this week battering the credibility of former Donald Trump Justice Department attorney Jeffrey Clark … ",
    "url": "https://lawandcrime.com/high-profile/jeffrey-clark-betrayed-his-oath-trump-doj-lawyer-behind-fake-electors-plot-should-be-disbarred-disciplinary-panel-says/"
  },
  {
    "text": "Live Updates: Lawyer for Stormy Daniels Takes Stand in Trump Criminal Trial  —  Keith Davidson, who negotiated the $130,000 hush-money payment at the heart of the case, has begun testifying.  Earlier, the judge overseeing the trial fined Donald J. Trump $9,000 and warned he could be jailed if he continued to violate his gag order.",
    "url": "https://www.nytimes.com/live/2024/04/30/nyregion/trump-hush-money-trial"
  },
  {
    "text": "Northwestern Cuts Deal with Encampment Organizers, Establishes Full-Ride Scholarship for Palestinian Students  —  After five days of anti-Israel demonstrators occupying Deering Meadow on Northwestern University's campus, Northwestern president Michael Schill and the rest of the university's leadership decided … ",
    "url": "https://www.nationalreview.com/news/northwestern-cuts-deal-with-encampment-organizers-establishes-full-ride-scholarship-for-palestinian-students/"
  },
  {
    "text": "Why I'm Resigning From The Intercept  —  I resigned from The Intercept today in order to pursue a new kind of journalism here on Substack, one more hard-hitting than what's possible in the corporate world.  The Intercept has been taken over by suits who have abandoned its founding mission … ",
    "url": "https://www.kenklippenstein.com/p/why-im-resigning-from-the-intercept"
  },
  {
    "text": "Biden administration contemplating bringing Palestinian refugees into US: Report  —  The Biden administration is reportedly considering bringing certain Gazan refugees into the United States.  —  According to internal federal government documents obtained by CBS News, senior officials … ",
    "url": "https://www.washingtonexaminer.com/policy/foreign-policy/2985895/biden-administration-contemplating-bringing-palestinian-refugees-us/"
  },
  {
    "text": "Dozens occupy Hamilton Hall as pro-Palestinian protests spread across campus  —  This is a developing story.  Check back for updates.",
    "url": "https://www.columbiaspectator.com/news/2024/04/30/dozens-occupy-hamilton-hall-as-pro-palestinian-protests-spread-across-campus/"
  },
  {
    "text": "Fox News Quietly Deletes Hunter Biden ‘Mock Trial’ Series  —  ‘HOLDING THEM ACCOUNTABLE’  —  The conservative cable giant has quickly moved to comply with the presidential scion's demands. … Fox News appears to be taking Hunter Biden's lawsuit threat quite seriously.",
    "url": "https://www.thedailybeast.com/fox-news-quietly-deletes-hunter-biden-mock-trial-special-following-lawsuit-threat"
  },
  {
    "text": "USPol #USPolitics #Politics #Fascism  —  11 thoughts on “#USPol #USPolitics #Politics #Fascism”  —  @ArpComics Peaceful protesters who don't trespass or cause damage to property are for the most part left to protest peacefully.  What is happening now is an embarrassment and is in no way a protest.",
    "url": "https://whatwasidoingagain.com/notes/9a42a0bdb1/"
  },
  {
    "text": "Middle schoolers who protested trans athlete's participation are banned from future competitions  —  Five West Virginia middle schoolers who protested a transgender athlete's participation in a track and field competition have been barred from future meets — prompting the state attorney general … ",
    "url": "https://nypost.com/2024/04/30/us-news/middle-schoolers-who-protested-trans-athletes-participation-banned-from-future-competitions/"
  },
  {
    "text": "War Zone Surveillance Technology Is Hitting American Streets … Big Brother isn't just watching you: He's using your cell phone, smartwatch, wireless earbuds, car entertainment systems and license plates to track your location in real time.  —  Contracting records and notes … ",
    "url": "https://www.notus.org/technology/war-zone-surveillance-border-us"
  },
  {
    "text": "Why Some Abortion Rights Groups Aren't Backing Pro-Choice Amendments  —  There's an internal struggle playing out right now in many states where abortion rights will likely be on the November ballot.  —  Eloisa Lopez is the executive director for Pro-Choice Arizona and the Abortion Fund of Arizona … ",
    "url": "https://www.huffpost.com/entry/why-some-abortion-rights-groups-not-backing-pro-choice-amendments_n_662fe875e4b0c9bc875862d4"
  },
  {
    "text": "How a Few Secret Donors Are Fueling the New Right-Wing Infrastructure  —  The Bradley Impact Fund helps finance the work of groups led by Michael Flynn and Stephen Miller.  Most of the money can be traced to four undisclosed sources, documents show.  —  In early 2021, Stephen Miller … ",
    "url": "https://www.motherjones.com/politics/2024/04/bradly-impact-fund-michael-flynn-stephen-miller-culture-war-project-veritas-american-first-legal-cpi/"
  }
]