[
  {
    "text": "The Elon / Trump interview on X started with an immediate tech disaster … Elon Musk's “conversation” with former President Donald Trump got off to a rocky start.  The interview, which was hosted on X Spaces and scheduled to begin at 8PM ET Monday night, crashed almost immediately and didn't begin until 42 minutes later",
    "url": "https://www.theverge.com/2024/8/12/24219121/donald-trump-elon-musk-interview-x-twitter-crashes"
  },
  {
    "text": "Elon Musk, Donald Trump event on X crashes site, Tesla CEO blames cyberattack … Elon Musk's much-hyped interview of former President Donald Trump on the social media platform X was quickly derailed by technical glitches in the first minutes of the scheduled start time on Monday evening.",
    "url": "https://www.cnbc.com/2024/08/12/elon-musk-donald-trump-event-on-x-crashes-site-tesla-ceo-blames-hackers.html"
  },
  {
    "text": "EU's Breton warns Musk on hate speech ahead of Trump interview; receives profane response  —  The European Union's digital enforcer wrote an open letter to tech mogul Elon Musk on Monday ahead of a planned interview with former United States President Donald Trump to remind him of the EU's rules on promoting hate speech.",
    "url": "https://www.politico.eu/article/eu-warns-elon-musk-hate-speech-donald-trump-interview-breton-x/"
  },
  {
    "text": "Trump's interview with Musk devolves into yet another X catastrophe  —  It started after about 45 minutes.  —  Elon Musk guaranteed entertainment.  He delivered technical difficulties instead.  —  Musk planned to host GOP nominee Donald Trump for an interview “Live on X,” formerly Twitter Spaces … ",
    "url": "https://www.politico.com/news/2024/08/12/trump-musk-x-interview-problems-00173739"
  },
  {
    "text": "Suspected Iranian hackers breached Roger Stone's personal email as part of effort to target Trump campaign, sources say  —  The FBI and other investigators probing the apparent hack-and-leak of Trump campaign documents, which Donald Trump has blamed on Iran, suspect that the hackers were able … ",
    "url": "https://www.cnn.com/2024/08/12/politics/trump-campaign-hack-personal-email-account-fbi/"
  },
  {
    "text": "Exclusive: Only Gaza ceasefire can delay Iran's Israel response, sources say  —  Only a ceasefire deal in Gaza stemming from hoped-for talks this week would hold Iran back from direct retaliation against Israel for the assassination of Hamas leader Ismail Haniyeh on its soil, three senior Iranian officials said.",
    "url": "https://www.reuters.com/world/middle-east/only-gaza-ceasefire-can-delay-irans-israel-response-sources-say-2024-08-13/"
  },
  {
    "text": "Judge rules against RFK Jr. in fight to be on New York's ballot, says he is not a state resident  —  A judge ruled Monday that independent presidential candidate Robert F. Kennedy Jr.'s name should not appear on New York's ballot, saying that he falsely claimed a New York residence on nominating petitions despite living in California.",
    "url": "https://apnews.com/article/kennedy-rfk-jr-ballot-new-york-residency-faaf0c8d7638cdfcdbe3c4eb7b542eef"
  },
  {
    "text": "Tina Peters guilty: Former Mesa County clerk convicted on 7 charges  —  Twelve Mesa County jurors found Tina Peters guilty of four felonies on Monday after a lengthy criminal trial, marking yet another conviction tied to post-2020 election conspiracy theories.",
    "url": "https://www.cpr.org/2024/08/12/tina-peters-trial-verdict/"
  },
  {
    "text": "Jurors deliberating in case of Colorado clerk Tina Peters in election computer system breach  —  DENVER (AP) — Prosecutors on Monday urged jurors to convict former Colorado clerk Tina Peters in a security breach of her county's election computer system, saying she deceived government employees … ",
    "url": "https://apnews.com/article/tina-peters-election-computer-breach-8a171657321dd595dfd2dd81e0a0a848"
  },
  {
    "text": "‘End of an era:’ the Times won't endorse in local races  —  Presented by With help from Rich Mendez  —  One of the most influential players in New York politics has benched itself without much explanation.  —  The New York Times' decision to immediately halt city and state endorsements scrambles … ",
    "url": "https://www.politico.com/newsletters/new-york-playbook/2024/08/13/end-of-an-era-the-times-wont-endorse-in-local-races-00173748"
  },
  {
    "text": "The New York Times Will Stop Endorsing Candidates in New York Races  —  The paper's editorial board will continue to endorse presidential candidates, as it has for more than 160 years.  —  The New York Times editorial board will no longer make endorsements in New York elections … ",
    "url": "https://www.nytimes.com/2024/08/12/business/media/the-new-york-times-editorial-board-political-endorsements.html"
  },
  {
    "text": "Biden's handoff to Harris set for DNC in Chicago … - It will be a goodbye that Biden resisted for weeks, as pressure built within the party for him to drop out of the race after his disastrous debate against Donald Trump in June.  — Now Biden, as a sitting president who wanted another term … ",
    "url": "https://www.axios.com/2024/08/13/biden-handoff-harris-dnc-chicago-democrats"
  },
  {
    "text": "Sasse's spending spree: Former UF president channeled millions to GOP allies, secretive contracts  —  The former UF president tripled his office's spending compared to predecessor  —  In his 17-month stint as UF president, Ben Sasse more than tripled his office's spending … ",
    "url": "https://www.alligator.org/article/2024/08/sasse-s-spending-spree-former-uf-president-channeled-millions-to-gop-allies-secretive-contracts"
  },
  {
    "text": "Donald Trump's Campaign Admits It Rented Jeffrey's Epstein's Jet  —  OOPS!  —  A campaign official told The Daily Beast that it instructed a charter jet company to never lease them the infamous Gulfstream G550 ever again.  —  Donald Trump's campaign confirmed the former president chartered … ",
    "url": "https://www.thedailybeast.com/trump-campaign-confirms-he-chartered-epsteins-old-jet"
  },
  {
    "text": "News outlets were leaked insider material from the Trump campaign.  They chose not to print it  —  At least three news outlets were leaked confidential material from inside the Donald Trump campaign, including its report vetting JD Vance as a vice presidential candidate.",
    "url": "https://apnews.com/article/trump-vance-leak-media-wikileaks-e30bdccbdd4abc9506735408cdc9bf7b"
  },
  {
    "text": "Arizona certifies abortion-rights initiative for the November ballot  —  Arizona's secretary of state's office announced that the 24-week limit will go up for a vote in the battleground state later this year.  —  PHOENIX — Arizona's ballot will include a major reproductive rights measure … ",
    "url": "https://www.nbcnews.com/politics/2024-election/arizona-certifies-abortion-rights-initiative-november-ballot-rcna166321"
  },
  {
    "text": "How hotels are colluding to jack up room rates, according to two lawsuits  —  If you traveled this summer, the rate you paid at hotels may have been artificially inflated.  According to two lawsuits, numerous hotel operators are participating in an illegal scheme to increase their prices.",
    "url": "https://popular.info/p/how-hotels-are-colluding-to-jack"
  },
  {
    "text": "Broadcast news and major papers failed to cover report of possible Egyptian bribery involving Trump  —  NBC, ABC, CBS, as well as the LA Times, USA Today, and Wall Street Journal, all ignored the reporting … According to an August 2 report in The Washington Post, the U.S. Department … ",
    "url": "https://www.mediamatters.org/donald-trump/broadcast-news-and-major-papers-failed-cover-report-possible-egyptian-bribery"
  },
  {
    "text": "Workers allege ‘nightmare’ conditions at Kentucky startup JD Vance helped fund  —  As a venture capitalist, JD Vance repeatedly touted his guiding principles for investing in a company: A business should not only turn a profit, it should also help American communities.",
    "url": "https://www.cnn.com/2024/08/13/politics/kentucky-startup-appharvest-jd-vance/"
  },
  {
    "text": "Fact Sheet: Biden-Harris Administration Announces $150 Million from ARPA-H to Deliver Progress on Biden Cancer Moonshot Goals and Improve Health Outcomes  —  More than two years ago, President Joe Biden and First Lady Jill Biden reignited the Cancer Moonshot with the goals of reducing … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/08/13/fact-sheet-biden-harris-administration-announces-150-million-from-arpa-h-to-deliver-progress-on-biden-cancer-moonshot-goals-and-improve-health-outcomes/"
  }
]