[
  {
    "text": "Harris campaign weaponizes crowd size against Trump … - Vice President Kamala Harris and Minnesota Gov. Tim Walz are drawing huge crowds as they barnstorm swing states this week, generating an exuberant atmosphere that had been missing from the Biden campaign.",
    "url": "https://www.axios.com/2024/08/09/kamala-harris-rally-crowd-size-trump"
  },
  {
    "text": "Donald Trump isn't fun anymore: How Kamala Harris stole the show — and extinguished his flame  —  We are currently watching Trump realize for the first time that he might lose again  —  Donald Trump is in a bad way.  —  His campaign has completely lost its bearings with the withdrawal … ",
    "url": "https://www.salon.com/2024/08/09/donald-isnt-fun-anymore-how-kamala-harris-stole-the-show--and-extinguished-his-flame/"
  },
  {
    "text": "Why Biden Was Really Forced Out of the Race, According to Anita Dunn  —  The longtime presidential adviser blames the press and her party for forcing Biden out of the race.  —  Anita Dunn has no regrets about holding a historically early debate between Joe Biden and Donald Trump … ",
    "url": "https://www.politico.com/news/magazine/2024/08/09/anita-dunn-no-regrets-biden-trump-debate-00173348"
  },
  {
    "text": "The Same Old Tired Shtick  —  The Harris-Walz barnstorming tour heads for the Sun Belt today, with rallies scheduled in Arizona and Nevada.  As Politico notes this morning, those events will provide an interesting test for “whether Walz's folksy, Midwestern brand can resonate beyond middle America.”",
    "url": "https://www.thebulwark.com/p/the-same-old-tired-schtick"
  },
  {
    "text": "Lawrence: ‘Stupidest’ candidate Trump did not answer reporters' questions  —  Donald Trump rambled and lied for over an hour without any follow up questions or fact-checking.  MSNBC's Lawrence O'Donnell says that while he hopes Vice President Harris answers questions from reporters … ",
    "url": "https://www.msnbc.com/the-last-word/watch/lawrence-stupidest-candidate-trump-did-not-answer-reporters-questions-216787525948"
  },
  {
    "text": "MSNBC Host Lawrence O'Donnell Slams His Own Network on Air Over Trump's Press Conference  —  SEEN ENOUGH  —  He also took it upon himself to “correct” a “mistake” the network made in its coverage of Kamala Harris.  —  MSNBC's Lawrence O'Donnell launched a scathing attack on the way cable news networks … ",
    "url": "https://www.thedailybeast.com/msnbc-host-lawrence-odonnell-slams-his-own-network-on-air-over-trumps-press-conference"
  },
  {
    "text": "Assessing claims about Tim Walz's military service  —  Republicans are attacking the Democratic vice-presidential nominee on his retirement timing and with allegations of “stolen valor.”  —  When Vice President Kamala Harris on Tuesday introduced her running mate, Minnesota Gov. Tim Walz … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/09/assessing-claims-about-walz-service/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzMTc2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI0NTU4Mzk5LCJpYXQiOjE3MjMxNzYwMDAsImp0aSI6IjE1ZGEzNWM5LTRmODAtNGEzYy04ZjA5LTAxODljMjA5MzExMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzA5L2Fzc2Vzc2luZy1jbGFpbXMtYWJvdXQtd2Fsei1zZXJ2aWNlLyJ9.Bt-jLzguzJkh4KOsdKYgzCO4oG6PVRy_cGxy00im3KM"
  },
  {
    "text": "Man who violently fought cops gets 2nd longest Jan. 6 sentence: 20 years  —  David Dempsey he came prepared for battle, prosecutors said.  He pleaded guilty earlier this year to two counts of assaulting police with dangerous or deadly weapons.  —  David N. Dempsey came to the Jan. 6, 2021 … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/08/09/david-dempsey-jan-6-sentencing/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzMTc2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI0NTU4Mzk5LCJpYXQiOjE3MjMxNzYwMDAsImp0aSI6Ijc0YjhiYWI2LWM3MDQtNDM4Mi1iMzU5LTVlNjYwNjI5ODRmNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS8yMDI0LzA4LzA5L2RhdmlkLWRlbXBzZXktamFuLTYtc2VudGVuY2luZy8ifQ.j3-x4ZmD0wS6_150iVQTkK_a1uwIVt6cJeQKCb1fafY&itid=gfta"
  },
  {
    "text": "Man who attacked police at the US Capitol with poles gets 20 years, one of longest Jan. 6 sentences  —  A California man with a history of political violence was sentenced on Friday to 20 years in prison for repeatedly attacking police with flagpoles and other makeshift weapons during the Jan. 6, 2021, riot at the U.S. Capitol.",
    "url": "https://apnews.com/article/david-dempsey-capitol-riot-prison-sentence-d724e95dd3a39951deae482fa3ec4ff5"
  },
  {
    "text": "New Nevada poll sees Harris with biggest lead over Trump yet  —  The poll also found that Nevada's three Democratic congressional incumbents lead their re-election races.  —  Election 2024 Elections Polls  —  A new poll of likely Nevada voters found Vice President Kamala Harris … ",
    "url": "https://thenevadaindependent.com/article/new-nevada-poll-sees-harris-with-biggest-lead-over-trump-yet"
  },
  {
    "text": "Jack Smith Granted Delay in Trump Election Interference Case  —  EXTRA TIME  —  Special Counsel Jack Smith will have three more weeks to come up with a game plan to prosecute of former President Donald Trump.  —  D.C. Circuit Court Judge Tanya Chutkan has granted Special Counsel Jack Smith's request … ",
    "url": "https://www.thedailybeast.com/jack-smith-granted-delay-in-trump-election-interference-case"
  },
  {
    "text": "Trump Has Started to Piss Off White Supremacists  —  White supremacist, Hitler fan, and far-right political pundit Nick Fuentes shockingly revoked his support from Donald Trump's campaign early Friday, announcing on social media that he and his allies believed that the presidential bid is headed for a “catastrophic loss.”",
    "url": "https://newrepublic.com/post/184729/donald-trump-nick-fuentes-white-supremacists-support"
  },
  {
    "text": "MAGA Turns on Joe Rogan as He Endorses RFK Jr. and Not Trump  —  TWIN FLAME  —  Right-wingers on X are not impressed that the popular podcaster is throwing his weight behind RFK Jr.  —  Podcast host and comedian Joe Rogan told listeners he supports longshot presidential candidate Robert F. Kennedy Jr. on his show Thursday afternoon.",
    "url": "https://www.thedailybeast.com/joe-rogan-endorses-fellow-vaccine-skeptic-robert-f-kennedy-jr-a-week-after-saying-kamala-harris-could-win"
  },
  {
    "text": "State Rep. Devan Seabaugh charged with DUI in collision with cyclist  —  District 34 lawmaker received citations involving alcohol, drugs  —  Georgia Rep. Devan Seabaugh was arrested Thursday night after he hit a cyclist in a bike lane while he was driving in Grant Park, the Georgia State Patrol said.",
    "url": "https://www.ajc.com/news/crime/state-rep-devan-seabaugh-arrested-accused-of-hitting-cyclist/TEUF7ADDO5AOPASIJPWLECGNFY/"
  },
  {
    "text": "Jill Stein recruiting Palestinian Americans for her running mate position  —  The Green Party nominee is looking to exploit Arab and Muslim voters' disaffection with Democrats over the Biden administration's support for Israel amid its war in Gaza.  —  Green Party nominee Jill Stein … ",
    "url": "https://www.nbcnews.com/politics/2024-election/jill-stein-recruiting-palestinian-americans-running-mate-position-rcna165984"
  },
  {
    "text": "GOP nominee to run North Carolina schools advocated pro-Trump military coup in January 6 video  —  Michele Morrow, the Republican nominee to run K-12 public education in North Carolina, filmed a video after attending the January 6 riot at the US Capitol urging then-President Donald Trump to put … ",
    "url": "https://www.cnn.com/2024/08/09/politics/kfile-michele-morrow-january-6-comments/"
  },
  {
    "text": "We Mapped JD Vance's Inner Circle  —  Silicon Valley donors, MAGA allies, and political operatives: The networks behind Trump's VP pick.  —  What happens when Middletown meets Mar-a-Lago?  With JD Vance now on the Republican ticket — and his political operation migrating from Ohio to southern Florida — we're about to find out.",
    "url": "https://www.politico.com/interactives/2024/jd-vance-inner-circle-guide/"
  },
  {
    "text": "George Floyd's brother endorses Harris-Walz, says Minnesota governor is ‘built for this’  —  Philonise Floyd described Walz, who was governor when his brother was murdered, as a “family man with a good heart.”  —  Minnesota Gov. Tim Walz was just a year into his first term when in May of 2020 … ",
    "url": "https://www.nbcnews.com/politics/2024-election/george-floyds-brother-endorses-harris-walz-says-minnesota-governor-bui-rcna166023"
  },
  {
    "text": "Walz and legions of ‘dudes’ want to give men permission to vote Democrat  —  When Vice President Harris introduced her running mate, Minnesota Gov. Tim Walz, to the nation this week, she ran through his biography - dad, military member, high school football coach, teacher … ",
    "url": "https://www.npr.org/2024/08/08/g-s1-15974/tim-walz-kamala-harris-men-for-harris-dudes-for-harris"
  }
]