[
  {
    "text": "How to Force Justices Alito and Thomas to Recuse Themselves in the Jan. 6 Cases  —  Many people have gloomily accepted the conventional wisdom that because there is no binding Supreme Court ethics code, there is no way to force Associate Justices Samuel Alito and Clarence Thomas to recuse themselves … ",
    "url": "https://www.nytimes.com/2024/05/29/opinion/alito-thomas-recuse-trump-jan-6.html"
  },
  {
    "text": "Sam Alito believes you — and, perhaps, his colleagues — are stupid  —  Alito defiantly refused to recuse himself from January 6 or Trump-related cases in a letter sent to members of Congress on Wednesday.  —  Justice Sam Alito, who is a problem, went even further on Wednesday than I thought … ",
    "url": "https://www.lawdork.com/p/sam-alito-believes-you-and-perhaps"
  },
  {
    "text": "Experts Question Alito's Failure to Recuse Himself in Flag Controversy  —  Legal ethicists welcomed the fact that the justice gave reasons for staying on two Jan. 6 cases, a break from court tradition.  But they said his rationale was open to criticism.  —  Supreme Court justices seldom give reasons … ",
    "url": "https://www.nytimes.com/2024/05/30/us/politics/alito-flags-recusal.html"
  },
  {
    "text": "Why Trump's team thinks he can survive any verdict  —  The former president's advisers and allies plan to situate any outcome within the same grievance narrative he's been cultivating for years.  —  Donald Trump's pollsters have been tracking the impact of his indictments throughout his first trial and … ",
    "url": "https://www.politico.com/news/2024/05/30/trump-verdict-campaign-spin-00160506"
  },
  {
    "text": "Playbook: Inside Biden's scramble to win back Black voters  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  WHAT DON BEYER IS READING — “FAA investigates after planes almost collide on runway at Reagan National Airport,” by WJLA-TV's JeanneTyler Moodee Lockman",
    "url": "https://www.politico.com/newsletters/playbook/2024/05/30/inside-bidens-scramble-to-win-back-black-voters-00160576"
  },
  {
    "text": "Trump, Biden and 2024 campaign aides anxiously await New York hush money verdict  —  NEW YORK CITY - Former President Donald Trump and his legal team aren't the only ones waiting anxiously for a jury verdict.  —  There are also the political campaigns of both Trump and his 2024 general election rival, President Joe Biden.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/05/30/trump-trial-biden-campaign-strategy-post-verdict/73893055007/"
  },
  {
    "text": "Biden not banking on a Trump conviction to win … - Despite everything — weeks of embarrassing trial headlines for Trump, Biden's big swing state push and his onslaught of ads — the race appears to be stuck, with Trump holding a slight lead in most polls.",
    "url": "https://www.axios.com/2024/05/30/biden-trump-trial-conviction-election-2024-polls"
  },
  {
    "text": "Judge defends right to teach Beyoncé, strikes down law restricting lessons on race and gender  —  In September 2020, in the midst of a panic about Critical Race Theory (CRT) infiltrating the government and schools, former President Donald Trump issued an executive order.",
    "url": "https://popular.info/p/judge-defends-right-to-teach-beyonce"
  },
  {
    "text": "SCOTUS's farcical endorsement of gerrymandering  —  The right-wing majority turned back the clock on efforts to address racial inequality. … Perhaps because he's been busy lying about his wife's visible support for an insurrection, Justice Samuel Alito can't seem to make time to do his job properly.",
    "url": "https://www.publicnotice.co/p/scotus-gerrymandering-south-carolina-alexander"
  },
  {
    "text": "Inside Donald Trump and Elon Musk's Growing Alliance  —  Donald Trump is weighing an advisory role for the Tesla leader in the event the former president reclaims the White House",
    "url": "https://www.wsj.com/politics/donald-trump-elon-musk-alliance-d1fe43e3"
  },
  {
    "text": "Florida sticks by social studies standard teaching ‘benefit’ of slavery  —  The updated standards include new required instruction surrounding the Sept. 11 attacks and the history of Asian Americans and Pacific Islanders, as well as several other more subtle changes.",
    "url": "https://www.politico.com/news/2024/05/29/florida-education-aapi-slavery-00160431"
  },
  {
    "text": "Indonesia court revises regional election rules, amid talk president's son may seek run  —  Indonesia's Supreme Court has approved regulatory changes on the age of candidates in regional elections, the court said on Thursday, amid speculation the president's 29-year-old son is seeking to run in upcoming Jakarta elections.",
    "url": "https://www.reuters.com/world/asia-pacific/indonesia-court-revises-regional-election-rules-amid-talk-presidents-son-may-2024-05-30/"
  },
  {
    "text": "Pro-McCormick Super PAC Plans $30 Million Ad Blitz in Pennsylvania  —  Senator Bob Casey's re-election campaign and the campaign arm of Senate Democrats have so far spent the most in a race that could determine control of the closely divided chamber.  —  The main super PAC supporting David McCormick … ",
    "url": "https://www.nytimes.com/2024/05/30/us/politics/mccormick-casey-pennsylvania.html"
  },
  {
    "text": "South Africa in Uncharted Waters With ANC Set to Share Power  — Ruling party projected to win about 42% of national vote  — ANC seen losing majority for first time since end of apartheid  —  South Africa Election: ANC Looks Set to Lose Majority  —  South Africa's ruling party looks set … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-30/south-africa-s-anc-projected-to-lose-its-majority-model-shows"
  },
  {
    "text": "The 2024 Election Won't Be Up To the Same Voters Who Chose Biden  —  It may be a presidential rematch, but it's not the same electorate as in 2020  —  The 2024 presidential election will be the first rematch in decades.  But the US electorate that's going to vote in November has changed … ",
    "url": "https://www.bloomberg.com/graphics/2024-new-eligible-voters-will-decide-trump-biden-rematch/"
  },
  {
    "text": "Fourteen Hong Kong democrats found guilty in landmark subversion trial  —  Fourteen Hong Kong pro-democracy activists were found guilty and two were acquitted on Thursday in a landmark subversion trial that critics say could deal another blow to the city's rule of law and its reputation as a global financial hub.",
    "url": "https://www.reuters.com/world/china/hong-kong-democrats-brace-landmark-subversion-trial-verdicts-2024-05-30/"
  },
  {
    "text": "Once a Sheriff's Deputy in Florida, Now a Source of Disinformation From Russia  —  In 2016, Russia used an army of trolls to interfere in the U.S. presidential election.  This year, an American given asylum in Moscow may be accomplishing much the same thing all by himself.",
    "url": "https://www.nytimes.com/2024/05/29/business/mark-dougan-russia-disinformation.html"
  },
  {
    "text": "Spain approves Catalan amnesty bill set to define PM's term  —  Spain's Congress on Thursday overturned an upper house veto with its final approval of a disputed amnesty for Catalan separatists that is expected to set the stage for Prime Minister Pedro Sanchez's second term and allow the return of an exiled pro-independence leader.",
    "url": "https://www.reuters.com/world/europe/spain-approves-catalan-amnesty-bill-set-define-pms-term-2024-05-30/"
  },
  {
    "text": "Texas GOP Platform Endorses Death Penalty for Abortion Patients  —  We need to talk about Plank 35 in the Texas GOP platform.  Because while there's been lots of coverage about how extremist the state's Republican convention was, people seem to have missed the fact that delegates adopted … ",
    "url": "https://jessica.substack.com/p/texas-gop-platform-endorses-death"
  },
  {
    "text": "RFK Jr. files complaint with Federal Election Commission over CNN debate criteria  —  Robert F. Kennedy Jr.'s campaign filed a complaint with the Federal Election Commission on Tuesday alleging President Joe Biden's campaign, former President Donald Trump's campaign and CNN violated federal campaign laws … ",
    "url": "https://www.cnn.com/2024/05/29/politics/rfk-jr-fec-complaint-cnn-debate/"
  },
  {
    "text": "ACLU of Louisiana Denounces Governor Jeff Landry's Signing of Bill Restricting Public Observation of Police  —  NEW ORLEANS—Alanah Odoms, Executive Director of the ACLU of Louisiana, has released the following statement in response to Governor Jeff Landry's signing of HB 173.",
    "url": "https://www.laaclu.org/en/press-releases/aclu-louisiana-denounces-governor-jeff-landrys-signing-bill-restricting-public"
  }
]