[
  {
    "text": "Israel Knew Hamas's Attack Plan More Than a Year Ago  —  A blueprint reviewed by The Times laid out the attack in detail.  Israeli officials dismissed it as aspirational and ignored specific warnings.  —  Israeli officials obtained Hamas's battle plan for the Oct. 7 terrorist attack … ",
    "url": "https://www.nytimes.com/2023/11/30/world/middleeast/israel-hamas-attack-intelligence.html"
  },
  {
    "text": "Trump can be held civilly liable in Jan. 6 riot, judges rule  —  Donald Trump can be held civilly liable for the actions of the mob that attacked the U.S. Capitol on Jan. 6, 2021, an appeals court ruled Friday in a long-awaited decision that could clear the way for lawsuits seeking financial damages from the former president.",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/12/01/trump-can-be-sued-jan-6-immunity/"
  },
  {
    "text": "Trump's campaign thinks it's getting a surprise assist from Dean Phillips  —  Joe Biden's primary opponent is make the ex-president's electability argument for him.  —  Donald Trump's campaign believes it's getting a welcome boost from an unexpected source.",
    "url": "https://www.politico.com/news/2023/12/01/trump-surprise-assist-dean-phillips-00129427"
  },
  {
    "text": "Trump is stepping up his advertising in Iowa, where governor has backed DeSantis  —  The ad buy marks one of the first times his campaign will go up on TV.  —  Republican presidential candidate former President Donald Trump looks on during a campaign rally at Trendsetter Engineering Inc., Nov. 2, 2023, in Houston.",
    "url": "https://abcnews.go.com/Politics/trump-stepping-advertising-iowa-governor-backed-desantis/story?id=105297530"
  },
  {
    "text": "Biden Wants to Abolish the Fees Trump Charges at His Resorts  —  In going after Donald Trump's business practices, Joe Biden is combining a hit on his opponent with a boost of his own economic record. … Biden resorts to a fresh Trump attack  —  Ahead of the 2024 election … ",
    "url": "https://www.thedailybeast.com/joe-biden-wants-to-abolish-the-fees-donald-trump-charges-at-his-resorts"
  },
  {
    "text": "Florida GOP Chair Christian Ziegler, husband of Moms For Liberty cofounder, accused of sexual assault by alleged menage a trois lover  —  Christian Ziegler, Florida's GOP chairman and husband of Sarasota County School Board member and Moms of Liberty co-founder Bridget Ziegler … ",
    "url": "https://flcga.org/florida-gop-chair-christian-ziegler-husband-of-a-moms-for-liberty-cofounder-accused-of-battery-by-alleged-menage-a-trois-lover/"
  },
  {
    "text": "Rep. George Santos may be expelled from the House — what happens next?  —  Two-thirds of the House would need to vote to remove Santos from Congress and make him the sixth House member in history to be expelled by his colleagues.  —  WASHINGTON — The House will vote Friday on whether to expel Rep. George Santos from Congress.",
    "url": "https://www.nbcnews.com/politics/congress/george-santos-expelled-house-what-happens-how-rcna127518"
  },
  {
    "text": "Steve Scalise reveals what's really happened since McCarthy's fall  —  The House Majority Leader illuminates what happened behind closed doors after Kevin McCarthy's ousting as well as what to expect next on impeachment; why he will vote against expelling George Santos; and how Speaker Mike Johnson … ",
    "url": "https://www.politico.com/news/2023/12/01/steve-scalise-house-majority-00129239"
  },
  {
    "text": "Sandra Day O'Connor, the first female Supreme Court justice, dead at 93  —  From the early 1990s until her retirement in 2005, she was the indisputable swing justice  —  Sandra Day O'Connor, the first woman to serve on the Supreme Court and the justice who held the court's center for more than a generation … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/sandra-day-oconnor-dead-dies-rcna127589"
  },
  {
    "text": "Sandra Day O'Connor, first woman on Supreme Court, dies at 93  — Former Supreme Court Justice Sandra Day O'Connor has died.  — O'Connor was the first woman to servce on the high court.  —  Sandra Day O'Connor, the first woman to serve as a justice on the U.S. Supreme Court, has died.",
    "url": "https://www.cnbc.com/2023/12/01/sandra-day-oconnor-first-woman-on-supreme-court-dies-at-93.html"
  },
  {
    "text": "Speaker Johnson wrote foreword for book filled with conspiracy theories and homophobic insults  —  Speaker of the House Mike Johnson wrote the foreword and publicly promoted a 2022 book that spread baseless and discredited conspiracy theories and used derogatory homophobic insults.",
    "url": "https://www.cnn.com/2023/12/01/politics/kfile-mike-johnson-conspiracy-theories-homophobic-slurs/"
  },
  {
    "text": "Behind the Curtain — Scoop: The Trump job applications revealed  —  We told you in a “Behind the Curtain” column last month that Trump allies are pre-screening the ideologies of thousands of potential appointees and employees in case he wins back the White House.",
    "url": "https://www.axios.com/2023/12/01/trump-government-job-applications-2025"
  },
  {
    "text": "Former U.S. Marine Pleads Guilty to Firebombing a Planned Parenthood Clinic in Orange County and Admits to Planning Additional Attacks  —  For Immediate Release  —  U.S. Attorney's Office, Central District of California  —  SANTA ANA, California - An Orange County man pleaded guilty today … ",
    "url": "https://www.justice.gov/usao-cdca/pr/former-us-marine-pleads-guilty-firebombing-planned-parenthood-clinic-orange-county-and"
  },
  {
    "text": "Rand Paul performs Heimlich on fellow GOP senator  —  Sen. Joni Ernst of Iowa thanked Sen. Rand Paul in a post on X after the incident.  —  WASHINGTON — Sen. Rand Paul, R-Ky., performed the Heimlich maneuver on Sen. Joni Ernst during a Republican conference lunch at the Capitol on Thursday, according to a tweet by the Iowa senator.",
    "url": "https://www.nbcnews.com/politics/congress/rand-paul-performs-heimlich-fellow-gop-senator-rcna127493"
  },
  {
    "text": "Israel-Gaza war live updates: Airstrikes resume in Gaza as pause in fighting ends 23 minutes ago  —  Here are the hostages released by Hamas and those remaining in Gaza  —  Thin rations, heavy bombing: Israel's hostages start sharing their stories  —  Israel-Gaza war",
    "url": "https://www.washingtonpost.com/world/2023/11/30/israel-hamas-war-news-gaza-hostages-update-palestine/"
  },
  {
    "text": "Playbook: Steve Scalise unpacks the House GOP  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  BREAKING OVERNIGHT — “War resumes in Gaza after truce collapses,” by Reuters' Nidal Al-Mughrabi and Suhaib Salem: “Israeli warplanes resumed pounding Gaza … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/12/01/steve-scalise-unpacks-the-house-gop-00129540"
  },
  {
    "text": "Welcome to Our New ‘Bespoke Realities’  —  I've known conspiracy theorists my entire life.  In fact, there's probably a little bit of conspiracy theorist in each of us, myself included.  (Don't get me started on Game 6 of the 2002 N.B.A. Western Conference Finals.)",
    "url": "https://www.nytimes.com/2023/11/30/opinion/political-reality-algorithms.html"
  },
  {
    "text": "Republican officials consider shaking up presidential debate system  —  The party, which has not yet scheduled a presidential debate after next week's meeting in Alabama, is considering a proposal to allow candidates to debate outside the party system  —  Top officials at the Republican … ",
    "url": "https://www.washingtonpost.com/nation/2023/11/30/republican-debates-rnc-primary/"
  },
  {
    "text": "Why Biden and Harris Merchandise Doesn't Sell  —  Liberals aren't buying political merchandise this season.  —  POLITICO illustration/Photos by Getty Images, AP, iStock  —  You know things are starting to look iffy when you get to the Janet Yellen novelty merch.  —  That's no slight on Yellen.",
    "url": "https://www.politico.com/news/magazine/2023/12/01/why-liberal-merchandise-doesnt-sell-00129355"
  },
  {
    "text": "The Bogus Historians Who Teach Evangelicals They Live in a Theocracy  —  A new book on the Christian right reveals how a series of unscrupulous leaders turned politics into a powerful and lucrative gospel.  —  POLITICO illustration/Photos by AP, Gage Skidmore, iStock",
    "url": "https://www.politico.com/news/magazine/2023/12/01/evangelicals-american-politics-tim-alberta-book-excerpt-00129319"
  }
]