[
  {
    "text": "Republicans advance a government funding bill despite Democratic opposition  —  House Republicans passed a critical test of their unity Tuesday on legislation to avoid a partial government shutdown, teeing up a final vote in the afternoon for a measure that keeps federal agencies funded through September.",
    "url": "https://apnews.com/article/congress-budget-funding-government-shutdown-e027a644af4152377b8cf99f6a91102f"
  },
  {
    "text": "“Have You No Decency?”:  Republican Calls Sarah McBride “Mister,” Dems Erupt And End Hearing  —  During a meeting of the House Foreign Affairs Committee, a Republican representative, Rep. Keith Self, called transgender congresswoman the “gentleman from Delaware.”  Dems pushed back.",
    "url": "https://www.erininthemorning.com/p/have-you-no-decency-republican-calls"
  },
  {
    "text": "Johnson's spending holdouts  —  Presented by IN TODAY'S EDITION:  — Johnson, White House hammer holdouts  — Thune taps a debt-limit whisperer  — More tax complications on GOP agenda  —  EAT LIKE A LAWMAKER — POLITICO Magazine is out this morning with a rundown of where Republicans … ",
    "url": "https://www.politico.com/newsletters/inside-congress/2025/03/11/johnsons-spending-holdouts-00223195"
  },
  {
    "text": "Vance gives hard sell for spending patch to House Republicans  —  Vice President JD Vance told House Republicans hours ahead of an expected vote on a seven-month funding patch on Tuesday that Republicans will take the blame for a government shutdown if they don't pass the legislation … ",
    "url": "https://www.politico.com/live-updates/2025/03/11/congress/jd-vance-house-gop-shutdown-stopgap-00223400"
  },
  {
    "text": "Education Department Fires 1,300 Workers, Gutting Its Staff  —  The layoffs mean that the department will now have a work force of about half the size it did when President Trump took office.  —  The Education Department announced on Tuesday that it was firing more than 1,300 workers … ",
    "url": "https://www.nytimes.com/2025/03/11/us/politics/trump-education-department-firings.html?unlocked_article_code=1.3E4.iXQq.0RGSfsfI4Mwh&smid=url-share"
  },
  {
    "text": "U.S. Department of Education Initiates Reduction in Force  —  As part of the Department of Education's final mission, the Department today initiated a reduction in force (RIF) impacting nearly 50% of the Department's workforce.  Impacted Department staff will be placed on administrative leave beginning Friday, March 21st.",
    "url": "https://www.ed.gov/about/news/press-release/us-department-of-education-initiates-reduction-force"
  },
  {
    "text": "Department of Education staff told offices will be closed Wednesday  —  Washington — Staff at the Department of Education received a notice Tuesday instructing them to leave the building by 6 p.m. local time and informing them that all department offices in Washington, D.C. … ",
    "url": "https://www.cbsnews.com/news/education-department-staff-offices-closed/"
  },
  {
    "text": "Education Department cutting nearly half of workforce  —  The US Education Department announced Tuesday it is cutting nearly 50% of its workforce, according to senior agency officials, as President Donald Trump has proposed eliminating the agency altogether.",
    "url": "https://www.cnn.com/2025/03/11/politics/department-of-education-cuts/"
  },
  {
    "text": "Ontario suspending 25% surcharge on provincially generated electricity purchased by U.S. states  —  Move comes after Trump threatened Ontario ‘will pay a financial price’ for levy  —  Ontario is suspending its promise to add a 25 per cent surcharge on exports of electricity to some U.S. states … ",
    "url": "https://www.cbc.ca/news/canada/toronto/trump-ford-ontario-electricity-tariffs-trade-war-1.7480234"
  },
  {
    "text": "Trump trade war confounds CEOs, deepening economic unease  —  Trump addressed business leaders Tuesday as stock markets continue sliding over concerns about his tariff policies.  —  just now  —  President Donald Trump faced more than 100 top business leaders Tuesday … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/11/trump-tariffs-stock-market-uncertainty/"
  },
  {
    "text": "Musk Seeks to Put $100 Million Directly Into Trump Political Operation  —  Elon Musk has signaled he wants to make some donations not just to his own super PAC, which is called America PAC and has spent heavily on President Trump in the past, but to an outside entity.",
    "url": "https://www.nytimes.com/2025/03/11/us/politics/elon-musk-trump-donation.html"
  },
  {
    "text": "USAID employees told to burn or shred classified documents  —  An organization representing foreign service workers said it was “alarmed” by the directive because there could be documents “relevant to ongoing litigation.”  —  WASHINGTON — The U.S. Agency for International Development … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/usaid-employees-told-burn-shred-classified-documents-rcna195853"
  },
  {
    "text": "What Really Happened With the DDoS Attacks That Took Down X  —  Elon Musk said a “massive cyberattack” disrupted X on Monday and pointed to “IP addresses originating in the Ukraine area” as the source of the attack.  Security experts say that's not how it works.",
    "url": "https://www.wired.com/story/x-ddos-attack-march-2025/"
  },
  {
    "text": "Ukraine willing to accept 30-day ceasefire with Russia as U.S. lifts freeze on aid and intelligence  —  Jeddah, Saudi Arabia — The U.S. and Ukraine said Kyiv would accept a 30-day ceasefire with Russia after talks in Saudi Arabia on Tuesday, with Washington pledging to immediately lift … ",
    "url": "https://www.cbsnews.com/news/ukraine-ceasefire-russia-us-talks-saudi-arabia/"
  },
  {
    "text": "Marco Rubio Personally Signed Off to Detain Mahmoud Khalil on ‘Foreign Policy Grounds,’ Sources Confirm  —  Marco Rubio personally signed off on the arrest of Palestinian Columbia University student protest negotiator Mahmoud Khalil, using a narrow, little-used authority given to the secretary of state … ",
    "url": "https://zeteo.com/p/marco-rubio-personally-signed-off"
  },
  {
    "text": "Remembering Kevin Drum  —  My friend and colleague, who died this month, was not only a pioneer blogger but also a journalist who should have won the Pulitzer Prize.  —  One day in early 2004, I called my senior editor at the Washington Monthly, Josh Marshall, with a proposition … ",
    "url": "https://washingtonmonthly.com/2025/03/11/remembering-kevin-drum/"
  },
  {
    "text": "USDA halts more than $100M in funding for University of Maine System programs  —  The move temporarily pauses USDA funding for Maine's university system after President Donald Trump threatened to cut off the state over Maine's decision to allow transgender athletes to compete in sports.",
    "url": "https://www.pressherald.com/2025/03/11/usda-halts-funding-for-all-university-of-maine-programs/?link-source=announcement-bar"
  },
  {
    "text": "Johns Hopkins Plans Staff Layoffs After $800 Million Grant Cuts  —  Local and international health research efforts are already winding down as the university braces for even more potential cuts  —  The Trump administration has terminated $800 million in grants to Johns Hopkins University … ",
    "url": "https://www.wsj.com/health/healthcare/johns-hopkins-federal-funding-foreign-aid-cut-ca841d31?st=jycPj9&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump official tasked with defending DOGE cuts posted fashion influencer videos from her office  —  As the Office of Personnel Management oversaw the layoffs of thousands of federal workers and pressed others to justify their positions, the agency's chief spokesperson repeatedly used her office … ",
    "url": "https://www.cnn.com/2025/03/11/politics/opm-spokesperson-fashion-influencer-videos-invs/"
  },
  {
    "text": "Elon Musk Has Wanted the Government Shutdown  —  Sources tell WIRED that Elon Musk has wanted a government shutdown in part because it would potentially make it easier to eliminate the jobs of hundreds of thousands of federal workers.  —  As President Donald Trump has been trying … ",
    "url": "https://www.wired.com/story/elon-musk-has-wanted-the-government-shut-down/"
  },
  {
    "text": "His Daughter Was America's First Measles Death in a Decade  —  A visit with a family in mourning  —  Peter greeted me in the mostly empty gravel parking lot of a Mennonite church on the outskirts of Seminole, a small city in West Texas surrounded by cotton and peanut fields.",
    "url": "https://www.theatlantic.com/health/archive/2025/03/texas-measles-outbreak-death-family/681985/?gift=HoRfrgrF5SCKopc-hfobxEUvk03OSejCTaTqLCgRjL8&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "‘Big one to eliminate’: Elon Musk spotlights cost of federal entitlements amid fear of cuts to programs  —  Elon Musk on Monday highlighted the cost of federal spending on entitlement programs, the latest sign of the tech billionaire and presidential adviser's focus to downsize … ",
    "url": "https://www.cnn.com/2025/03/11/politics/musk-federal-entitlements-costs/"
  },
  {
    "text": "What lies behind the dramatic shift in markets  —  The sudden change in investors' growth expectations for the three largest economies is upending many consensus trades  —  The writer is president of Queens' College, Cambridge, and an adviser to Allianz and Gramercy",
    "url": "https://www.ft.com/content/7568e76f-3455-4ca3-b901-79f411ce7e11"
  },
  {
    "text": "Trump's Latest Weapon Against Critics: Destroying Their Lawyers  —  from the first-they-came-for-the-lawyers dept  —  When a president uses executive power to not just blacklist but effectively destroy a major law firm, solely for representing political opponents, it means he's given … ",
    "url": "https://www.techdirt.com/2025/03/11/trumps-latest-weapon-against-critics-destroying-their-lawyers/"
  }
]