[
  {
    "text": "Tim Walz's normal dad energy is causing MAGA to come unglued  —  Walz is the opposite of weird: Kamala Harris' running mate shows masculinity can be about love and not hate  —  In their first go-round in attacking Gov. Tim Walz, the Donald Trump campaign bet that maximum hyperbole … ",
    "url": "https://www.salon.com/2024/08/08/tim-walzs-normal-energy-is-causing-maga-to-come-unglued/"
  },
  {
    "text": "Why Harris isn't taking questions  —  Welcome to POLITICO's West Wing Playbook, your guide to the people and power centers in the Biden administration.  —  There is a line in the movie “Bull Durham” where CRASH DAVIS, the sage journeyman catcher played by KEVIN COSTNER, tells “NUKE” LaLOOSH … ",
    "url": "https://www.politico.com/newsletters/west-wing-playbook/2024/08/07/why-harris-isnt-taking-questions-00173115"
  },
  {
    "text": "Tim Walz's military record, National Guard departure get new scrutiny  —  The Harris-Walz campaign has cited his Army experience as an asset.  But Republicans and some who served with him have questioned claims about his service.  —  Tim Walz was weighing a life-altering decision when he stepped … ",
    "url": "https://www.washingtonpost.com/elections/2024/08/07/tim-walz-military-record/"
  },
  {
    "text": "Harris's Rise Has Unsettled Trump, Who Is Struggling to Focus, Supporters Say  —  Donald J. Trump's allies want him to talk about the issues, but he seems distracted by Kamala Harris's burst of momentum.  —  Former President Donald J. Trump dialed into “Fox & Friends” on Wednesday morning … ",
    "url": "https://www.nytimes.com/2024/08/08/us/politics/trump-harris-campaign.html"
  },
  {
    "text": "RFK Jr. and the third-party effect are now hurting Trump  —  The dynamic has shifted with Kamala Harris atop the Democratic ticket.  And Robert F. Kennedy Jr. — once elevated by Trump allies — is looking more like a significant liability for the GOP nominee.",
    "url": "https://www.washingtonpost.com/politics/2024/08/08/rfk-jr-third-party-effect-are-now-hurting-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzMDg5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI0NDcxOTk5LCJpYXQiOjE3MjMwODk2MDAsImp0aSI6ImU0ZDRjYTBkLTJiODAtNDU4Ni1hZjI5LTc5NDAwMTFiYjM0OCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzA4L3Jmay1qci10aGlyZC1wYXJ0eS1lZmZlY3QtYXJlLW5vdy1odXJ0aW5nLXRydW1wLyJ9.0YdhLfkfKPWnotmkxkG6nhB8ipcUZuK0YtCGtk4F_GA&itid=gfta"
  },
  {
    "text": "Trump says he wants to face Harris in 3 debates in September  —  At a press conference Thursday, the former president said he's accepted invitations from NBC News, Fox News and ABC News.  —  Former President Donald Trump on Thursday said he would be open to debating Vice President Kamala Harris three times in September.",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-says-wants-face-harris-3-debates-september-rcna165840"
  },
  {
    "text": "Trump isn't campaigning as hard as he used to  —  In 2016 and even 2020, Trump kept up a brisk pace of events in the summer.  This year, he hasn't.  —  Donald Trump has always been fixated on crowd size, to the point that it's one of the defining features of his approach to politics.",
    "url": "https://www.washingtonpost.com/politics/2024/08/08/trump-isnt-campaigning-hard-he-used/"
  },
  {
    "text": "New Marquette Law School Poll national survey finds Harris leading Trump and outperforming Biden against Trump; enthusiasm to vote among Democrats having risen substantially  —  MILWAUKEE - A new Marquette Law School Poll national survey finds Vice President Kamala Harris is the choice … ",
    "url": "https://law.marquette.edu/poll/2024/08/07/mlspsc21-release/"
  },
  {
    "text": "Get Ready Now: Republicans Will Refuse to Certify a Harris Win  —  Some darkness in honor of JVL.  It's important stuff.  —A.B. Stoddard  —  1. Trump's Not Taking the L. . .  The last two weeks—the unveiling of the Harris-Walz ticket, and Kamala Harris's surge in the polls—feels like some surreal dream state.",
    "url": "https://www.thebulwark.com/p/republicans-will-refuse-certify-harris-election"
  },
  {
    "text": "Democrats Take Early ‘Top of the Ticket’ Lead Following Arizona's Primary Election  —  You are here: - Home - Democrats Take Early 'Top of...  Harris holds slim lead over Trump within the margin while Gallego leads Lake by 11 in Arizona  —  Contact: Paul Bentz, 602-528-3684",
    "url": "https://azhighground.com/democrats-take-early-top-of-the-ticket-lead-following-arizonas-primary-election/"
  },
  {
    "text": "Presidential Campaign Reset: Arizona, Georgia and Nevada Move From Lean Republican to Toss Up  —  Three weeks ago, Donald Trump was leading President Joe Biden in the Cook Political Report national vote tracker by about 2.5%.  Today, Kamala Harris leads Trump by less than one point … ",
    "url": "https://www.cookpolitical.com/analysis/national/national-politics/presidential-campaign-reset-arizona-georgia-and-nevada-move"
  },
  {
    "text": "Elon Musk's X Sued an Advertising Coalition.  Now It's Shutting Down.  —  The Global Alliance for Responsible Media will dissolve after Mr. Musk accused the group of orchestrating a boycott.  —  An influential advertising industry group said it would shut down after being sued this week by X … ",
    "url": "https://www.nytimes.com/2024/08/08/technology/elon-musk-x-advertisers-boycott.html?unlocked_article_code=1.BU4.rEt4.gqvdfhrYvbQ6&smid=url-share"
  },
  {
    "text": "The Global Alliance for Responsible Media is ‘discontinuing’ after Elon Musk's X filed an antitrust lawsuit against it  — The World Federation of Advertisers is ‘discontinuing’ the activities of the Global Alliance for Responsible Media.  — The decision follows an antitrust lawsuit filed … ",
    "url": "https://www.businessinsider.com/ad-group-to-suspend-garm-initiative-following-elon-musk-lawsuit-2024-8"
  },
  {
    "text": "Nancy Pelosi's Art of Power  —  The former Speaker discusses how she hastened Joe Biden's decision to drop out, her new memoir, and not getting “doggy doo-doo on your shoe.”  —  Nancy Pelosi likes to say that she went from “housewife to House member to House Speaker.”",
    "url": "https://www.newyorker.com/news/daily-comment/nancy-pelosis-art-of-power"
  },
  {
    "text": "What the Jeffrey Epstein Documents Reveal About Donald Trump  —  Speculation about which famous and powerful figures would be tarnished by the Jeffrey Epstein scandal heated up at the end of last year when a judge ordered that court documents from a years-old case related to the disgraced financier be made public.",
    "url": "https://nymag.com/intelligencer/article/epstein-documents-trump.html"
  },
  {
    "text": "A daily compendium of helpful reporting and commentary surrounding the pivotal 2024 elections in the United States.  You won't find horse race coverage here, or the standard “both sides” BS that passes so often for political journalism.  What you will find are links, with brief commentary … ",
    "url": "https://cornerstone.ghost.io/essentials-august-7-2024/"
  },
  {
    "text": "Taylor Swift terrorist threat suspect confessed he intended to kill fans: Officials  —  The suspect accused of plotting a terrorist attack at Taylor Swift's concerts in Vienna confessed that he intended to kill himself and a crowd on Thursday or Friday, according to officials.",
    "url": "https://www.usatoday.com/story/entertainment/music/2024/08/08/taylor-swift-vienna-concert-terrorist-plot/74717447007/"
  },
  {
    "text": "Elon Musk shares fake news claiming UK rioters will be sent to ‘detainment camps’  —  LONDON — Elon Musk is at it again.  —  Amid an ongoing feud with the British government about unrest on the country's streets, the billionaire X owner boosted, and then deleted, an entirely-manufactured … ",
    "url": "https://www.politico.eu/article/elon-musk-share-fake-news-uk-rioters-detainment-camp/"
  }
]