[
  {
    "text": "Conservatives in furor over Julia Roberts ad  —  A new Harris-Walz campaign ad voiced by actor Julia Roberts encourages women to vote for Vice President Harris in the presidential election, even if their husbands are backing former President Trump.  —  The Roberts ad also alludes to abortion rights … ",
    "url": "https://thehill.com/homenews/campaign/4964265-kamala-harris-ad-julia-roberts/"
  },
  {
    "text": "“It is so disastrous”: MAGA men are freaking out that wives may be secretly voting for Kamala Harris  —  “That's the same thing as having an affair,” Fox News host argues as women fuel early vote in key states  —  When you're a star, Donald Trump has said more than once, women will let you do whatever you want to them.",
    "url": "https://www.salon.com/2024/10/31/it-is-so-disastrous-maga-men-are-freaking-out-that-wives-may-be-secretly-voting-for-kamala-harris/"
  },
  {
    "text": "Trump lagging in early vote with seniors in Pennsylvania, a red flag for GOP  —  Democrats account for about 58 percent of the votes cast by seniors so far in Pennsylvania.  —  Donald Trump is lagging Kamala Harris in Pennsylvania early voting with a critical and once-reliably Republican constituency: seniors.",
    "url": "https://www.politico.com/news/2024/10/31/trump-lagging-early-votes-seniors-pennsylvania-00186612"
  },
  {
    "text": "MAGA Bros Are Freaking Out Because So Many Women Are Voting  —  'IT'S OVER'  —  “Unless this changes, Kamala Harris takes PA and it's over,” tweeted right wing gadfly Mike Cernovich.  —  Two of former president Donald Trump's most prominent backers in the right wing influencer sphere fretted Wednesday … ",
    "url": "https://www.thedailybeast.com/maga-bros-are-freaking-out-because-so-many-women-are-voting/"
  },
  {
    "text": "Trump picks one-judge Texas court for lawsuit over CBS Harris interview  —  A spokesperson for CBS News called the lawsuit “completely without merit” and said “60 Minutes” fairly presented the interview of Kamala Harris.  —  Republican nominee Donald Trump sued CBS News on Thursday … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/31/trump-sues-60-minutes-cbs-kamala-harris/"
  },
  {
    "text": "Trump sues CBS for $10B over Harris's ‘60 Minutes’ interview  —  Former President Trump is suing CBS News over a “60 Minutes” interview it broadcast with Vice President Harris earlier this month that he and his allies have claimed was edited to cast her in a positive light.",
    "url": "https://thehill.com/homenews/media/4964816-trump-sues-cbs-news-60-minutes/"
  },
  {
    "text": "Why I'm Voting for Kamala Harris  —  When it comes to the candidates' policy positions and personal integrity, there's a clear choice. … I do not agree with Vice President Kamala Harris on every issue, but earlier this week, I voted for her without hesitation.",
    "url": "https://www.bloomberg.com/opinion/articles/2024-10-31/michael-bloomberg-why-i-m-voting-for-kamala-harris?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczMDM5NTE5MCwiZXhwIjoxNzMwOTk5OTkwLCJhcnRpY2xlSWQiOiJTTThBT0ZEV1gyUFMwMCIsImJjb25uZWN0SWQiOiIyQjUzMzlCNDU0MUM0NkZGOEJGRkVGOEQzNUM3RjAyOCJ9.AVkgjFyIF0zMUucberOGYD4aGf8IIntjrTC0HhwR9q0"
  },
  {
    "text": "AP sources: White House altered record of Biden's ‘garbage’ remarks despite stenographer concerns  —  White House press officials altered the official transcript of a call in which President Joe Biden appeared to take a swipe at supporters of Donald Trump, drawing objections from the federal workers … ",
    "url": "https://apnews.com/article/biden-garbage-transcript-puerto-rico-trump-326e2f516a94a470a423011a946b6252"
  },
  {
    "text": "Video of Donald Trump ‘Struggling’ to Enter Garbage Truck Goes Viral  —  Social media commentators have raised concerns over  —  's health after footage emerged of the  —  presidential candidate climbing into a campaign-branded garbage truck.  —  In Wisconsin on Wednesday, Trump was",
    "url": "https://www.newsweek.com/video-donald-trump-struggling-enter-garbage-truck-goes-viral-1977750"
  },
  {
    "text": "Trump's ‘grab them’ comment was history.  Now TikTok is showing it to young voters.  —  As the audio clip circulates on the popular video app, Gen Z users are expressing their shock.  —  It's been eight years since leaked audio from a conversation between Donald Trump and TV host Billy Bush … ",
    "url": "https://www.washingtonpost.com/technology/2024/10/31/tiktok-trump-access-hollywood-gen-z/"
  },
  {
    "text": "Scoop: What Trump is being told … The memo, addressed to “TEAM TRUMP,” has the subject line: “PRESIDENT TRUMP IS ON THE VERGE.”  — Fabrizio draws on Real Clear Politics polling averages to argue that Trump's “position nationally and in every single Battleground State is SIGNIFICANTLY better today than it was 4 years ago.”",
    "url": "https://www.axios.com/2024/10/31/trump-2024-election-polls-memo"
  },
  {
    "text": "The stock market's surprising bet on who will win the presidency  —  Voters are clamoring for any hints of clarity about the neck-and-neck presidential race, so some are looking beyond public opinion polls.  —  Wall Street executives, political gamblers and cryptocurrency traders are piling … ",
    "url": "https://www.politico.com/news/2024/10/31/stock-market-betting-kamala-harris-win-00185818"
  },
  {
    "text": "Elon Musk Could Have US Citizenship Revoked If He Lied on Immigration Forms  —  The richest man in the world appears to have worked in the US without authorization.  According to experts, if he did so and lied about it as part of the immigration process, he could be denaturalized.",
    "url": "https://www.wired.com/story/elon-musk-citizenship-revoked-denaturalized/"
  },
  {
    "text": "A Brief History of Trump's Violent Remarks  —  Here are 40 instances in which the former president incited or praised violence against his fellow citizens.  —  After the second attempt on his life, Donald Trump accused his political opponents of inspiring the attacks against him with their rhetoric.",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/trump-violent-rhetoric-timeline/680403/?gift=mBLCHcnsd_Gd3EecvWSKTRHJyRSh4e6cpG5nsanEcr0&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Vance suggests upper- and middle-class kids ‘become trans’ for college admissions, says Trump may earn ‘normal gay guy vote’  —  Republican vice presidential candidate JD Vance suggested in an interview with podcast host Joe Rogan that aired Thursday that White upper- and middle-class children … ",
    "url": "https://www.cnn.com/2024/10/31/politics/vance-transgender-college-admissions/"
  },
  {
    "text": "She Saw Jan. 6 Coming.  Here's What Worries Her Now.  —  The founder of a private intelligence firm says far-right extremists are ramping up — before the election.  —  Rioters loyal to Donald Trump protest at the Capitol on Jan. 6, 2021.  Rita Katz said the threats in the 2024 election season … ",
    "url": "https://www.politico.com/news/magazine/2024/10/31/rita-katz-january-6-prediction-00186090"
  },
  {
    "text": "Trump transition official says RFK Jr. wants to force vaccines off the market  —  Howard Lutnick, co-chair of the Trump-Vance transition team, said in a Wednesday interview that former presidential candidate Robert F. Kennedy Jr., who is backing former President Trump, is seeking the federal data … ",
    "url": "https://thehill.com/homenews/campaign/4963677-trump-transition-rfk-jr-vaccines-hhs/"
  },
  {
    "text": "5 Days Out I Would Much Rather Be Us Than Them - New 2024 Election Analysis and Video With Tom Bonier  —  Happy Thursday all. 5 days of hard work left until victory.  I ask two things of you today:  — Make sure you have voted.  Voting early helps our campaigns move … ",
    "url": "https://www.hopiumchronicles.com/p/i-would-much-rather-be-us-than-them-aec"
  },
  {
    "text": "Republican women open their firepower on Mark Cuban  —  Top Kamala Harris surrogate Mark Cuban drew a firestorm of criticism from Donald Trump's campaign for saying, “Donald Trump, you never see him around strong, intelligent women ever,” in a Thursday interview on The View.",
    "url": "https://www.politico.com/live-updates/2024/10/31/2024-elections-live-coverage-updates-analysis/mark-cuban-republican-women-00186596"
  },
  {
    "text": "Boeing Dismantles Diversity Team as Pressure Builds on New CEO  — Diversity staff to be re-assigned, vice president departs  — Retrenchment comes amid broader corporate anti-DEI backlash … Staff from Boeing's DEI office will be combined with another human resources team focused … ",
    "url": "https://www.bloomberg.com/news/articles/2024-10-31/boeing-dismantles-diversity-team-as-pressure-builds-on-new-ceo"
  },
  {
    "text": "Donald Trump Is Bored  —  Have you heard that Donald Trump is unraveling?  His use of profanity has become increasingly casual, in rallies that stretch almost twice as long as they did in the past.  His references to Vice President Kamala Harris have gone from dismissive to vicious.",
    "url": "https://www.nytimes.com/2024/10/31/opinion/donald-trump-speech-aging.html"
  }
]