[
  {
    "text": "Donald Trump removed from Maine primary ballot by secretary of state  —  Maine barred Donald Trump from the primary ballot Thursday, making it the second state in the country to block the former president from running again under a part of the Constitution that prevents insurrectionists from holding office.",
    "url": "https://www.washingtonpost.com/politics/2023/12/28/maine-trump-primary-ballot/"
  },
  {
    "text": "Maine Secretary of State Decision in Challenge to Trump Presidential Primary Petitions  —  Secretary of State Shenna Bellows issued the attached decision regarding three challenges brought by Maine voters to the nomination petition of Donald J. Trump, for the Republican primary for the President of the United States.",
    "url": "https://www.maine.gov/sos/news/2023/BellowsDecisionChallengeTrumpPrimaryPetitionsDec2023.html"
  },
  {
    "text": "Maine strips Trump from the ballot, inflaming legal war over his candidacy  —  Activists and voters have filed numerous lawsuits around the country claiming the former president is barred from office under the “insurrection clause.”  —  Maine's top election official ejected former President Donald Trump … ",
    "url": "https://www.politico.com/news/2023/12/28/maine-kicks-trump-off-ballot-under-14th-amendment-00133294"
  },
  {
    "text": "Supreme Court Urged to Move Fast on Trump's Ballot Eligibility  —  The Colorado Republican Party asked the justices to decide its appeal by Super Tuesday.  The voters who won in the Colorado Supreme Court want to move even faster.  —  The Supreme Court was asked on Thursday to fast-track … ",
    "url": "https://www.nytimes.com/2023/12/28/us/trump-ballot-eligibility.html"
  },
  {
    "text": "Elder reacts to states barring Trump from ballot: 'It's going to set the country on fire'  —  Former GOP presidential candidate Larry Elder blasted rulings removing former President Trump from state primary ballots Thursday, predicting the precedent will “set the country on fire.”",
    "url": "https://thehill.com/homenews/campaign/4381053-elder-states-bar-trump-ballot-going-to-set-country-fire/"
  },
  {
    "text": "Exclusive: Recordings, emails show how Trump team flew fake elector ballots to DC in final push to overturn 2020 election  —  Two days before the January 6 insurrection, the Trump campaign's plan to use fake electors to block President-elect Joe Biden from taking office faced a potentially crippling hiccup … ",
    "url": "https://www.cnn.com/2023/12/28/politics/recordings-trump-team-fake-elector-ballots/"
  },
  {
    "text": "'She's toast': Republicans of color disappointed by Haley's slavery misstep  —  Among other points of frustration is the sense that the GOP candidates still can't seem to talk about the horrors of slavery.  —  Republicans of color said on Thursday they were dismayed by Nikki Haley's initial refusal … ",
    "url": "https://www.politico.com/news/2023/12/28/republicans-of-color-nikki-haley-civil-war-00133286"
  },
  {
    "text": "Bucks County mom behind conservative school movement charged with assault, giving teens alcohol  —  Chris Ullery Bethany RodgersUSA TODAY NETWORK  —  A former Pennsylvania lieutenant governor candidate and outspoken voice in the conservative “parental rights” school movement has been charged … ",
    "url": "https://www.phillyburbs.com/story/news/politics/2023/12/28/clarice-schillinger-conservative-pa-schools-activist-charged-with-assault-bucks-county-pac-lt-gov/72038859007/"
  },
  {
    "text": "BREAKING: Federal judge upholds Georgia's Republican redistricting plan  —  Democrats unlikely to gain a U.S. House seat under new maps  —  A federal judge upheld Georgia's new political districts that preserve Republican power, ruling Thursday that state legislators “fully complied” … ",
    "url": "https://www.ajc.com/politics/breaking-georgias-republican-redistricting-plan-upheld-by-federal-judge/5YEJGZ25HBC6NPJUOLC54MAWN4/"
  },
  {
    "text": "‘Screams Without Words’: How Hamas Weaponized Sexual Violence on Oct. 7  —  A Times investigation uncovered new details showing a pattern of rape, mutilation and extreme brutality against women in the attacks on Israel.  —  At first, she was known simply as “the woman in the black dress.”",
    "url": "https://www.nytimes.com/2023/12/28/world/middleeast/oct-7-attacks-hamas-israel-sexual-violence.html"
  },
  {
    "text": "Wisconsin university chancellor says he was fired for producing and appearing in porn videos  —  Former University of Wisconsin-La Crosse Chancellor Joe Gow said Thursday that the school's governing board fired him because members were uncomfortable with him and his wife producing and appearing in pornographic videos.",
    "url": "https://apnews.com/article/university-wisconsin-la-crosse-porn-fired-2bcaa8e751be50ebe83f8e1ed1a7cc32"
  },
  {
    "text": "Senators demand Musk correct ‘apparent false and misleading representations’ of Tesla safety  —  Sens. Ed Markey (D-Mass.) and Richard Blumenthal (D-Conn.) went after Elon Musk on Thursday, demanding the Tesla owner correct false statements about the safety of the company's vehicles.",
    "url": "https://thehill.com/business/4380803-senators-demand-musk-correct-apparent-false-misleading-representations-tesla-safety/"
  },
  {
    "text": "Elon Musk's X loses court bid to block California content moderation law  —  US District Judge William Shubb rules that legislation's disclosure rules are not ‘unjustified or unduly burdensome’.  —  Elon Musk's X has lost a bid to block a California law that forces social media companies … ",
    "url": "https://www.aljazeera.com/news/2023/12/29/elon-musks-x-loses-court-bid-to-block-california-content-moderation-law?traffic_source=rss"
  },
  {
    "text": "Biden's Other Formidable Opponent in 2024  —  On October 6, the U.S. Bureau of Labor Statistics released its monthly jobs report for September.  The numbers were extremely positive, with 336,000 jobs added, almost double the forecast.  Most media outlets were reporting the numbers as a sign … ",
    "url": "https://newrepublic.com/article/177560/biden-fox-news-formidable-opponent-2024"
  },
  {
    "text": "DeSantis says he will fire special counsel Jack Smith on ‘day one’  —  Florida Gov. Ron DeSantis (R) said in a Thursday interview that, if elected president, he would fire special counsel Jack Smith, who brought two indictments against former President Trump, on “day one” of his hypothetical term in office.",
    "url": "https://thehill.com/homenews/campaign/4381032-desantis-fire-special-counsel-jack-smith-day-one/"
  },
  {
    "text": "Seattle Supporters Watch Black Lives Matter Garden Leveled After It Was Overrun by Drug Users, Homeless  —  The garden was established by community organizers and demonstrators during the summer of 2020, to memorialize those individuals of color who have been killed with police bullets",
    "url": "https://themessenger.com/news/seattle-black-lives-matter-garden-leveled-homeless-drug-use"
  }
]