[
  {
    "text": "Jordan and the GOP find a new low point in speaker mess  —  There are few things Congress loves more than a short-term solution to a long-term problem — something to help it forestall difficult decisions and paper over divisions in hopes that, at some later date, these problems will magically disappear.",
    "url": "https://www.washingtonpost.com/politics/2023/10/19/jim-jordan-speaker-mchenry-speaker/"
  },
  {
    "text": "House GOP drowning as crisis reaches breaking point  —  It seems that every day without a speaker brings a new release of pent-up anger from Republicans who see no way out of their self-inflicted pain.  —  When Matt Gaetz stepped to the microphones during Thursday's three-hour private House GOP meeting … ",
    "url": "https://www.politico.com/news/2023/10/19/house-gop-speaker-mccarthy-gaetz-00122617"
  },
  {
    "text": "Jim Jordan tries again?  —  Good morning, Early Birds.  If you reading this newsletter hasn't slaked your interest in the speakership race, we encourage you to listen to our colleagues Marianna Sotomayor and Paul Kane break everything down on The Post's fabulous podcast, “Post Reports.”",
    "url": "https://www.washingtonpost.com/politics/2023/10/20/jim-jordan-tries-again/"
  },
  {
    "text": "Christie Challenges Trump: 'You'll Have to Face Me One Way or Another.  Get Ready'  —  Christie says Trump's secret service detail makes it a little more ‘complicated’ for him to face Trump … GOP presidential hopeful and former New Jersey Gov. Chris Christie is telling former President Donald Trump to … ",
    "url": "https://themessenger.com/politics/christie-challenges-trump-youll-have-to-face-me-one-way-or-another-get-ready"
  },
  {
    "text": "Team Trump Never Dreamed Sidney Powell Would Flip on Them  —  She was the ultimate MAGA conspiracy theorist.  Then she got charged with being part of a criminal conspiracy, and her tune started to change  —  Sidney Powell was the wildest of MAGA diehards — someone who swore long past … ",
    "url": "https://www.rollingstone.com/politics/politics-features/team-trump-sidney-powell-flip-rico-fulton-county-1234858576/"
  },
  {
    "text": "Trump co-defendant Kenneth Chesebro rejected plea offer from Georgia prosecutors  —  The Trump campaign adviser turned down the offer last month, a source said.  Sidney Powell, who had been scheduled to stand trial with Chesebro, pleaded guilty on Thursday.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-co-defendant-kenneth-chesebro-rejected-plea-offer-georgia-prosec-rcna121325"
  },
  {
    "text": "Behind the Curtain: Rattled U.S. government fears wars could spread … Never before have we talked to so many top government officials who, in private, are so worried about so many overseas conflicts at once. … But to sound a siren of clinical, clear-eyed realism: U.S. officials … ",
    "url": "https://www.axios.com/2023/10/20/biden-government-war-fears-israel-hamas"
  },
  {
    "text": "Maryland circuit court judge killed in driveway of home, police say  —  Washington County Circuit Court Judge Andrew Wilkinson, 52, was found with apparent gunshot wounds and died at a hospital, authorities said.  —  A Maryland judge was found apparently shot in the driveway of his home Thursday evening and later died, officials say.",
    "url": "https://www.nbcnews.com/news/us-news/maryland-circuit-court-judge-killed-driveway-home-police-say-rcna121366"
  },
  {
    "text": "Maryland judge found shot in driveway of Hagerstown home, dies at hospital: Officials  —  HAGERSTOWN, Md. (7News) — A Washington County judge has died after he was found shot in the driveway of his Hagerstown home Thursday night, according to the Washington County Sheriff's Office (WCSO).",
    "url": "https://wjla.com/news/local/judge-killed-dead-maryland-hagerstown-washington-county-andrew-wilkinson-state-troopers-maryland-police-investigation-shooting-crime-murder-killing"
  },
  {
    "text": "Trump leads Biden, builds support among young voters: poll  —  Former President Trump leads President Biden in a hypothetical 2024 general election matchup by 2 points and is improving his standing among young voters, according to a new poll.  —  An Emerson College poll released Friday showed Trump ahead … ",
    "url": "https://thehill.com/homenews/campaign/4265622-trump-leads-biden-builds-support-among-young-voters-poll/"
  },
  {
    "text": "October 2023 National Poll: Trump Making Inroads with Young Voters Against Biden, Maintains Majority Support in Republican Primary  —  Home Polls October 2023 National Poll: Trump Making Inroads with Young Voters Against Biden, Maintains Majority Support in Republican Primary",
    "url": "https://emersoncollegepolling.com/october-2023-national-poll-trump-making-inroads-with-young-voters-against-biden-maintains-majority-support-in-republican-primary/"
  },
  {
    "text": "Biden tries to make it a foreign policy election  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  HAPPENING TODAY — AP: “Jury selection is set to begin Friday for the first defendant to go to trial in the Georgia case that accuses former President DONALD TRUMP … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/20/biden-tries-to-make-it-a-foreign-policy-election-00122678"
  },
  {
    "text": "Judge Won't Let Alex Jones Use Bankruptcy to Avoid Sandy Hook Damages  —  A Texas court ruling means the Infowars broadcaster must pay most of the $1.4 billion he owes Sandy Hook families, regardless of whether his business survives.  —  The judge in Alex Jones's bankruptcy case ruled … ",
    "url": "https://www.nytimes.com/2023/10/19/us/politics/alex-jones-sandy-hook.html"
  },
  {
    "text": "Elon Musk's X removes the New York Times' verification badge  —  The unexplained decision removes the only symbol distinguishing the news organization from impostors and comes amid a flood of false information related to the Israel-Gaza war, some of which Musk has personally endorsed.",
    "url": "https://www.washingtonpost.com/technology/2023/10/19/x-twitter-nyt-dispute-musk/"
  },
  {
    "text": "The True Story Behind ‘Killers of the Flower Moon’ Is Being Erased From Oklahoma Classrooms  —  During the early 20th century, members of the Osage Nation in Oklahoma were systematically murdered by white settlers.  Yet outside the Osage Nation, the history of this racial injustice … ",
    "url": "https://www.nytimes.com/2023/10/20/opinion/killers-flower-moon-oklahoma-history.html"
  },
  {
    "text": "Dean Phillips has told lawmakers he's running against Joe Biden  —  But one person who talked to the representative said he was still being coy.  —  Rep. Dean Phillips has begun signaling to fellow House members that he plans to launch a challenge to President Joe Biden.",
    "url": "https://www.politico.com/news/2023/10/19/dean-phillips-biden-minnesota-democrat-00122642"
  },
  {
    "text": "Italy PM splits from partner after his sexist TV comments  —  Italian Prime Minister Giorgia Meloni said on Friday she had separated from her television journalist partner Andrea Giambruno, who has drawn criticism in recent weeks for sexist comments made on and off air.",
    "url": "https://www.reuters.com/world/europe/italy-pm-splits-partner-after-his-sexist-tv-comments-2023-10-20/"
  },
  {
    "text": "Rep. Derrick Van Orden leaves D.C. for fact-finding mission in Israel as House remains paralyzed  —  WASHINGTON - With the House paralyzed and Republicans unable to find a path to electing a leader, Wisconsin freshman Rep. Derrick Van Orden left Capitol Hill for Israel Thursday evening … ",
    "url": "https://www.jsonline.com/story/news/politics/2023/10/20/rep-derrick-van-orden-leaves-d-c-for-fact-finding-mission-in-israel/71243868007/"
  },
  {
    "text": "The Inside Story of How Jim Jordan Broke the Model, Didn't Become Speaker and Decided That was Fine  —  There's an aspect of the Jim Jordan Speaker Drama that hasn't gotten enough attention.  It's really the central element of the story.  Over the years I've argued that the post-2010 GOP caucus operates … ",
    "url": "https://talkingpointsmemo.com/edblog/the-inside-story-of-how-jim-jordan-broke-the-model-didnt-become-speaker-and-decided-that-was-fine"
  },
  {
    "text": "White Supremacist Nick Fuentes is Causing Chaos Inside Texas Youth GOP  —  After Fuentes was seen meeting a Texas conservative mega-donor this month, fallout over neo-Nazi sympathies has roiled young Republicans in the state.  —  A simmering civil war among Texas's young Republicans came … ",
    "url": "https://www.thedailybeast.com/white-supremacist-nick-fuentes-is-causing-chaos-inside-texas-youth-gop"
  }
]