[
  {
    "text": "Democrats draw up plans to retaliate if Republicans gerrymander Texas — but they face legal hurdles  —  California is eyeing a ballot initiative this fall to redraw its House map for 2026 — only if Texas Republicans redistrict to gain more seats.  New York Democrats may have to wait until 2028.",
    "url": "https://www.nbcnews.com/politics/2026-election/democrats-plans-redistricting-retaliate-texas-republicans-legal-rcna223128"
  },
  {
    "text": "‘Trumpmandering’ — a nationwide scheme to undermine Black and Hispanic voters  —  In a desperate power grab to preserve Republican control of the U.S. House in the 2026 elections, President Trump is demanding Republican elected officials in Texas and other states redraw congressional district boundaries.",
    "url": "https://thehill.com/opinion/campaign/5436443-trump-abbott-gerrymandering-texas/"
  },
  {
    "text": "RFK Jr. Cancels $500 Million In Funding For Vaccine Development  —  The mRNA vaccines are credited with slowing the 2020 coronavirus pandemic.  —  The Department of Health and Human Services will cancel contracts and pull funding for some vaccines that are being developed to fight respiratory viruses like COVID-19 and the flu.",
    "url": "https://www.huffpost.com/entry/rfk-vaccine-funding-mrna_n_68928569e4b0d3424bc41392"
  },
  {
    "text": "Addressing Threats to The United States by the Government of the Russian Federation  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, including the International Emergency Economic Powers Act (50 U.S.C. 1701 et seq.)",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/08/addressing-threats-to-the-united-states-by-the-government-of-the-russian-federation/"
  },
  {
    "text": "LAWSUIT: FIRE challenges unconstitutional provisions Rubio uses in crusade to deport legal immigrants over protected speech  — The First Amendment trumps the statutes that the government is abusing to deport people for speech alone  — This lawsuit seeks a landmark ruling … ",
    "url": "https://www.thefire.org/news/lawsuit-fire-challenges-unconstitutional-provisions-rubio-uses-crusade-deport-legal-immigrants"
  },
  {
    "text": "Free Speech Group Sues Rubio, Noem for ‘War Against Noncitizens’ Freedom of Speech'  —  The Foundation for Individual Rights and Expression (FIRE), a nonpartisan free speech advocacy nonprofit, has filed a lawsuit against Secretary of State Marco Rubio and Secretary of Homeland Security Kristi Noem over … ",
    "url": "https://www.mediaite.com/lawcrime/free-speech-group-sues-rubio-noem-for-war-against-noncitizens-freedom-of-speech/"
  },
  {
    "text": "Vance expected to host Epstein strategy dinner with Bondi, Blanche, Patel  —  Officials are considering releasing the Ghislaine Maxwell interview transcript.  —  Vice President JD Vance delivers remarks on the “One Big Beautiful Bill Act” at Don's Machine Shop in West Pittston, Penn., on July 16, 2025.",
    "url": "https://abcnews.go.com/Politics/vance-expected-host-epstein-strategy-dinner-bondi-blanche/story?id=124407326"
  },
  {
    "text": "FEMA Employees Reassigned to ICE  —  Probationary employees who had been on paid leave were told to report to ICE within seven days or lose their jobs.  It could signal problems with ICE recruitment.  —  A number of employees with the Federal Emergency Management Agency (FEMA) … ",
    "url": "https://prospect.org/labor/2025-08-06-fema-employees-reassigned-to-ice/"
  },
  {
    "text": "Casualties reported in active shooter incident at U.S. Army base in state of Georgia  —  An active shooter incident at the Fort Stewart U.S. Army base in Georgia has resulted in casualties, authorities said, and the base has been put on lockdown.  —  “The installation was locked down at 11:04 … ",
    "url": "https://www.reuters.com/world/us/casualties-reported-active-shooter-incident-us-army-base-state-georgia-2025-08-06/"
  },
  {
    "text": "Secretary Noem Unveils No Age Limit for Patriotic Americans to Join ICE Law Enforcement to Help Remove Worst of the Worst from U.S.  —  In less than one week since DHS launched its recruitment campaign, more than 80,000 Americans applied to join ICE  —  WASHINGTON — U.S. Department … ",
    "url": "https://www.dhs.gov/news/2025/08/06/secretary-noem-unveils-no-age-limit-patriotic-americans-join-ice-law-enforcement"
  },
  {
    "text": "Senator Marsha Blackburn Will Run for Governor of Tennessee  —  A conservative Trump ally in the Senate, Ms. Blackburn will now try to become the first woman to serve as governor.  —  Senator Marsha Blackburn of Tennessee announced on Wednesday that she would run for governor, less than a year after winning another term in the Senate.",
    "url": "https://www.nytimes.com/2025/08/06/us/politics/marsha-blackburn-governor-tennessee.html"
  },
  {
    "text": "Library of Congress blames “coding error” for missing sections of online Constitution  —  The Library of Congress on Wednesday pointed to an unspecified “coding error” that led to key parts of the U.S. Constitution being deleted from the Constitution Annotated website.",
    "url": "https://www.axios.com/2025/08/06/constitution-missing-sections-coding-error"
  },
  {
    "text": "Trump, Apple to Announce Fresh $100 Billion US Investment  —  President Donald Trump will announce that Apple Inc. will commit to spend another $100 billion on domestic manufacturing, the latest pledge by the tech giant to increase US production of its products as it seeks to avoid punishing tariffs on its flagship iPhones.",
    "url": "https://www.bloomberg.com/news/articles/2025-08-06/trump-apple-to-announce-fresh-100-billion-in-us-manufacturing"
  },
  {
    "text": "Gabbard overrode CIA officials' concerns in push to release classified Russia report  —  CIA officials worried that the release of a House report on 2016 Russian election meddling could reveal top-secret spying techniques and sources, but Director of National Intelligence Tulsi Gabbard authorized … ",
    "url": "https://www.washingtonpost.com/national-security/2025/08/06/gabbard-russia-report-cia-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzU0NDUyODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1ODM1MTk5LCJpYXQiOjE3NTQ0NTI4MDAsImp0aSI6IjRiZDcwZjlkLTY5ZjAtNDA0OC04MTVmLWYzN2EzMjNiM2M3ZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA4LzA2L2dhYmJhcmQtcnVzc2lhLXJlcG9ydC1jaWEtdHJ1bXAvIn0.zThlbluXeljlYmzIFF1M0sI_iGv-x5PudmNVLDbH7LM"
  },
  {
    "text": "Trump Weighs Getting Involved in New York City Mayor's Race  —  The possibility that the president will seek to intercede could inject an element of unpredictability into an already fractious contest.  —  President Trump may have moved out of New York City, but he has privately discussed whether … ",
    "url": "https://www.nytimes.com/2025/08/06/nyregion/trump-nyc-mayor-cuomo-adams-mamdani.html"
  },
  {
    "text": "A new low in bipartisanship: Trump hasn't met with Schumer or Jeffries  —  Presidents traditionally host opposing party leaders early in their term, as Trump did in 2017, but that tradition is now gone.  —  Just now  —  Almost six and a half months into his new term … ",
    "url": "https://www.washingtonpost.com/politics/2025/08/06/schumer-jeffries-no-trump-meeting-government-shutdown/"
  },
  {
    "text": "Trump administration staffer known as ‘Big Balls’ assaulted in DC … President Donald Trump posted a photo on his social media platform showing a shirtless Coristine with what appeared to be blood spattered on his face, body and pants.  He called for a change in the law so that the juveniles … ",
    "url": "https://www.politico.com/news/2025/08/05/trump-administration-staffer-known-as-big-balls-assaulted-in-dc-00494990"
  },
  {
    "text": "Experts Say Florida's Alligator Alcatraz Migrant Camp May Be Illegal  —  A Trump-appointed judge gave officials until Thursday to prove they can legally detain migrants in the Everglades. … Audio By Carbonatix … What the state of Florida is doing in the so-called “Alligator Alcatraz” detention camp is illegal, point blank.",
    "url": "https://www.miaminewtimes.com/news/experts-say-floridas-alligator-alcatraz-migrant-camp-may-be-illegal-23755106"
  },
  {
    "text": "Trump's War on Big Law Means It's Harder to Challenge the Administration  —  Some of America's largest law firms are refusing to take pro bono and paid legal work from groups that seek to hold the government to account on issues like environmental protection, LGBTQ+ rights and police accountability.",
    "url": "https://www.propublica.org/article/trump-law-firms-accountability-environment-police-lgbtq"
  },
  {
    "text": "The Banality of Weasel  —  Yesterday, the president of the United States appeared without explanation on the roof of the White House, walked aimlessly for a bit, shouted back-and-forth with reporters, said some hard-to-interpret things about nuclear weapons, gesticulated oddly, and then left.",
    "url": "https://www.thebulwark.com/p/the-banality-of-weasel-trump-kevin-hassett-economics-jobs-numbers-fired"
  },
  {
    "text": "Allegations surrounding GOP's Cory Mills go from bad to worse  —  House Republican leaders didn't need another controversy surrounding one of their members, but they apparently have one anyway.  —  All things considered, House Republican leaders didn't need another controversy surrounding … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/allegations-surrounding-gops-cory-mills-go-bad-worse-rcna223406"
  },
  {
    "text": "FBI crime report says violent crime decreased by 4.5% in 2024  —  Violent crime is defined as murder and nonnegligent manslaughter, rape, robbery and aggravated assault.  —  Statistics released Tuesday by the FBI indicate that violent crime decreased overall in the United States by 4.5% last year.",
    "url": "https://www.nbcnews.com/news/us-news/fbi-crime-report-says-violent-crime-decreased-45-2024-rcna223201"
  },
  {
    "text": "Glenn Kessler Believes Fact-Checkers Are Getting Easier to Ignore … Last week Glenn Kessler, the longtime writer of the Washington Post's Fact Checker column, announced that he had accepted a buyout, joining dozens of his former colleagues in walking away from the storied institution.",
    "url": "https://www.cjr.org/the-interview/glenn-kessler-interview-fact-checker-easy-ignore-washington-post-trump-lies.php"
  },
  {
    "text": "Trump names himself chair of L.A. Olympics task force, sees role for military during Games  — Trump said he would send the military back to Los Angeles if he so chose in order to protect the Games.  — More concentrated involvement from Trump could spell further strain with Los Angeles city officials.",
    "url": "https://www.latimes.com/politics/story/2025-08-05/trump-l-a-2028-olympics-task-force-billion-dollar-security-effort"
  },
  {
    "text": "Russia's internet crackdown is in a dangerous new phase  —  Criminalising searches is an escalation of repressive state control  —  The writer is a lawyer, co-founder of digital rights organisation RKS Global and CLO of VPN Guild  —  In July, Russian authorities passed laws ushering in a new era of digital repression.",
    "url": "https://www.ft.com/content/8a71052d-d26d-4d71-95d8-c8886ca4fdea"
  },
  {
    "text": "MAGA expectations soar after DOJ orders Russia grand jury probe  —  The MAGA movement has spent the past 10 years demanding the arrests of President Trump's political enemies.  — Now, for the first time, the levers of power are aligned to pursue that goal from inside the federal government.",
    "url": "https://www.axios.com/2025/08/06/russia-investigation-criminal-charges-trump-maga"
  },
  {
    "text": "The Howard Stern Show ‘to be canceled’ after nearly 20 years on SiriusXM as ‘$100m’ contract is up later this year  —  The King of All Media's lucrative deal ends in late 2025  —  THE ICONIC Howard Stern Show on SiriusXM is set to be canceled after a stunning 20-year run, sources exclusively told The U.S. Sun.",
    "url": "https://www.the-sun.com/entertainment/14910416/howard-stern-show-canceled-contract-up/"
  }
]