[
  {
    "text": "Supreme Court appears open to some presidential immunity for Trump, risking delays  —  Justices on the Supreme Court voiced skepticism Thursday to assertions from former President Trump's attorneys that presidential immunity could extend to an attempted coup or the assassination of a political rival … ",
    "url": "https://thehill.com/regulation/court-battles/4621749-supreme-court-justices-skeptical-of-sweeping-immunity-claims-by-trump/"
  },
  {
    "text": "Trump Is Getting What He Wants  —  The Supreme Court seems to be endorsing his views on presidential power.  —  At today's hearing on Donald Trump's claim of absolute immunity from criminal prosecution, the Republican-appointed Supreme Court majority appeared poised to give him what he most desires … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/04/supreme-court-poised-unshackle-second-trump-term/678190/"
  },
  {
    "text": "High School AD Framed Principal With Fake AI-Generated Racist Audio: Cops  —  BRAVE NEW WORLD  —  The alleged ploy led police to arrest and charge Dazhon Darien with theft, stalking, disruption of school operations, and retaliation against a witness.  —  A Maryland high school athletic director … ",
    "url": "https://www.thedailybeast.com/high-school-athletic-director-framed-principal-with-fake-ai-generated-racist-audio"
  },
  {
    "text": "Team Trump Fine With Pissing Off MAGA to Compete With Biden  —  DEBASER  —  On a pair of high-profile occasions, Trump got crosswise with his MAGA base.  It's not accidental. … NOT SO BASED DON  —  It's one of the seemingly ironclad natural laws of the Trump era … ",
    "url": "https://www.thedailybeast.com/team-trump-fine-with-pissing-off-maga-to-compete-with-biden"
  },
  {
    "text": "MAGA begins to panic: Trump may not make it to the ballot  —  Donald Trump.  —  Those two words spoken out loud can elicit an emotional response on par with the worst invectives, curses or insults you can conjure.  —  The man himself is capable of the same emotional outbursts under the proper stimuli.",
    "url": "https://www.salon.com/2024/04/25/maga-begins-to-panic-may-not-make-it-to-the-ballot/"
  },
  {
    "text": "USC cancels ‘main stage’ commencement ceremony  —  USC announced Thursday that it is canceling its main May commencement ceremony, capping a dramatic series of moves that began last week after it informed valedictorian Asna Tabassum, who had been opposed by pro-Israel groups, that she would not be delivering the traditional speech.",
    "url": "https://www.latimes.com/california/story/2024-04-25/la-me-usc-commencement-canceled"
  },
  {
    "text": "IDF says terrorists fired mortar shells at under-construction US-led Gaza aid pier as UN officials toured site  —  Members of a terror group in the Gaza Strip launched mortars at an under-construction pier for a US-led project to bring aid into the Palestinian enclave yesterday, the military says.",
    "url": "https://www.timesofisrael.com/liveblog_entry/idf-says-mortar-fired-at-under-construction-gaza-aid-pier-as-un-officials-toured-site/"
  },
  {
    "text": "Trump VP contender Kristi Noem writes of killing dog - and goat - in new book  —  South Dakota governor includes bloody tale in campaign volume - and admits 'a better politician ... wouldn't tell the story here'  —  In 1952, as a Republican candidate for vice-president … ",
    "url": "https://www.theguardian.com/books/2024/apr/26/trump-kristi-noem-shot-dog-and-goat-book"
  },
  {
    "text": "Trump Allies Draw Up Plans to Blunt Fed's Independence  —  Some Trump advisers argue that the president should be consulted on interest-rate decisions",
    "url": "https://www.wsj.com/economy/central-banking/trump-allies-federal-reserve-independence-54423c2f"
  },
  {
    "text": "DeSantis: Florida ‘will not comply’ with new Biden Title IX rules  —  Florida Gov. Ron DeSantis (R) said Thursday his state “will not comply” with recently unveiled changes to Title IX by the Biden administration.  —  “Florida rejects [President Biden's] attempt to rewrite Title IX,” … ",
    "url": "https://thehill.com/homenews/lgbtq/4621642-desantis-florida-will-not-comply-with-new-biden-title-ix-rules/"
  },
  {
    "text": "COP29 climate summit host Azerbaijan defends oil and gas investments  —  Azerbaijan, host of this year's U.N. climate summit, will defend the right of oil and gas producing nations to invest in the sector, the country's president said on Friday, noting that despite climate targets, fossil fuel demand remains strong.",
    "url": "https://www.reuters.com/sustainability/climate-energy/cop29-climate-summit-host-azerbaijan-defends-oil-gas-investments-2024-04-26/"
  },
  {
    "text": "Bill that could lead to prosecution of librarians advances in Alabama House  —  Lawmakers in Alabama passed legislation that could lead to the prosecution of librarians under the state's obscenity law for providing minors with “harmful” materials.  —  The bill, approved 72-28 by the Alabama House … ",
    "url": "https://thehill.com/homenews/state-watch/4622940-bill-that-could-lead-to-prosecution-of-librarians-advances-in-alabama-house/"
  },
  {
    "text": "Scoop: Biden changes walking routine to Marine One … - Weeks ago the president told aides that he'd prefer a less formal approach, a White House official told Axios. … White House staffers and reporters alike noticed the sudden change in Biden's walk routine beginning in mid-April … ",
    "url": "https://www.axios.com/2024/04/26/biden-walkers-white-house-marine-one"
  },
  {
    "text": "US preparing to announce $6B in weapons contracts for Ukraine  —  The package could be finalized and announced as soon as Friday, and will include Patriot systems.  —  The U.S. is putting the finishing touches on one of its largest Ukraine military aid packages to date … ",
    "url": "https://www.politico.com/news/2024/04/25/us-weapons-contract-ukraine-00154450"
  },
  {
    "text": "Pluralistic: Antitrust is a labor issue (25 Apr 2024)  — Antitrust is a labor issue: Banning noncompetes is huge, but it's not all the FTC is doing!  — Hey look at this: Delights to delectate.  — This day in history: 2009, 2014, 2019, 2023  — Upcoming appearances: Where to find me.",
    "url": "https://pluralistic.net/2024/04/25/capri-v-tapestry/"
  },
  {
    "text": "CNN Poll: Few think Trump is being treated the same as other defendants  —  As the first criminal prosecution of a former American president began just 13% nationwide feel Donald Trump is being treated the same as other criminal defendants, a new CNN poll conducted by SSRS finds.",
    "url": "https://www.cnn.com/2024/04/25/politics/cnn-poll-trump-trial/"
  },
  {
    "text": "In Historic Vote, the FCC Reasserts Its Authority to Protect the Open Internet and Safeguard Online Users  —  Contact: Timothy Karr, 201-533-8838  —  WASHINGTON — On Thursday, in a 3-2 vote, the Federal Communications Commission voted to restore Net Neutrality protections … ",
    "url": "https://www.freepress.net/news/press-releases/historic-fcc-vote-restore-net-neutrality-title-ii"
  },
  {
    "text": "Speaker Mike Johnson stands tall against hateful campus mobs  —  .  —  House Speaker Mike Johnson (R-LA) gave new evidence yesterday of having “found his voice” in defense of Western values against the threats from both international and domestic bullies and mobs.",
    "url": "https://www.washingtonexaminer.com/opinion/2980157/speaker-mike-johnson-stands-tall-against-hateful-campus-mobs/"
  },
  {
    "text": "US State Department Arabic spokesperson resigns in opposition to Gaza policy  —  The Arabic language spokesperson of the U.S. State Department has resigned, citing her opposition to Washington's policy related to the war in Gaza, in at least the third resignation from the department over the issue.",
    "url": "https://www.reuters.com/world/uk/us-state-department-arabic-spokesperson-resigns-opposition-gaza-policy-2024-04-25/"
  },
  {
    "text": "Newsom celebrates storage milestone but confirms blackouts are not over yet  —  California officials on Thursday celebrated a milestone in their quest to achieve a 100-percent clean grid by 2045: the installation of more than 10,000 megawatts of battery storage.",
    "url": "https://thehill.com/policy/energy-environment/4622694-gavin-newsom-battery-storage-california-blackouts/"
  },
  {
    "text": "Tennessee lawmakers OK bill criminalizing adults who help minors receive gender-affirming care  —  Tennessee's GOP-controlled Statehouse on Thursday gave their final approval to legislation criminalizing adults who help minors receive gender-affirming care without parental consent … ",
    "url": "https://apnews.com/article/tennessee-transgender-care-ban-minors-b7b6700f6a54a3788ec0697f065281b6"
  }
]