[
  {
    "text": "Trump stuns donors with behind-closed-doors rant about bombing Russia and China: report  —  Former President Donald Trump told a recent group of donors at a fundraising event that he would have bombed Russia and China in response to their aggression against U.S. allies, reportedThe Washington Post on Tuesday.",
    "url": "https://www.rawstory.com/trump-donors-2668393354/"
  },
  {
    "text": "The Alitos, the Neighborhood Clash and the Upside-Down Flag  —  Inside the escalating conflict on a bucolic suburban street that Justice Alito said prompted a “Stop the Steal” symbol at his home.  —  The police in Fairfax County, Va., received an unusual phone call on Feb. 15, 2021.",
    "url": "https://www.nytimes.com/2024/05/28/us/justice-alito-neighbors-stop-steal-flag.html"
  },
  {
    "text": "Amy Coney Barrett's Husband Is Representing Fox in a Lawsuit  —  Supreme Court Justice Amy Coney Barrett's husband, Jesse Barrett, is defending Fox Corporation in a defamation case … The lawsuit relates to reports by one of Fox's local stations.  —  Jesse Barrett is a trial lawyer and managing partner at SouthBank Legal.",
    "url": "https://www.rollingstone.com/politics/politics-features/amy-coney-barrett-husband-jesse-fox-1235028838/"
  },
  {
    "text": "Republican member of Fulton elections board won't certify primary results  —  Her lawsuit seeks detailed voting data and a ruling that her duties are discretionary  —  A Republican member of the Fulton County elections board refuses to certify primary election results unless given access … ",
    "url": "https://www.ajc.com/news/atlanta-news/republican-member-of-fulton-elections-board-wont-certify-primary-results/IDYT7CZVMZAJXHDAADS7G6JNT4/"
  },
  {
    "text": "Emerging Portrait of Judge in Trump Documents Case: Prepared, Prickly and Slow  —  Judge Aileen Cannon's handling of court hearings offers insights into how the case accusing Donald Trump of illegally retaining classified material has become bogged down in unresolved issues.",
    "url": "https://www.nytimes.com/2024/05/29/us/politics/trump-documents-judge-aileen-cannon.html"
  },
  {
    "text": "U.S. Coast Guard: Man Dies After Jumping Off World's Largest Cruise Ship  —  Authorities said a passenger died after allegedly leaping from the world's largest cruise ship on Sunday during a journey from Florida to Honduras.  —  The vessel the man went overboard from was identified … ",
    "url": "https://www.breitbart.com/local/2024/05/28/u-s-coast-guard-man-dies-jumping-off-worlds-largest-cruise-ship/"
  },
  {
    "text": "What you need to know about Trump's trial before the verdict  —  The defense really struggled.  But all it takes is one juror. … After six wild weeks and innumerable citations of Jonathan Turley, Donald Trump's criminal trial in New York is finally coming to an end.",
    "url": "https://www.publicnotice.co/p/trump-new-york-criminal-trial-recap"
  },
  {
    "text": "Steinglass pokes hole in defense's argument around National Enquirer  —  Steinglass makes a very good point about the Dino Sajuddin story and corresponding payment.  —  Sajuddin is the former Trump Tower doorman who claims Trump fathered a child out of wedlock, a claim the former president has denied.",
    "url": "https://www.nbcnews.com/politics/donald-trump/live-blog/trump-trial-live-updates-closing-statements-hush-money-case-rcna153996/rcrd42325?canonicalCard=true"
  },
  {
    "text": "Florida civics training links “cancel culture” to mass murder  —  The Florida Department of Education's civics training does not just train educators to teach Christian nationalism.  The same program also includes a section on Communism's legacy.  This has been a priority of Governor Ron DeSantis (R).",
    "url": "https://popular.info/p/florida-civics-training-links-cancel"
  },
  {
    "text": "North Korea Accused of Floating Poo Balloons Into the South  —  CAUSING A STINK  —  Over 260 balloons carrying trash and excrement appear to have floated across the border.  —  South Korea's military on Wednesday accused North Korea of floating balloons loaded with trash and manure across … ",
    "url": "https://www.thedailybeast.com/north-korea-accused-of-floating-poo-balloons-into-the-south"
  },
  {
    "text": "The slaughter in Rafah and Israel's moral nadir  —  On Sunday, an Israeli airstrike in the Gaza city of Rafah ignited a fire that killed dozens of civilians.  The carnage was horrific even by the bloody standards set by Israel's war: An emergency doctor on the ground told NPR that it was … ",
    "url": "https://www.vox.com/world-politics/351968/the-slaughter-in-rafah-and-israels-moral-nadir"
  },
  {
    "text": "How I went from left to center-left  —  My crisis of confidence in progressive epistemology  —  I've written about the history of left versus right since the French Revolution, about what the left gets right, and about what the right gets right.  Now, I want to talk about my own journey … ",
    "url": "https://www.slowboring.com/p/how-i-went-from-left-to-center-left"
  },
  {
    "text": "US pier constructed off Gaza has broken apart  —  The temporary pier constructed by the US military to transport aid into Gaza broke apart and sustained damage in heavy seas on Tuesday in a major blow to the American-led effort to create a maritime corridor for humanitarian supplies into the war-torn enclave, the Pentagon said.",
    "url": "https://www.cnn.com/2024/05/28/politics/us-gaza-pier-broken-apart/"
  },
  {
    "text": "Labour Poll Lead Grows Even After Tory Policy Blitz, YouGov Says  — Starmer's party holds 27-point advantage over Conservatives  — Blow to Sunak's bid to build momentum ahead of July 4 vote  —  Keir Starmer's opposition Labour Party extended its poll lead over the Conservatives … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-29/labour-poll-lead-grows-even-after-tory-policy-blitz-yougov-says"
  },
  {
    "text": "Giant pandas are returning to D.C.'s National Zoo … - But the number of giant pandas at U.S. zoos has dwindled as tensions between Washington and Beijing rose in recent years. … - They're coming back to one bougie bear den: Carlyle Group co-founder and billionaire philanthropist David … ",
    "url": "https://www.axios.com/local/washington-dc/2024/05/29/giant-pandas-return-dc-national-zoo"
  },
  {
    "text": "The media and sullen nonvoters should listen to Ken Burns  —  The historian knows something about civil war — and moral responsibility in politics.  —  A skilled graduation speaker who poetically delivers life lessons and imparts insightful advice can leave me teary-eyed.",
    "url": "https://www.washingtonpost.com/opinions/2024/05/28/ken-burns-graduation-election-trump/"
  },
  {
    "text": "Biden and Harris make a rare joint campaign appearance to shore up Black voters' support  —  The campaign is also launching Black Voters for Biden, which will be followed by events around the country.  —  PHILADELPHIA — Preparing for a new phase of the campaign as Donald Trump's criminal trial nears … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-harris-rare-joint-campaign-appearance-black-voters-rcna154348"
  },
  {
    "text": "Another State Department official resigns over Gaza, taking aim at aid  —  The official, Stacy Gilbert, resigned Tuesday.  She told colleagues that the State Department was wrong to conclude Israel had not obstructed aid to Gaza.  —  A career State Department official involved … ",
    "url": "https://www.washingtonpost.com/national-security/2024/05/28/state-department-official-resigns-gilbert/"
  },
  {
    "text": "FBI arrests ‘dreaded’ Jan. 6 defendant they say rammed ‘Trump’ sign into police line  —  William George Knight shoved an officer during the Capitol attack, the FBI said, after “ramming” a giant metal-framed “TRUMP” sign into police officers at the Capitol.  —  WASHINGTON — A Jan. 6 participant … ",
    "url": "https://www.nbcnews.com/politics/justice-department/fbi-arrests-dreaded-jan-6-defendant-say-rammed-trump-sign-police-line-rcna154374"
  },
  {
    "text": "Playbook: All politics is legal  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  JUST POSTED — “Democrats Plan $100 Million Push on Abortion Rights to Win House,” by WSJ's Natalie Andrews: “In a memo to donors, the House Majority PAC outlined … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/05/29/all-politics-is-legal-00160338"
  },
  {
    "text": "Ohio House agrees to Biden ballot fix compromise if ‘anti-democratic’ Senate provisions removed  —  President Joe Biden delivers the State of the Union address during a joint meeting of Congress in the House chamber at the U.S. Capitol on Thursday, March 7, 2024, in Washington, DC.",
    "url": "https://ohiocapitaljournal.com/2024/05/28/ohio-house-agrees-to-biden-ballot-fix-compromise-if-anti-democratic-senate-provisions-removed/"
  }
]