[
  {
    "text": "The irony of Trump's angry reaction to his N.H. primary victory  —  So let me get this straight.  Donald Trump, of all people, is outraged by the very idea of a candidate presenting a second-place finish as a success?  —  For speechwriters, remarks after a primary victory are an easy lift.",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/irony-trumps-angry-reaction-nh-primary-victory-rcna135420"
  },
  {
    "text": "Lindsey Graham ‘threw Trump under the bus’ in Georgia case, book says  —  Senator told grand jury in election subversion case Trump would have believed martians stole the election, per Find Me the Votes  —  The South Carolina senator Lindsey Graham “threw Donald Trump under the bus” … ",
    "url": "https://www.theguardian.com/books/2024/jan/24/find-me-the-votes-book-graham-trump-georgia"
  },
  {
    "text": "Collins, leading Senate GOP centrist, won't endorse Trump in 2024  —  Sen. Susan Collins (Maine), the top-ranking Republican on the Senate Appropriations Committee and a key figure in getting bills passed through Congress, says she will not endorse former President Trump, even if he becomes the Republican Party's nominee for president.",
    "url": "https://thehill.com/homenews/senate/4426835-collins-wont-endorse-trump-2024/"
  },
  {
    "text": "Why Republicans are (still) humiliating themselves for Trump  —  Even Nikki Haley will eventually have to kiss the ring. … With close to 90 percent of the vote counted early Wednesday morning evening, Donald Trump had beaten Nikki Haley by just over 10 points in the New Hampshire Republican presidential primary.",
    "url": "https://www.publicnotice.co/p/trump-wins-new-hampshire-primary-24-endorsements"
  },
  {
    "text": "Trump fumes in victory, Haley spins in defeat: Takeaways from New Hampshire … A disgusted Trump lashed out in response, dropping any pretense of civility as he ripped Haley as an “imposter” standing in his way.  —  3 takeaways from New Hampshire … - You wouldn't know it from the tone of her speech … ",
    "url": "https://www.axios.com/2024/01/24/new-hampshire-trump-haley-takeaways"
  },
  {
    "text": "After Trump's NH win, Biden gets the opponent he wants  —  The president's campaign gears up for a Trump rematch  —  MANCHESTER, New Hampshire — The general election has all but begun — and it's the race President Joe Biden's team wanted.  —  Former President Donald Trump's victory … ",
    "url": "https://www.politico.com/news/2024/01/24/trumps-win-biden-gets-opponent-he-wants-00137429"
  },
  {
    "text": "Wall Street's bargain with Trump  —  Many corporate leaders are misguided in playing down the risks of a second term for the Republican former president  —  The Financial Times had only nice things to say about Benito Mussolini in a June 1933 supplement entitled “The Renaissance of Italy: Fascism's gift of order and progress”.",
    "url": "https://www.ft.com/content/8fbf3a47-f622-46cc-ac06-17732cecc313"
  },
  {
    "text": "The White House has its own pharmacy—and, boy, was it shady under Trump  —  It wasted $750K during the Trump years and freely handed out Ambien and Provigil.  —  The White House has its own pharmacy that, until recently, could perhaps best be described as a hot mess, according … ",
    "url": "https://arstechnica.com/science/2024/01/the-white-house-has-its-own-pharmacy-and-boy-was-it-shady-under-trump/"
  },
  {
    "text": "Senate panel advances bill to seize frozen Russian assets for Ukraine  —  The Senate Foreign Relations Committee advanced legislation Wednesday to allow the U.S. to seize frozen Russian assets to pay for Ukraine's reconstruction.  —  The top Democrat and Republican on the panel were confident … ",
    "url": "https://thehill.com/policy/international/4426738-seize-russian-assets-ukraine-senate/"
  },
  {
    "text": "Republicans Turn on Their Impeachment Chairman: ‘Parade of Embarrassments’ (Exclusive)  —  One Trump ally told The Messenger ‘the base is starting to get more and more frustrated’ with Comer  —  JWPlayer  —  House Republicans are increasingly disenchanted with Rep. James Comer, R-Ky. … ",
    "url": "https://themessenger.com/politics/republicans-turn-on-their-impeachment-chairman-a-parade-of-embarrassments-exclusive"
  },
  {
    "text": "Religious ‘Nones’ are now the largest single group in the U.S.  —  When Americans are asked to check a box indicating their religious affiliation, 28% now check ‘none.’  —  A new study from Pew Research finds that the religiously unaffiliated - a group comprised of atheists … ",
    "url": "https://www.npr.org/2024/01/24/1226371734/religious-nones-are-now-the-largest-single-group-in-the-u-s"
  },
  {
    "text": "Obamacare enrollment hits record level as Trump vows repeal  —  More than 21 million people have signed up for health plans through the Affordable Care Act's health insurance marketplaces, the Biden administration announced Wednesday.  The record level of enrollment comes as former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/health/2024/01/24/obamacare-record-enrollment-biden/"
  },
  {
    "text": "Nose wheel falls off Boeing 757 passenger jet awaiting takeoff  —  Delta Air Lines jet was due to depart from Atlanta airport and none of six crew or 184 passengers were hurt  —  A nose wheel fell off a Delta Air Lines Boeing 757 passenger jet and rolled away as the plane lined up for takeoff … ",
    "url": "https://www.theguardian.com/business/2024/jan/24/delta-air-lines-plane-nose-wheel-falls-off"
  },
  {
    "text": "Video shows massive waves crashing Army base in Marshall Islands, causing extensive damage  —  A series of powerful weather-driven waves struck a key U.S. military installation in the Marshall Islands Saturday night, damaging infrastructure and forcing dozens of people to evacuate the island.",
    "url": "https://www.usatoday.com/story/news/nation/2024/01/23/marshall-islands-rogue-wave-video/72323059007/"
  },
  {
    "text": "Ohio lawmakers override DeWine veto of gender-affirming care ban, transgender athlete restrictions  —  The Ohio Senate voted 23-9 Wednesday to override Republican Gov. Mike DeWine's veto of legislation banning gender-affirming health care for minors and preventing transgender women and girls from competing on female school sports teams.",
    "url": "https://thehill.com/homenews/lgbtq/4427040-ohio-senate-house-override-dewine-veto-gender-affirming-care-ban-transgender-athlete/"
  },
  {
    "text": "What is Tucker Carlson doing in Canada?  —  Albertans turn out for Tucker Carlson MAGA tour.  —  CALGARY — A year ago, Tucker Carlson was calling on Americans to invade and “liberate” Canada from Prime Minister Justin Trudeau.  —  Now, he's getting the red carpet treatment in Alberta.",
    "url": "https://www.politico.com/news/2024/01/24/tucker-carlson-canada-00137380"
  },
  {
    "text": "Factory failed to test applesauce for lead before poisonings, FDA says  —  The manufacturer behind now-recalled cinnamon applesauce pouches failed to ever test its product for heavy metals, the Food and Drug Administration found in a recent inspection, among several shortfalls by the plant … ",
    "url": "https://www.cbsnews.com/news/applesauce-lead-poisonings-fda-factory-ecuador/"
  },
  {
    "text": "Heaven knows I'm miserable now!  The Smiths star recoils at Trump using his song  —  Donald Trump isn't known for his love of classic British guitar band The Smiths — even though they have a song called “Bigmouth Strikes Again” that could be an ideal soundtrack for his planned return to the White House.",
    "url": "https://www.politico.eu/article/the-smiths-johnny-marr-donald-trump-rally-election/"
  }
]