[
  {
    "text": "What Ginni Thomas and Leonard Leo wrought: How a justice's wife and a key activist started a movement  —  Thanks to the Supreme Court's Citizens United ruling, a trove of so-called “dark money” was about to be unleashed.  Two activists prepared to seize the moment.",
    "url": "https://www.politico.com/news/2023/09/10/ginni-thomas-leonard-leo-citizens-united-00108082"
  },
  {
    "text": "The House GOP leadership's Trump split rears its head  —  With assists from Jordain Carney, Sarah Ferris, Olivia Beavers, Ursula Perano and Burgess Everett  —  HOUSE GOP LEADERS' OPEN-SECRET DIVIDE OVER TRUMP  —  It's the split that most everyone on the Hill knows about — and keeps rearing its head.",
    "url": "https://www.politico.com/newsletters/huddle/2023/09/08/the-house-gop-leaderships-trump-split-rears-its-head-00114678"
  },
  {
    "text": "California Gov. Gavin Newsom would make an ‘interim’ choice if Dianne Feinstein vacates her Senate seat  —  In a new interview with NBC's “Meet the Press,” the California governor said he would not select any of the candidates currently running to replace the ailing senator.",
    "url": "https://www.nbcnews.com/politics/2024-election/gavin-newsom-make-interim-appointment-dianne-feinstein-senate-rcna103933"
  },
  {
    "text": "Trump's post-presidential office is hiding in plain sight  —  For a man who likes his name in lights, his government-funded post-presidential office is as nondescript as they come.  —  WEST PALM BEACH, Fla. — Donald Trump likes to put his name on everything — except his taxpayer-funded … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-post-presidential-office-hiding-plain-sight-rcna104235"
  },
  {
    "text": "Virginia Gov. Glenn Youngkin Pardons Father Who Protested School Board After Daughter's Sexual Assault  —  Scott Smith was convicted of disorderly conduct over the 2021 incident  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/virginia-gov-glenn-youngkin-pardons-father-who-protested-school-board-after-daughters-sexual-assault"
  },
  {
    "text": "Book Review: ‘Elon Musk,’ by Walter Isaacson  —  Walter Isaacson's biography of the billionaire entrepreneur depicts a mercurial “man-child” with grandiose ambitions and an ego to match.  —  Buy Book ▾ … When you purchase an independently reviewed book through our site, we earn an affiliate commission.",
    "url": "https://www.nytimes.com/2023/09/09/books/review/elon-musk-walter-isaacson.html"
  },
  {
    "text": "J.F.K. Assassination Witness Breaks His Silence and Raises New Questions  —  The account of Paul Landis, one of the Secret Service agents just feet away from John F. Kennedy when he was struck down, could change the understanding of what happened in Dallas in 1963.  —  He still remembers the first gunshot.",
    "url": "https://www.nytimes.com/2023/09/09/us/politics/jfk-assassination-witness-paul-landis.html"
  },
  {
    "text": "Why Mothers Feel Touched Out  —  When my first child was a few months old, a man shouted at me while I stood in the snow with my sleeping baby slung over my shoulder, partially covered by a worn blanket.  We lived in upstate New York, it was winter, and she had fallen asleep on me during a rare outing.",
    "url": "https://www.nytimes.com/2023/09/10/opinion/motherhood-bodily-autonomy.html"
  },
  {
    "text": "GOP senator says he would ‘speak’ to No Labels about 2024 third-party run  —  Sen. Bill Cassidy (R-La.) on Sunday said he would be open to speaking to No Labels if they approached him about a potential third-party run.  —  “What about No Labels?”  NBC's Chuck Todd asked Cassidy.",
    "url": "https://thehill.com/homenews/campaign/4196634-gop-senator-says-he-would-speak-to-no-labels-about-third-party-run/"
  },
  {
    "text": "White House press secretary ends news conference as Biden is still responding to questions from reporters  —  White House press secretary Karine Jean-Pierre on Sunday abruptly ended a news conference with President Joe Biden in Hanoi, Vietnam, at one point taking a microphone and announcing … ",
    "url": "https://www.cnn.com/2023/09/10/politics/karine-jean-pierre-joe-biden-press-conference/"
  },
  {
    "text": "At Iowa's Biggest Game, Football and Politics Collide  —  Donald J. Trump and Ron DeSantis played off each other at the Iowa-Iowa State game, where the tables appeared to turn on the former president.  —  Two ardent rivals faced off on Saturday.  Thousands of fans cheered and jeered from the sidelines.",
    "url": "https://www.nytimes.com/2023/09/09/us/politics/iowa-football-trump-desantis.html"
  },
  {
    "text": "Tuberville ‘paralyzing’ Pentagon, House Foreign Affairs chair says  —  “I really wish he would reconsider this,” he said.  —  Rep. Michael McCaul (R-Texas) repeatedly said Sunday that Sen. Tommy Tuberville's one-person blockade of military nominations was “paralyzing” the Defense Department.",
    "url": "https://www.politico.com/news/2023/09/10/tuberville-military-mccaul-00114901"
  },
  {
    "text": "Russia's ‘Merchant of Death’ Is Looking to Forge a New Life in Politics  —  The convicted arms trafficker Viktor A. Bout hasn't much flair for retail politicking, but his celebrity may compensate for that in regional elections.  —  As an arms trafficker, he operated in some of the world's … ",
    "url": "https://www.nytimes.com/2023/09/10/world/europe/russia-bout-arms-dealing-politics.html"
  },
  {
    "text": "Transcript: Vice President Kamala Harris on “Face the Nation,” Sept. 10, 2023  —  The following is a transcript of an interview with Vice President Kamala Harris that aired on “Face the Nation” on Sept. 10, 2023.  —  MARGARET BRENNAN: So, you're 58 now.  If you win a second term … ",
    "url": "https://www.cbsnews.com/news/vice-president-kamala-harris-face-the-nation-transcript-09-10-2023/"
  }
]