[
  {
    "text": "Sen. Dianne Feinstein, a trailblazer in U.S. politics and the longest-serving woman in the Senate, dies at age 90  —  Feinstein, elected in 1992, was a vocal gun control advocate who often sought common ground with Republicans, sometimes frustrating her more liberal colleagues.",
    "url": "https://www.nbcnews.com/politics/congress/dianne-feinstein-rcna18010"
  },
  {
    "text": "Comer's Fiasco  —  “Republicans are the party that says that government doesn't work, and then they get elected and prove it.”  — P.J. O'Rourke  —  As we roll into the weekend:  — Dysfunction squared: Hardliners plot to replace McCarthy as government shutdown looms - The Washington Post",
    "url": "https://morningshots.thebulwark.com/p/comers-fiasco"
  },
  {
    "text": "Dianne Feinstein, centrist stalwart of the Senate, dies at 90  —  A trailblazer for women in politics, she led the Intelligence Committee and helped mold the federal bench.  Amid health setbacks, she faced calls to resign.  —  It was the morning of Nov. 27, 1978, and Dianne Feinstein … ",
    "url": "https://www.washingtonpost.com/obituaries/2023/09/29/dianne-feinstein-california-senator-dead/"
  },
  {
    "text": "Dianne Feinstein, California's longest-serving senator, dies at 90  — Dianne Feinstein, the oldest member of the U.S. Senate and the longest-serving senator from California, has died at age 90.  — Feinstein's death leaves vacant her powerful Senate seat, requiring Gov. Gavin Newsom to appoint a temporary successor.",
    "url": "https://www.cnbc.com/2023/09/29/dianne-feinstein-dead.html"
  },
  {
    "text": "Senator Dianne Feinstein Dies at 90  —  The California Democrat, the oldest member of the Senate, had been declining in health for months.  —  Senator Dianne Feinstein, the trailblazing Democratic power broker who served in the Senate for 30 years, died on Thursday night, according to a family member.",
    "url": "https://www.nytimes.com/2023/09/29/us/politics/dianne-feinstein-dead-senate.html"
  },
  {
    "text": "Playbook: Inside the grudge that paralyzed the House  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  THE FRIDAY READ — “Nikki Haley Doesn't Want to Choose a Side,” by Michael Kruse: “The conventional wisdom is that this is a time for choosing, for all Republicans, and for her, too.",
    "url": "https://www.politico.com/newsletters/playbook/2023/09/29/inside-the-grudge-that-paralyzed-the-house-00119014"
  },
  {
    "text": "Donald Trump's thrill ride is nearly over — but the media refuses to let go  —  What if we told America the truth about Donald Trump?  He's a fraud, a cheat and a rapist, facing 91 felony counts … I take no joy in saying this, but we in the press are moral cowards.",
    "url": "https://www.salon.com/2023/09/28/donald-thrill-ride-is-nearly-over--but-the-media-wont-let-him-go/"
  },
  {
    "text": "Supreme Court to decide landmark Texas, Fla. social media cases and more  —  The Supreme Court on Friday said it would wade into the future of free speech online and decide whether laws passed in Texas and Florida can restrict social media companies from removing certain political posts or accounts.",
    "url": "https://www.washingtonpost.com/politics/2023/09/29/supreme-court-social-media-florida-texas-google-facebook/"
  },
  {
    "text": "Supreme Court to hear cases on Florida, Texas social media laws  —  The Supreme Court on Friday announced it will hear two cases stemming from controversial laws in Texas and Florida regulating social media platforms' content moderation decisions.  —  The laws aim to prohibit social media companies … ",
    "url": "https://thehill.com/regulation/court-battles/4228470-supreme-court-to-hear-cases-on-florida-texas-social-media-laws/"
  },
  {
    "text": "Hard-liners plot to replace McCarthy with a deputy as shutdown looms  —  A contingent of far-right House Republicans are plotting an attempt to remove Kevin McCarthy as House speaker as early as next week, a move that would throw the chamber into further disarray in the middle … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/28/kevin-mccarthy-tom-emmer-government-shutdown-motion-vacate/"
  },
  {
    "text": "Trump deposition scheduled for next month in lawsuits filed by ex-FBI officials  —  An appeals court this month rejected the Justice Department's request to block Trump from answering questions related to the lawsuits from Lisa Page and Peter Strzok.  —  Former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-deposition-scheduled-lawsuits-filed-ex-fbi-officials-rcna117953?taid=6516bc443f76e8000158b273"
  },
  {
    "text": "John Fetterman's greatest accomplishment is the Senate passing a dress code  —  These days, Democrats and Republicans seem to hate each other so much that when not attempting to incarcerate each others' principal political leaders, they can't come to a simple agreement to fund the government that employs them.",
    "url": "https://www.washingtonexaminer.com/opinion/fettermans-greatest-accomplishment-senate-passing-dress-code"
  },
  {
    "text": "Amid GOP confusion, U.S. braces for ‘first-ever shutdown about nothing’  —  What's the deal with this government shutdown?  In a standoff even Republicans are comparing to ‘Seinfeld,’ it's hard to tell.  —  In 1995 and 1996, the federal government shut down as House Republicans … ",
    "url": "https://www.washingtonpost.com/business/2023/09/29/government-shutdown-gop-seinfeld/"
  },
  {
    "text": "Melania Trump ‘quietly’ renegotiated prenup with Donald ahead of potential second presidential term, legal woes: sources  —  Sources tell Page Six that Melania Trump has “quietly” renegotiated her prenuptial agreement with Donald Trump in advance of his potentially serving a second term in the White House.",
    "url": "https://pagesix.com/2023/09/28/melania-trump-quietly-renegotiated-donald-trump-prenup/"
  },
  {
    "text": "How Trump's fraudulent business practices finally came back to bite him  —  The New York ruling that's big trouble for the Trump Organization, unpacked. … While we all wait for Trump's criminal trials to start, let us enjoy the absolute hammering Trump and his sons just received … ",
    "url": "https://www.publicnotice.co/p/trump-fraud-ruling-new-york-canceled-business"
  },
  {
    "text": "The Market for Nazi Memorabilia Is Huge, Lucrative and Very Disturbing  —  At the Ohio Valley Military Society's annual Show of Shows, there is plenty for sale that isn't Nazi memorabilia.  All sorts of mementos from all sorts of wars: Civil War caps, antique pistols, Purple Hearts, samurai swords, World War I trench kits.",
    "url": "https://www.nytimes.com/2023/09/29/opinion/nazi-memorabilia-market-liveauctioneers.html"
  },
  {
    "text": "Dems pressure White House to change economic message  —  Democrats are loving the Biden economy.  They're less certain about his economic message.  —  President Joe Biden placed a big bet that he could sell an improving economy under the banner of “Bidenomics.”",
    "url": "https://www.politico.com/news/2023/09/29/white-house-bidenomics-failure-00118949"
  },
  {
    "text": "Revealed: far-right Oath Keepers kept up dues payments after Capitol attack  —  Venmo records show members of rightwing militia paid vice-president for months after group's January 6 role was exposed  —  Oath Keepers members paid dues to the rightwing militia's then vice-president … ",
    "url": "https://www.theguardian.com/us-news/2023/sep/29/oath-keepers-members-january-6-capitol-attack-venmo"
  },
  {
    "text": "Republicans brace for Nikki Haley-Ron DeSantis showdown after debates  —  Haley and DeSantis' teams will go head-to-head for support at an upcoming donor conference, following their clash at Wednesday's debate and Haley's rising polling.  —  For months, Nikki Haley campaigned in relative obscurity.",
    "url": "https://www.nbcnews.com/politics/2024-election/republicans-brace-nikki-haley-ron-desantis-showdown-debates-rcna117786"
  },
  {
    "text": "Second Republican primary debate had the lowest TV viewership since 2015  —  Wednesday's debate had the lowest TV viewership of any Republican presidential debate since 2015.  —  When it comes to debates, the question of ratings is usually little more than a curiosity.",
    "url": "https://www.nbcnews.com/meet-the-press/meetthepressblog/second-republican-primary-debate-lowest-tv-viewership-2015-rcna117955"
  }
]