[
  {
    "text": "Live Updates: Stormy Daniels Is Expected to Testify in Trump's Trial  —  Ms. Daniels, who received $130,000 in hush money to keep silent about her story of having had sex with Donald J. Trump, is at the center of the case against him.  —  Here's the latest on the trial.",
    "url": "https://www.nytimes.com/live/2024/05/07/nyregion/trump-trial-hush-money-stormy-daniels"
  },
  {
    "text": "Trump trial live updates with Stormy Daniels expected to testify today  —  Stormy Daniels, the adult film star who received $130,000 in 2016 in exchange for her silence about an alleged sexual encounter with Donald Trump, is in New York and expects to be called to the stand to testify … ",
    "url": "https://www.cbsnews.com/live-updates/trump-trial-testimony-bookkeeping-gag-order-contempt/"
  },
  {
    "text": "Jurors in Trump Trial Hear Witness Tie the President to the Payment  —  Before prosecutors began presenting crucial records, the judge held Donald J. Trump in contempt, saying his complaints about the jury were “a direct attack on the rule of law.”  —  After two weeks of enthralling jurors … ",
    "url": "https://www.nytimes.com/2024/05/06/nyregion/trump-trial-gag-order-hush-money.html"
  },
  {
    "text": "Israelis frustrated with U.S. handling of hostage talks … - The U.S. official said “this is an extremely difficult process with negotiations conducted through intermediaries in Doha and Cairo.”  — He added that the U.S. believes Israel has engaged in the talks in good faith … ",
    "url": "https://www.axios.com/2024/05/07/us-israel-hamas-hostage-ceasefire-talks"
  },
  {
    "text": "Trump on going to jail over gag order: 'I'll do that sacrifice'  —  The judge has threatened the former president with possible jail time, something Trump and his supporters think may bolster his campaign.  —  Donald Trump said he would rather risk imprisonment than comply with a gag order … ",
    "url": "https://www.politico.com/news/2024/05/06/trump-jail-time-gag-order-hush-money-trial-00156388"
  },
  {
    "text": "New York governor said Black kids in the Bronx do not know the word ‘computer’  —  Kathy Hochul made comment at California conference to showcase upstate AI center before apologizing on Monday night  —  The governor of New York, Kathy Hochul, has rapidly backtracked on remarks she made on Monday … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/07/kathy-hochul-bronx-computer-comment"
  },
  {
    "text": "Abortion bans drive away up to half of young talent, new CNBC/Generation Lab youth survey finds … Young people are seen on the Emory University campus in Atlanta, Georgia on October 14, 2022.  —  The youngest generation of American workers is prepared to move away from states … ",
    "url": "https://www.cnbc.com/2024/05/07/abortion-bans-drive-away-up-to-half-of-young-talent-new-cnbc/generation-lab-youth-survey-finds.html"
  },
  {
    "text": "Former Republican Official Finds a Spine, Endorses Joe Biden  —  Georgia's former Republican Lieutenant Governor Geoff Duncan announced Monday that he is endorsing Joe Biden in the 2024 election, a stunning defection that puts him at odds with other leaders in his party.",
    "url": "https://newrepublic.com/post/181337/republican-trump-election-endorse-biden"
  },
  {
    "text": "Inside the increasingly ugly GOP fight over a Texas runoff  —  Tony Gonzales has made a lot of Republican enemies.  Party leadership is still defending him, against his opponent “The AK Guy” and his own conservative colleagues.  —  Rep. Tony Gonzales' centrist voting record and willingness … ",
    "url": "https://www.politico.com/news/2024/05/07/tony-gonzales-inter-gop-fight-texas-00156073"
  },
  {
    "text": "House swears in New York Democrat, thinning GOP majority  —  Rep. Tim Kennedy (D-N.Y.) was sworn in on the House floor Monday, replacing the now-retired Rep. Brian Higgins (D-N.Y.) and leaving Republicans with just a one-vote margin for any partisan vote.  —  Kennedy, previously a state senator … ",
    "url": "https://thehill.com/homenews/house/4647274-house-new-york-democrat-tim-kennedy-thinning-gop-majority/"
  },
  {
    "text": "The right-wing uproar about Title IX  —  For the last 50 years, Title IX has had an extraordinary impact on the nature of higher education in the United States.  Passed in 1972 as an amendment to the Higher Education Act, Title IX prohibits sex-based discrimination at any school that receives funding from the federal government.",
    "url": "https://popular.info/p/the-right-wing-uproar-about-title"
  },
  {
    "text": "Ukraine Says It Arrested Two in Zelenskiy Assassination Plot  —  Ukrainian authorities said they foiled a plot to assassinate President Volodymyr Zelenskiy and other high-ranking officials, making the announcement on the day of Vladimir Putin's inauguration in Moscow.",
    "url": "https://www.bloomberg.com/news/articles/2024-05-07/ukraine-says-it-arrested-two-in-zelenskiy-assassination-plot"
  },
  {
    "text": "Guilty?  By nearly 3-1, Americans predict a Trump conviction, though some see unfairness  —  Susan Page Rachel Barber Sudiksha KochiUSA TODAY  —  Guilty?  —  Americans by nearly 3-1 predict that former President Donald Trump will be convicted on all or some of the felony charges he faces … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/05/07/trump-hush-money-trial-americans-guilty/73504245007/"
  },
  {
    "text": "Israel approved Rafah military operation and started striking Hamas targets  —  The decision by Israel's War Cabinet came hours after Hamas agreed to a cease-fire that Israel hadn't previously accepted.  —  Israel launched a volley of strikes in the Gazan city of Rafah and said it would … ",
    "url": "https://www.politico.com/news/2024/05/06/israel-rafah-hamas-00156372"
  },
  {
    "text": "Congresswoman battling brain disorder delivers House speech using a text-to-voice app  —  Rep. Jennifer Wexton (D-Va.), whose ability to speak, hear and move has been affected by a degenerative brain condition, uses assistive technology to help her navigate life on the Hill.",
    "url": "https://www.washingtonpost.com/politics/2024/05/06/wexton-house-speech-brain-condition/"
  },
  {
    "text": "GOP Pays the Price for Booting Kevin McCarthy  —  HOUSE BROKE  —  Kevin McCarthy couldn't keep his job, but he could raise gobs of cash.  With the House majority on the line, his successor is struggling to keep up.  —  Former Speaker of the House Kevin McCarthy (R-CA) failed at many things … ",
    "url": "https://www.thedailybeast.com/gop-pays-the-price-for-booting-kevin-mccarthy"
  },
  {
    "text": "Libertarians asked Trump to headline their convention — stirring anger  —  Some national committee members have called on the party to rescind the invitation to former president Donald Trump.  —  Some Libertarian Party leaders are fuming over the party's decision to have former president … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/07/trump-libertarian-national-convention/"
  },
  {
    "text": "Russia's Vladimir Putin sworn in as president for a fifth term  —  President Vladimir Putin was sworn in for a new six-year term on Tuesday at a Kremlin ceremony that was boycotted by the United States and a number of other Western countries due to Russia's war in Ukraine.",
    "url": "https://www.reuters.com/world/europe/russias-vladimir-putin-sworn-president-fifth-term-2024-05-07/"
  },
  {
    "text": "Boeing Admits That Its Employees Falsified Aircraft Records for 787 Dreamliner  —  The airplane manufacturer is currently the subject of multiple separate probes.  —  In the latest disturbing twist to the Boeing saga, the company admitted to falsifying records related to the inspection of its 787 Dreamliner plane.",
    "url": "https://gizmodo.com/boeing-admits-employees-falsified-aircraft-records-1851459132"
  },
  {
    "text": "FACT SHEET: Biden-Harris Administration Ramps Up Actions to Counter Antisemitism on College Campuses and Protect Jewish Communities  —  Today, during Holocaust Remembrance Day, the Biden-Harris Administration announced several new actions to counter the abhorrent rise of Antisemitism in the United States.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/05/07/biden-harris-administration-ramps-up-actions-to-counter-antisemitism-on-college-campuses-and-protect-jewish-communities/"
  },
  {
    "text": "Jack Dorsey praises Twitter as ‘freedom technology’ as he leaves Bluesky board  —  Former Twitter CEO Jack Dorsey praised the platform he founded, now known as X, as “freedom technology” on Saturday, shortly after revealing he was no longer serving on the board of directors for Bluesky.",
    "url": "https://thehill.com/policy/technology/4646630-jack-dorsey-praises-twitter-as-freedom-technology-as-he-leaves-bluesky-board/"
  },
  {
    "text": "Why is the simplest explanation of campus protests so hard to accept?  —  Young people were sympathetic to Palestinians even before the war began.  Why is that ignored?  —  Over the weekend, New York Police Chief of Patrol John Chell took to social media to offer thoughts on the college campus protests … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/06/campus-protests-explanation-nypd/"
  },
  {
    "text": "Inside the Johnson-MTG talks  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  MIDDLE EAST LATEST — Israel seized control of the Rafah checkpoint on the border between Egypt and Gaza last night, Reuters reports, amid a series of Israel Defense Forces strikes … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/05/07/inside-the-johnson-mtg-talks-00156448"
  },
  {
    "text": "Trump mocks Sen. Tester's weight, hints at a Montana campaign appearance  —  Trump mocked the senator's weight at a fundraiser Saturday night in Palm Beach, Fla., comparing the Montana Democrat's appearance to that of a pregnant woman, according to a recording of the event obtained by The Washington Post.",
    "url": "https://www.washingtonpost.com/politics/2024/05/06/trump-tester-weight-comments/"
  },
  {
    "text": "Ole Miss Student Kicked Out of Fraternity After Video Caught Racist Gestures Toward Protester  —  Video footage of a student making racist gestures, seemingly imitating a monkey, toward a Black woman who was part of a scheduled pro-Palestinian protest at the University of Mississippi … ",
    "url": "https://time.com/6974979/university-of-mississippi-protest-racist-monkey-gesture-fraternity/"
  }
]