[
  {
    "text": "McConnell criticizes Trump's broad pardon of Capitol riot defendants  —  The Scoop  —  Mitch McConnell criticized President Donald Trump's broad pardon of Jan. 6 convictions on Tuesday, a sign that the former Senate GOP leader won't be afraid to publicly break with Trump at times.",
    "url": "https://www.semafor.com/article/01/21/2025/mcconnell-criticizes-trumps-broad-pardon-of-capitol-riot-defendants"
  },
  {
    "text": "Judges Begin Freeing Jan. 6 Defendants and Dismissing Their Cases  —  Two prominent far-right extremists with central roles in the Capitol attack, Enrique Tarrio of the Proud Boys and Stewart Rhodes of the Oath Keepers militia, have been set free.  —  One day after President Donald J … ",
    "url": "https://www.nytimes.com/2025/01/21/us/politics/jan-6-defendants-freed.html"
  },
  {
    "text": "PROTECTING THE MEANING AND VALUE OF AMERICAN CITIZENSHIP  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  The privilege of United States citizenship is a priceless and profound gift.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/protecting-the-meaning-and-value-of-american-citizenship/"
  },
  {
    "text": "Why Ruben Gallego's Laken Riley vote is a warning for Democrats  —  In backing the Laken Riley Act, the Arizona senator said he's breaking with a party that's “largely out of touch with where your average Latino is.”  —  Ruben Gallego didn't run to be the next John McCain or Kyrsten Sinema … ",
    "url": "https://www.politico.com/news/2025/01/20/ruben-gallego-democrats-trump-00001925"
  },
  {
    "text": "Senators receive affidavit containing new allegations against Pete Hegseth, who denies the claims  —  The former sister-in-law of Trump's defense secretary pick said that Hegseth made his second wife fear for her safety.  Hegseth's second wife said, “There was no physical abuse in my marriage.”",
    "url": "https://www.nbcnews.com/politics/national-security/senators-received-affidavit-containing-new-allegations-pete-hegseth-de-rcna188342"
  },
  {
    "text": "Coast Guard Commandant terminated over border lapses, recruitment, DEI focus: official  —  Senior DHS official confirms to Fox News Digital Coast Guard Adm. Linda Fagan has been relieved of her post  —  EXCLUSIVE: The Commandant of the U.S. Coast Guard has been terminated over concerns about the border … ",
    "url": "https://www.foxnews.com/politics/coast-guard-commandant-terminated-over-border-lapses-recruitment-dei-focus-official"
  },
  {
    "text": "Trump signs order seeking to rename Alaska's Denali and the Gulf of Mexico  —  President Donald Trump said the Gulf of Mexico will be called Gulf of America, while the Denali mountain peak will revert to its old name, Mount McKinley.  —  President Donald Trump on Monday issued … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/21/trump-gulf-of-america-mexico-denali-mckinley/"
  },
  {
    "text": "Restoring Names That Honor American Greatness  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose and Policy.  It is in the national interest to promote the extraordinary heritage … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/restoring-names-that-honor-american-greatness/"
  },
  {
    "text": "Trump terminates John Bolton's security detail within hours of taking office  —  Within hours of taking office, President Donald Trump terminated the Secret Service detail that was assigned to his former national security adviser John Bolton, Bolton confirmed to CNN on Tuesday.",
    "url": "https://www.cnn.com/2025/01/21/politics/john-bolton-security-detail-trump"
  },
  {
    "text": "Pritzker attacks Trump over birthright citizenship order: It's ‘chaos’  —  CHICAGO — Illinois Gov. JB Pritzker launched an attack on President Donald Trump's planned executive order attempting to revoke birthright citizenship.  “That's unconstitutional.  We will not follow an unconstitutional order … ",
    "url": "https://www.politico.com/live-updates/2025/01/20/donald-trump-inauguration-day-news-updates-analysis/pritzker-trump-birthright-citizenship-00199472"
  },
  {
    "text": "Musk responds to backlash over gesture at Trump rally  —  Elon Musk has caused outrage over a one-armed gesture he gave during a speech celebrating the inauguration of Donald Trump.  —  Musk thanked the crowd for “making it happen”, before placing his right hand over his heart and then thrusting … ",
    "url": "https://www.bbc.com/news/articles/cy48v1x4dv4o"
  },
  {
    "text": "America's second Paris withdrawal is not like the first … - There may be sufficient momentum now in both the Paris regime as well as the burgeoning clean energy sector that this will make only a symbolic difference. … - Last time the U.S. left, no other country followed that move.",
    "url": "https://www.axios.com/2025/01/21/us-paris-withdrawal-effects-second-time"
  },
  {
    "text": "Instagram hides search results for ‘Democrats’  —  Meta says its working urgently to fix a problem with Instagram which results in a “results hidden” message when users search for the terms “Democrat” or “Democrats”.  —  Some social media users have accused the company of political bias … ",
    "url": "https://www.bbc.com/news/articles/c4g32yxpdz0o"
  },
  {
    "text": "DEFENDING WOMEN FROM GENDER IDEOLOGY EXTREMISM AND RESTORING BIOLOGICAL TRUTH TO THE FEDERAL GOVERNMENT  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, including section 7301 of title 5, United States Code, it is hereby ordered:",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/defending-women-from-gender-ideology-extremism-and-restoring-biological-truth-to-the-federal-government/"
  },
  {
    "text": "Trump to announce up to $500 billion in private sector AI infrastructure investment  —  President Trump is set to announce billions of dollars in private sector investment to build artificial intelligence infrastructure in the United States, CBS News has learned.",
    "url": "https://www.cbsnews.com/news/trump-announces-private-sector-ai-infrastructure-investment/"
  },
  {
    "text": "Designating Cartels And Other Organizations As Foreign Terrorist Organizations And Specially Designated Global Terrorists  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, including the Immigration and Nationality Act (INA) … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/designating-cartels-and-other-organizations-as-foreign-terrorist-organizations-and-specially-designated-global-terrorists/"
  },
  {
    "text": "No Time for Wonkery  —  This is hell, nor are we out of it  —  Donald Trump's second inaugural speech was as vile as expected, but also surprisingly dull.  —  OK, I guess his promise to take back the Panama Canal was a bit exciting.  But nobody took him seriously.",
    "url": "https://paulkrugman.substack.com/p/no-time-for-wonkery"
  },
  {
    "text": "Time to Admit It: Trump Is a Great President.  He's Still Trying To Be a Good One.  —  The most consequential presidents divided the nation—before “reuniting it on a new level of understanding.”  —  Donald J. Trump in his second inaugural address was everything his supporters hoped he would be … ",
    "url": "https://www.politico.com/news/magazine/2025/01/21/harris-column-trump-great-president-00199564"
  },
  {
    "text": "Sheinbaum Calls for ‘Cool Head’ as Trump Sends Peso Tumbling  — Trump tariff pledge reignites fears he'll target Mexico  — Sheinbaum says she's focused on details rather than rhetoric  —  President Claudia Sheinbaum called for cool heads to prevail after Donald Trump's vow … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-21/mexico-must-keep-cool-head-on-trump-orders-sheinbaum-says-m66jyfvz"
  },
  {
    "text": "Federal Workers Sue Trump Administration Over Schedule F Executive Order  —  Amid a flurry of executive orders President Donald Trump signed in the first few hours of retaking the White House is one that strips employment protections for tens of thousands of federal workers.",
    "url": "https://www.democracydocket.com/news-alerts/federal-workers-sue-trump-administration-over-schedule-f-executive-order/"
  },
  {
    "text": "Distorting Trump's Language  —  In the flurry of boasts, exaggerations, and untruths that President Trump emitted during yesterday's Inaugural Address, he made evident his intention to turn reality on its head.  Taking his predecessor's successes in reducing crime, increasing oil and gas production … ",
    "url": "https://contrarian.substack.com/p/distorting-trumps-language"
  }
]