[
  {
    "text": "New Polling Shows the Real Fallout From the Trump Conviction  —  A new POLITICO Magazine/Ipsos poll shows that Trump's criminal conviction hurts him with independents.  —  Donald Trump's criminal conviction didn't instantly upend the 2024 presidential race.  But the results of a new poll should be worrying for Trump.",
    "url": "https://www.politico.com/news/magazine/2024/06/17/trouble-for-trump-in-a-new-poll-on-his-conviction-00163498"
  },
  {
    "text": "The 2024 ‘Deciders’: Who are they and what makes them tick? … RiKi Denning is, by her own account, “torn up” about the November election.  She is almost certain she will cast a ballot but just might leave the presidential line blank.  “I just hate both of the candidates and there's … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/17/deciders-2024-election-poll/"
  },
  {
    "text": "J.D. Vance for Trump's VP?  Here are the pros and cons of the 8 candidates on his shortlist  —  The former president is expected to announce his selection next month.  —  Donald Trump Jr. is urging his dad to pick a “fighter” as his running mate.  The elder Trump is locked in a general election … ",
    "url": "https://www.politico.com/news/2024/06/17/trump-vp-pick-list-pros-cons-00162820"
  },
  {
    "text": "A tradwife drops a racist slur: Why the right's trolling economy made Lilly Gaddis' rise inevitable  —  Cashing in as a “cancel culture” martyr is getting harder, so attention addicts have to get more extreme  —  Let's stipulate up front that it is theoretically possible that Lilly Gaddis … ",
    "url": "https://www.salon.com/2024/06/17/a-tradwife-drops-a-slur-why-the-rights-trolling-economy-made-lilly-gaddis-rise-inevitable/"
  },
  {
    "text": "U.S. faces “serious threat” of terror attack, expert and former CIA chief warn … - Now, similar warnings are popping up from FBI director Chris Wray and Army Gen. Erik Kurilla — the commander of CENTCOM, which includes the Middle East. … - Over that time, terrorism has faded as a national fixation.",
    "url": "https://www.axios.com/2024/06/17/us-terrorist-attack-morell-allison"
  },
  {
    "text": "Trials reveal depths of Bidens' family tragedy … - When Biden declared for president in 2019, his family was plagued by addiction, grief and soap opera levels of drama, the legal cases involving his son Hunter and daughter Ashley have shown.  — It's affected the president … ",
    "url": "https://www.axios.com/2024/06/17/biden-hunter-family-election-2024"
  },
  {
    "text": "How Alex Jones dodged accountability again  —  A leading purveyor of hate keeps gaming the legal system. … Judge Christopher Lopez last Friday booted Infowars out of bankruptcy.  It was mostly a win for hate purveyor Alex Jones, who within hours of the December 14, 2012 … ",
    "url": "https://www.publicnotice.co/p/alex-jones-judge-lopez-inforwars-bankruptcy"
  },
  {
    "text": "Surgeon General: Why I'm Calling for a Warning Label on Social Media Platforms  —  One of the most important lessons I learned in medical school was that in an emergency, you don't have the luxury to wait for perfect information.  You assess the available facts, you use your best judgment, and you act quickly.",
    "url": "https://www.nytimes.com/2024/06/17/opinion/social-media-health-warning.html"
  },
  {
    "text": "Maryland governor to pardon 175,000 marijuana convictions in sweeping order  —  The blanket pardon by Gov. Wes Moore is among the country's most far reaching and will forgive decades of low-level marijuana possession charges for an estimated 100,000 people.  —  Maryland Gov. Wes Moore … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/06/16/maryland-mass-pardon-marijuana-conviction/"
  },
  {
    "text": "White House Fumes at Trumpworld's Latest ‘Cheap Fake’ Video  —  NOT AGAIN!  —  Another deceptively cut video of President Joe Biden is being circulated by right-wing pundits and media outlets-and the White House is not happy.  —  Less than a week after being derided for using … ",
    "url": "https://www.thedailybeast.com/no-president-biden-didnt-freeze-at-star-studded-hollywood-fundraiser"
  },
  {
    "text": "Hochul's bet against congestion pricing is backfiring  —  Blocking an unpopular New York City toll program has alienated many of the governor's key supporters.  —  NEW YORK — Gov. Kathy Hochul is facing political consequences for her congestion pricing reversal.",
    "url": "https://www.politico.com/news/2024/06/17/hochul-congestion-pricing-problems-00163601"
  },
  {
    "text": "Sinclair floods local news websites with hundreds of deceptive articles about Biden's mental fitness  —  This month, Sinclair Broadcast Group has flooded a vast network of local news websites with misleading articles suggesting that President Biden is mentally unfit for office.",
    "url": "https://popular.info/p/sinclair-floods-local-news-websites"
  },
  {
    "text": "Russia Sets Hearing as It Moves Toward Trial of Falsely Accused WSJ Reporter Evan Gershkovich  —  U.S. citizen has been held in Moscow's Lefortovo prison for more than a year  —  A Russian court said judicial proceedings in the case of Evan Gershkovich, the Wall Street Journal reporter held … ",
    "url": "https://www.wsj.com/world/russia/russia-sets-hearing-as-it-moves-toward-trial-of-falsely-accused-wsj-reporter-evan-gershkovich-d579e708"
  },
  {
    "text": "President Biden and Barack Obama Rip Donald Trump During Starry L.A. Fundraiser  —  Los Angeles Democrats and Hollywood stars like George Clooney, Julia Roberts and Barbra Streisand came out in full force on Saturday night for a record-setting fundraiser for Biden's reelection campaign.",
    "url": "https://www.hollywoodreporter.com/news/politics-news/biden-los-angeles-fundraiser-obama-kimmel-1235923818/"
  },
  {
    "text": "Trump unleashed: This is the calm before the storm  —  We will look back at these months before the election and Donald Trump's sentencing as relatively good times  —  Donald Trump is unleashed.  —  Following his historic felony conviction in New York for election interference, the former president has become even more dangerous.",
    "url": "https://www.salon.com/2024/06/17/unleashed-this-is-the-calm-before-the-storm/"
  },
  {
    "text": "Half of the U.S. military bases nationwide are in ‘health care deserts’  —  For hundreds of thousands of U.S. troops and their families, when the Pentagon orders them to find health care off base there is none.  —  An NPR analysis found that 50% of active duty military installations stand … ",
    "url": "https://www.npr.org/2024/06/17/g-s1-4187/military-bases-shortage-health-care-troops-army-navy-marines"
  }
]