[
  {
    "text": "Jack Smith Wants Trump Convicted by Super Tuesday  —  The Department of Justice is suggesting that Trump's trial for trying to overturn the 2020 election should begin on Jan. 2, 2024—and last no more than six weeks.  —  Special Counsel Jack Smith's office wants to put former President Donald Trump … ",
    "url": "https://www.thedailybeast.com/jack-smith-wants-trump-convicted-by-super-tuesday"
  },
  {
    "text": "Trump confronted on golf course about no-showing Florida court appearance  —  Trump told the judge in court papers last week he is not guilty and waived his right to appear at the hearing  —  FIRST ON FOX: Former President Donald Trump said Thursday he didn't think it was “necessary” … ",
    "url": "https://www.foxnews.com/politics/trump-confronted-golf-course-no-showing-florida-court-appearance"
  },
  {
    "text": "Trump's Truth Social tipped FBI to man killed during arrest attempt for Biden threats  — The social media company owned by former President Donald Trump in March tipped off the FBI about threats made by a Utah man who was fatally shot Wednesday by FBI agents as they attempted to arrest him for threatening to kill President Joe Biden.",
    "url": "https://www.cnbc.com/2023/08/10/trumps-truth-social-tipped-fbi-to-man-killed-during-arrest-attempt-for-biden-threats.html"
  },
  {
    "text": "Conservative Case Emerges to Disqualify Trump for Role on Jan. 6  —  Two law professors active in the Federalist Society wrote that the original meaning of the 14th Amendment makes Donald Trump ineligible to hold government office.  —  Reporting from Washington",
    "url": "https://www.nytimes.com/2023/08/10/us/trump-jan-6-insurrection-conservatives.html"
  },
  {
    "text": "GOP Oversight Chairman Comer vows to subpoena the Biden family  —  Comer's promise follows a Republican-led investigation that has largely focused on Hunter Biden's foreign business dealings but shown no direct links to the president.  —  WASHINGTON — House Oversight Committee James Comer … ",
    "url": "https://www.nbcnews.com/politics/congress/oversight-chairman-comer-threatens-subpoenas-biden-family-rcna99313"
  },
  {
    "text": "DeSantis suggests he would use drone strikes against drug cartels  —  Republican presidential candidate Gov. Ron DeSantis (Fla.) said he would use “whatever force we need to” to take down Mexican drug cartels if elected president, with or without help from the Mexican government.",
    "url": "https://thehill.com/homenews/campaign/4148271-desantis-suggests-use-drone-strikes-against-drug-cartels/"
  },
  {
    "text": "Republicans slam Biden's deal to free Americans in Iran as ‘appeasement’  —  The plan, now unfolding, involves a prisoner exchange and giving Tehran regulated access to billions of dollars.  —  Republicans on key foreign policy panels are criticizing an unfolding plan that would release Americans imprisoned … ",
    "url": "https://www.politico.com/news/2023/08/10/republicans-biden-iran-00110737"
  },
  {
    "text": "GOP presidential candidate says rivals who don't make the debate stage should drop out  —  Fox News is hosting the first Republican presidential nomination debate on August 23 in Milwaukee, Wisconsin  —  MANCHESTER, N.H. - Former New Jersey Gov. Chris Christie has a blunt suggestion … ",
    "url": "https://www.foxnews.com/politics/gop-presidential-candidate-says-rivals-dont-make-debate-stage-should-drop-out"
  },
  {
    "text": "Maui fire deaths surge to 53 and likely to go higher, governor says.  Over 1,000 structures burned  —  The search of the wildfire wreckage on the Hawaiian island of Maui is revealing a wasteland of burned out homes and obliterated communities as firefighters battle the stubborn blaze that has already claimed 36 lives.",
    "url": "https://apnews.com/article/hawaii-wildfire-maui-lahaina-f5a7047d407f836f89e90dd7f10faa94"
  },
  {
    "text": "Research Firm Says Proud Boys Legal Team Stiffed Them $30,000  —  A lingering legal fight from the Jan. 6 attack gives new insight into the Proud Boys' seditious conspiracy case.  —  A seditious conspiracy trial for members of the Proud Boys is over.  But a legal loose end from the case … ",
    "url": "https://www.thedailybeast.com/research-firm-says-proud-boys-legal-team-stiffed-them-dollar30000"
  },
  {
    "text": "Tommy Tuberville: Florida's third senator?  —  The Fact Checker  —  “Tuberville lives in Auburn, Alabama, with his wife Suzanne.”  — website of Sen. Tommy Tuberville (R-Ala.)  —  In late June, Tommy Tuberville traveled to the Wiregrass region of Alabama, which borders Florida.",
    "url": "https://www.washingtonpost.com/politics/2023/08/10/tommy-tuberville-floridas-third-senator/"
  },
  {
    "text": "Miscommunication between pilots caused United plane to drop near ocean's surface, investigation finds  —  The crew failed to manage the plane's path, airspeed and nose direction after the mix-up, the NTSB said in its report.  No one was injured.  —  Federal investigators said Thursday … ",
    "url": "https://www.nbcnews.com/news/us-news/miscommunication-pilots-caused-united-plane-drop-oceans-surface-invest-rcna99374"
  },
  {
    "text": "White House asks Congress for $40B in additional funding  —  The White House on Thursday outlined a supplemental funding request for Congress for the start of the coming fiscal year, asking for billions more dollars for assistance to Ukraine amid its war with Russia as well as money … ",
    "url": "https://thehill.com/homenews/administration/4147785-white-house-asks-congress-for-40b-in-additional-funding/"
  },
  {
    "text": "Trump adviser groped 2 women in 2021 at Scottsdale club, one tells police  —  A woman says Boris Epshteyn, a special adviser to Donald Trump, repeatedly groped her and her sister inside a Scottsdale nightclub in 2021, according to police body camera footage obtained by The Arizona Republic.",
    "url": "https://www.azcentral.com/story/news/politics/elections/2023/08/10/trump-adviser-boris-epshteyn-groped-2-women-in-scottsdale-one-says/70562482007/"
  },
  {
    "text": "South Africa's Zuma appears at prison, released under remission process  —  South Africa's former president Jacob Zuma appeared at the Estcourt correctional facility on Friday morning and was released under a remission process, a senior prisons official said.",
    "url": "https://www.reuters.com/world/africa/south-africas-zuma-appears-prison-released-under-remission-process-2023-08-11/"
  },
  {
    "text": "Supreme Court pauses Purdue Pharma bankruptcy deal  —  The Supreme Court on Thursday agreed to consider the Biden administration's challenge to a bankruptcy settlement for Purdue Pharma, pausing the $6 billion deal over the administration's concerns about a provision that would shield the members … ",
    "url": "https://thehill.com/regulation/court-battles/4148000-supreme-court-pauses-purdue-pharma-bankruptcy-deal/"
  },
  {
    "text": "Joe Manchin says he's thinking ‘seriously’ about becoming an independent  —  Sen. Joe Manchin III, a centrist West Virginia Democrat who has at times sparred with his party, said Thursday that he has “seriously” considered leaving the Democratic Party ahead of the 2024 election.",
    "url": "https://www.washingtonpost.com/politics/2023/08/10/joe-manchin-says-hes-thinking-seriously-about-becoming-an-independent/"
  },
  {
    "text": "Recordings show Va. swing district candidate favors ‘total ban’ on abortion  —  RICHMOND — John Stirrup has been playing up crime, taxes and other bread-and-butter issues while running for the House of Delegates in a purple Northern Virginia district, but the Republican didn't mince words … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/08/10/abortion-ban-virginia-elections-stirrup/"
  },
  {
    "text": "California Democrat suspends congressional campaign due to ‘lack of joy’  —  Democratic House candidate Aditya Pai — running for Rep. Michelle Steel's (R-Calif.) seat — announced Thursday that he is suspending his campaign, citing a “lack of joy.”  —  “I'm writing to announce the suspension … ",
    "url": "https://thehill.com/homenews/campaign/4147739-california-democrat-suspends-congressional-campaign-due-to-lack-of-joy/"
  },
  {
    "text": "Ron DeSantis is running for president but doesn't believe in democracy  —  Republican Florida Gov. Ron DeSantis is staying in the presidential race because he thinks he's the best bet for the Republican Party if Donald Trump can't be the nominee.  He can't defeat Trump because he's … ",
    "url": "https://www.lawdork.com/p/ron-desantis-is-running-for-president"
  },
  {
    "text": "West Virginia man arrested for threatening Pittsburgh federal jury  —  For Immediate Release  —  U.S. Attorney's Office, Northern District of West Virginia  —  WHEELING, WEST VIRGINIA - A Follansbee, West Virginia, man was arrested today on criminal charges related to his alleged obstruction and witness tampering in a federal trial.",
    "url": "https://www.justice.gov/usao-ndwv/pr/west-virginia-man-arrested-threatening-pittsburgh-federal-jury"
  },
  {
    "text": "Dems revive calls for Clarence Thomas resignation after new report  —  The new ProPublica report reveals a higher number of unreported gifts from billionaire benefactors than was previously known.  —  Democratic lawmakers revived their calls for Supreme Court Justice Clarence Thomas to resign … ",
    "url": "https://www.politico.com/news/2023/08/10/propublica-clarence-thomas-supreme-court-00110654"
  }
]