[
  {
    "text": "How Trump's Verbal Slips Could Weaken His Attacks on Biden's Age  —  Donald Trump, 77, has relentlessly attacked President Biden, 80, as too old for office.  But the former president himself has had a series of gaffes that go beyond his usual freewheeling style.",
    "url": "https://www.nytimes.com/2023/10/30/us/politics/trump-biden-age.html"
  },
  {
    "text": "Ex-North Dakota Lawmaker Accused Of Flying To Prague To Rape Minor  —  Ex-Republican state Sen. Ray Holmberg is facing federal charges for intent to rape a minor and receiving images depicting child sexual abuse.  —  A former longtime North Dakota lawmaker is charged with traveling to Prague … ",
    "url": "https://www.huffpost.com/entry/ap-us-former-legislator-indicted-north-dakota_n_653ff3dee4b0a78a26a44b60"
  },
  {
    "text": "Former state senator Ray Holmberg indicted, arrested on federal child porn charges  —  GRAND FORKS, N.D. (KFGO) - Ray Holmberg, who was North Dakota's - and one of the country's - longest-serving state senators until he resigned last spring, has been indicted on federal charges of travel … ",
    "url": "https://kfgo.com/2023/10/30/917202/"
  },
  {
    "text": "Mike Johnson's Wife Takes Down Website That Compared Being Gay To Bestiality, Incest  —  HuffPost first reported on Kelly Johnson's counseling service that likens LGBTQ+ people to people who have sex with animals and family members.  —  LOADING  —  House Speaker Mike Johnson's wife took … ",
    "url": "https://www.huffpost.com/entry/mike-johnson-wife-website-homosexuality-bestiality-incest_n_653fd7a9e4b0ae2dc0b49d17"
  },
  {
    "text": "Vivek Ramaswamy's Unfavorable Rating Surges in Iowa as Voters Get to Know Him  —  A new poll from NBC News and the Des Moines Register, long considered the gold standard in the Hawkeye State, shows that the more voters get to know Vivek Ramaswamy, the less inclined they are to like him.",
    "url": "https://www.mediaite.com/politics/vivek-ramaswamys-unfavorable-rating-surges-in-iowa-as-voters-get-to-know-him/"
  },
  {
    "text": "Ivanka Trump Helped Her Dad Lie About His Net Worth  —  When Ivanka Trump takes the stand in her father's fraud case, she should have plenty to talk about.  —  Ivanka Trump is expected to testify on Friday in a $250 million fraud case that the New York attorney general is waging against her father and his associates.",
    "url": "https://www.forbes.com/sites/danalexander/2023/10/30/ivanka-trump-helped-her-dad-lie-about-his-net-worth/"
  },
  {
    "text": "Judge Postpones Ivanka Trump's Testimony For a Few Days in Civil Fraud Trial  —  The former president's daughter is now scheduled to take the witness stand on Wednesday, Nov. 8 — instead of this coming Friday  —  JWPlayer  —  Ivanka Trump's testimony in her family's civil fraud trial … ",
    "url": "https://themessenger.com/politics/ivanka-trump-testimony-postponed-civil-fraud-case"
  },
  {
    "text": "Antisemitic mob storms through Russian airport as flight from Tel Aviv lands  —  An angry crowd in Russia's mostly Muslim region of Dagestan stormed an airport where a flight from Israel arrived on Sunday, forcing authorities to close the facility and divert flights.",
    "url": "https://www.cnn.com/2023/10/30/europe/russia-dagestan-airport-anti-israel-intl-hnk/"
  },
  {
    "text": "Ron DeSantis Turns Down Chance To Squash Lifted Shoe Speculation  —  People have been trolling the Florida governor and GOP presidential candidate by claiming his signature cowboy boots have hidden heels.  —  LOADING  —  It looks like Florida Gov. Ron DeSantis can't sidestep ridiculous rumors about his height much longer.",
    "url": "https://www.huffpost.com/entry/ron-desantis-dismisses-heel-boot-rumor_n_65402831e4b0a78a26a470a8"
  },
  {
    "text": "Democrat drops out of Missouri Senate race, challenges Cori Bush for House seat  —  Missouri U.S. Senate candidate Wesley Bell (D) announced Monday he is dropping out of the state's Senate race and will instead challenge Missouri Rep. Cori Bush (D) in the House.",
    "url": "https://thehill.com/homenews/campaign/4283766-democrat-drops-out-of-missouri-senate-race-challenges-cori-bush-for-house-seat/"
  },
  {
    "text": "Outraised and embattled, Lauren Boebert heads back to Colorado with a revamped campaign strategy  —  Retreating from the turmoil in Washington, D.C., Rep. Lauren Boebert arrived in bucolic southwest Colorado to turmoil of a different sort — the lingering impact of an embarrassing moment … ",
    "url": "https://apnews.com/article/boebert-gop-voters-campaign-apology-reelection-frisch-af8cf7cb563e6b97bc75f3e8b849281c"
  },
  {
    "text": "Executive Order on the Safe, Secure, and Trustworthy Development and Use of Artificial Intelligence  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered as follows:  —  Section 1.  Purpose.",
    "url": "https://www.whitehouse.gov/briefing-room/presidential-actions/2023/10/30/executive-order-on-the-safe-secure-and-trustworthy-development-and-use-of-artificial-intelligence/"
  },
  {
    "text": "Las Vegas man charged after making antisemitic threats to Nevada senator  —  John Anthony Miller was arrested Thursday and appeared in federal court a day later in connection with the one count of threatening a federal official, the Justice Department said.  —  A Nevada man has been charged … ",
    "url": "https://www.nbcnews.com/politics/congress/las-vegas-man-charged-making-antisemitic-threats-nevada-senator-rcna122866"
  },
  {
    "text": "White House shoots down GOP funding bills  —  The Big Story  —  Biden fires veto warning to House GOP on funding  —  The White House is threatening to veto House Republican funding bills as the party moves quickly to pass partisan spending plans.",
    "url": "https://thehill.com/newsletters/business-economy/4284280-white-house-shoots-down-gop-funding-bills/"
  },
  {
    "text": "‘Medical emergency’ leads to another short-handed military post due to Tuberville protest  —  The nation's top Marine has been hospitalized due to a “medical emergency,” officials say, leaving a three-star ranked leader to take charge thanks to a stalled confirmation process led by Sen. Tommy Tubervile over the Corps' abortion policy.",
    "url": "https://www.rawstory.com/tommy-tuberville-marine-corps/"
  },
  {
    "text": "Antisemitic threats to our community  —  Dear members of the Cornell community,  —  Earlier today, a series of horrendous, antisemitic messages threatening violence to our Jewish community and specifically naming 104 West — the home of the Center for Jewish Living — was posted on a website unaffiliated with Cornell.",
    "url": "https://statements.cornell.edu/2023/20231029-antisemitic-threats.cfm"
  },
  {
    "text": "White House details draft plans for next student debt relief plan  —  The draft regulatory plans outline what are essentially four separate student debt relief programs for different categories of borrowers.  —  President Joe Biden is considering canceling student debt for borrowers whose balances … ",
    "url": "https://www.politico.com/news/2023/10/30/white-house-next-student-debt-relief-plan-00124351"
  },
  {
    "text": "Far-right German politician arrested after ‘Sieg Heil’ salutes heard  —  Banned totalitarian symbols found at fraternity of Daniel Halemba, 22, who takes up seat in Bavarian legislature on Thursday  —  A legislator with the far-right Alternative für Deutschland (AfD) … ",
    "url": "https://www.theguardian.com/world/2023/oct/30/far-right-german-politician-arrested-after-sieg-heil-salutes-heard"
  },
  {
    "text": "‘Be looking over your shoulder’: MAGA man arrested for threats against Fani Willis  —  A 59-year-old supporter of Donald Trump has been arrested for threats against Fulton County District Attorney Fani Willis and Fulton County Sheriff Pat Labat, Atlanta Journal-Constitution reporter Tamar Hallerman posted on social media Monday.",
    "url": "https://www.rawstory.com/fani-willis-maga-trump-threats/"
  },
  {
    "text": "‘This war is prophetically significant’: why US evangelical Christians support Israel  —  One strand of evangelical theology holds that the return of Jews to the region starts the clock ticking on a seven-year armageddon, after which Jesus Christ will return",
    "url": "https://www.theguardian.com/world/2023/oct/30/us-evangelical-christians-israel-hamas-war"
  },
  {
    "text": "U.S. Department of Education Announces Withholding of Payment to Student Loan Servicer as Part of Accountability Measures for Harmed Borrowers  —  Contact:  Press Office, (202) 401-1576, press@ed.gov  —  U.S. Secretary of Education Miguel Cardona and Federal Student Aid (FSA) … ",
    "url": "https://www.ed.gov/news/press-releases/us-department-education-announces-withholding-payment-student-loan-servicer-part-accountability-measures-harmed-borrowers"
  }
]