[
  {
    "text": "GOP Senator Flames Dems for ‘Cheating’ and Voting ‘Drunk’  —  “And don't tell me you haven't seen it, because I know you have,” the Republican senator said.",
    "url": "https://www.thedailybeast.com/gop-senator-markwayne-mullin-flames-dems-for-cheating-and-voting-drunk-during-pete-hegseth-hearing/"
  },
  {
    "text": "The Pressure Campaign to Get Pete Hegseth Confirmed as Defense Secretary  —  Supporters of Donald Trump's nominee have intimidated potential witnesses and suppressed the F.B.I. background check of the former Fox News host in the run-up to his Senate hearing.",
    "url": "https://www.newyorker.com/news/the-lede/the-pressure-campaign-to-get-pete-hegseth-confirmed-as-defense-secretary"
  },
  {
    "text": "Former Fox anchor Gretchen Carlson makes request ahead of hearing  —  Former Fox News anchor Gretchen Carlson and her nonprofit group sent a letter yesterday asking the Senate Armed Services Committee to allow an alleged victim of sexual assault to testify anonymously at Hegseth's confirmation hearing.",
    "url": "https://www.nbcnews.com/politics/congress/live-blog/senate-confirmation-hearings-live-updates-pete-hegseth-first-trump-cab-rcna186867/rcrd68168"
  },
  {
    "text": "The Situation: The Cult of Unqualified Authenticity  —  On Pete Hegseth and the first hearing for a Trump nominee for a major cabinet position  —  Meet The Authors  —  Published by The Lawfare Institute in Cooperation With  —  The Situation on Friday reflected on the sentencing of Donald Trump in New York.",
    "url": "https://www.lawfaremedia.org/article/the-situation--the-cult-of-unqualified-authenticity"
  },
  {
    "text": "Special Counsel Report Says Trump Would Have Been Convicted in Election Case  —  “But for Mr. Trump's election and imminent return to the presidency, the office assessed that the admissible evidence was sufficient to obtain and sustain a conviction at trial,” the report said.",
    "url": "https://www.nytimes.com/2025/01/14/us/politics/trump-special-counsel-report-election-jan-6.html?unlocked_article_code=1.pE4.qEsJ.JEVOGbzuKumK&smid=url-share"
  },
  {
    "text": "The Most Damning Lines in Jack Smith's Brutal Trump January 6 Report  —  Special counsel Jack Smith did not hold back in his final report on the investigation into Donald Trump's attempt to overturn the 2020 election.  —  While much of it contains information already made public … ",
    "url": "https://newrepublic.com/post/190190/jack-smith-trump-january-6-report"
  },
  {
    "text": "A Contrarian Take on Volume One of Jack Smith's Report  —  The fact that we are already familiar with almost all of the facts in the first volume of Jack Smith's final report on January 6th and Donald Trump's attempted self-coup, makes them no less horrifying.",
    "url": "https://contrarian.substack.com/p/a-contrarian-take-on-volume-one-of"
  },
  {
    "text": "Michelle Obama will skip Trump inauguration, but ex-Presidents Obama, Clinton and Bush will be there  —  Former first lady Michelle Obama will skip the inauguration of President-elect Donald Trump, the second time in two weeks that she is not attending a gathering of former U.S. leaders and their spouses … ",
    "url": "https://apnews.com/article/trump-inauguration-obama-bush-clinton-f7212766dc0f69444d8a4537a736c2d2"
  },
  {
    "text": "Michelle Obama Will Skip Trump's Inauguration  —  Mrs. Obama also declined to attend the funeral of Jimmy Carter last week, which would have put her face-to-face with Mr. Trump.  —  Michelle Obama, the former first lady, will not attend the inauguration of President-elect Donald J. Trump, her office said in a statement on Tuesday.",
    "url": "https://www.nytimes.com/2025/01/14/us/politics/michelle-obama-trump-inauguration.html"
  },
  {
    "text": "Elon Musk, Jeff Bezos and Mark Zuckerberg to attend Trump's inauguration  —  The three will be seated together on the inauguration platform with other prominent guests.  —  Elon Musk, Jeff Bezos and Mark Zuckerberg will attend President-elect Donald Trump's inauguration on Monday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/elon-musk-jeff-bezos-mark-zuckberg-trump-inauguration-rcna187629"
  },
  {
    "text": "Certification of Rescission of Cuba's Designation as a State Sponsor of Terrorism  —  Certification of Rescission of Cuba's Designation  —  Pursuant to the Constitution and the laws of the United States, and consistent with sections 1754(c) and 1768(c) of the National Defense Authorization Act … ",
    "url": "https://www.whitehouse.gov/briefing-room/presidential-actions/2025/01/14/certification-of-rescission-of-cubas-designation-as-a-state-sponsor-of-terrorism/"
  },
  {
    "text": "Vice Is a Moat  —  1. Secretary Pete  —  Here is the thing about Pete Hegseth:  —  Imagine that his character was sterling.  That he was a fine, upstanding man, admired by all who know him.  That he had dedicated his life to service and been judged to be as good a human being as Mister Rogers or Dolly Parton.",
    "url": "https://www.thebulwark.com/p/vice-is-a-moat"
  },
  {
    "text": "Hegseth's Drinking, Once ‘Self-Medication,’ Could Prompt Questions at His Hearing  —  President-elect Donald J. Trump's pick for Defense Secretary has spoken candidly about his alcohol use in interviews over the past few years.  —  In August 2021, Pete Hegseth said on Will Cain's podcast that slowly … ",
    "url": "https://www.nytimes.com/2025/01/14/us/politics/pete-hegseth-drinking-alcohol.html?unlocked_article_code=1.pE4.GR1c.n93NFznvOudP&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Jan. 6 committee members talk to White House about pardons … In an interview, Rep. Bennie Thompson (D-Miss.), who chaired the Jan. 6 committee, said he spoke to the White House counsel's office last month about the issue.  Thompson noted that he hadn't talked directly with President Joe Biden on the topic … ",
    "url": "https://punchbowl.news/article/house/january-6-committee-members-talk-pardons/"
  },
  {
    "text": "Israel and Hamas agree in principle to ceasefire and hostage deal, sources say  —  A draft deal for a ceasefire in Gaza and hostage release has been agreed to in principle and, if all goes well, will be finalized by Israel and Hamas this week, Arab, U.S. and Israeli officials told CBS News.",
    "url": "https://www.cbsnews.com/news/israel-hamas-ceasefire-hostage-deal-agreement-in-principle/"
  },
  {
    "text": "Trump and DeSantis golf, with Rubio replacement looming  —  President-elect Donald Trump and Florida Gov. Ron DeSantis are meeting over a round of golf on Tuesday, as key decisions loom in the state they both call home.  The meetup is taking place as Trump backed DeSantis' recent call … ",
    "url": "https://www.politico.com/live-updates/2025/01/14/congress/trump-desantis-golf-rubio-replacement-00000396"
  },
  {
    "text": "I was fully indoctrinated into the Democrat ‘cult.’ Here's why I left my liberal influencer life behind to raise money for Trump  —  A former high energy Democratic fundraiser, failed congressional candidate and social media influencer is now raising money for President-elect Donald Trump's inaugural committee.",
    "url": "https://www.dailymail.co.uk/news/article-14278643/lindy-li-liberal-defected-democrat-cult-raising-money-trump.html"
  },
  {
    "text": "Speaker Orders Capitol Hill Flags Raised for Inauguration  —  President-elect Donald J. Trump had complained that flags were scheduled to fly at half-staff — a symbol of mourning for former President Jimmy Carter — on the day of his inauguration.  —  Speaker Mike Johnson on Tuesday announced … ",
    "url": "https://www.nytimes.com/2025/01/14/us/politics/mike-johnson-flags-trump-inauguration.html"
  },
  {
    "text": "Texas House elects new speaker in blow to far-right wing  —  The Texas House on Tuesday elected state Rep. Dustin Burrows (R) to lead the chamber in a blow to the rising far-right wing of the party, defeating a candidate supported by Texas Attorney General Ken Paxton (R) and other top state figures.",
    "url": "https://thehill.com/homenews/state-watch/5085530-texas-house-elects-new-speaker-blow-to-far-right-wing/"
  },
  {
    "text": "Iran ‘never’ plotted to kill Trump during campaign, Iran's president tells NBC News  —  The Justice Department in November charged an Iranian man in an alleged murder-for-hire plot to assassinate then-candidate Donald Trump and two others.  —  Iran “never” plotted to assassinate Donald Trump during … ",
    "url": "https://www.nbcnews.com/investigations/iran-never-plotted-kill-president-elect-donald-trump-irans-president-t-rcna187644"
  },
  {
    "text": "I have struggled with how to respond to Mark Zuckerberg and Facebook's descent into toxic masculinity and Neo-Nazi madness.  While I have thought about quitting Facebook, I find great value in the connections and friends I have here, and it doesn't seem fair that I should lose that because Zuckerberg is having a mid-life crisis.",
    "url": "https://www.linkedin.com/posts/marklemley_i-have-struggled-with-how-to-respond-to-mark-activity-7284685204676362241-7h9r"
  },
  {
    "text": "‘Days of thunder’: Steve Bannon on the second coming of the Trump administration  —  The former adviser sat for a wide-ranging interview with POLITICO this week.  —  Steve Bannon had some thoughts on what the next four years have in store for Donald Trump as he returns to the White House.",
    "url": "https://www.politico.com/news/2025/01/14/bannon-second-trump-administration-00198197"
  },
  {
    "text": "The Washington Post just endorsed 19 Trump nominees.  Here are the 5 worst.  —  Remember when Washington Post owner Jeff Bezos spiked the paper's planned editorial board endorsement of Kamala Harris and then Bezos piously insisted that endorsements demonstrate bias and his publisher William Lewis claimed … ",
    "url": "https://www.findinggravity.net/p/the-washington-post-just-endorsed"
  },
  {
    "text": "Kaine clashes with Hegseth over infidelity, drinking, scandals  —  Sen. Tim Kaine (D-Va.) clashed sharply with secretary of Defense nominee Pete Hegseth over his infidelity and reports of public drunkenness and drunkenness on the job, repeatedly pressing Hegseth on his character and judgment.",
    "url": "https://thehill.com/homenews/5084889-tim-kaine-pete-hegseth-hearing-infidelity/"
  }
]