[
  {
    "text": "A Constitutional Crisis Greater Than Watergate  —  Trump's nomination of Kash Patel threatens to turn the FBI into an instrument of personal presidential power.  —  For more than four decades before Donald Trump assumed the presidency, the FBI director was a position above politics.",
    "url": "https://www.theatlantic.com/politics/archive/2024/12/trumps-fbi-kash-patel/680840/"
  },
  {
    "text": "Republicans Stand Behind Trump's Choice of Kash Patel to Lead F.B.I.  —  Several lawmakers expressed support on Sunday for the president-elect's plan to install a loyalist who has vowed to use the position to exact revenge on adversaries.  —  Several Republican lawmakers fell in line … ",
    "url": "https://www.nytimes.com/2024/12/01/us/politics/trump-kash-patel-fbi-republicans.html"
  },
  {
    "text": "Kash Patel Would Bring Bravado and Baggage to F.B.I. Role  —  President-elect Donald J. Trump's choice to run the F.B.I. has a record in and out of government that is likely to raise questions during his Senate confirmation hearings.  —  Few people tapped for any top federal post … ",
    "url": "https://www.nytimes.com/2024/12/01/us/politics/kash-patel-bravado-baggage-fbi.html"
  },
  {
    "text": "Behind the Curtain: Trump's shock and awe … - Trump named real estate developer Charles Kushner — father of Trump's son-in-law, Jared — as ambassador to France. … - Less than six hours later, Trump announced he picked Kash Patel, one of the hardest of his first-term hardliners, as FBI director.",
    "url": "https://www.axios.com/2024/12/01/trump-cabinet-kash-patel-fbi"
  },
  {
    "text": "The Kash Patel Principle  —  Donald Trump has been releasing names of his nominees for the Cabinet and other senior posts in waves.  He began with some relatively conventional choices, and then unloaded one bombshell after another, perhaps in an attempt to paralyze opposition in the Senate … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/kash-patel-principle/680838/?gift=_IXYI0Wrwnxuvm7JZ0fMfLyMalbJhTJ1f4imheld7FU&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "President Biden set to issue a pardon of his son Hunter Biden  —  The president is expected to announce his decision Sunday night, according to a senior White House official.  —  WASHINGTON — President Joe Biden has decided to issue a pardon for his son Hunter and is expected to announce it Sunday night … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/joe-biden-issue-pardon-son-hunter-biden-rcna182369"
  },
  {
    "text": "Joe Biden pardons his son Hunter  —  The president had promised not to pardon Hunter Biden, who was convicted of gun-related charges and had pleaded guilty in a tax case.  —  President Joe Biden has pardoned his son Hunter, a controversial decision that reverses his long-standing pledge … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/01/hunter-biden-pardon/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMzMDI5MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM0NDExNTk5LCJpYXQiOjE3MzMwMjkyMDAsImp0aSI6IjFiZjNjZGUzLTU1M2EtNDBkNS1hNWUwLTc4MTJjNjYxMTFiMCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEyLzAxL2h1bnRlci1iaWRlbi1wYXJkb24vIn0.wDR5B7Va6DfPBILpasUZQCzM544s_elWQdvB92ojoas"
  },
  {
    "text": "Statement from President Joe Biden  —  Today, I signed a pardon for my son Hunter.  From the day I took office, I said I would not interfere with the Justice Department's decision-making, and I kept my word even as I have watched my son being selectively, and unfairly, prosecuted.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/01/statement-from-president-joe-biden-11/"
  },
  {
    "text": "Cheryl Hines sells products with naked RFK Jr. showering behind her  —  Actress Cheryl Hines, the wife of former independent presidential candidate Robert F. Kennedy Jr., posted a video promoting her beauty products featuring her husband showering half-naked in the background.",
    "url": "https://thehill.com/policy/healthcare/5016353-cheryl-hines-video-kennedy-shower/"
  },
  {
    "text": "Trump's Next Term Could See America's First True Oligarchs, Warns Democracy Activist Garry Kasparov  —  Elon Musk's DOGE plan could mix public and private interests in a way previously not seen in American politics, the former world chess champion said.  —  LOADING",
    "url": "https://www.huffpost.com/entry/trump-musk-america-oligarchs_n_6746b6efe4b0800c73f710a5"
  },
  {
    "text": "Biden decries ‘stigma’ and ‘misinformation’ on World AIDS Day  —  President Biden called for a fight against “stigma” and “misinformation” on World AIDS Day in remarks at the White House.  —  “We stand united in the fight against this epidemic,” Biden said Sunday.  “It matters, it matters. ...",
    "url": "https://thehill.com/policy/healthcare/5016799-biden-stigma-misinformation-world-aids-day/"
  },
  {
    "text": "Democrats Face an Existential Crisis on X  —  Conversations with a dozen insiders point to a party that is unsure about whether to leave or engage with the increasingly MAGA platform.  —  Two days after the election, Patrick Dillon, a longtime Democratic strategist and current Biden administration official … ",
    "url": "https://www.politico.com/news/magazine/2024/11/30/dems-leave-twitter-musk-00191755"
  },
  {
    "text": "Wisconsin Democratic Chair Says He Is the One to Revive a Distressed Party  —  Ben Wikler, who has led the Wisconsin Democratic Party since 2019, announced a bid to be national party chair with a platform to “unite, fight, win.”  —  Ben Wikler, the Wisconsin Democratic chairman … ",
    "url": "https://www.nytimes.com/2024/12/01/us/politics/ben-wikler-democratic-national-committee-wisconsin.html?unlocked_article_code=1.eE4.gNV6.LMZEyttmVIQL&smid=url-share"
  },
  {
    "text": "Trump and allies blur the lines between politician and influencer  —  The president-elect and some in his proposed Cabinet are adopting influencer tactics to hawk products, boost political points and promote their personal brands.  —  A few weeks before he was named to lead the Department … ",
    "url": "https://www.washingtonpost.com/technology/2024/12/01/trump-social-media-influencer-cabinet/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMzMDI5MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM0NDExNTk5LCJpYXQiOjE3MzMwMjkyMDAsImp0aSI6IjRlNTU5ZmIyLWY2MjctNDc4ZC1hNjhmLTQ1MzllODkyMzU5MiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjQvMTIvMDEvdHJ1bXAtc29jaWFsLW1lZGlhLWluZmx1ZW5jZXItY2FiaW5ldC8ifQ.2tC92jjg3M6Pnbrd1DMKkSWB8f2Qd46W0cnZZSEZn7M&itid=gfta"
  },
  {
    "text": "John Bolton compares Kash Patel to Soviet secret police leader  —  Former National Security Advisor John Bolton compared Kash Patel, President-elect Trump's nomination for head of FBI, to one of the USSR's most feared secret police chiefs, Lavrentiy Beria.  —  “Trump has nominated Kash Patel … ",
    "url": "https://thehill.com/homenews/sunday-talk-shows/5016380-john-bolton-compares-kash-patel-to-soviet-secret-police-leader/"
  },
  {
    "text": "Putin signs off record Russian defense spending as top EU officials visit Kyiv  —  Russian President Vladimir Putin approved budget plans, raising 2025 military spending to record levels as Moscow seeks to prevail in the war in Ukraine.  Around 32.5% of the budget posted on a government website Sunday … ",
    "url": "https://apnews.com/article/russia-ukraine-budget-defense-spending-putin-drone-3a1a73c559b250ec26190edd9332100c"
  },
  {
    "text": "Ex-Dem Rep Tim Ryan Warns On MSNBC His Own Party ‘Is Toxic’ To Voters: ‘What Are We Doing?’  —  Former Rep. Tim Ryan (D-OH) told MSNBC that Democrats need a complete “rebrand” and to find common ground with MAGA figures like Elon Musk.  —  Ryan joined MSNBC's The Weekend on Saturday and offered … ",
    "url": "https://www.mediaite.com/tv/ex-dem-rep-tim-ryan-warns-on-msnbc-his-own-party-is-toxic-to-voters-what-are-we-doing/"
  }
]