[
  {
    "text": "Trump campaign staff had altercation with official at Arlington National Cemetery  —  Two members of Donald Trump's campaign staff had a verbal and physical altercation Monday with an official at Arlington National Cemetery where the former president participated in a wreath laying ceremony, NPR has learned.",
    "url": "https://www.npr.org/2024/08/27/nx-s1-5091154/trump-arlington-cemetery"
  },
  {
    "text": "New federal indictment filed against Trump in federal Jan. 6 case  —  The superseding indictment brought by special counsel Jack Smith follows a historic Supreme Court ruling granting broad immunity to presidents for official acts.  —  Special counsel Jack Smith has filed a new indictment … ",
    "url": "https://www.washingtonpost.com/national-security/2024/08/27/trump-dc-indictment-new-charges-jan-6/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI0NzMxMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI2MTEzNTk5LCJpYXQiOjE3MjQ3MzEyMDAsImp0aSI6ImRmNThmNzM0LTcwMTQtNGU5NC05MDA1LTEyOWEzMzk0MTQ3NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI0LzA4LzI3L3RydW1wLWRjLWluZGljdG1lbnQtbmV3LWNoYXJnZXMtamFuLTYvIn0.T1RTMQOPlpCKKHBtnRCVXK2tCpj4jGeeyMHiMyDN5DA&itid=gfta"
  },
  {
    "text": "Trump charged in superseding indictment in election interference case following SCOTUS ruling  —  The new indictment adjusts the charges to the Supreme Court's immunity ruling.  —  LIVE  —  Republican presidential nominee, former President Donald Trump greets the crowd before speaking during … ",
    "url": "https://abcnews.go.com/Politics/donald-trump-charged-superseding-indictment-federal-election-subversion/story?id=113193224"
  },
  {
    "text": "Trump indicted again in election subversion case brought by Jack Smith  —  The 36-page indictment, secured Tuesday by special counsel Jack Smith, is an attempt by prosecutors to recalibrate the case.  —  A federal grand jury in Washington, D.C. has re-indicted Donald Trump on four felony charges related … ",
    "url": "https://www.politico.com/news/2024/08/27/trump-indicted-2020-election-subversion-00176503"
  },
  {
    "text": "Special counsel files reworked indictment against Donald Trump in January 6 case  —  Special counsel Jack Smith on Tuesday filed a superseding indictment in the election interference case against former President Donald Trump, slimming down the allegations against the 2024 presidential nominee … ",
    "url": "https://www.cnn.com/2024/08/27/politics/trump-superseding-indictment-january-6"
  },
  {
    "text": "Jack Smith Isn't Backing Down  —  After a Supreme Court ruling challenged his case, the special counsel filed a fresh indictment of Donald Trump.  —  When the Supreme Court ruled last month that presidents are immune from prosecution for anything done as an official act, many observers reacted with immediate horror.",
    "url": "https://www.theatlantic.com/politics/archive/2024/08/jack-smith-isnt-backing-down/679635/"
  },
  {
    "text": "Harris and Walz to sit with CNN for exclusive first joint interview since campaign began  —  Vice President Kamala Harris and Minnesota Gov. Tim Walz will sit with CNN for their first joint interview on Thursday as Democrats work to broaden their base's excitement from last week's Democratic National Convention.",
    "url": "https://www.cnn.com/2024/08/27/politics/kamala-harris-cnn-interview"
  },
  {
    "text": "Mark Zuckerberg's letter about Facebook censorship is not what it seems  —  This week Mark Zuckerberg sent Rep. Jim Jordan (R-OH) a letter outlining how the Biden administration pressured his company to “censor” free speech on Facebook — specifically misinformation about Covid-19.",
    "url": "https://www.vox.com/technology/369136/zuckerberg-letter-facebook-censorship-biden"
  },
  {
    "text": "'He's got to pay a price': Unaired footage reveals Nancy Pelosi's Jan. 6 fury  —  Previously unaired footage reviewed by POLITICO reveals how the former speaker quickly turned her focus to impeaching Donald Trump after Congress certified the 2020 election.  —  Nancy Pelosi spent the duration … ",
    "url": "https://www.politico.com/news/2024/08/27/nancy-pelosi-jan-6-fury-00176529"
  },
  {
    "text": "Kamala's Campaign Pushes Trump's Impulse Control Problems  —  I don't think that even the outlets that recognize the troll are giving the Kamala Harris campaign enough credit for the jujitsu they're engaged in with the debate.  Before I explain why, though, here's a video of Barack Obama's skewering … ",
    "url": "https://www.emptywheel.net/2024/08/27/kamalas-campaign-pushes-trumps-impulse-control-problems/"
  },
  {
    "text": "North Carolina Moves to Toss Up; Minnesota and New Hampshire Shift to Likely Democrat  —  Since the beginning of this cycle, Democrats were confident that President Joe Biden could win North Carolina.  Its demographic profile as an ethnically diverse and rapidly suburbanizing state looks similar … ",
    "url": "https://www.cookpolitical.com/analysis/national/national-politics/north-carolina-moves-toss-minnesota-and-new-hampshire-shift"
  },
  {
    "text": "Trump economic plans would cost more than $4 trillion over a decade  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/business/budget/4849727-trump-economic-proposals-deficit-analysis/"
  },
  {
    "text": "Robert F. Kennedy Jr. Sawed the Head Off a Whale and Drove It Home, Daughter Says  —  Three decades later, an environmental organization is calling for an investigation.  —  It is a violation of longstanding federal law to collect parts from the carcass of a protected marine animal if there are still “soft tissues” attached.",
    "url": "https://www.nytimes.com/2024/08/27/us/politics/rfk-jr-whale-head.html?unlocked_article_code=1.GU4.or3n.sY_XKxzY_FRY&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Trump's Approach to Florida's High-Stakes Abortion Amendment: Don't Ask.  Won't Tell.  —  He knows abortion is a political minefield for him.  The question is, can he avoid getting blown up?  —  TWENTY DAYS AGO, DONALD TRUMP promised he would soon discuss how he'll vote on Florida's abortion rights initiative.",
    "url": "https://www.thebulwark.com/p/trump-approach-to-florida-abortion-amendment-dont-ask-wont-tell"
  },
  {
    "text": "Donald Trump, JD Vance and RFK Jr.?  ‘Weird’ doesn't do justice to this loony trifecta.  —  The ‘these guys are weird’ memes launched by Democratic vice presidential nominee Tim Walz to describe Trump and Vance are no match for the Republican Party's new trifecta of wackadoodles.",
    "url": "https://www.usatoday.com/story/opinion/columnist/2024/08/26/donald-trump-rfk-jr-kennedy-vance-weird-republican-campaign/74947404007/"
  },
  {
    "text": "Harris flip-flops on building the border wall … - Harris is embracing a more hawkish immigration policy as Donald Trump's campaign spends tens of millions of dollars attacking her about the border.  — But she still has significant differences with Trump on immigration … ",
    "url": "https://www.axios.com/2024/08/27/kamala-harris-flip-flops-border-wall"
  },
  {
    "text": "Lowe's becomes latest company to dial back DEI efforts aimed at LGBTQ groups  —  Lowe's changes follow closely on the heels of announcements by Harley Davidson and Jack Daniel's, as well as similar changes made by Tractor Supply, John Deere and Best Buy.  —  Home goods retailer Lowe's … ",
    "url": "https://www.nbcnews.com/business/business-news/lowes-becomes-later-paring-back-dei-efforts-rcna168380"
  },
  {
    "text": "Confederate Voter Intimidation 2.0: The GOP's Dark Strategy for Winning  —  From Reconstruction to DeSantis to Paxton: How Republicans Are Keeping Power by Any Means Necessary...  The song that was inspired by this article is available here.  —  The Republican attorney general … ",
    "url": "https://hartmannreport.com/p/confederate-voter-intimidation-20-0bd"
  },
  {
    "text": "Harris Shakes Up Key Demographics in 2024 Presidential Race  —  New Poll Shows Tight Race in Arizona as Both Trump and Harris Appeal to Different Voter Bases  —  As the 2024 Presidential election approaches, the latest Arizona Public Opinion Poll (AZPOP) from Noble Predictive Insights (NPI) … ",
    "url": "https://www.noblepredictiveinsights.com/post/harris-shakes-up-key-demographics-in-2024-presidential-race"
  },
  {
    "text": "Georgia governor inquires whether he can remove MAGA election board members after series of alarming votes  —  Donald Trump recently praised the right-wing coalition on the Georgia state election board  —  Support truly  —  independent journalism  —  Our mission is to deliver unbiased … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/georgia-election-trump-brian-kemp-b2602111.html"
  }
]