[
  {
    "text": "MAGA world lashes out over DeSantis' ‘listless vessels’ remark  —  Trump campaign and supporters push comparisons to Hillary Clinton's ‘deplorables’ remark.  —  The Trump campaign and MAGA world on Saturday blasted Florida Gov. Ron DeSantis for remarks appearing to label some of the former president's supporters “listless vessels.”",
    "url": "https://www.politico.com/news/2023/08/19/desantis-trump-listless-vessels-00111971"
  },
  {
    "text": "DeSantis opens up about leaked debate strategy memo, vows to punch back in first GOP showdown  —  Fox News hosts the first Republican presidential nomination debate on Wednesday in Milwaukee, Wisconsin  —  MANCHESTER, N.H. - Florida Gov. Ron DeSantis says he's “ready to do what we need to” … ",
    "url": "https://www.foxnews.com/politics/desantis-opens-up-about-leaked-debate-strategy-memo-vows-punch-back-first-gop-showdown"
  },
  {
    "text": "Scoop: Big GOP donors push for Trump alternative  —  Several top GOP donors, panicked about their current choices, are holding back 2024 money with the long-shot dream of luring an alternative to former President Trump into the presidential race at the last minute.",
    "url": "https://www.axios.com/2023/08/19/gop-donors-dreaming-trump-alternative"
  },
  {
    "text": "Inside Trump's Decision to Skip the G.O.P. Debate  —  Fox News leaned on the former president privately and publicly to join the debate.  But all the while he was proceeding with a plan for his own counterprogramming.  —  On a cool August night on the crowded patio of his private club in New Jersey … ",
    "url": "https://www.nytimes.com/2023/08/19/us/politics/trump-fox-debate.html"
  },
  {
    "text": "Trump to release taped interview with Tucker Carlson, skipping GOP debate  —  Former president Donald Trump intends to skip the first Republican presidential primary debate in Milwaukee on Wednesday and instead plans to post a prerecorded interview with former Fox News host Tucker Carlson … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/19/trump-gop-debate-tucker-carlson/"
  },
  {
    "text": "Why Trump might regret passing on the first debate  —  In recent nominating contests, the nationally televised shoutfests have prompted significant shifts in polling afterward.  —  Donald Trump wants to deprive his competitors of any oxygen.  That's why the former president is likely skipping next week's debate in Milwaukee.",
    "url": "https://www.politico.com/news/2023/08/19/2024-debates-matter-00111948"
  },
  {
    "text": "The Constitution Prohibits Trump From Ever Being President Again  —  The only question is whether American citizens today can uphold that commitment.  —  As students of the United States Constitution for many decades—one of us as a U.S. Court of Appeals judge, the other as a professor … ",
    "url": "https://www.theatlantic.com/ideas/archive/2023/08/donald-trump-constitutionally-prohibited-presidency/675048/"
  },
  {
    "text": "Legal scholars increasingly raise constitutional argument that Trump should be barred from presidency  —  Prominent conservative legal scholars are increasingly raising a constitutional argument that 2024 Republican candidate Donald Trump should be barred from the presidency because of his actions … ",
    "url": "https://www.cnn.com/2023/08/19/politics/donald-trump-fourteenth-amendment-2024-race/"
  },
  {
    "text": "In talks with prosecutors, Hunter Biden's lawyers vowed to put the president on the stand  —  A behind-the-scenes look at how a plea deal for the president's son nearly came together before it fell apart.  —  It was Halloween of 2022, and Hunter Biden's lawyer, Chris Clark, didn't sound happy.",
    "url": "https://www.politico.com/news/2023/08/19/hunter-biden-plea-deal-collapse-00111974"
  },
  {
    "text": "August 2023 National Poll: DeSantis Fades Into Tie with Ramaswamy; Trump Maintains Majority of GOP Support Ahead of Debate  —  Home Polls August 2023 National Poll: DeSantis Fades Into Tie with Ramaswamy; Trump Maintains Majority of GOP Support Ahead of Debate",
    "url": "https://emersoncollegepolling.com/august-2023-national-poll-desantis-fades-into-tie-with-ramaswamy-trump-maintains-majority-of-gop-support-ahead-of-debate/"
  },
  {
    "text": "White House is torn over Joe Manchin's fury at climate law he crafted  —  As White House officials weigh how much to give in to his demands, rift grows between president and senator from West Virginia  —  The obscure federal agency that oversees the nation's immense tangle of pipelines … ",
    "url": "https://www.washingtonpost.com/business/2023/08/19/inflation-reduction-act-joe-manchin-biden/"
  },
  {
    "text": "Christie: Trump Canceled Election Fraud Press Conference Because 'He's Scared' Of Jail  —  Trump first promised a news conference to reveal proof that the 2020 election in Georgia had been “stolen” from him, but then canceled.  —  ATLANTA — While Donald Trump claims he canceled … ",
    "url": "https://www.huffpost.com/entry/christie-trump-scared-of-jail_n_64e0da41e4b04a3ebc33f537"
  },
  {
    "text": "Giuliani Repeatedly Sought Financial Lifeline From Trump  —  As Rudolph Giuliani has neared a financial breaking point with a pile of legal bills, the former president has largely demurred, despite making a vague promise to pay up.  —  Rudolph W. Giuliani is running out of money and looking … ",
    "url": "https://www.nytimes.com/2023/08/19/us/politics/giuliani-trump-legal-finances.html"
  },
  {
    "text": "Jean-Louis Georgelin, French general in charge of Notre Dame Cathedral restoration, dies at 74  —  The decorated French general in charge of the ambitious, big-budget restoration of fire-ravaged Notre Dame Cathedral in Paris, Jean-Louis Georgelin, has died.  He was 74.",
    "url": "https://www.cbsnews.com/news/jean-louis-georgelin-french-general-notre-dame-restoration-dies-age-74/"
  },
  {
    "text": "Christie hits Trump on foreign policy: 'I don't want to be the apple of Vladimir Putin's eye'  —  Republican presidential candidate Chris Christie hit against former President Trump's comments about his relationship with Russian President Vladimir Putin's after the former president claimed he was the “apple of his eye.”",
    "url": "https://thehill.com/homenews/campaign/4160223-christie-hits-trump-on-foreign-policy/"
  }
]