[
  {
    "text": "Navigating Iran crisis, Trump relies on experience over star power  —  Gabbard, Hegseth outside the inner circle as president weighs military actions against Iran.  —  Summary55  —  As President-elect Donald Trump assembled his core national security team early this year … ",
    "url": "https://www.washingtonpost.com/national-security/2025/06/18/iran-war-trump-hegseth-gabbard/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwMjE5MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUxNjAxNTk5LCJpYXQiOjE3NTAyMTkyMDAsImp0aSI6IjFkZjY1NzI5LTc5MTAtNGZmYS05ZWQxLTcwMzkzZGYwYmE1YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA2LzE4L2lyYW4td2FyLXRydW1wLWhlZ3NldGgtZ2FiYmFyZC8ifQ.THNOto4e4zo2NbppjsRDq54e9G_ZY2aCgoBjro_oRgM&itid=gfta"
  },
  {
    "text": "Exclusive: inside the spy dossier that led Israel to war  —  We review its secret intelligence on Iranian nukes  —  When israel launched its war on Iran on June 13th it did so on the basis of intelligence that it claimed showed Iran had reached a “point of no return” in its quest for a nuclear weapon.",
    "url": "https://www.economist.com/middle-east-and-africa/2025/06/18/exclusive-inside-the-spy-dossier-that-led-israel-to-war"
  },
  {
    "text": "We asked 1,000 Americans if they support U.S. strikes on Iran.  This is how they responded.  —  if they support U.S. strikes on Iran.  —  Cannot allow Iran to have nukes  —  Israel can handle it defend our country Diplomacy first  —  going to war and dying  —  Too dangerous",
    "url": "https://www.washingtonpost.com/politics/interactive/2025/iran-strike-us-involvement-poll/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwMjE5MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUxNjAxNTk5LCJpYXQiOjE3NTAyMTkyMDAsImp0aSI6IjRmYjZmMjg3LTk2NTktNDcwNy05YTliLWFmZWY0NDM3YTM2YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy9pbnRlcmFjdGl2ZS8yMDI1L2lyYW4tc3RyaWtlLXVzLWludm9sdmVtZW50LXBvbGwvIn0.LXvYNAAwBfe-J00k07MxGXiC0oasTGMh46sEWVN-JtU&itid=gfta"
  },
  {
    "text": "Trump Privately Approved Attack Plans For Iran But Has Withheld Final Order  —  The president is hoping that threatening to join Israel's strikes will lead Tehran to abandon its nuclear program  —  WASHINGTON—President Trump told senior aides late Tuesday that he approved of attack plans for Iran … ",
    "url": "https://www.wsj.com/politics/national-security/trump-privately-approved-attack-plans-for-iran-but-has-withheld-final-order-4563c526?st=2G6TEe&reflink=desktopwebshare_permalink"
  },
  {
    "text": "U.S. to Review Social Media Posts of Student and Scholar Visa Applicants  —  The State Department is restarting the processing of visa applications from students and visiting scholars, but is screening for “hostility” toward the United States.  —  The State Department plans to review … ",
    "url": "https://www.nytimes.com/2025/06/18/us/politics/student-visa-applications.html"
  },
  {
    "text": "Trump Travel Restrictions Bar Residents Needed at U.S. Hospitals  —  Limits on travel and visa appointments have delayed or prevented foreign doctors from entering the country for jobs set to begin in weeks.  —  Travel and visa restrictions imposed by the Trump administration threaten patient care … ",
    "url": "https://www.nytimes.com/2025/06/18/health/medical-residents-travel-ban.html"
  },
  {
    "text": "Marco Rubio, Velociraptor  —  Donald Trump never met a war he wouldn't pretend he could easily solve, but it seems he's getting tired of talking about only the current ones.  Here he was yesterday rolling back the clock: “I wonder if—you know, the Civil War, it always seemed to me maybe … ",
    "url": "https://www.thebulwark.com/p/marco-rubio-velociraptor-student-visas-social-media-administration-learning"
  },
  {
    "text": "The Supreme Court's incoherent new attack on trans rights, explained  —  What the hell did the Court just do to equal protection law? … It was obvious, if you listened to the Supreme Court's oral argument in United States v. Skrmetti last December, that the Court would vote … ",
    "url": "https://www.vox.com/scotus/417281/supreme-court-skremett-transgender-tennessee-health"
  },
  {
    "text": "The US supreme court just undermined gender equality  —  The Skrmetti decision upholding Tennessee's ban on transition-related healthcare for minors deprives children and batters the 14th amendment  —  By now, it is a ritual: every June, Americans endure several weeks of agonizing suspense … ",
    "url": "https://www.theguardian.com/commentisfree/2025/jun/19/us-supreme-court-gender-equality"
  },
  {
    "text": "Republicans Threaten a Hospital Apocalypse  —  Experts warn of potentially hundreds of hospital closures, which would degrade the entire medical system. … As we at the Prospect have reported, while the Senate's version of the Republican budget reconciliation bill was widely expected … ",
    "url": "https://prospect.org/health/2025-06-13-hospitals-senate-republicans-senate/"
  },
  {
    "text": "Parsing ICE's mixed-up, hard-to-believe assault claims  —  ICE officials keep touting a 413 percent increase in assaults on officers to justify anonymity.  —  Last month, I wrote a column questioning why Immigration and Customs Enforcement officers were increasingly disguising their identities as they conducted sweeps and arrests.",
    "url": "https://www.washingtonpost.com/opinions/2025/06/19/brad-lander-ice-assault-masking/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwMzA1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUxNjg3OTk5LCJpYXQiOjE3NTAzMDU2MDAsImp0aSI6IjkzZmYyMmUzLTU5MWMtNGQ3OC1hMmMwLWI4OTYwNmY0ODRkMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA2LzE5L2JyYWQtbGFuZGVyLWljZS1hc3NhdWx0LW1hc2tpbmcvIn0.jI3RdkdeQ_BuOvl3vCMb275mxz0VICVSopkT2v71vjg&itid=gfta"
  },
  {
    "text": "Trump administration to shut down LGBTQ youth suicide hotline  —  The 988 Suicide & Crisis Lifeline will no longer use its LGBTQ youth service line starting July 17.  The Trump administration says the move will “focus on serving all help seekers.”  —  The Trump administration will shut … ",
    "url": "https://www.nbcnews.com/nbc-out/out-news/trump-administration-shut-lgbtq-youth-suicide-hotline-rcna213815"
  },
  {
    "text": "Musk Savages ‘Snake’ Trump Aide as Their White House Feud Erupts  —  VENOMOUS WORDS  —  Sergio Gor has been blamed in part for the explosive breakdown in the alliance between the president and his former “First Buddy.”  —  Elon Musk publicly ripped into a top White House aide who fueled his falling out with President Donald Trump.",
    "url": "https://www.thedailybeast.com/elon-musk-savages-snake-trump-aide-sergio-gor-as-their-white-house-feud-erupts/"
  },
  {
    "text": "The Subway Is Not Scary  —  In 2014, New York Times reporter Michael Barbaro (who would go on to become one of the paper's superstars as host of its podcast “The Daily\") posted this tweet:  —  After receiving a good deal of ridicule, Barbaro deleted the tweet.  The nervous sentiment he expressed, however, lives on.",
    "url": "https://www.hamiltonnolan.com/p/the-subway-is-not-scary"
  },
  {
    "text": "How My Reporting on the Columbia Protests Led to My Deportation  —  As an Australian who wrote about the demonstrations while on campus, I gave my phone a superficial clean before flying to the U.S. I underestimated what I was up against.  —  Many people are detained at U.S. airports for reasons they find arbitrary and mysterious.",
    "url": "https://www.newyorker.com/news/the-lede/how-my-reporting-on-the-columbia-protests-led-to-my-deportation"
  },
  {
    "text": "Hegseth Recommended a ‘Passive Approach’ to Honoring Juneteenth  —  Defense Secretary Pete Hegseth requested the Pentagon go light on commemorating Juneteenth, the holiday marking the end of slavery … Juneteenth marks the day in 1865, after the Civil War ended, when Union soldiers arrived … ",
    "url": "https://www.rollingstone.com/politics/politics-features/hegseth-juneteenth-holiday-passive-approach-1235368064/"
  },
  {
    "text": "As Trump pledges mass deportation, he's creating more undocumented people  —  More than 1 million people who were granted legal entry to the country under different programs are now being considered illegally here by the Trump administration.  —  Florndjie Camey, 31, had gone from a bleak future … ",
    "url": "https://www.nbcnews.com/news/us-news/trump-deportation-undocumented-immigrants-policy-change-rcna213356"
  },
  {
    "text": "Naming Villains and Values  —  If you tell people they face an existential threat but don't act as if there is one, how can you expect to get other people to help you fight it?  That's the question Democrats need to ask themselves on a number of fronts this week, as I discussed on Substack Live … ",
    "url": "https://www.weekendreading.net/p/naming-villains-and-values"
  },
  {
    "text": "Bernie Sanders dives into a key House battleground Trump carried in 2024 with a new endorsement  —  Democrat Rebecca Cooke is running against GOP Rep. Derrick Van Orden again after she lost by less than 3 points in western Wisconsin even as Trump won the district by 7 last year.",
    "url": "https://www.nbcnews.com/politics/2026-election/bernie-sanders-dives-key-house-battleground-trump-carried-2024-new-end-rcna213874"
  },
  {
    "text": "Justice Dept. to Cut Two-Thirds of Inspectors Monitoring Gun Sales  —  The move is part of the Trump administration's effort to defang and downsize the Bureau of Alcohol, Tobacco, Firearms and Explosives.  —  The Justice Department plans to slash the number of inspectors … ",
    "url": "https://www.nytimes.com/2025/06/18/us/politics/justice-dept-guns-atf-trump.html"
  },
  {
    "text": "June 18, 2025 (Wednesday)  —  Tomorrow is the federal holiday honoring Juneteenth, the celebration of the announcement in Texas on June 19th, 1865, that enslaved Americans were free.  —  That announcement came as late as it did because, while General Robert E. Lee surrendered his Army … ",
    "url": "https://heathercoxrichardson.substack.com/p/june-18-2025-wednesday"
  }
]