[
  {
    "text": "Hacker Is Said to Have Gained Access to File With Damaging Testimony About Gaetz  —  The computer file is said to contain testimony from the woman who said she had sex with Matt Gaetz, President-elect Donald Trump's choice to be attorney general, when she was 17.",
    "url": "https://www.nytimes.com/2024/11/19/us/politics/matt-gaetz-hack-testimony.html?unlocked_article_code=1.bE4.f2SX.A-EoaFu8nQma&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump Transition Live Updates: Hacker Is Said to Have Obtained Damaging Testimony About Gaetz  —  President-elect Donald J. Trump's attorney general candidate, Matt Gaetz, was investigated, but not charged, with having sex with a 17-year-old girl.  The computer file included testimony from the girl … ",
    "url": "https://www.nytimes.com/live/2024/11/19/us/trump-news-live-updates"
  },
  {
    "text": "President-elect Donald Trump is now receiving intelligence briefings  —  Trump took regular intelligence briefings during his first term but has a history of being cavalier with classified information.  —  President-elect Donald Trump, the only former president to have been charged … ",
    "url": "https://www.washingtonpost.com/national-security/2024/11/19/trump-intelligence-cia-odni-secret/"
  },
  {
    "text": "Republican bathroom bill targets Congress's first transgender member  —  South Carolina Republican Nancy Mace introduces bill two months before Sarah McBride is to be sworn in  —  After Delaware elected the first ever openly transgender member of Congress earlier this month … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/19/sarah-mcbride-congress-bathroom-bill-transgender"
  },
  {
    "text": "Johnson pressured by GOP firebrands on trans bathroom access … - Mace told Axios on Tuesday morning that Johnson “said to me last night that he would include it in House Rules.”  — But Johnson stopped short of making that commitment at a press conference, telling reporters, “We're not going to address the plans on any of that.”",
    "url": "https://www.axios.com/2024/11/19/mike-johnson-mace-mtg-mcbride-bathroom"
  },
  {
    "text": "MTG threatens to fight transgender woman  —  Rep. Marjorie Taylor Greene in a private House GOP conference meeting indicated she'd fight a transgender woman if she tried to use a woman's bathroom on the House side of the Capitol, according to two people in the room, as Congress … ",
    "url": "https://www.politico.com/live-updates/2024/11/19/congress/mtg-threatens-to-fight-transgender-woman-00190344"
  },
  {
    "text": "Donald Trump Has NOT Won a Majority of the Votes Cast for President  —  Donald Trump's popular vote total has fallen below 50 percent, and his margin over Kamala Harris has narrowed considerably as all the votes are counted.  —  Pocket  —  “America has given us an unprecedented and powerful mandate … ",
    "url": "https://www.thenation.com/article/politics/donald-trump-vote-margin-narrowed/"
  },
  {
    "text": "In reversal, Thune seeks to slow down Biden's judicial nominees  —  In 2020, Thune touted the importance of confirming judges to the bench.  —  Senator John newly elected Senate Majority Leader for the upcoming 119th Congress, speaks to reporters at the U.S. Capitol, Nov. 13, 2024, in Washington.",
    "url": "https://abcnews.go.com/Politics/reversal-thune-seeks-slow-bidens-judicial-nominees/story?id=116010653"
  },
  {
    "text": "The stunning success of vaccines in America, in one chart  —  Measles, mumps, and polio are supposed to be diseases of the past.  In the early to mid-20th century, scientists developed vaccines that effectively eliminated the risk of anyone getting sick or dying from illnesses that had killed millions over millennia of human history.",
    "url": "https://www.vox.com/future-perfect/386215/trump-rfk-jr-vaccines-health-measles-chart"
  },
  {
    "text": "RFK Jr. Said the Government May Have Planned COVID  —  THE MAN DONALD TRUMP HAS ENTRUSTED to run America's health agencies previously expressed his belief that the U.S. government planned the COVID pandemic that killed more than 1.2 million of its citizens.  —  In an August 2020 speech … ",
    "url": "https://www.thebulwark.com/p/rfk-government-planned-covid-pandemic"
  },
  {
    "text": "RFK Jr. is a massive public health threat  —  Dems like Jared Polis shouldn't pretend pretend otherwise.  —  ∙ Paid … Donald Trump, in his vacuous orange wisdom, has nominated vaccine denier, crank, and champion of disease Robert F. Kennedy Jr. to be the Secretary of Health and Human Services (HHS).",
    "url": "https://www.publicnotice.co/p/rfk-jr-public-health-threat-vaccines"
  },
  {
    "text": "‘Morning Joe’ meeting with Trump was driven by fears of retribution from incoming administration, sources say  —  New York CNN  —  “Morning Joe” co-hosts Joe Scarborough and Mika Brzezinski announced Monday, in dramatic fashion, that they went to Mar-a-Lago last week for a fence-mending meeting with President-elect Donald Trump.",
    "url": "https://www.cnn.com/2024/11/19/media/morning-joe-trump-mar-a-lago-meeting-fears/"
  },
  {
    "text": "Gaetz, Gabbard and Hegseth are unqualified — Senate Republicans should reject them  —  President-elect Donald Trump has nominated three political hacks to highly sensitive and important federal positions: former Rep. Matt Gaetz (R-Fla.) as attorney general, former Rep. Tulsi Gabbard (D-Hawaii) … ",
    "url": "https://thehill.com/opinion/campaign/4996058-gaetz-gabbard-and-hegseth-are-unqualified-senate-republicans-should-reject-them/"
  },
  {
    "text": "Prosecutors oppose tossing Trump's hush money conviction but are open to sentencing delay  —  New York prosecutors oppose any effort to dismiss President-elect Donald Trump's hush money conviction, but they expressed openness Tuesday to delaying sentencing until after his impending second term.",
    "url": "https://apnews.com/article/trump-hush-money-case-stormy-daniels-8793ae086092c64325d38a380851e23a"
  },
  {
    "text": "Bucks County board chair says comment about violating election law has been misinterpreted  —  Bucks County Board of Commissioners Chair Diane Ellis-Marseglia said Monday that her comments about violating the Pennsylvania Supreme Court were taken out of context after they set off a national backlash … ",
    "url": "https://www.inquirer.com/politics/election/bucks-county-commissioner-diane-ellis-marseglia-20241118.html"
  },
  {
    "text": "Ukraine fires first US-made missile into Russia: WW3 fears as Kremlin threatens ‘nuclear response’ if long-range Western weapons are used on its territory  — Ukrainian officials confirmed the use of ATACMS on Russian soil for the first time  — Comes as Kremlin said its updated nuclear doctrine allowed a ‘nuclear response’",
    "url": "https://www.dailymail.co.uk/news/article-14100327/Ukraine-fires-missile-Russia-WW3-fears-Kremlin-threatens-nuclear-response-long-range-Western-weapons-used-territory.html"
  },
  {
    "text": "Nancy Mace defends anti-trans bathroom bill, says it ‘absolutely’ targets Sarah McBride  —  McBride, the first out transgender person elected to Congress, will be serving in the House starting next year and Mace doesn't want her using women's bathrooms at the Capitol.",
    "url": "https://www.nbcnews.com/politics/congress/nancy-mace-defends-anti-trans-bathroom-bill-says-absolutely-targets-sa-rcna180805"
  },
  {
    "text": "The law is clear on birthright citizenship.  Can Trump end it anyway?  —  Ending birthright citizenship has been on President-elect Donald Trump's wish list for years, and he's pledged to kill it once and for all in his next term.  But ending it may not be as easy as he's promised.",
    "url": "https://www.vox.com/policy/386094/birthright-citizenship-trump-2024-immigration"
  },
  {
    "text": "Trump picks Dr. Oz to lead massive Medicare, Medicaid agency CMS … President-elect Donald Trump on Tuesday said he would nominate Dr. Mehmet Oz to lead the Centers for Medicare & Medicaid Services.  —  CMS operates or oversees health-care programs that provide coverage to about 1 out of every 2 Americans … ",
    "url": "https://www.cnbc.com/2024/11/19/trump-picks-dr-oz-to-lead-massive-medicare-medicaid-agency-cms.html"
  },
  {
    "text": "Vice's Hard-Right Turn to Trumpism  —  VICE News once covered the border with videos that exposed the hardships faced by immigrants, such as “The Human Cost of Hardening the US-Mexico Border” and “What It's Like To Raise Your Child In An Immigration Detention Center.”",
    "url": "https://theintercept.com/2024/11/19/vice-news-right-wing-trumpism/"
  },
  {
    "text": "Marjorie Taylor Greene: GOP Covered Up ‘Sexual Harassment and Assault’ Claims  —  THROWING DOWN  —  Rep. Marjorie Taylor Greene (R-GA) made a sensational allegation that her Republican colleagues in Congress have covered up “sexual harassment and assault claims” by paying off victims with taxpayer money.",
    "url": "https://www.thedailybeast.com/marjorie-taylor-greene-gop-covered-up-sexual-harassment-and-assault-claims/"
  },
  {
    "text": "Trump to Pick Howard Lutnick as Commerce Secretary  —  Cantor Fitzgerald chief executive has been a key transition adviser to president-elect  —  WASHINGTON—Donald Trump is expected to nominate veteran Wall Street financier Howard Lutnick to lead the Commerce Department … ",
    "url": "https://www.wsj.com/politics/trump-commerce-secretary-howard-lutnick-cabinet-77c86b81?st=WoXYDH&reflink=article_copyURL_share"
  },
  {
    "text": "Trump's Treasury Challenge: A Pick Who Loves Tariffs Yet Calms Markets  —  The president-elect is considering a conflicting mix of qualities as he decides who will steer his economic agenda.  —  The conflicting goals of President-elect Donald J. Trump's economic agenda have been playing … ",
    "url": "https://www.nytimes.com/2024/11/19/us/politics/trump-treasury-secretary-tariffs.html"
  }
]