[
  {
    "text": "Workers strike at all 3 Detroit automakers in a battle for a bigger share of industry profits  —  About 13,000 U.S. auto workers stopped making vehicles and went on strike Friday after their leaders couldn't bridge a giant gap between union demands in contract talks and what Detroit's three automakers are willing to pay.",
    "url": "https://apnews.com/article/auto-uaw-workers-strike-gm-ford-stellantis-7ce3ca9d94b911250d07556b7af376c7"
  },
  {
    "text": "EXCLUSIVE: Married South Dakota governor Kristi Noem and Trump advisor Corey Lewandowski have been having a years-long clandestine affair  — DailyMail.com uncovered evidence of Lewandowski and Noem's fling: Dozens of trips that mixed business with pleasure, private flights and luxury resort stays",
    "url": "https://www.dailymail.co.uk/news/article-12509093/Kristin-Noem-Corey-Lewandowski-secret-affair.html"
  },
  {
    "text": "Biden Administration Aims to Trump-Proof the Federal Work Force  —  If Donald Trump wins a second term, he and his allies want to revive a plan to allow a president to fire civil service workers who are supposed to be hired on merit.  The Biden administration is trying to thwart it.",
    "url": "https://www.nytimes.com/2023/09/15/us/politics/trump-biden-schedule-f.html"
  },
  {
    "text": "UAW Temporarily Loses Twitter Verification as Union Strikes Against Big Three  —  This article was updated to include information about a Twitter policy to temporarily remove checkmarks from verified accounts that change their profile pictures.  Twitter offered only an auto-response … ",
    "url": "https://theintercept.com/2023/09/15/uaw-strike-twitter-verification-elon-musk/"
  },
  {
    "text": "Evidence of Biden's wrongdoing is considerable  —  Rep. Jamie Raskin (D-MD) claimed this week that “there is precisely zero evidence of any wrongdoing whatsoever” by President Joe Biden.  The Associated Press asserted Republicans are “claiming without evidence that [Joe and Hunter Biden] engaged in an influence-peddling scheme.”",
    "url": "https://www.washingtonexaminer.com/opinion/editorials/evidence-bidens-wrongdoing-considerable"
  },
  {
    "text": "Special counsel warned Trump could ‘precipitate violence’ if told of Twitter search warrant  —  Newly unsealed court records indicate special counsel Jack Smith's team warned that former President Trump could “precipitate violence” unless the court shielded its efforts to obtain information on his Twitter account.",
    "url": "https://thehill.com/regulation/court-battles/4206811-special-counsel-warned-trump-could-precipitate-violence-if-told-of-twitter-search-warrant/"
  },
  {
    "text": "Twitter turned over at least 32 direct messages from Trump's account to special counsel  —  Twitter turned over at least 32 direct messages from former President Donald Trump's account - @realDonaldTrump - to special counsel Jack Smith earlier this year as part of the federal election subversion … ",
    "url": "https://www.cnn.com/2023/09/15/politics/trump-twitter-direct-messages/"
  },
  {
    "text": "Trump says he'd testify under oath he never ordered Mar-a-Lago security video deleted  —  In a wide-ranging interview with NBC's “Meet the Press with Kristen Welker,” Trump said, “They were my tapes.  I could have fought them.”  —  Former President Donald Trump said Thursday that he did not order … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-mar-lago-staffer-delete-security-footage-tapes-false-rcna104781"
  },
  {
    "text": "The Ken Paxton saga is exposing the limits of Trump's coattails  —  Nearly a quarter of Texas Republicans now disapprove of the embattled attorney general, an all-time high.  —  Ken Paxton and his MAGA allies framed his stunning impeachment trial as the last gasp of the GOP's weakened establishment.",
    "url": "https://www.politico.com/news/2023/09/15/ken-paxton-saga-trump-00116273"
  },
  {
    "text": "Speaker Matt Gaetz has big plans for the House  —  The Constitution designates the speaker as the presiding officer of the House of Representatives and, throughout our history, this has been the case — until now.  —  The House is currently being run not by Speaker Kevin McCarthy … ",
    "url": "https://www.washingtonpost.com/opinions/2023/09/15/biden-impeachment-inquiry-house-gop-mccarthy-gaetz-greene/"
  },
  {
    "text": "Congress is in crisis.  There's no clear escape.  —  “We've been seeing this coming ... I just didn't think we were dumb enough to get there,” Rep. Mike Simpson (R-Idaho) said.  —  The government is barreling toward a shutdown.  House Republicans threaten to impeach the president — though some of them don't see the evidence.",
    "url": "https://www.politico.com/news/2023/09/15/government-shutdown-congress-gop-00116066"
  },
  {
    "text": "Man helping deer cross a busy street shot, killed by ‘scared’ driver  —  A man who was trying to slow traffic in his neighborhood because deer were crossing the street was shot and killed by another man who was driving past, authorities in western Washington state said.",
    "url": "https://www.washingtonpost.com/nation/2023/09/14/deer-street-shooting/"
  },
  {
    "text": "Joe Biden Is Going To Have To Talk About Leonard Peltier  —  Indigenous leaders and human rights advocates are making the long-imprisoned Native activist's freedom a 2024 election priority.  —  LOADING  —  WASHINGTON ― Maxine was 4 years old when the bullet whizzed by her face.",
    "url": "https://www.huffpost.com/entry/leonard-peltier-joe-biden-clemency-indigenous-rights_n_64e7737ae4b07a9e3f5bc6dc"
  },
  {
    "text": "The spectacular downfall of a common, useless cold medicine  —  This week's unanimous vote on phenylephrine's ineffectiveness was decades in the making.  —  After spending decades on pharmacy shelves, the leading nasal decongestant in over-the-counter cold and allergy medicines has met its downfall.",
    "url": "https://arstechnica.com/health/2023/09/the-spectacular-downfall-of-a-common-useless-cold-medicine/"
  },
  {
    "text": "Lee's jabs at Newsom cause exodus from her super PAC  —  Two longtime aides in Newsom world are siding with the California governor over Rep. Barbara Lee.  —  SACRAMENTO, Calif. — Two top California strategists have cut ties with the super PAC supporting Barbara Lee's U.S. Senate bid after she went scorched earth on Gavin Newsom.",
    "url": "https://www.politico.com/news/2023/09/15/lee-newsom-advisers-super-pac-california-00116206"
  },
  {
    "text": "Some small businesses caught in culture wars face financial woes, employee fears: ‘Never been as bad’  —  Target and Bud Light draw attention but backlash also hurts small companies.  —  When Republican Texas Gov. Greg Abbott declared a war on “woke” earlier this year with a proposal … ",
    "url": "https://abcnews.go.com/Business/small-businesses-caught-culture-wars-face-financial-woes/story?id=102834758"
  },
  {
    "text": "With democracy on the ballot, the mainstream press must change its ways  —  US news organizations have turned Biden's age into a scandal and continue to cover Trump as an entertaining side show  —  Christiane Amanpour has reported all over the world, so she recognizes a democracy on the brink when she sees one.",
    "url": "https://www.theguardian.com/commentisfree/2023/sep/15/trump-biden-mainstream-politics-news-coverage"
  },
  {
    "text": "Trump DOJ Official Jeff Clark Claims President Had ‘Unqualified and Illimitable’ Right to Deputize Him in 2020 Election  —  Clark also told a federal judge that he got it wrong in denying former White House chief of staff Mark Meadows a federal court transfer",
    "url": "https://themessenger.com/politics/jeff-clark-trump-georgia-court-brief"
  }
]