[
  {
    "text": "'I'm not a windmill person': Trump takes the witness stand and doesn't break character  —  In a series of outbursts while testifying, Trump assailed the judge who is overseeing his civil fraud case.  —  NEW YORK — Testimony by former President Donald Trump quickly descended into bitter sniping Monday … ",
    "url": "https://www.politico.com/news/2023/11/06/trump-civil-fraud-trial-00125515"
  },
  {
    "text": "Iowa Gov. Kim Reynolds says Trump can't win in 2024 as she endorses Ron DeSantis  —  Reynolds and DeSantis spoke about the state of the 2024 race and what led to the Iowa governor's endorsement in a joint interview with NBC News.  —  DES MOINES, Iowa  — Iowa Gov. Kim Reynolds touted Ron … ",
    "url": "https://www.nbcnews.com/politics/2024-election/iowa-gov-kim-reynolds-says-trump-cant-win-2024-endorses-ron-desantis-rcna123788"
  },
  {
    "text": "Trump Forgets What Years He Was President While on the Stand in NY Trial  —  WHOOPS!  —  Donald Trump forgot what years he served as president while on the stand in his New York fraud trial Monday.  He claimed at one point that he did not pay attention to his company's financial statements … ",
    "url": "https://www.thedailybeast.com/trump-forgets-what-years-he-was-president-while-on-the-stand-in-ny-fraud-trial"
  },
  {
    "text": "Eye Opener: Former President Donald Trump clashes with judge in New York fraud trial  —  Former President Donald Trump takes the stand in his New York fraud trial, appearing to dodge questions and lashing out at the judge as prosecutors make their case.  Also, one month into Israel's war with Hamas … ",
    "url": "https://www.cbsnews.com/video/eye-opener-former-president-donald-trump-clashes-with-judge-in-new-york-fraud-trial/"
  },
  {
    "text": "Jan. 6 riot was ‘culmination’ of Trump conspiracies to overturn 2020 election, special counsel says in new filing  —  The special counsel's office called Trump's motion a “meritless effort” to evade allegations that he was responsible for the attack on the Capitol.",
    "url": "https://www.nbcnews.com/politics/donald-trump/jan-6-riot-was-culmination-trump-conspiracies-overturn-2020-election-s-rcna123897"
  },
  {
    "text": "3 early takeaways from Trump's testimony  —  Donald Trump's many legal problems led to a historic scene Monday: a former president testifying under oath in his own civil fraud trial in New York.  —  New York Attorney General Letitia James (D) is suing Trump and others, including his two adult sons, seeking $250 million.",
    "url": "https://www.washingtonpost.com/politics/2023/11/06/trump-trial-testimony-takeaways/"
  },
  {
    "text": "'He's a child' Trump is imploding because he thinks 'rules don't apply to him': biographer  —  Former President Donald Trump had a bad day on the witness stand at his civil fraud trial in New York, snapping at state attorneys and offering contradictory stories about his company's dubious property valuations … ",
    "url": "https://www.rawstory.com/trump-child-rules-dont-apply/"
  },
  {
    "text": "Playbook: Four big Election Day questions  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  COACH BAGGAGE — Senate Republicans are set to discuss a possible resolution to Sen. TOMMY TUBERVILLE's blockade of military promotions this afternoon, and … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/11/07/four-big-election-day-questions-00125728"
  },
  {
    "text": "‘Wanna Kill All You Little Crackers’: Nashville Trans Shooter Manifesto Leaked?  Update: Confirmed  —  Has the long-buried “manifesto” of the Nashville transgender mass murderer finally leaked?  More than seven months after the massacre of six people inside The Covenant School … ",
    "url": "https://hotair.com/ed-morrissey/2023/11/06/wanna-kill-all-you-little-crackers-nashville-trans-shooter-manifesto-leaked-n590375"
  },
  {
    "text": "Capitol Hill Targets Legacy Preferences for College Admissions  —  Bipartisan bill comes amid scrutiny of diversity and fairness after Supreme Court decision  —  WASHINGTON—Senators are taking fresh aim at legacy and donor preferences for admission to college, as advantages given … ",
    "url": "https://www.wsj.com/us-news/education/capitol-hill-targets-legacy-preferences-for-college-admissions-f827125f?mod=followamazon"
  },
  {
    "text": "Netanyahu to ABC's Muir: ‘No cease-fire’ without release of hostages  —  He spoke exclusively with “World News Tonight” anchor David Muir.  —  Israeli Prime Minister Benjamin Netanyahu speaks with ABC World News Tonight anchor David Muir, Nov. 6, 2023.  —  Israeli Prime Minister Benjamin Netanyahu … ",
    "url": "https://abcnews.go.com/Politics/netanyahu-abcs-muir-cease-fire-release-hostages/story?id=104661239"
  },
  {
    "text": "5 candidates qualify for the Miami GOP debate, with Doug Burgum missing out  —  Donald Trump is skipping another debate, but Chris Christie, Ron DeSantis, Nikki Haley, Vivek Ramaswamy and Tim Scott will be onstage Wednesday night.  —  Five candidates will be on the stage Wednesday night … ",
    "url": "https://www.nbcnews.com/politics/2024-election/republican-debate-candidates-qualify-rcna123741"
  },
  {
    "text": "Iran Might Have Miscalculated in Gaza  —  It had an interest in dividing Israel from Arab states.  So far that hasn't happened.  —  Most news and commentary describes the war in Gaza as the latest brutal episode in the conflict between Israelis and Arabs.",
    "url": "https://www.wsj.com/articles/iran-might-have-miscalculated-in-gaza-abraham-accords-arab-allies-70bc087a?mod=followamazon"
  },
  {
    "text": "Criminalizing dissent  —  Sixty-one activists appeared before Fulton County Court yesterday on racketeering charges related to their protest of Atlanta's new “Public Safety Training Center,” commonly known as Cop City.  The arraignment comes after the Georgia Attorney General's Office alleged … ",
    "url": "https://popular.info/p/criminalizing-dissent"
  },
  {
    "text": "Portuguese PM António Costa in crisis after cops raid residence  —  Authorities detain prime minister's top aide and also search Ministries of Environment and Infrastructure in corruption probe.  —  Portuguese police raided Prime Minister António Costa's official residence … ",
    "url": "https://www.politico.eu/article/portuguese-police-raid-prime-minister-antonio-costas-residence/"
  },
  {
    "text": "Dems see a big upside to Johnson's conservative funding push  —  The new speaker has leaned into the right flank's spending crusade, giving House Democrats plenty of election messaging on cuts to education, Amtrak, LGBTQ policies and abortion rights.  —  House Democrats were already attacking … ",
    "url": "https://www.politico.com/news/2023/11/07/dems-upside-johnson-conservative-funding-push-00125486"
  }
]