[
  {
    "text": "Google Explains Why Search for ‘Where Can I Vote for Harris’ Showed a Map While Similar Trump Search Didn't … Earlier Tuesday, searches on Google for “Where can I vote for Harris?” displayed a “Where to vote” map that lets uses enter their street address to find their polling location.",
    "url": "https://variety.com/2024/digital/news/google-search-where-can-i-vote-for-harris-trump-map-1236201473/"
  },
  {
    "text": "How Trump Accidentally Let His Biggest Advantage Over Harris Slip Away  —  If you've spent time on social media lately, you've surely encountered the argument that Kamala Harris and Democrats have squandered way too much time and resources on attacking Donald Trump as a sexual predator, dangerous madman, and wannabe fascist dictator.",
    "url": "https://newrepublic.com/article/187950/trump-2024-election-advantage-harris-slip-away"
  },
  {
    "text": "Trump votes in his “last” election: “I don't even want to think about losing” … - He also cast doubt on the efficiency and reliability of voting machines, and called it an “absolute outrage” that key states take so long to count ballots.  — But Trump did say there will be “no violence” … ",
    "url": "https://www.axios.com/2024/11/05/trump-votes-election-fair-declare-victory"
  },
  {
    "text": "Biden will not attend Harris election night watch party  —  President Joe Biden will not attend Vice President Kamala Harris's election night watch party in another sign that her campaign is keeping the incumbent at arm's length.  —  “Tonight, the president and First Lady will watch election results … ",
    "url": "https://www.washingtonexaminer.com/news/white-house/3217564/joe-biden-not-attend-harris-election-night-watch-party/"
  },
  {
    "text": "Trump campaign denies and revokes journalists' election night credentials after critical coverage  —  New York CNN  —  Journalists from multiple news organizations have been denied credentials to former President Donald Trump's election night watch event in West Palm Beach, Florida … ",
    "url": "https://www.cnn.com/2024/11/05/media/trump-revokes-journalists-election-night-credentials/"
  },
  {
    "text": "Non-credible bomb threats against Atlanta-area polling places were from Russia, secretary of state says  —  Several non-credible bomb threats that briefly disrupted voting at two Georgia polling places originated from Russia, Georgia Secretary of State Brad Raffensperger told reporters Tuesday.",
    "url": "https://www.cnn.com/2024/11/05/us/georgia-non-credible-bomb-threat-russia/"
  },
  {
    "text": "A random number generator determined the “favorite” in our forecast  —  When I say the odds in this year's presidential race are about as close as you can possibly get to 50/50, I'm not exaggerating.  —  At exactly midnight on Tuesday, I pressed the “go” button for the final time on our election model this year.",
    "url": "https://www.natesilver.net/p/a-random-number-generator-determined"
  },
  {
    "text": "Musk to Spend Election Night With Trump  —  Elon Musk has spent $119 million on a super PAC supporting Donald Trump and held events on his behalf.  But his ownership of X is especially valuable.  —  Elon Musk plans to spend election night with former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/11/05/us/politics/elon-musk-trump-election-night.html"
  },
  {
    "text": "Musk and X are epicenter of US election misinformation, experts say  —  False or misleading claims by billionaire Elon Musk about the U.S. election have amassed 2 billion views on social media platform X this year, according to a report by non-profit group Center for Countering Digital Hate.",
    "url": "https://www.reuters.com/world/us/wrong-claims-by-musk-us-election-got-2-billion-views-x-2024-report-says-2024-11-04/"
  },
  {
    "text": "NBC News Exit Poll: Voters express deep concern about America's democracy and economy  —  Women are twice as likely as men to rank abortion as their top issue, according to preliminary results from the national survey.  —  The state of democracy and the economy in the United States … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nbc-news-exit-poll-voters-express-concern-democracy-economy-rcna178602"
  },
  {
    "text": "Israel's Netanyahu dismisses his defense minister as wars rage.  Protests erupt across country  —  Israeli Prime Minister Benjamin Netanyahu on Tuesday dismissed his popular defense minister, Yoav Gallant, in a surprise announcement that came as the country is embroiled in wars on multiple fronts across the region.",
    "url": "https://apnews.com/article/israel-netanyahu-gallant-gaza-war-lebanon-3810d3adb1603e8485b4be46a5b79f8b"
  },
  {
    "text": "Giuliani Moved Possessions From N.Y. Apartment as Creditors Closed In  —  Lawyers for the two election workers seeking to collect on a $148 million defamation judgment against Rudolph W. Giuliani found that he had largely cleared out his Upper East Side home.",
    "url": "https://www.nytimes.com/2024/11/05/us/politics/giuliani-apartment-defamation-election.html?unlocked_article_code=1.Xk4.FMaD.HRrsOdodBJn7&smid=url-share"
  },
  {
    "text": "X Is a White-Supremacist Site … X has always had a nazi problem.  I've covered the site, formerly known as Twitter, for more than a decade and reported extensively on its harassment problems, its verification (and then de-verification) of a white nationalist, and the glut of anti-Semitic hatred that roiled the platform in 2016.",
    "url": "https://www.theatlantic.com/technology/archive/2024/11/x-white-supremacist-site/680538/?gift=bQgJMMVzeo8RHHcE1_KM0T8uB7iimO1-elCapdzG8XE&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump-loving evangelical leader busted with hard drive full of appalling images  —  The former head of a Christian conservative voter outreach has been arrested for possession of child sexual abuse materials.  —  Jason C. Yates, former CEO of My Faith Votes, has been charged in Minnesota … ",
    "url": "https://www.rawstory.com/jason-yates-my-faith-votes/"
  },
  {
    "text": "Elon Musk is sued over $1 million election giveaway  —  Elon Musk was sued in a proposed class action on Tuesday by registered voters who signed his petition to support the Constitution for a chance to win his $1 million-a-day giveaway, and now claim it was a fraud.",
    "url": "https://www.reuters.com/legal/elon-musk-is-sued-over-1-million-election-giveaway-2024-11-05/"
  },
  {
    "text": "Vance says he's lost friends over Trump support  —  Ohio Sen. JD Vance, the Republican vice presidential nominee, said Tuesday that he's lost friends over his support for former President Trump.  —  “We can't discard friends, and we can't discard family members,” Vance said in a clip … ",
    "url": "https://thehill.com/homenews/campaign/4972658-vance-lost-friendships-trump-support/"
  },
  {
    "text": "Short On Cash After 2016 Election, Trump Secured Secret Loan  —  Even as Americans head to the polls, secrets are still emerging from the former president's first stint in office, like the fact that he got a hidden loan around the time he became president.  —  The last time Donald Trump won … ",
    "url": "https://www.forbes.com/sites/danalexander/2024/11/05/short-on-cash-after-2016-election-trump-secured-secret-loan/"
  },
  {
    "text": "Judge shreds RNC's ‘red herring’ attempt to invalidate Georgia votes  —  A federal judge in Georgia said an eleventh-hour bid by the Republican Party to set aside some absentee votes from Democratic-leaning counties was rife with dishonesty, “red herrings” and demands that would have required him to break his oath to the Constitution.",
    "url": "https://www.politico.com/live-updates/2024/11/05/2024-elections-live-coverage-updates-analysis/georgia-rnc-votes-case-00187486"
  },
  {
    "text": "Capitol Police arrest man who ‘smelled like fuel’ and had torch and flare gun  —  The U.S. Capitol Visitors Center was closed Tuesday afternoon, after Capitol Police arrested a man during their security screening process who was carrying a torch and flare gun.",
    "url": "https://thehill.com/regulation/court-battles/4973099-capitol-police-arrest-man-fuel-torch-flare-gun/"
  },
  {
    "text": "Michigan on pace to break voter turnout records, official says  —  Michigan Secretary of State Jocelyn Benson (D) said Tuesday that the Great Lake State, a critical battleground in the presidential race, is on track to break voter turnout records.  —  “Michiganders are already voting in record numbers.",
    "url": "https://thehill.com/homenews/campaign/4973132-michigan-on-pace-to-break-voter-turnout-records-official-says/"
  },
  {
    "text": "Texas church removes four elders over Trump-linked founder's abuse of girl, 12, in 1980s  —  Church said leaders ‘failed to inquire further’ after learning Robert Morris, ex-Trump adviser, molested girl for years  —  A Dallas-area Christian megachurch has removed four of its elders … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/05/gateway-church-founder-child-sex-abuse-texas"
  },
  {
    "text": "How are things looking in Pennsylvania?  Dems are feeling cautiously optimistic  —  How are Democrats feeling in Pennsylvania, the most pivotal battleground in the country?  Cautiously optimistic.  I surveyed 10 Dem elected officials and strategists across the state and, to a person … ",
    "url": "https://www.politico.com/live-updates/2024/11/05/2024-election-results-live-coverage-updates-analysis/pennsylvania-vibe-check-early-00187540"
  }
]