[
  {
    "text": "DOJ expected to announce indictment of Texas Democratic Rep. Henry Cuellar, sources say  —  Federal authorities searched the congressman's home in Laredo in 2022 as part of an investigation into the country of Azerbaijan and a group of U.S. businessmen.  —  WASHINGTON — The Justice Department … ",
    "url": "https://www.nbcnews.com/politics/congress/doj-expected-announce-indictment-texas-democratic-rep-henry-cuellar-so-rcna150567"
  },
  {
    "text": "Democratic Rep. Henry Cuellar expected to be indicted, source says  —  Washington — Federal prosecutors are expected to announce an indictment against Democratic Rep. Henry Cuellar of Texas on Friday, a U.S. official confirmed to CBS News.  —  Details of the indictment … ",
    "url": "https://www.cbsnews.com/news/henry-cuellar-innocent-justice-department-indictment/"
  },
  {
    "text": "SEC charges Trump Media auditor with ‘massive fraud’ on hundreds of companies, imposes lifetime ban … The auditing firm for Trump Media and the auditor's owner were charged Friday with “massive fraud” by the Securities and Exchange Commission for work that affected more than 1,500 SEC filings, the federal regulator announced.",
    "url": "https://www.cnbc.com/2024/05/03/trump-media-auditor-charged-by-sec-with-massive-fraud-permanently-barred-from-public-company-audits.html"
  },
  {
    "text": "SEC Charges Audit Firm BF Borgers and Its Owner with Massive Fraud Affecting More Than 1,500 SEC Filings  —  The Securities and Exchange Commission today charged audit firm BF Borgers CPA PC and its owner, Benjamin F. Borgers (together, “Respondents\"), with deliberate and systemic failures … ",
    "url": "https://www.sec.gov/news/press-release/2024-51"
  },
  {
    "text": "Gov. Kristi Noem's account of meeting North Korean dictator in doubt  —  UPDATE: Since the original publication of this story, a Noem spokesman told The Dakota Scout “the publisher will be addressing conflated world leaders' names in the book before it is released.”",
    "url": "https://www.thedakotascout.com/p/gov-kristi-noems-account-of-meeting"
  },
  {
    "text": "Playbook: Kristi Noem shoots at ‘lone wolf’ Nikki Haley  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WORTH YOUR TIME THIS MORNING — “What's Really Happening on College Campuses, According to Student Journalists,” by Catherine Kim",
    "url": "https://www.politico.com/newsletters/playbook/2024/05/03/kristi-noem-shoots-at-lone-wolf-nikki-haley-00155932"
  },
  {
    "text": "Biden expands health insurance access for DACA recipients  —  The move comes during an election year in which immigration has become a salient issue.  —  The White House announced Friday that it is moving forward with an initiative to expand access to health insurance for about 100,000 immigrants covered … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/03/biden-daca-health-care/"
  },
  {
    "text": "Trump Violates Gag Order by Posting Video Attacking Judge's Daughter  —  This potential violation occurred after Judge Merchan held Trump in contempt of court  —  On Thursday night, Trump posted a link to a Rumble clip of Steve Bannon's War Room podcast in which Trump supporting host Doug Burquam … ",
    "url": "https://www.meidastouch.com/news/trump-violates-gag-order-by-posting-video-attacking-judges-daughter"
  },
  {
    "text": "How one text exchange gave Trump an ominous day in court  —  Editor's Note: Norman Eisen is a CNN legal analyst and editor of “Trying Trump: A Guide to His First Election Interference Criminal Trial.”  He served as counsel to the House Judiciary Committee for the first impeachment and trial of then-President Donald Trump.",
    "url": "https://www.cnn.com/2024/05/02/opinions/keith-davidson-testimony-trump-ominous-day-in-court-eisen/"
  },
  {
    "text": "NYPD Officer Fired Gun Inside Columbia's Hamilton Hall, Manhattan DA's Office Confirms  —  An officer inside Columbia University's Hamilton Hall Tuesday evening to break up a pro-Palestinian student demonstration fired his gun, in an incident that is now under review by Manhattan District … ",
    "url": "https://www.thecity.nyc/2024/05/02/nypd-officer-fired-gun-columbia-hamilton-hall-raid/"
  },
  {
    "text": "President Biden Announces Recipients of the Presidential Medal of Freedom  —  Today, President Biden named nineteen recipients of the Presidential Medal of Freedom.  —  The Presidential Medal of Freedom is the Nation's highest civilian honor, presented to individuals who have made exemplary contributions … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/05/03/president-biden-announces-recipients-of-the-presidential-medal-of-freedom-2/"
  },
  {
    "text": "Make Billionaires Pay (Their Taxes)  —  Until recently, it was hard to know just how good the superrich are at avoiding taxes.  Public statistics are oddly quiet about their contributions to government coffers, a topic of legitimate interest in democratic societies.",
    "url": "https://www.nytimes.com/interactive/2024/05/03/opinion/global-billionaires-tax.html"
  },
  {
    "text": "Texas man files legal action to probe ex-partner's out-of-state abortion  —  The previously unreported petition reflects a potential new antiabortion strategy to block women from ending their pregnancies in states where abortion is legal.  —  As soon as Collin Davis found out his ex-partner … ",
    "url": "https://www.washingtonpost.com/investigations/2024/05/03/texas-abortion-investigations/"
  },
  {
    "text": "Who will Donald Trump choose as his running mate?  What to know as potential VPs gather in Florida.  —  WASHINGTON Former President Donald Trump will spend part of his weekend hosting the latest episode of “The Apprentice,” but this time it's the vice presidential edition.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/05/03/donald-trump-vice-president-running-mate/73510077007/"
  },
  {
    "text": "Ron DeSantis bans ‘global elite’ lab-grown meat  —  Florida Governor Ron DeSantis has banned lab-grown meat, saying he will “save our beef” from the “global elite” and its “authoritarian plans”.  —  “Florida is fighting back against the global elite's plan to force the world to eat meat grown … ",
    "url": "https://www.bbc.com/news/world-us-canada-68947766"
  },
  {
    "text": "Hope Hicks witnessed nearly every Trump scandal.  Now she must testify.  —  Friends say the former aide and Trump have not spoken since she testified to Congress about the Jan. 6 Capitol attack, but the two continue to have affection for each other  —  Special counsel Robert S. Mueller III … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/03/hope-hicks-testimony-trump-hush-money-trial/"
  },
  {
    "text": "Former government official charged with falsely implicating colleagues in Jan. 6 attack  —  Investigators say Miguel Zapata used “burner” emails to submit anonymous, false tips to an FBI tipline about seven ex-colleagues.  —  Federal prosecutors have charged a former government employee … ",
    "url": "https://www.politico.com/news/2024/05/03/former-government-official-charged-jan-6-capitol-riots-00155949"
  },
  {
    "text": "Government remains essential for the nation's financial stability and prosperity  —  A national leader finds himself face-to-face with a polarized Congress.  He passes major legislation investing in his country's infrastructure and economy but receives little credit for doing so.",
    "url": "https://thehill.com/opinion/4640478-government-remains-essential-for-the-nations-financial-stability-and-prosperity/"
  },
  {
    "text": "Elon Musk to reinstate X account of white nationalist Nick Fuentes … - The decision also came hours after Holocaust survivors launched a new campaign targeting antisemitism and disinformation online.  — Fuentes' X account was still suspended as of Friday morning.",
    "url": "https://www.axios.com/2024/05/03/elon-musk-nick-fuentes-x-account"
  },
  {
    "text": "Biden Says Japan ‘Xenophobic’ Along With China, Russia  — Remarks come weeks after Biden welcomed Japan's PM Kishida  — Immigration inches up in Japan, population still shrinking  —  US President Joe Biden included ally Japan along with rivals China and Russia in a list of countries he called … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-02/biden-now-calls-ally-japan-xenophobic-along-with-china-russia"
  }
]