[
  {
    "text": "Joseph Lieberman, senator and vice presidential nominee, dies at 82  —  Joseph I. Lieberman, the doggedly independent four-term U.S. senator from Connecticut who was the Democratic nominee for vice president in 2000, becoming the first Jewish candidate on the national ticket of a major party, died March 27 in New York City.",
    "url": "https://www.washingtonpost.com/obituaries/2024/03/27/joe-lieberman-senator-vice-president-dead/"
  },
  {
    "text": "Former Sen. Joe Lieberman, Democrats' VP pick in 2000, dead at 82  —  Former Sen. Joe Lieberman of Connecticut has died, according to his family.  He was 82 and died of complications from a fall.  —  Photos  —  Former U.S. Sen. Joe Lieberman of Connecticut, who nearly won the vice presidency … ",
    "url": "https://apnews.com/article/joe-lieberman-death-obit-senate-c82d9c92c1c4493fa5d708719884b12d"
  },
  {
    "text": "Chris Christie turns down No Labels presidential bid after discussions  —  The decision removes one of the top remaining prospects for the centrist group hoping to upset the two-party system this year with a “unity ticket”  —  Former New Jersey governor Chris Christie (R) … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/27/chris-christie-no-labels-president/"
  },
  {
    "text": "Trump Attacks R.F.K. Jr., a Third-Party Wild Card  —  Robert F. Kennedy Jr., the independent presidential candidate, has asserted that he intends to be a “spoiler” for both Donald Trump and President Biden.  —  Former President Donald J. Trump attacked Robert F. Kennedy Jr. … ",
    "url": "https://www.nytimes.com/2024/03/27/us/politics/trump-rfk-jr.html"
  },
  {
    "text": "Judge rules John Eastman should be disbarred over efforts to overturn 2020 election  —  A California judge on Wednesday recommended disbarring a lawyer at the center of former President Trump's efforts to overturn the results of the 2020 election.  —  State Bar Judge Yvette Roland found … ",
    "url": "https://thehill.com/regulation/court-battles/4560409-judge-rules-john-eastman-should-be-disbarred-over-efforts-to-overturn-2020-election/"
  },
  {
    "text": "John Eastman, architect of Trump's 2020 election plot, should be disbarred, judge rules  —  Judge Yvette Roland made the recommendation.  —  A California judge on Wednesday recommended the disbarment of John Eastman, calling to revoke the law license of one of Donald Trump's top allies … ",
    "url": "https://www.politico.com/news/2024/03/27/john-eastman-disbarred-00149468"
  },
  {
    "text": "Matt Schlapp's Accuser Was Paid to Drop Sexual Assault Suit  —  EXONERATED?  —  The GOP operative who sued Matt Schlapp over allegations of sexual assault dropped his lawsuit, prompting Schlapp to take a victory lap.  It's more complicated, however.",
    "url": "https://www.thedailybeast.com/matt-schlapps-accuser-was-paid-to-drop-sexual-assault-suit"
  },
  {
    "text": "CNN Exclusive: Conservative bigwig Matt Schlapp agreed to hefty settlement to end sexual assault lawsuit  —  The Republican operative who accused American Conservative Union chairman Matt Schlapp of sexual assault last year received a significant financial settlement in exchange for dropping … ",
    "url": "https://www.cnn.com/2024/03/27/politics/matt-schlapp-settlement-sexual-assault-lawsuit/"
  },
  {
    "text": "NBC offered Ronna McDaniel a better contract to appear on MSNBC  —  The cable channel was part of the broad push to clinch a contributor deal for McDaniel, whose hiring caused an uproar  —  MSNBC President Rashida Jones participated in recruiting former Republican National Committee chair … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/27/ronna-mcdaniel-nbc-msnbc-contract/"
  },
  {
    "text": "Settlement reached in lawsuit between Florida Gov. Ron DeSantis allies and Disney  —  ORLANDO, Fla. (AP) — Allies of Florida Gov. Ron DeSantis and Disney reached a settlement agreement Wednesday in a lawsuit over who controls Walt Disney World's governing district.",
    "url": "https://apnews.com/article/disney-florida-ron-desantis-settlement-91040178ad4708939e621dd57bc5e494"
  },
  {
    "text": "COVID-Cautious Americans Feel Abandoned  —  For all of 2020, Alex, a 28-year-old living in New York, followed the U.S. Centers for Disease Control and Prevention's (CDC) COVID-19 guidance “religiously.”  Then, in 2021, something began to shift.  That spring, the CDC said it was okay … ",
    "url": "https://time.com/6960789/covid-19-cautious-americans/"
  },
  {
    "text": "In Alabama, Abortion and IVF Helped Flip a Red Seat in a Special Election  —  On Tuesday, Alabama provided even more evidence of what we already know to be true: Abortion rights win elections.  —  Democrat Marilyn Lands won a special election for an Alabama state House seat … ",
    "url": "https://www.motherjones.com/politics/2024/03/marilyn-lands-alabama-special-election-ivf/"
  },
  {
    "text": "Fugitive US Militant Ammon Bundy Geolocated to Utah  —  In February 2024, American anti-government agitator Ammon Bundy posted a video with a provocative title to his YouTube channel: ‘Want to know where Ammon Bundy is?’  —  Earlier in 2023, Bundy was ordered by an Idaho court to pay … ",
    "url": "https://www.bellingcat.com/news/2024/03/27/fugitive-us-militant-ammon-bundy-geolocated-to-utah/"
  },
  {
    "text": "Speaker Johnson's only path to legislative salvation: House Democrats  —  The Republican House speaker finds himself continuously boxed in by his own side, with legislation — and maybe his job — dependent on the minority  —  House Speaker Mike Johnson (R-La.) faces a unique dilemma … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/27/speaker-johnsons-only-path-legislative-salvation-house-democrats/"
  },
  {
    "text": "Kari Lake and the Trump movement's billion-dollar defamation problem  —  For the second time in eight months, a top Donald Trump ally has, extraordinarily, declined to try to prove that they didn't defame an election worker.  Arizona Senate candidate Kari Lake (R) has joined former Trump lawyer Rudy Giuliani in that distinction.",
    "url": "https://www.washingtonpost.com/politics/2024/03/27/trump-lake-defamation/"
  },
  {
    "text": "Jon Stewart benefited by 829% ‘overvalue’ of his NYC home even as he labels Trump's civil case ‘not victimless’  —  Comedian Jon Stewart ranted this week that Donald Trump's civil real-estate case overvaluing his properties was “not victimless,” yet when it came to his own home, Stewart benefited from a similar inflation.",
    "url": "https://nypost.com/2024/03/27/real-estate/jon-stewart-found-to-have-overvalued-his-nyc-home-by-829/"
  },
  {
    "text": "Trump's Social Media Company Opens New Avenue for Conflicts of Interest  —  Ethics experts say Trump Media, now a publicly traded company, would present a new way for foreign actors or others to influence Donald J. Trump, if he is elected president.  —  When former President Donald J. Trump's … ",
    "url": "https://www.nytimes.com/2024/03/27/us/trump-media-truth-social-campaign.html"
  },
  {
    "text": "“This is insane”: RNC reportedly makes Trump's false election claims a “litmus test” for new hires  —  “If you say the election wasn't stolen, do you really think you're going to get hired?” ex-RNC staffer says  —  The Republican National Committee is asking prospective job candidates … ",
    "url": "https://www.salon.com/2024/03/27/this-is-insane-rnc-reportedly-makes-trumps-false-claims-a-litmus-test-for-new-hires/"
  },
  {
    "text": "How Trump Moved Money to Pay $100 Million in Legal Bills  —  Former President Donald J. Trump has spent more than $100 million since leaving office, on lawyers and other costs related to fending off various investigations, indictments and his coming criminal trials, according to a New York Times review of federal records.",
    "url": "https://www.nytimes.com/interactive/2024/03/27/us/politics/trump-cases-legal-fund.html"
  },
  {
    "text": "Lawmakers in Thailand overwhelmingly approve a bill to legalize same-sex marriage  —  Lawmakers in Thailand's lower house of Parliament overwhelmingly approved a marriage equality bill on Wednesday that would make the country the first in Southeast Asia to legalize equal rights for marriage partners of any gender.",
    "url": "https://apnews.com/article/thailand-marriage-same-sex-equality-law-9a2f9da6b5b36a1cf70dee5caec70e23"
  }
]