[
  {
    "text": "DNC projects message tying Trump to Hitler on Madison Square Garden during rally  —  The Democratic National Committee is projecting digital messages on Madison Square Garden's exterior during former President Donald Trump's campaign rally on Sunday about recent reports that he once praised Adolf Hitler … ",
    "url": "https://www.cbsnews.com/news/trump-madison-square-garden-rally-dnc-projections/"
  },
  {
    "text": "Trump's New York homecoming sparks backlash over racist and vulgar remarks  —  A pro-Trump comedian's racist diatribe drew widespread condemnation.  —  NEW YORK  —  Donald Trump's rally at Madison Square Garden, billed as a triumphant homecoming, instead turned into a political fiasco … ",
    "url": "https://www.politico.com/news/2024/10/27/trumps-madison-square-garden-racist-00185770"
  },
  {
    "text": "A Trump Rally Speaker Trashed Puerto Ricans.  Harris Reached Out to Them.  —  Her campaign moved swiftly to highlight that even as a speaker at Donald Trump's rally in New York made offensive remarks about Puerto Rico and Latinos, she was visiting Puerto Rican voters in Philadelphia.",
    "url": "https://www.nytimes.com/2024/10/27/us/politics/kamala-harris-philadelphia-voters.html"
  },
  {
    "text": "Anti-Puerto Rico comments at Trump rally spur outrage as Bad Bunny supports Harris  —  The artist's gesture of support came as a number of speakers at a Trump event in New York made racist and disparaging comments about Puerto Ricans and other Latinos.  —  Bad Bunny, the Puerto Rican recording artist … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/27/harris-bad-bunny-puerto-rico-trump/"
  },
  {
    "text": "Trump at the Garden: A Closing Carnival of Grievances, Misogyny and Racism  —  The inflammatory rally was a capstone for an increasingly aggrieved campaign for Donald Trump, whose rhetoric has grown darker and more menacing.  —  Donald J. Trump's closing rally at Madison Square Garden … ",
    "url": "https://www.nytimes.com/2024/10/27/us/trump-msg-rally.html?unlocked_article_code=1.Vk4.HOSe.ALhL4fWb0r2f&smid=url-share"
  },
  {
    "text": "Donald Trump's Racist NYC Rally Was Vile.  It Was Also Political Suicide  —  FINAL ACT  —  The Madison Square Garden rally, operatic in its repulsive bigotry, will almost certainly alienate more voters who might have voted for Trump.  —  OPINION  —  To all those Republicans … ",
    "url": "https://www.thedailybeast.com/donald-trumps-racist-nyc-rally-was-vile-it-was-also-political-suicide/"
  },
  {
    "text": "MAGA speakers unleash ugly rhetoric at Trump's MSG rally … - The remarks at Trump's rally undermine his campaign's effort to soften the former president's image among voters who may like his policies but dislike his divisive and race-baiting rhetoric.",
    "url": "https://www.axios.com/2024/10/27/trump-madison-square-garden-rally"
  },
  {
    "text": "As Trump courts their vote, comedian at his rally makes racist jokes about Latinos and Puerto Rico  —  Comedian Tony Hinchcliffe made crude jokes about Latinos having babies and called Puerto Rico a “floating island of garbage.”  —  As former President Donald Trump courts the community's vote … ",
    "url": "https://www.nbcnews.com/politics/2024-election/comedian-trump-rally-makes-racist-jokes-latinos-puerto-rico-rcna177514?taid=671ebeec9303b30001fd3d81"
  },
  {
    "text": "Bad Bunny shares Kamala Harris's video on Puerto Rico on Instagram  —  Puerto Rican rapper and superstar Bad Bunny posted a video from Vice President Harris on his Instagram story Sunday.  —  In the video, Harris talks to Puerto Ricans, saying that “this election is not just a choice between Donald Trump … ",
    "url": "https://thehill.com/blogs/in-the-know/4956229-bad-bunny-kamala-harris-video-puerto-rico-instagram/"
  },
  {
    "text": "Trump's Madison Square Garden rally overshadowed by his allies' crude and racist remarks  —  The event in deep-blue New York City was designed to mark the start of Trump's closing argument in the final days of the campaign.  —  Former President Donald Trump delivered his standard lines … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-madison-square-garden-rally-allies-crude-racist-remarks-rcna177487"
  },
  {
    "text": "2 new polls show Harris leading Trump as the election nears.  Women continue to propel the VP's candidacy.  — Kamala Harris' strength with female voters is fueling her overall leads in two new national polls.  — A CBS News poll showed Harris up by one point, while an ABC News poll had her ahead by four points.",
    "url": "https://www.businessinsider.com/harris-trump-national-polls-women-gender-gap-election-2024-10"
  },
  {
    "text": "‘Betrayal’: Marty Baron, former Washington Post editor, slams paper's non-endorsement  —  Jeff Bezos' decision to block the Washington Post's presidential endorsement has been met with a lot of strong reactions - including from the paper's own journalists and its legendary former Executive Editor Marty Baron.",
    "url": "https://www.msnbc.com/ali-velshi/watch/-betrayal-marty-baron-former-washington-post-editor-slams-paper-s-non-endorsement-222795333869"
  },
  {
    "text": "Trump ad depicts country ‘gone to hell’ — during Trump's presidency  —  Donald Trump's two-minute ad that aired during Sunday's Philadelphia Eagles game and said the country had “gone to hell” during the Biden and Harris administration featured an image from a protest during Trump's presidency, not Biden's.",
    "url": "https://www.politico.com/live-updates/2024/10/27/2024-elections-live-coverage-updates-analysis/gone-to-hell-when-00185767"
  },
  {
    "text": "Some billionaires, CEOs hedge bets as Trump vows retribution  —  With the race tight, some business elites are toning down past criticism of the former president.  —  At a five-star resort in California last week, Wall Street executives, fast-food CEOs, a few dozen other industry titans … ",
    "url": "https://www.washingtonpost.com/business/2024/10/28/trump-bezos-billionaires-zuckerberg/"
  },
  {
    "text": "How a Splintered Left Is Preparing for a Possible Trump Victory  —  After the former president's 2016 victory, they marched.  Now, Democrats wrestle with how to mount an uprising—and whether to even do so.  —  By now America is well versed in the predictions of the political right's potential response … ",
    "url": "https://www.wsj.com/politics/elections/left-wrestles-with-a-possible-trump-win-40857a95"
  },
  {
    "text": "Four Lessons From Nine Years of Being ‘Never Trump’  —  I've been wrong about many things, but here are two of the bigger whiffs of my professional life.  —  I thought Donald Trump wouldn't find any meaningful support in the Republican Party.  I watched his strange campaign announcement … ",
    "url": "https://www.nytimes.com/2024/10/27/opinion/never-trump-maga-evangelicals.html?unlocked_article_code=1.VU4.7iHw.z7LMXQQYw6l9&smid=url-share"
  },
  {
    "text": "Courage & Cowardice  —  Hello.  —  I once met Katharine Graham at an intimate dinner party with five or six other people in her Georgetown mansion.  It was early 1992 and the presidential primary season was just beginning.  On the Democratic side, the field was still wide open; there were no obvious front-runners.",
    "url": "https://geneweingarten.substack.com/p/courage-and-cowardice"
  }
]