[
  {
    "text": "Hill Dems brace for party reckoning over Biden  —  The party's panic over the president's electability has spiraled behind the scenes — and is likely to spill more into public view in the coming days.  —  President Joe Biden's outreach efforts to congressional Democrats haven't quelled … ",
    "url": "https://www.politico.com/news/2024/07/08/hill-dems-brace-for-fight-over-bidens-future-to-get-worse-00166950"
  },
  {
    "text": "Read the letter President Biden sent to House Democrats telling them to support him in the election  —  President Joe Biden wants Democrats in Congress to know he has no intention of exiting this year's election, sending them a letter on Monday on his personal letterhead.",
    "url": "https://apnews.com/article/biden-letter-democrats-4562a72aa3a891e55261617d0d494d00"
  },
  {
    "text": "Playbook: The Democratic split to watch  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  DEPT. OF SHIT-STIRRING — “Poll finds Biden damaged by debate; with Harris and Clinton best positioned to win,” by Christopher Cadelago: “The national poll … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/09/the-democratic-split-to-watch-00166992"
  },
  {
    "text": "Defiant Biden tells donors: 'We're done talking about the debate'  —  A defiant President Joe Biden insisted to his donors on Monday that he is “done talking about the debate” and implored the party to ignore any further distractions and direct its attention back to Donald Trump.  “We need to move forward.",
    "url": "https://www.politico.com/live-updates/2024/07/08/congress/defiant-biden-tells-donors-were-done-with-the-debate-00166834"
  },
  {
    "text": "Poll finds Biden damaged by debate; with Harris and Clinton best positioned to win  —  Vice President Kamala Harris is now running ahead of Trump, 42 percent to 41 percent, the survey found.  —  A top Democratic pollster has a new survey showing President Joe Biden still in contention against Donald Trump … ",
    "url": "https://www.politico.com/news/2024/07/09/biden-clinton-harris-democrat-poll-00166937"
  },
  {
    "text": "White House doctor offers explanation for Parkinson's expert's visits  —  The doctor held regular Neurology clinics at the White House, she said  —  In a letter released late Monday night by the president's physician, Dr. Kevin O'Connor, he confirmed that Dr. Kevin Cannard … ",
    "url": "https://abcnews.go.com/Politics/white-house-doctor-offers-explanation-parkinsons-experts-visits/story?id=111764565"
  },
  {
    "text": "Peter Baker Argues Joe Biden Is Unfit because Peter Baker Is Too Lazy to Read the Homework  —  The NYT and ABC have now joined the insane mob tying the White House visits of a neurologist who has written papers on topics that include Parkinson's, Dr. Kevin Cannard, to their wild brays that Joe Biden is unfit to stay in the race.",
    "url": "https://www.emptywheel.net/2024/07/08/peter-baker-argues-joe-biden-is-unfit-because-peter-baker-is-too-lazy-to-read-the-homework/"
  },
  {
    "text": "‘No one is picking up the phone’: Joe Biden's fundraising confronts new hurdles after debate … President Joe Biden's fundraising operation started showing cracks in its once formidable armor, almost 10 days after his disastrous presidential debate performance.",
    "url": "https://www.cnbc.com/2024/07/08/joe-biden-fundraising-debate.html"
  },
  {
    "text": "Trump Says He Has Yet to Finalize Vice Presidential Pick  — Nominee says he'd ‘love’ to announce during the GOP convention  — Former president says he seeks someone to help him get elected  —  Donald Trump said he has yet to make a final decision on who his vice presidential pick … ",
    "url": "https://www.bloomberg.com/news/articles/2024-07-09/trump-says-he-has-yet-to-finalize-vice-presidential-pick"
  },
  {
    "text": "Republicans Move at Trump's Behest to Change How They Will Oppose Abortion  —  (MILWAUKEE) — The Republican National Committee's platform committee has adopted a policy document that reflects former President Donald Trump's position opposing a federal abortion ban and ceding limits to states … ",
    "url": "https://time.com/6996118/republican-national-committee-platform-abortion-trump/"
  },
  {
    "text": "The alarming new power Trump will claim in a second term  —  Donald Trump says that if he returns to the White House in 2025, he will have the power to effectively cancel any federal program — or even an entire agency — by refusing to spend money appropriated by Congress.",
    "url": "https://popular.info/p/the-alarming-new-power-trump-will"
  },
  {
    "text": "Texas sends millions to anti-abortion groups with little accountability  —  Since the Supreme Court overturned Roe v. Wade in 2022, taxpayer money has poured into what are known as crisis pregnancy centers.  These controversial organizations have a long-stated mission to discourage pregnant women from seeking abortions.",
    "url": "https://www.cbsnews.com/video/texas-sends-millions-to-anti-abortion-groups-with-little-accountability/"
  },
  {
    "text": "Le Pen Faces Probe for 2022 French Election Campaign Funding  — The far-right leader suspected of unlawfully taking a loan  — Report comes after National Rally came 3rd in legislative vote  —  French far-right leader Marine Le Pen faces an investigation over suspicions … ",
    "url": "https://www.bloomberg.com/news/articles/2024-07-09/france-s-le-pen-faces-probe-into-possible-illegal-campaign-funds"
  },
  {
    "text": "House Freedom Caucus ousts Warren Davidson  —  Members of the House Freedom Caucus ousted Rep. Warren Davidson (R-Ohio) on Monday night — less than a month after he started a firestorm within the group by endorsing Chair Bob Good's primary challenger.  The vote to oust Davidson took place during … ",
    "url": "https://www.politico.com/live-updates/2024/07/08/congress/another-freedom-caucus-ouster-00166978"
  },
  {
    "text": "A Dangerous Double Standard  —  All our energies must go to defeating Trump  —  What a weekend.  You know I have seen some things in my seven decades covering American politics.  I have never seen anything quite like the wrangling, hand-wringing, and behind-the-scenes gamesmanship currently swirling around President Biden.",
    "url": "https://steady.substack.com/p/a-dangerous-double-standard"
  },
  {
    "text": "Texas Governor Greg Abbott Jets Off to Asia as Hurricane Beryl Lashes His State  —  SOUND FAMILIAR?  —  Abbott departed for South Korea, Taiwan, and Japan on Friday as forecasts showed that Beryl was likely to hit Texas on Monday.  —  Texas Governor Greg Abbott boasted of having … ",
    "url": "https://www.thedailybeast.com/gov-greg-abbott-tours-jets-to-asia-as-hurricane-beryl-lashes-texas"
  }
]