[
  {
    "text": "Judge Chutkan denies Trump's request to recuse herself in federal election subversion case  —  U.S. District Judge Tanya Chutkan said Wednesday she won't recuse herself from Donald Trump's 2020 election interference case in Washington, rejecting the former president's claims … ",
    "url": "https://apnews.com/article/donald-trump-justice-department-special-counsel-jan-6-8439ca0fcae8e7cf2a15663f9888e75a"
  },
  {
    "text": "Ruling Against Trump Cuts to the Heart of His Identity  —  The finding by a judge in a New York civil case that Donald Trump committed fraud in valuing his real estate properties undermined the narrative of the business career that launched him in politics.  —  Nearly every aspect … ",
    "url": "https://www.nytimes.com/2023/09/27/us/politics/trump-fraud-ruling.html"
  },
  {
    "text": "Trump Asked His Lawyers for Ways to Suppress His ‘Perfect Call’  —  The former president says his demand to ‘find’ votes in Georgia was absolutely pristine.  Some of his lawyers have a different view  —  IN PUBLIC, DONALD Trump says his conversation with the Georgia secretary of state asking to … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-georgia-perfect-call-1234832866/"
  },
  {
    "text": "Judge Gives Trump Organization the Corporate Death Penalty  —  Donald Trump is no longer in business.  —  Worse, the self-proclaimed multibillionaire may soon be personally bankrupt as a result, stripped of just about everything because for years he engaged in calculated bank fraud … ",
    "url": "https://www.dcreport.org/2023/09/26/donald-trump-liable-for-fraud/"
  },
  {
    "text": "How much would your house be worth if the Trump Organization owned it?  —  A year offering no shortage of bad news for Donald Trump outdid itself Tuesday afternoon, with New York Supreme Court Justice Arthur Engoron ruling that the former president's namesake business, the Trump Organization … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/trump-property-inflated-values/"
  },
  {
    "text": "Donald Trump's Mar-a-Lago estate worth ‘at least’ $300M, not $18M as NY judge cites  —  A New York judge's Tuesday ruling valuing Donald Trump's sprawling, headline-making Florida estate at $18 million has left industry experts perplexed.  —  In his verdict, Manhattan Supreme Court Justice … ",
    "url": "https://nypost.com/2023/09/27/donald-trumps-mar-a-lago-worth-at-least-300m-sources/"
  },
  {
    "text": "Gen. Milley says he has “appropriate” safety measures after Trump social media threat  —  Outgoing Chairman of the Joint Chiefs of Staff Gen. Mark Milley has “appropriate measures” to ensure his safety, he said this week in his first public response to shocking comments made by former President … ",
    "url": "https://www.cbsnews.com/news/general-milley-responds-to-trump-social-media-post-60-minutes/"
  },
  {
    "text": "Shutdown odds grow as House GOP leaders reject Senate's spending bill  —  A federal government shutdown looked increasingly likely as House Republicans indicated Wednesday they would not consider a bipartisan Senate plan to fund the government past the weekend deadline.",
    "url": "https://www.washingtonpost.com/business/2023/09/27/government-shutdown-house-rejects-senate-spending-bill/"
  },
  {
    "text": "Poll: Republicans see Trump as a ‘person of faith’ ... more so than Mitt Romney, Mike Pence and others  —  Sen. Mitt Romney tops the list for independents, while more Democrats say President Biden is a man of faith  —  More than half of Republicans see former President Donald Trump as a person of faith … ",
    "url": "https://www.deseret.com/2023/9/26/23891360/trump-biden-man-of-faith-religious-mitt-romney-vivek-ramaswamy"
  },
  {
    "text": "Trump Tries to Court Blue-Collar Workers at a Nonunion Factory  —  A day after President Biden appeared on a union picket line, the former president will speak at an auto parts factory, but it's unclear whether any striking workers will be in the crowd.  —  Former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2023/09/27/us/politics/trump-autoworkers-detroit.html"
  },
  {
    "text": "Biden tops Trump by 5 points in new survey  —  President Biden tops former President Trump by 5 points among registered voters in a 2024 hypothetical matchup, new polling shows.  —  Asked who they'd back if Trump and Biden were their respective party's nominees, 45 percent of registered voters … ",
    "url": "https://thehill.com/homenews/campaign/4225778-biden-tops-trump-by-5-points-in-new-survey/"
  },
  {
    "text": "Jared Kushner pressured Washington Post to fire editor over Russia, book says  —  Marty Baron says Trump's son-in-law leaned on Post publisher to withdraw support of Russia election interference investigation  —  Donald Trump's son-in-law and senior White House adviser, Jared Kushner … ",
    "url": "https://www.theguardian.com/books/2023/sep/27/jared-kushner-editor-washington-post-trump-russia-election-interference-2016"
  },
  {
    "text": "The impeachment inquiry is starting exactly as might have been expected  —  When the Democratic majority in the House held the first public hearing in its 2019 impeachment inquiry targeting President Trump, it heard testimony from members of Trump's administration who could speak to the central allegation … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/comer-biden-impeachment-hearing/"
  },
  {
    "text": "Four-Time Congressional Candidate Charged in Long-Running Misuse of Campaign Funds  —  For Immediate Release  —  U.S. Attorney's Office, Central District of California  —  LOS ANGELES - Federal prosecutors today unsealed a grand jury indictment that accuses a Torrance man who was a candidate … ",
    "url": "https://www.justice.gov/usao-cdca/pr/four-time-congressional-candidate-charged-long-running-misuse-campaign-funds"
  },
  {
    "text": "At least 20 arrested in night of looting throughout Philly, police say  —  Large crowds — mostly consisting of juveniles — looted multiple stores and damaged property across Philadelphia Tuesday night, police said.  —  It was around 8 p.m. when, officials said, police started receiving calls … ",
    "url": "https://www.nbcphiladelphia.com/news/local/large-crowds-of-juveniles-loot-multiple-stores-in-center-city-police-say/3654732/"
  },
  {
    "text": "Trump's Georgia Prosecutor Fires Back at Efforts to Have RICO Case Charges Dismissed  —  Fani Willis filed a series of responses this week to motions from Kenneth Chesebro and Sidney Powell seeking to dismiss the underlying Fulton County DA's charges  —  A Facebook icon representing … ",
    "url": "https://themessenger.com/politics/trump-georgia-prosecutor-fani-willis-motions-rico"
  },
  {
    "text": "US Senator Bob Menendez pleads not guilty to corruption charges  —  U.S. Senator Bob Menendez pleaded not guilty on Wednesday to charges of taking bribes from three New Jersey businessman, as calls for his resignation from his fellow Democrats escalated.  —  Federal prosecutors in Manhattan … ",
    "url": "https://www.reuters.com/world/us/us-senator-bob-menendez-appear-court-calls-resignation-mount-2023-09-27/"
  },
  {
    "text": "Student-loan borrowers have a new safeguard in place to ensure their debt doesn't pile up once they graduate  — The Education Department released its final version of the gainful employment rule.  — It would prevent borrowers from enrolling in program that leaves them with too much debt compared to earnings.",
    "url": "https://www.businessinsider.com/what-is-new-gainful-employment-rule-student-loan-debt-relief-2023-9?op=1"
  },
  {
    "text": "Musk's X disabled feature for reporting electoral misinformation - researcher  —  Elon Musk's X, formerly called Twitter, disabled a feature that let users report misinformation about elections, a research organisation said on Wednesday, throwing fresh concern about false claims spreading just before major U.S. and Australian votes.",
    "url": "https://www.reuters.com/technology/musks-x-disabled-feature-reporting-electoral-misinformation-researcher-2023-09-27/"
  },
  {
    "text": "Court rulings poised to play pivotal role in battle for Congress  —  The Supreme Court's Alabama decision was just one among a series of redistricting cases expected to influence the balance of power on Capitol Hill  —  The Supreme Court's order Tuesday clearing the way for a second Alabama … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/supreme-court-alabama-redistricting/"
  }
]