[
  {
    "text": "The real reason Trump is destroying the economy  —  The Trump administration's tariffs are, by every reasonable account, an economic catastrophe in the making.  So why are they happening?  —  One explanation is that this is simply democracy at work.  President Donald Trump campaigned … ",
    "url": "https://www.vox.com/politics/407053/trump-tariff-expensive-democracy-authoritarianism-breakdown"
  },
  {
    "text": "Trump sued over China tariffs  —  President Trump was sued Thursday over the 20 percent tariffs he imposed on Chinese goods in the weeks leading up to Wednesday's broader announcement.  —  It marks the first known legal challenge against Trump's tariffs, which have fulfilled a campaign promise and rattled financial markets.",
    "url": "https://thehill.com/homenews/5231388-trump-sued-over-china-tariffs/"
  },
  {
    "text": "Carney hits back at Trump's auto tariffs, warns U.S. trade action will ‘rupture the global economy’  —  ‘We must respond with both purpose and force,’ Liberal leader says after Trump takes aim at Canada again  —  Liberal Leader Mark Carney said Thursday U.S. President Donald Trump's move … ",
    "url": "https://www.cbc.ca/news/politics/carney-hits-back-trump-1.7500990"
  },
  {
    "text": "Trump contradicts aides, talking points on purpose of global tariffs  —  Investors and global leaders have been trying to understand the purpose of sprawling new import duties.  —  President Donald Trump on Thursday contradicted his top aides on the purpose of his sprawling new global tariff regime … ",
    "url": "https://www.washingtonpost.com/business/2025/04/03/tariffs-trump-global-trade-talks/"
  },
  {
    "text": "Republicans play powerless as Trump tariff fears sweep across the globe  —  While GOP lawmakers could stop the presidential levies, they made clear they would not do so anytime soon.  —  Faced with President Donald Trump's sweeping new tariffs, Wall Street traders voted with their dollars Thursday … ",
    "url": "https://www.politico.com/news/2025/04/03/trump-tariffs-congress-republicans-powerless-00271537"
  },
  {
    "text": "Trump just imposed the largest tax hike since 1942 without congressional approval  —  Trump's tariffs are a tax by another name, and the power to levy taxes lies with Congress.  —  The full economic impact of the shockingly large “reciprocal” tariffs that President Donald Trump announced … ",
    "url": "https://www.washingtonpost.com/opinions/2025/04/03/trump-tariffs-taxation-congress/"
  },
  {
    "text": "National Security Agency and Cyber Command chief Gen. Timothy Haugh ousted  —  The director of the NSA, the powerful wiretapping and cyber espionage service, was fired and reassigned Thursday, according to U.S. officials.  —  just now  —  The director of the powerful wiretapping … ",
    "url": "https://www.washingtonpost.com/national-security/2025/04/03/nsa-director-fired-tim-haugh/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzNjUyODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1MDM1MTk5LCJpYXQiOjE3NDM2NTI4MDAsImp0aSI6ImU5MGYyZTIyLTZlMWUtNDI5Ny1iODVmLTRkMmNhNTM5ZDJhMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA0LzAzL25zYS1kaXJlY3Rvci1maXJlZC10aW0taGF1Z2gvIn0.7AVXq6PGEYYtSiu9nV1l4fhRg0-IrJpb6HtYrKyQ0Yo&itid=gfta"
  },
  {
    "text": "Head of National Security Agency and Cyber Command Is Ousted  —  No reason was given for the removal of Gen. Timothy D. Haugh, but the far-right activist Laura Loomer had called for his ouster in a meeting with President Trump, an official said.  —  The head of the National Security Agency … ",
    "url": "https://www.nytimes.com/2025/04/03/us/politics/nsa-cyber-command-chief-fired.html?unlocked_article_code=1.9E4.h78r.muOL8d3IxEvb&smid=url-share"
  },
  {
    "text": "California, Connecticut and Washington lose federal grant funding for local libraries and museums  —  Sydney Carruth and Ryan J. Reilly  —  Several states were notified this morning the federal grant funding they rely on to operate local libraries and museums has been terminated.",
    "url": "https://www.nbcnews.com/politics/trump-administration/live-blog/trump-tariffs-china-doge-musk-immigration-live-updates-rcna199420/rcrd76195?canonicalCard=true"
  },
  {
    "text": "South Korean court removes president from office, says he violated duties  —  The Constitutional Court upheld the impeachment of President Yoon Suk Yeol over his attempt to impose martial law, a decision expected to exacerbate political divisions.  —  Just now",
    "url": "https://www.washingtonpost.com/world/2025/04/03/south-korea-president-removed-martial-law/"
  },
  {
    "text": "Jubilation in South Korea After President Who Declared Martial Law Is Ousted  —  The nation's top court unanimously upheld the impeachment of Yoon Suk Yeol, clearing the way for the election of a new president.  —  Here's the latest.  —  South Korea's top court voted unanimously to dismiss … ",
    "url": "https://www.nytimes.com/live/2025/04/03/world/south-korea-yoon?unlocked_article_code=1.9E4.i2b6.EEITEAhitQBA&smid=url-share"
  },
  {
    "text": "RFK Jr. announces HHS reinstating some programs, employees cut by mistake  —  He didn't indicate when the reinstatements would happen.  —  Health and Human Services Secretary Robert F. Kennedy Jr. arrives before President Donald Trump speaks during an event to announce new tariffs … ",
    "url": "https://abcnews.go.com/Politics/rfk-jr-announces-hhs-reinstating-programs-employees-cut/story?id=120463293"
  },
  {
    "text": "RFK Jr. says 20% of health agency layoffs could be mistakes  —  Health and Human Services Secretary Robert F. Kennedy Jr. suggested Thursday that around 20% of the job cuts by the Trump administration's Department of Government Efficiency will be wrong and need to be corrected.",
    "url": "https://www.cbsnews.com/news/rfk-jr-hhs-job-cuts-doge-mistakes/"
  },
  {
    "text": "Judge Blocks H.H.S. From Terminating $11 Billion in Public Health Grants  —  A coalition of states sued over the Trump administration's unexpected move to cut off the funds, which they said imperiled everything from childhood vaccination programs to opioid addiction treatment.",
    "url": "https://www.nytimes.com/2025/04/03/us/politics/hhs-public-health-grants-judge.html?unlocked_article_code=1.804.3weI.YX-dOoE8si5U&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "The American Age Is Over  —  1. Canada  —  Fittingly, it was the Canadian prime minister, Mark Carney, who declared the official time of death. … And just like that, the age of American empire, the great Pax Americana, ended.  —  Share  —  We cannot overstate what has just happened.",
    "url": "https://www.thebulwark.com/p/the-american-age-is-over"
  },
  {
    "text": "Trump Administration Set to Pause $510 Million for Brown University  —  The administration has now targeted five schools' federal funding as part of a pledge to combat what it considers to be antisemitism on university campuses.  —  The Trump administration intends to block $510 million … ",
    "url": "https://www.nytimes.com/2025/04/03/us/trump-administration-brown-university-funding-pause.html"
  },
  {
    "text": "Senate confirms Dr. Oz to lead Medicare and Medicaid  —  He will oversee how physicians are paid through Medicare.  —  Dr. Mehmet Oz, the heart surgeon turned daytime television star, has a new job — overseeing the nation's largest health insurance programs.",
    "url": "https://www.politico.com/news/2025/04/03/senate-confirmation-mehmet-oz-medicare-medicaid-00270913"
  },
  {
    "text": "Eugene Robinson Leaves the Washington Post After Jeff Bezos' ‘Significant Shift’ to Opinion Section  —  “I wish nothing but the very best for the paper and for all of you.  I won't be a stranger,” the political columnist tells his colleagues after 45 years at WaPo",
    "url": "https://www.thewrap.com/eugene-robinson-leaves-the-washington-post-jeff-bezos-opinion/"
  },
  {
    "text": "Trump Officials Could Be Held in Contempt for Deportation Flights, Judge Says  —  Judge says administration ‘acted in bad faith’ in removal of alleged Venezuelan gang members under wartime law  —  WASHINGTON—A federal judge said he was considering whether to hold Trump administration officials … ",
    "url": "https://www.wsj.com/politics/policy/trump-officials-could-be-held-in-contempt-for-deportation-flights-judge-says-279bb61d"
  },
  {
    "text": "Radio Free Europe says US switches off satellite transmitting Russia broadcast  —  PRAGUE - The head of Radio Free Europe/Radio Liberty said on April 3 that the US government had switched off a satellite that transmitted its Russian-language programme into Russia.",
    "url": "https://www.straitstimes.com/world/europe/radio-free-europe-says-us-switches-off-satellite-transmitting-russia-broadcast"
  },
  {
    "text": "A Response to a Member of Congress  —  Sydney Kamlager-Dove, a Democrat representing California's 37th district in Los Angeles, began her opening remarks in a House Foreign Affairs Subcommittee hearing Tuesday with a comment directed to me.  “To distract from the dumpster fire this administration is pursuing … ",
    "url": "https://www.racket.news/p/a-response-to-a-member-of-congress"
  },
  {
    "text": "Army Planners Are Weighing Force Reductions of Up to 90,000 Active-Duty Soldiers  —  The Army is quietly considering a sweeping reduction of up to 90,000 active-duty troops, a move that underscores mounting fiscal pressures at the Pentagon and a broader shift in military strategy away from Europe … ",
    "url": "https://www.military.com/daily-news/2025/04/03/army-mulling-dramatic-reduction-of-tens-of-thousands-of-troops.html"
  },
  {
    "text": "Exclusive: Trump White House directs NIH to study ‘regret’ after transgender people transition … - Max Kozlov  —  You can also search for this author in  —  PubMed Google Scholar  —  As the US National Institutes of Health (NIH) continues to defund nearly every research project on transgender health … ",
    "url": "https://www.nature.com/articles/d41586-025-01029-8"
  },
  {
    "text": "Trump's highest tariff will kill tiny African kingdom of Lesotho, economist says  —  A 50% reciprocal trade tariff on Lesotho, the highest levy on U.S. President Donald Trump's long list of target economies, will kill the tiny Southern African kingdom that Trump ridiculed last month, an economic analyst there said on Thursday.",
    "url": "https://www.reuters.com/world/africa/trump-slaps-tiny-african-kingdom-lesotho-with-highest-tariff-all-2025-04-03/"
  }
]