[
  {
    "text": "In talks with prosecutors, Hunter Biden's lawyers vowed to put the president on the stand  —  A behind-the-scenes look at how a plea deal for the president's son nearly came together before it fell apart.  —  It was Halloween of 2022, and Hunter Biden's lawyer, Chris Clark, didn't sound happy.",
    "url": "https://www.politico.com/news/2023/08/19/hunter-biden-plea-deal-collapse-00111974"
  },
  {
    "text": "Before investigating Hunter Biden, prosecutor worked with brother Beau  —  David Weiss, the special counsel investigating Hunter Biden, has long targeted Delaware's powerful interests.  His onetime experience with Beau Biden potentially complicates the probe.",
    "url": "https://www.washingtonpost.com/politics/2023/08/20/hunter-biden-david-weiss-special-prosecutor-delaware/"
  },
  {
    "text": "MAGA world lashes out over DeSantis' ‘listless vessels’ remark  —  Trump campaign and supporters push comparisons to Hillary Clinton's ‘deplorables’ remark.  —  The Trump campaign and MAGA world on Saturday blasted Florida Gov. Ron DeSantis for remarks appearing to label some of the former president's supporters “listless vessels.”",
    "url": "https://www.politico.com/news/2023/08/19/desantis-trump-listless-vessels-00111971"
  },
  {
    "text": "DeSantis opens up about leaked debate strategy memo, vows to punch back in first GOP showdown  —  Fox News hosts the first Republican presidential nomination debate on Wednesday in Milwaukee, Wisconsin  —  MANCHESTER, N.H. - Florida Gov. Ron DeSantis says he's “ready to do what we need to” … ",
    "url": "https://www.foxnews.com/politics/desantis-opens-up-about-leaked-debate-strategy-memo-vows-punch-back-first-gop-showdown"
  },
  {
    "text": "How G.O.P. Views of Biden Are Helping Trump in the Republican Primary  —  In interviews and polling, many Republican voters believe President Biden is so weak that picking the most electable candidate to beat him no longer matters.  —  Gov. Ron DeSantis of Florida has run into a surprising buzz saw … ",
    "url": "https://www.nytimes.com/2023/08/20/us/politics/biden-trump-republican-primary.html"
  },
  {
    "text": "Trump May Skip Some G.O.P. Debates, but Advisers See a Biden Face-Off as Key  —  The strong desire of Mr. Trump's advisers to see him debate Mr. Biden in the event of a rematch could lead to a clash with the Republican National Committee.  —  On July 17, the head of the Republican Party traveled … ",
    "url": "https://www.nytimes.com/2023/08/20/us/politics/trump-biden-debates.html"
  },
  {
    "text": "Trump to release taped interview with Tucker Carlson, skipping GOP debate  —  Former president Donald Trump intends to skip the first Republican presidential primary debate in Milwaukee on Wednesday and instead plans to post a prerecorded interview with former Fox News host Tucker Carlson … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/19/trump-gop-debate-tucker-carlson/"
  },
  {
    "text": "Meadows told special counsel he could not recall Trump ever declassifying Mar-a-Lago docs: Sources  —  Trump has insisted that he declassified all the materials before he left office.  —  Appearing to contradict former President Donald Trump's primary public defense in the classified documents case … ",
    "url": "https://abcnews.go.com/US/meadows-told-special-counsel-recall-trump-declassifying-mar/story?id=102396159"
  },
  {
    "text": "Jimmy and Rosalynn Carter's Grandson Offers Update on Their Health: 'We're in the Final Chapter' (Exclusive)  —  Josh Carter tells PEOPLE that while it's “different” visiting his grandparents' home now that they've grown a bit quieter, “they are still here, they are still holding hands and still very much together”",
    "url": "https://people.com/jimmy-rosalynn-carter-health-update-exclusive-7692868"
  },
  {
    "text": "Bucks County power struggle could hint at shifting suburban politics for 2024  —  “As Bucks County goes, Pennsylvania will go.”  —  DOYLESTOWN, Pa. — An obscure race for county commissioner underway here in a suburb outside of Philadelphia could tell us a lot about who will win the presidential election in 2024.",
    "url": "https://www.politico.com/news/2023/08/20/bucks-county-pennsylvania-2024-00111933"
  },
  {
    "text": "The Education of Ron DeSantis: 5 Takeaways  —  Mr. DeSantis, the Republican governor and presidential candidate, leaned heavily on his Ivy League schooling before using it as fodder in the culture wars.  Here are key findings from a Times examination.  —  As Gov. Ron DeSantis of Florida seeks … ",
    "url": "https://www.nytimes.com/2023/08/20/us/politics/ron-desantis-takeaways.html"
  },
  {
    "text": "Factbox: Russia's Luna-25 moon mission fails: what you need to know  —  Russia's first moonshot in nearly half a century has failed after its Luna-25 spacecraft spun out of control and smashed into the moon.  —  Following are details about the mission and what its failure is likely to mean.",
    "url": "https://www.reuters.com/technology/space/russias-luna-25-moon-mission-fails-what-you-need-know-2023-08-20/"
  },
  {
    "text": "White House is torn over Joe Manchin's fury at climate law he crafted  —  As White House officials weigh how much to give in to his demands, rift grows between president and senator from West Virginia  —  The obscure federal agency that oversees the nation's immense tangle of pipelines … ",
    "url": "https://www.washingtonpost.com/business/2023/08/19/inflation-reduction-act-joe-manchin-biden/"
  },
  {
    "text": "The Constitution Prohibits Trump From Ever Being President Again  —  The only question is whether American citizens today can uphold that commitment.  —  As students of the United States Constitution for many decades—one of us as a U.S. Court of Appeals judge, the other as a professor … ",
    "url": "https://www.theatlantic.com/ideas/archive/2023/08/donald-trump-constitutionally-prohibited-presidency/675048/"
  },
  {
    "text": "Jean-Louis Georgelin, French general in charge of Notre Dame Cathedral restoration, dies at 74  —  The decorated French general in charge of the ambitious, big-budget restoration of fire-ravaged Notre Dame Cathedral in Paris, Jean-Louis Georgelin, has died.  He was 74.",
    "url": "https://www.cbsnews.com/news/jean-louis-georgelin-french-general-notre-dame-restoration-dies-age-74/"
  }
]