[
  {
    "text": "Vance tells donors Harris change was a ‘sucker punch,’ at odds with campaign  —  “The bad news is that Kamala Harris does not have the same baggage as Joe Biden,” Trump's running mate acknowledged at a private event.  —  The Republican vice-presidential nominee, Sen. JD Vance (R-Ohio) … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/29/jd-vance-kamala-harris-campaign/"
  },
  {
    "text": "Why, as a Republican mayor, I support Kamala Harris over Trump  —  Arizona Republicans like me can emulate Sen. John McCain's motto of ‘Country First’ and beat back Trump and his threat to democracy.  —  The time has come for my fellow Arizona Republicans to return to the core foundations of the Grand Old Party.",
    "url": "https://www.azcentral.com/story/opinion/op-ed/2024/07/29/mesa-mayor-republican-vote-kamala-harris/74583703007/"
  },
  {
    "text": "“Old and quite weird”: Democrats finally discover new effective attack — and Republicans hate it  —  After nearly a decade of being forced to take Trump seriously, Democrats increasingly call BS on the whole charade  —  Sure, Donald Trump is a threat to democracy — a would-be dictator … ",
    "url": "https://www.salon.com/2024/07/29/old-and-quite-weird-democrats-finally-discover-new-effective--and-hate-it/"
  },
  {
    "text": "Playbook: The anti-Harris ad blitz begins  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  THE BURDEN OF WHAT HAS BEEN — “How Kamala Harris Can Bury the Ghosts of 2020,” by Christopher Cadelago: “The KAMALA HARRIS of 2024 is light-years better than the Harris of 2019.",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/30/the-anti-harris-ad-blitz-begins-00171779"
  },
  {
    "text": "Harris was expected to have fundraising trouble.  Here's why big donors are actually lining up in droves.  —  The idea that Kamala Harris would be unable to raise money has been quickly dismissed, with enthusiasm for her presidential bid hinging on who she's up against — and who she's replacing.",
    "url": "https://www.politico.com/news/2024/07/30/kamala-harris-fundraising-00171630"
  },
  {
    "text": "Roy Cooper Withdraws From Kamala Harris VP Sweepstakes  —  Mr. Cooper, the governor of North Carolina, had been seen as one of the half-dozen top candidates to join the Democratic presidential ticket.  It was not immediately clear why he withdrew.  —  Gov. Roy Cooper of North Carolina … ",
    "url": "https://www.nytimes.com/2024/07/29/us/politics/roy-cooper-kamala-harris-vp.html?unlocked_article_code=1.-00.tfSj.7gMcOUeOQAUJ&smid=url-share"
  },
  {
    "text": "Republicans Are About To Become Desperate  —  But they won't respond by listening to the public; they'll respond by ratcheting up the menace.  —  Prior to this most improbable of months, a hallmark of the Biden era had been a great forgetting of the Trump years that preceded it.",
    "url": "https://www.offmessage.net/p/republicans-are-about-to-become-desperate"
  },
  {
    "text": "Obama photographer Pete Souza deletes X account after Trump ear attacks  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/policy/technology/4798519-former-white-house-photographer-deletes-x-account/"
  },
  {
    "text": "Trump says he'll ‘probably’ debate Harris: ‘I can also make a case for not doing it’  —  commit to debating her until  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:05 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate",
    "url": "https://thehill.com/homenews/campaign/4799124-trump-says-hell-probably-debate-harris-i-can-also-make-a-case-for-not-doing-it/"
  },
  {
    "text": "Supreme Court Rocked by New Leak of Bitter Abortion Split  —  DRIP DRIP DRIP  —  A months-long internal feud among the justices over a key case about abortion access in Idaho has been leaked—the latest internal communication to escape the high court.  —  The Supreme Court has been hit … ",
    "url": "https://www.thedailybeast.com/supreme-court-rocked-by-new-leak-on-bitter-split-over-idaho-emergency-abortion-ruling"
  },
  {
    "text": "J.D. Vance May Be The Worst Politician I've Ever Seen  —  This is before even taking the couch into consideration.  —  I already have promised to stay as far away from the J.D. Vance couch story as I intend to stay away from the couch in question.  (Got a flight booked for Neptune already.)",
    "url": "https://www.esquire.com/news-politics/politics/a61719535/jd-vance-sucks/"
  },
  {
    "text": "How the crypto industry is buying political support with 202 million U.S. dollars  —  15 years after Bitcoin was created, there are still few legitimate use cases.  Today, Bitcoin and other cryptocurrencies are primarily used for financial speculation and to facilitate organized crime.",
    "url": "https://popular.info/p/how-the-crypto-industry-is-buying"
  },
  {
    "text": "Ten Thousand Commandments 2024  —  Sizing up the Federal Government's New Rules and Regulations  —  The hidden tax of regulation has proved appealing to lawmakers who feel the pressure of a national debt topping $34 trillion.  Off-budget regulations requiring private business outlays … ",
    "url": "https://cei.org/studies/ten-thousand-commandments-2024/"
  },
  {
    "text": "Better late than never  —  Biden proposes reforms to a Court in desperate need of them. … Though a lot of people will probably scorn it as too little too late, President Joe Biden just called for substantial court reform.  However, much like the adage “the best time to plant a tree was 20 years ago.",
    "url": "https://www.publicnotice.co/p/biden-proposed-supreme-court-reforms-explained"
  },
  {
    "text": "Video surprise - Capitol security tapes show fake GOP electors scheme  —  The Jan. 6 security tapes being released by House Republicans have produced a surprise - video evidence of Donald Trump's fake GOP elector scheme in action on Capitol Hill, one day before Trump supporters laid siege to the U.S. Capitol.",
    "url": "https://jamiedupree.substack.com/p/video-surprise-capitol-security-tapes"
  },
  {
    "text": "William Calley, Army officer and face of My Lai Massacre, is dead at 80  —  He was the only person convicted in connection with the atrocity, in which American troops killed hundreds of unarmed South Vietnamese men, women and children.  —  William L. Calley Jr., a junior Army officer … ",
    "url": "https://www.washingtonpost.com/obituaries/2024/07/29/william-calley-dead-my-lai-massacre/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIyMjI1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzIzNjA3OTk5LCJpYXQiOjE3MjIyMjU2MDAsImp0aSI6IjU3YzU3Yjg0LTBlYmUtNDY0OS1hN2U2LWViMzM0ZDQ4ODI4YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vYml0dWFyaWVzLzIwMjQvMDcvMjkvd2lsbGlhbS1jYWxsZXktZGVhZC1teS1sYWktbWFzc2FjcmUvIn0.0BG4k9Xmve3VLUfJyMuTA0747JtYch7ptweUEiaw53o&itid=gfta"
  },
  {
    "text": "Trump would ‘absolutely’ scrap Biden's Air Force One colors, adviser says  —  If reelected, Trump still has time to change the paint job back to red, white and dark blue.  But it'd be expensive.  —  If Donald Trump returns to the presidency, he'll have another shot at achieving a goal … ",
    "url": "https://www.politico.com/news/2024/07/30/trump-air-force-one-00171453"
  },
  {
    "text": "Marianne Williamson Ends Longshot 2024 Presidential Bid  —  Marianne Williamson said she failed to meet the deadline to challenge Vice President Kamala Harris for the Democratic nomination, effectively ending her longshot bid.  —  “We did everything possible to stand for a blitz primary, an open convention and so forth.",
    "url": "https://www.bloomberg.com/news/articles/2024-07-29/williamson-ends-longshot-2024-bid-as-harris-poised-to-be-nominee"
  },
  {
    "text": "(Not) spotted: House members at votes  —  Good morning, Early Birds.  Mike Johnson has been speaker of the House for 278 days.  That's nine days longer than Kevin McCarthy, who only lasted 269 days before being ousted by Republicans last October.  Send tips to earlytips@washpost.com.",
    "url": "https://www.washingtonpost.com/politics/2024/07/30/not-spotted-house-members-votes/"
  },
  {
    "text": "Venezuelan opposition says it has proof its candidate defeated President Maduro in disputed election  —  As thousands of people demonstrated across Venezuela, opposition candidate Edmundo González on Monday announced that his campaign has the proof it needs to show he won … ",
    "url": "https://apnews.com/article/venezuela-presidential-election-maduro-machado-edmundo-results-acee6c8cd3a8fc88086c2dd71963b759"
  }
]