[
  {
    "text": "Trump administration will offer all 2 million federal workers a buyout to resign  —  An email is set to go out to federal workers beginning Tuesday.  —  President Donald Trump's administration is set to offer every single federal worker the chance to take a “deferred resignation” … ",
    "url": "https://www.nbcnews.com/politics/white-house/trump-administration-offer-federal-workers-buyouts-resign-rcna189661"
  },
  {
    "text": "Scoop: Trump offering buyouts to all federal workers, source says … We're five years past COVID and just 6 percent of federal employees work full-time in office.  That is unacceptable,\" a senior administration official tells Axios.",
    "url": "https://www.axios.com/2025/01/28/trump-federal-workers-quit-severance"
  },
  {
    "text": "Trump offering federal workers buyouts with about 8 months' pay in effort to shrink government  —  The Trump administration announced Tuesday that it is offering buyouts to all federal employees who opt to leave their jobs by next week — an unprecedented move to shrink the U.S. government at breakneck speed.",
    "url": "https://apnews.com/article/trump-buyouts-to-all-federal-employees-f67f5751a0fd5ad8471806a5a1067b5e"
  },
  {
    "text": "White House incentivizes federal workers to resign  —  The email sent to the federal workforce is the most sweeping effort yet by the new Trump administration to shrink the ranks of government employees.  —  The White House's Office of Personnel Management sent an email blast Tuesday … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/28/trump-emails-workforce/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4MDQwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NDIyNzk5LCJpYXQiOjE3MzgwNDA0MDAsImp0aSI6IjdiYzYyMDcwLWZjMzktNDAwYi04ZjNlLWYzMzQ0Mjg0ZDBjZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAxLzI4L3RydW1wLWVtYWlscy13b3JrZm9yY2UvIn0.NOvFpC8Ks_JQ3MmXWM71M0t_TWxEl88EK-V6Ckpwc7A&itid=gfta"
  },
  {
    "text": "Elon Musk Lackeys Have Taken Over the Office of Personnel Management  —  Sources tell WIRED that the OPM's top layers of management now include individuals linked to xAI, Neuralink, the Boring Company, and Palantir.  One expert found the takeover reminiscent of Stalin.",
    "url": "https://www.wired.com/story/elon-musk-lackeys-office-personnel-management-opm-neuralink-x-boring-stalin/"
  },
  {
    "text": "Protecting Children from Chemical and Surgical Mutilation  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Policy and Purpose.  Across the country today, medical professionals are maiming … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/protecting-children-from-chemical-and-surgical-mutilation/"
  },
  {
    "text": "Trump's Order on Transgender Troops Will Likely Ban Their Service, Again  —  In an executive order issued Monday night, the president said transgender service members “cannot satisfy the rigorous standards necessary” for the military.  —  Hours after President Trump signed … ",
    "url": "https://www.nytimes.com/2025/01/28/us/politics/trump-transgender-troops.html"
  },
  {
    "text": "D.C. federal judge temporarily blocks Trump plan to pause federal aid spending  —  The order from Judge Loren AliKhan runs through next Monday, when further arguments in the case are scheduled.  —  Trump administration freezes nearly all federal grants and loans",
    "url": "https://www.nbcnews.com/politics/donald-trump/dc-federal-judge-temporarily-blocks-trump-plan-pause-federal-aid-spend-rcna189706"
  },
  {
    "text": "Legal battle looms as Trump orders a funding freeze during a review of federal loans and grants  —  The White House is pausing federal grants and loans starting Tuesday as President Donald Trump's administration begins an across-the-board ideological review of its spending … ",
    "url": "https://apnews.com/article/donald-trump-pause-federal-grants-aid-f9948b9996c0ca971f0065fac85737ce"
  },
  {
    "text": "Illinois shut out of Medicaid after Trump administration halts federal grants and loans  —  The Trump administration's federal freeze has shut Illinois out of Medicaid, according to Gov. JB Pritzker's office.  The government-funded health insurance program covered about 3.9 million people … ",
    "url": "https://chicago.suntimes.com/politics/donald-trump/2025/01/28/illinois-medicaid-federal-funding-freeze-trump-administration"
  },
  {
    "text": "Caroline Kennedy warns of ‘predator’ RFK Jr. in searing letter, video  —  The former ambassador urged senators to reject Robert F. Kennedy Jr.'s nomination for health secretary, questioning his ethics and views on vaccines.  —  Caroline Kennedy warned senators Tuesday about Robert F. Kennedy Jr. … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/28/kennedy-lettor-rfk/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4MDQwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NDIyNzk5LCJpYXQiOjE3MzgwNDA0MDAsImp0aSI6ImZhNmJjNWE5LTg3OTEtNDQyZC1hMGU3LTUxZmJhMDIyY2UzZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAxLzI4L2tlbm5lZHktbGV0dG9yLXJmay8ifQ.fW4r9jt8DqylCfb5j_rzlwhNhNQfMJ2GaIAA7wUH7mU"
  },
  {
    "text": "Trump moves to fire members of EEOC and NLRB, breaking with precedent  —  The dismissals target two independent agencies that oversee large swaths of U.S. workers, employers and labor unions.  —  President Donald Trump has moved to fire Democratic members of two independent federal commissions … ",
    "url": "https://www.washingtonpost.com/business/2025/01/28/trump-fire-eeoc-nlrb-board-members/"
  },
  {
    "text": "Departing the New York Times  —  As many people reading this know, last month I retired from my position as an opinion writer at the New York Times—a job I had done for 25 years.  Despite the encomiums issued by the Times, it was not a happy departure.  If you check out my Substack … ",
    "url": "https://contrarian.substack.com/p/departing-the-new-york-times"
  },
  {
    "text": "Pentagon pulling Gen. Milley's security detail and clearance ‘immediately,’ may face demotion in retirement  —  EXCLUSIVE: Defense Secretary Pete Hegseth will announce he is “immediately pulling” retired Gen. Mark Milley's personal security detail and security clearance, multiple senior administration officials tell Fox News.",
    "url": "https://www.foxnews.com/politics/white-house-pulling-gen-milleys-security-detail-clearance-panel-may-face-demotion-retirement"
  },
  {
    "text": "‘A 5 Alarm F-ing Fire’: Trump's Federal Funding Freeze Is Jolting Some Dems Into Fight Mode  —  “The Senate must not be business as usual,” warned Sen. Elizabeth Warren (D-Mass.) as nearly two dozen Democrats cast a protest vote on a Trump nominee.  —  LOADING",
    "url": "https://www.huffpost.com/entry/democrats-direct-assault-federal-spending-freeze_n_67991b1ee4b0f8946ae298e3"
  },
  {
    "text": "SCOOP: RFK Jr. Secretly Recorded Second Wife During Divorce and Acknowledged Being “Polygamous”  —  One recording might have violated state law.  It was part of a messy saga that ended with her suicide.  —  In the early 2010s, Robert F. Kennedy Jr. went through a contentious divorce with his second wife, Mary Richardson Kennedy.",
    "url": "https://www.motherjones.com/politics/2025/01/robert-f-kennedy-jr-richardson-divorce-polygamous-secret-recording-suicide-department-health-and-human-services-trump/"
  },
  {
    "text": "Trump briefing begins with pledge to boost outside media  —  Press secretary Karoline Leavitt put traditional outlets on notice.  —  Donald Trump's “flood the zone” approach will extend — literally — to the White House briefing room.  —  In her first appearance from the White House briefing room podium … ",
    "url": "https://www.politico.com/news/2025/01/28/trump-briefing-room-media-00200996"
  },
  {
    "text": "Americans sour on some of Trump's early moves, Reuters/Ipsos poll finds  —  Americans have a dim view of some of President Donald Trump's early barrage of executive orders, including his attempt to do away with so-called birthright citizenship and his decision to rename the Gulf of Mexico, a Reuters/Ipsos poll found.",
    "url": "https://www.reuters.com/world/us/americans-sour-some-trumps-early-moves-reutersipsos-poll-finds-2025-01-28/"
  },
  {
    "text": "State Department Permits Distribution of H.I.V. Medications to Resume — for Now  —  Experts fear a resurgence of infections in low-income countries if the ban were to continue.  The waiver remains in place, while officials review foreign aid programs.  —  The Trump administration … ",
    "url": "https://www.nytimes.com/2025/01/28/health/trump-pepfar-freeze.html"
  },
  {
    "text": "'Biden's Book Ban Hoax': Department of Education claims book bans are a ‘hoax’ and dismisses all complaints  —  The fear that book bans would worsen under Donald Trump's presidency has become a reality.  The Department of Education announced it is dismissing book ban complaints as a hoax … ",
    "url": "https://www.themarysue.com/bidens-book-ban-hoax-department-of-education-claims-book-bans-are-a-hoax-and-dismisses-all-complaints/"
  },
  {
    "text": "Republican congressman suggests some children receiving free school lunches should work at McDonald's instead  —  Rep. Rich McCormick said that the freeze on federal aid would allow the government to review all programs including ones that provide free school lunches to low-income children.",
    "url": "https://www.nbcnews.com/politics/congress/republican-congressman-suggests-children-receiving-free-school-lunches-rcna189614"
  },
  {
    "text": "Google reclassifies U.S. as ‘sensitive country’ alongside China, Russia after Trump's ‘Gulf of America’ comments … Google's maps division on Monday reclassified the U.S. as a “sensitive country,” a designation it reserves for states with strict governments and border disputes, CNBC has learned.",
    "url": "https://www.cnbc.com/2025/01/28/google-reclassifies-us-as-sensitive-country-like-china-russia-.html"
  },
  {
    "text": "Trump administration may pull money from TSA, Coast Guard to help ICE afford costly deportations  —  The average cost to ICE to deport a single person during the Biden administration was about $10,500, sources told NBC News.  —  Immigrations and Customs Enforcement, the principal agency tasked … ",
    "url": "https://www.nbcnews.com/politics/national-security/administration-may-pull-money-tsa-help-fund-deportations-rcna189387"
  },
  {
    "text": "Tuberculosis outbreak that has killed 2 in Kansas continues to grow  —  More than 60 people were being treated for the disease in the Kansas City area as of Friday, according to the state health department.  —  The number of tuberculosis cases linked to an outbreak in the Kansas City area continues … ",
    "url": "https://www.nbcnews.com/health/health-news/tuberculosis-outbreak-kansas-rcna189637"
  },
  {
    "text": "STAT+: Private emails show RFK Jr. making false claims about Covid-19 shots, linking vaccines to autism  —  On the eve of Robert F. Kennedy Jr.'s confirmation hearings, his physician niece has shared a trove of private emails in the hopes of derailing his nomination to lead the Department of Health and Human Services.",
    "url": "https://www.statnews.com/2025/01/28/kennedy-confirmation-hearing-niece-releases-emails-vaccine-criticism-conspiracy-theories/"
  },
  {
    "text": "FCC chair says landlords can force bulk internet service on residents  —  Trump's FCC head says reducing competition will lower prices.  —  Trump's FCC head says reducing competition will lower prices. … The Federal Communications Commission is eliminating a Biden administration proposal … ",
    "url": "https://www.theverge.com/news/599513/fcc-bulk-billing-proposal-ended-isp-apartment-carr"
  },
  {
    "text": "OpenAI says it has evidence China's DeepSeek used its model to train competitor  —  White House AI tsar David Sacks raises possibility of alleged intellectual property theft  —  OpenAI says it has found evidence that Chinese artificial intelligence start-up DeepSeek used the US company's proprietary models … ",
    "url": "https://www.ft.com/content/a0dfedd1-5255-4fa9-8ccc-1fe01de87ea6"
  }
]