[
  {
    "text": "Bombshell immunity filing details Trump's alleged ‘increasingly desperate’ bid to overturn 2020 election  —  Trump privately described claims of voter fraud as “crazy,” the filing says.  —  In this July 31, 2024, file photo, Republican presidential candidate former President Donald Trump waits … ",
    "url": "https://abcnews.go.com/US/bombshell-special-counsel-filing-includes-new-allegations-trumps/story?id=114409494"
  },
  {
    "text": "Jack Smith lays out his case against Trump in vivid detail  —  In a newly unsealed legal brief, the special counsel revealed private, detailed conversations Trump had with GOP officials in his bid to subvert the 2020 election.  —  As his bid to hold on to power in 2020 grew increasingly desperate … ",
    "url": "https://www.politico.com/news/2024/10/02/jack-smith-trump-case-00182258"
  },
  {
    "text": "Key takeaways from special counsel Jack Smith's major filing in Trump's 2020 election case  —  Washington — U.S. District Judge Tanya Chutkan has made public a key filing from special counsel Jack Smith that includes evidence compiled in his investigation into former President Donald Trump's alleged efforts … ",
    "url": "https://www.cbsnews.com/news/trump-2020-election-filing-special-counsel-jack-smith/"
  },
  {
    "text": "Jack Smith Lays Out New Evidence in Trump's Jan. 6 Case  —  Judge Tanya Chutkan made public portions of a filing by prosecutors setting out their argument for why the case should go forward despite the Supreme Court's ruling on presidential immunity.  —  When told by an aide … ",
    "url": "https://www.nytimes.com/2024/10/02/us/politics/trump-jan-6-case-jack-smith-evidence.html?unlocked_article_code=1.PE4.CPV7.DVbtr_zR8EME&smid=url-share"
  },
  {
    "text": "Jack Smith's Big New Jan. 6 Brief Is a Major Indictment of the Supreme Court  —  It's rare to simultaneously feel red-hot anger and wistfulness, especially when merely reading a document.  But those are exactly the emotions that washed over me when I read the redacted version … ",
    "url": "https://slate.com/news-and-politics/2024/10/trump-election-interference-trial-jack-smith-brief-supreme-court-failure.html"
  },
  {
    "text": "CBS News VP debate poll shows voter reactions to Vance-Walz showdown  —  In the first — and likely only — vice-presidential debate between Tim Walz and JD Vance, voters who watched Tuesday night said it was an almost even match, and an overwhelming majority felt the tone of the debate was positive.",
    "url": "https://www.cbsnews.com/news/cbs-news-vp-debate-poll-2024/"
  },
  {
    "text": "Walz vs Vance: Fact Checking the VP Debate  —  Tim Walz and JD Vance met for their first and only Vice Presidential debate.  Below I provide a comprehensive analysis on 10 of the most salient questions and subjects.  We have a lot to cover so let's dive in.  Likewise, please consider subscribing to support my work and advocacy.",
    "url": "https://www.qasimrashid.com/p/walz-vs-vance-fact-checking-the-vp"
  },
  {
    "text": "Trump and his allies are not planning to concede another electoral loss  —  The former president and his allies are making it clear, repeatedly, that the only outcome they will accept without hesitation is one where he is the victor.  —  The reason that it is important to ask Sen. JD Vance … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/02/trump-his-allies-are-not-planning-concede-another-electoral-loss/"
  },
  {
    "text": "Trump mixes up words, swerves among subjects in off-topic speech  —  The Republican nominee appeared tired and complained about his heightened campaign schedule.  —  MILWAUKEE — Republican nominee Donald Trump spoke for 33 minutes before his first mention of the ostensible focus of his remarks.",
    "url": "https://www.washingtonpost.com/politics/2024/10/01/trump-wisconsin-swerves-subjects/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3NzU1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI5MTM3NTk5LCJpYXQiOjE3Mjc3NTUyMDAsImp0aSI6IjhmZDhmNGE1LWZhMTEtNGFkMi05ZjdkLTM3ZDI2MWQ5ZDIxMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEwLzAxL3RydW1wLXdpc2NvbnNpbi1zd2VydmVzLXN1YmplY3RzLyJ9.E00QenZ6mHuNVNIKz7lrPMQnl8nj_H2ZrFRyvIx3Z_0&itid=gfta"
  },
  {
    "text": "Trump backs out of “60 Minutes” interview after appearing “scattered” and incoherent in Wisconsin  —  Trump's decision to pull out of the event came after he made confused and incoherent remarks on Tuesday  —  Former President Donald Trump backed out of an interview with “60 Minutes,” … ",
    "url": "https://www.salon.com/2024/10/02/backs-out-of-60-minutes-interview-after-appearing-confused-at-wisconsin-rally/"
  },
  {
    "text": "Melania Trump passionately defends abortion rights in upcoming memoir  —  Exclusive: ‘I have carried this belief with me throughout my entire adult life’, former first lady writes in memoir  —  Melania Trump made an extraordinary declaration in an eagerly awaited memoir to be published … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/02/melania-trump-memoir-defends-abortion-rights"
  },
  {
    "text": "Trump campaign brings in $160 million in September  —  Hundreds of millions of dollars raised by each campaign are going towards expensive television buys in battleground states.  —  Donald Trump's campaign reported raising over $160 million in September as it gears up for the final five weeks of the presidential election.",
    "url": "https://www.politico.com/news/2024/10/02/trump-fundraising-september-2024-00182263"
  },
  {
    "text": "Kamala Harris's husband Doug Emhoff ‘forcefully slapped ex-girlfriend for flirting with another man’ in booze-fueled assault after date to star-studded gala  —  Vice President Kamala Harris's husband assaulted his ex-girlfriend, three friends have told Dailymail.com.",
    "url": "https://www.dailymail.co.uk/news/article-13898791/Kamala-Harris-husband-Doug-Emhoff-accused-ex-girlfriend-slap.html"
  },
  {
    "text": "As Gov. Lee Seeks to Reshape Education, Vouchers Loom Large in House Races  —  Editor's note: Over the summer, we sent out a community survey to ask what issues mattered most to you in this election cycle.  This is the latest in our community-focused series.",
    "url": "https://nashvillebanner.com/2024/10/02/vouchers-education-debate-tennessee/"
  },
  {
    "text": "The Solution to Giant Killer Cars Is Really, Really Simple  —  A proposed rule could force automakers to downsize the largest of their vehicles.  That's what's really needed to save pedestrians.  —  The number of pedestrian deaths in the United States is skyrocketing.",
    "url": "https://slate.com/business/2024/10/cars-suvs-pedestrian-deaths-traffic-safety-lidar-computer-vision.html"
  },
  {
    "text": "Exclusive: Multiple Women Claiming Romantic Relationships With RFK Jr. Threaten His Standing in Trump Orbit  —  At least three women are claiming to have had romantic relationships with Robert F. Kennedy Jr. in just the last year, as he pursued a long-shot bid for the presidency, Mediaite has learned.",
    "url": "https://www.mediaite.com/politics/exclusive-multiple-women-claiming-romantic-relationships-with-rfk-jr-threaten-his-standing-in-trump-orbit/"
  },
  {
    "text": "Internal Emails Reveal How Hate Overwhelmed Springfield After Trump's Lies About Haitian Immigrants  —  A cache of internal emails obtained by 404 Media using a public records request show the chaos caused by the unfounded racist conspiracy theory that Haitian immigrants are “eating the pets” of residents in Springfield, Ohio.",
    "url": "https://www.404media.co/internal-emails-reveal-how-hate-overwhelmed-springfield-after-trumps-lies-about-haitian-immigrants/"
  },
  {
    "text": "Trump fear factor hits Senate GOP … - “I said, 'Sir, if I was you, I would stay out of the race, because there's no win for you in this,'” Sen. Markwayne Mullin (R-Okla.) told us about a recent call with Trump.  — “I hope not,” said Sen. Thom Tillis, when asked if he thinks Trump will weigh in.",
    "url": "https://www.axios.com/2024/10/03/trump-senate-republicans-mcconnell-thune-cornyn"
  },
  {
    "text": "Ted Cruz, Rick Scott, and Other Senate Republicans Voted to Defund FEMA—Now Ask for Federal Aid  —  Written for MeidasTouch by J.D. Wolf  —  As the federal response to Hurricane Helene is well underway, many MAGA Republicans have been politicizing the Biden administration's efforts.",
    "url": "https://www.meidasplus.com/p/ted-cruz-rick-scott-and-other-senate"
  },
  {
    "text": "Video: Derrick Anderson's Disastrous Week Highlighted In New Advertisement, “Fake Family Guy,” Ahead of UMW Debate  —  “Derrick faked having a family.  Now he wants to control yours.”  —  From the Eugene Vindman for Congress (VA07), which has been watching as their opponent … ",
    "url": "https://bluevirginia.us/2024/10/video-derrick-andersons-disastrous-week-highlighted-in-new-advertisement-fake-family-guy-ahead-of-umw-debate"
  },
  {
    "text": "How unhinged must Trump get to even matter?  —  The irony is now painful.  For many years now, the artsy mountain resort city of Asheville, N.C. has been marketed to a growing retiree population as a “climate refuge,” a temperate inland fortress far from the potential killer hurricanes … ",
    "url": "https://www.inquirer.com/columnists/attytood/trump-crime-police-violence-cbs-news-debate-fact-check-20241001.html"
  },
  {
    "text": "Who Are the ‘Undecided’?  —  It may not be about issues, but whether voters surrender to Trump's invitation to return to the womb.  —  Former President Donald Trump gestures at a campaign event at Dane Manufacturing, October 1, 2024, in Waunakee, Wisconsin.",
    "url": "https://prospect.org/politics/2024-10-02-who-are-the-undecided/"
  },
  {
    "text": "500-pound US WW2 bomb explodes at Japanese airport 80 years later  —  A 500-pound bomb from World War II dropped by the United States on Japan exploded at a Japanese airport after nearly 80 years.  —  One bomb out of the 179,967 tons of bombs dropped on Japan during World War II … ",
    "url": "https://www.washingtonexaminer.com/news/world/3174974/500-pound-us-ww2-bomb-explodes-japanese-airport-80-years-later/"
  }
]