[
  {
    "text": "House GOP erupts as conservatives block defense bill again  —  To many in the conference, it proved that Speaker Kevin McCarthy has no power to avert a fast-approaching shutdown.",
    "url": "https://www.politico.com/live-updates/2023/09/21/congress/house-gop-fails-move-defense-bill-again-00117356"
  },
  {
    "text": "Right-Wing Rebels Block Defense Bill Again, Rebuking McCarthy on Spending  —  It was the second time in a week that hard-right Republicans had defied Speaker Kevin McCarthy on a spending measure, signaling that there was still no G.O.P. agreement on a bill to fund the government.",
    "url": "https://www.nytimes.com/2023/09/21/us/politics/mccarthy-spending-house-republicans.html"
  },
  {
    "text": "Republicans can't pass bills for the same reason they support insurrection  —  This free edition of Public Notice is made possible by paid subscribers.  If you aren't one already, please sign up to support our work.  We're currently offering free trials for all new signups.  Just click the button below.",
    "url": "https://www.publicnotice.co/p/house-republicans-mccarthy-defense-bill-disaster"
  },
  {
    "text": "House Republicans still don't have the votes as government shutdown looms  —  Speaker Kevin McCarthy brought up a vote to advance a bill to fund the Defense Department on Thursday.  For the second time this week, it failed.  —  House fails to advance military funding bill for the second time this week",
    "url": "https://www.nbcnews.com/politics/congress/house-republicans-still-dont-votes-government-shutdown-looms-rcna111338"
  },
  {
    "text": "House recesses after Defense bill, government funding plan implode  — House Republican leaders on Thursday sent the chamber into recess, likely dashing hopes of passing a bill to fund the government in the coming days.  — The stinging defeat came after a procedural vote on a defense funding bill failed Thursday morning.",
    "url": "https://www.cnbc.com/2023/09/21/house-speaker-mccarthy-squeezed-in-shutdown-fight-markets-worry.html"
  },
  {
    "text": "The Patriot  —  How General Mark Milley protected the Constitution from Donald Trump  —  The missiles that comprise the land component of America's nuclear triad are scattered across thousands of square miles of prairie and farmland, mainly in North Dakota, Montana, and Wyoming.",
    "url": "https://www.theatlantic.com/magazine/archive/2023/11/general-mark-milley-trump-coup/675375/"
  },
  {
    "text": "Rupert Murdoch steps down as chairman of Fox and News Corp.  — Rupert Murdoch is stepping down as chairman of News Corp. and Fox Corp.  — The news comes as the 92-year-old's empire, which includes Fox News, gears up for the 2024 election.  — Earlier this year … ",
    "url": "https://www.cnbc.com/2023/09/21/rupert-murdoch-steps-down-as-chairman-of-fox-and-news-corp.html"
  },
  {
    "text": "Conservative media titan Rupert Murdoch to step down as chairman of Fox Corp. and News Corp.  —  He will become chairman emeritus of the two corporations, the company said in a news release.  —  Rupert Murdoch, the Australian press baron who reshaped conservative media in his image … ",
    "url": "https://www.nbcnews.com/media/rupert-murdoch-steps-chairman-fox-news-corp-rcna111323"
  },
  {
    "text": "U.S. Will Allow Nearly 500,000 Venezuelan Migrants to Work Legally  —  The move, announced late Wednesday, followed intense lobbying by New York Democrats before and during President Biden's visit to New York City this week.  —  The Biden administration said late Wednesday that it would allow hundreds … ",
    "url": "https://www.nytimes.com/2023/09/20/nyregion/biden-adams-migrants.html"
  },
  {
    "text": "DeSantis Close to Getting Iowa Governor's Endorsement in Blow to Trump  — Support would boost odds of DeSantis upset in Iowa contest  — Reynolds endorsement not final, decision possible in November  —  Iowa Governor Kim Reynolds is signaling she is likely to endorse Ron DeSantis for president … ",
    "url": "https://www.bloomberg.com/news/articles/2023-09-21/iowa-governor-moves-toward-endorsing-desantis-in-blow-to-trump"
  },
  {
    "text": "Trump's latest legal gambit could cause ‘cascade’ of trial delays, New York warns  —  Postponing Trump's upcoming trial on business fraud might have ripple effects on all the other Trump cases, the state attorney general said.  —  NEW YORK — Donald Trump's trial calendar is a delicate balancing act … ",
    "url": "https://www.politico.com/news/2023/09/21/trump-trial-delays-business-fraud-00117362"
  },
  {
    "text": "Democratic Senator Accused of Cartoonish Corruption  —  New Jersey Democrat Bob Menendez possesses an ability to hang on through corruption scandals that would bury most politicians.  In 2018, less than one year after a federal bribery trial for accepting lavish gifts from a Florida eye doctor ended … ",
    "url": "https://nymag.com/intelligencer/2023/09/senator-robert-menendez-accused-of-cartoonish-corruption.html"
  },
  {
    "text": "NEW: Project Veritas Suspends All Operations Amid Devastating Layoffs and Fundraising Struggles  —  Project Veritas, the conservative organization founded by James O'Keefe, suspended all operations on Wednesday after another round of layoffs, Mediaite has learned.",
    "url": "https://www.mediaite.com/news/new-project-veritas-suspends-all-operations-amid-devastating-layoffs-and-fundraising-struggles/"
  },
  {
    "text": "U.S. Government Contractor Arrested on Espionage Charges  —  For Immediate Release  —  IT Help Desk Technician Charged with Transferring Classified Materials to a Foreign Government  —  A U.S. government contractor was arrested on Aug. 24 based on espionage charges in a complaint unsealed today.",
    "url": "https://www.justice.gov/opa/pr/us-government-contractor-arrested-espionage-charges"
  },
  {
    "text": "Manchin circulates proposal to reverse Schumer on dress code  —  Centrist Sen. Joe Manchin (D-W.Va.) is circulating a proposal to reestablish the Senate's dress code, which Senate Majority Leader Chuck Schumer (D-N.Y.) loosened over the weekend to allow senators to wear whatever they want on the Senate floor … ",
    "url": "https://thehill.com/homenews/senate/4216746-manchin-circulates-proposal-to-reverse-schumer-on-dress-code/"
  },
  {
    "text": "She Pioneered Internet Fame, He Helped Draft a Constitution.  Now They're in Love.  —  Who would have guessed that the former New York media obsession Julia Allison and the law scholar Noah Feldman would make a great couple?  —  One afternoon in May 2020, Julia Allison sat in a hot spring near Joshua Tree National Park, crying.",
    "url": "https://www.nytimes.com/2023/09/20/style/julia-allison-noah-feldman.html"
  },
  {
    "text": "Book banners target public libraries  —  The campaign to censor America's libraries is expanding.  —  A new report from the American Library Association (ALA) finds that this year, between January 1 and August 31, there have been “695 attempts to censor library materials and services and documented challenges to 1,915 unique titles.”",
    "url": "https://popular.info/p/book-banners-target-public-libraries"
  },
  {
    "text": "Following layoffs, Boston University announces ‘inquiry’ into Ibram Kendi's Antiracist Center  —  Boston University announced Wednesday it would conduct an “inquiry” into Dr. Ibram X. Kendi's Center for Antiracist Research after complaints emerged about the center's culture and financial management.",
    "url": "https://www.bostonglobe.com/2023/09/20/metro/following-layoffs-boston-university-announces-inquiry-into-ibram-kendis-antiracist-center/"
  }
]