[
  {
    "text": "Who Is on Donald Trump's Revenge List?  —  One of the central themes of Donald Trump's 2024 presidential campaign has been the desire for vengeance against those who he believes have done him and the country wrong.  “I am your retribution,” has become a staple of his stump speech, and it's not just rhetoric.",
    "url": "https://nymag.com/intelligencer/article/who-is-donald-trump-planning-revenge-against.html"
  },
  {
    "text": "Trump Just Revealed How He'll Attack Biden at Debate—and It's Vile … You can't say you weren't warned: At the upcoming presidential debate on June 27, Donald Trump plans to highlight a handful of horrific murders—allegedly by undocumented migrants—and blame them on President Biden.",
    "url": "https://newrepublic.com/article/182993/trump-biden-debate-attack"
  },
  {
    "text": "Sotomayor Issues Dire Warning on Supreme Court Ruling on Noncitizens … In a ruling delivered Friday, the Supreme Court decided 6-3 that U.S. citizens have no constitutional interest in their noncitizen spouses being able to enter the United States—despite the fact that a married person … ",
    "url": "https://newrepublic.com/post/182960/supreme-court-sotomayor-non-citizens-marriage-munoz-obergefell"
  },
  {
    "text": "“Alarm bells about Obergefell”: Sotomayor pens blistering dissent on SCOTUS marriage attack  —  Sotomayor warned gay marriage could be next as her colleagues gutted a U.S. citizen's right to marry a non-citizen  —  Supreme Court Justice Sonia Sotomayor used her dissent in a case that struck … ",
    "url": "https://www.salon.com/2024/06/21/alarm-bells-about-obergefell-sotomayor-pens-blistering-dissent-on-scotus-marriage/"
  },
  {
    "text": "Pro-Ted Cruz group draws scrutiny for receiving money from his podcast's company  —  Campaign finance experts have questioned whether the arrangement runs afoul of a ban on candidates directing money to super PACs that can raise unlimited amounts of money.  —  A super PAC supporting … ",
    "url": "https://www.washingtonpost.com/elections/2024/06/22/ted-cruz-podcast-super-pac/"
  },
  {
    "text": "Judge Cannon wants to know whether Merrick Garland is supervising Jack Smith  —  The judge in Donald Trump's classified documents case asked lawyers how much independence the special counsel has.  —  FORT PIERCE, Florida — The federal judge overseeing Donald Trump's classified documents … ",
    "url": "https://www.politico.com/news/2024/06/21/trump-classified-documents-cannon-garland-smith-00164541"
  },
  {
    "text": "60 years ago today, they murdered my protector  —  I've shared some of this with you, but today marks 60 years since it happened — when the Klan murdered my protector.  —  I was always the shortest kid in school, which made me an easy target for bullies.  To protect myself … ",
    "url": "https://robertreich.substack.com/p/60-years-ago-today-they-murdered"
  },
  {
    "text": "Judge dismisses Nevada fake electors case over lack of jurisdiction  —  Judge Mary Kay Holthus ruled that Clark County was not an appropriate place to decide the case.  —  Courts Election 2020  —  A Clark County judge has dismissed the charges filed against the six Nevada Republicans … ",
    "url": "https://thenevadaindependent.com/article/judge-dismisses-nevada-fake-electors-case-over-lack-of-jurisdiction"
  },
  {
    "text": "DeSantis Vetoes All Arts Grants in Florida  —  Gov. Ron DeSantis gave no explanation for zeroing out the $32 million in grants that were approved by state lawmakers.  —  For the past 10 days, Richard Russell has been rattled, poring over budgets and working the phones in an attempt to limit … ",
    "url": "https://www.nytimes.com/2024/06/21/arts/ron-desantis-veto-arts-funding-florida.html"
  },
  {
    "text": "Trump keeps flip-flopping his policy positions after meeting with rich people  —  Top CEOs were seen nodding their heads when Trump talked about finding ways to keep American-educated talent at home.  —  Donald Trump privately hinted at a shift in immigration policy at a Business Roundtable meeting last week.",
    "url": "https://www.politico.com/news/2024/06/22/trump-policy-flip-flop-00164538"
  },
  {
    "text": "‘Florida loves prison labor’: why most incarcerated people still work for free in the Sunshine state  —  Many prisoners clean toilets and prep food with no pay - as the state charges $50 a day for their incarceration  —  A $9bn food services company is using prisoners to make meals … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/21/florida-unpaid-prison-labor"
  },
  {
    "text": "Biden vs. Trump: Will the First 2024 Debate Jolt the Race?  —  Is the election a choice between the two, or purely a referendum on the president?",
    "url": "https://www.wsj.com/politics/elections/biden-vs-trump-will-the-first-2024-debate-jolt-the-race-9edc9419"
  },
  {
    "text": "Louisiana's Ten Commandments Law Signals a Broader Christian Agenda  —  Gov. Jeff Landry wants his state to be at the forefront of a national movement to advance legislation with a Christian worldview.  —  The crowd at Our Lady of Fatima Catholic School in Lafayette, La. … ",
    "url": "https://www.nytimes.com/2024/06/21/us/louisiana-ten-commandments-landry.html"
  },
  {
    "text": "Texas Congressman Won't Stop Wearing Combat Infantryman Badge that Was Revoked  —  More than a month after a news report revealed that the Combat Infantryman Badge Rep. Troy Nehls, R-Texas, wears on his lapel was revoked since he was never eligible for the award to begin with, the congressman refuses to take the pin off.",
    "url": "https://www.military.com/daily-news/2024/06/21/texas-congressman-wont-stop-wearing-combat-infantryman-badge-was-revoked.html"
  },
  {
    "text": "What the Hell Is Going on With the Supreme Court's Trump Ruling?  —  BEHIND THE SCENES  —  The court's deadline to release a decision is next Friday, June 28, but there are fears the conservative majority may have something more sinister up their sleeve.  —  The Supreme Court released … ",
    "url": "https://www.thedailybeast.com/what-the-hell-is-going-on-with-the-supreme-courts-trump-immunity-ruling"
  },
  {
    "text": "Justice Samuel Alito absent from Supreme Court session for second day in a row  —  Justice Samuel Alito was not present on Friday morning as the Supreme Court handed down opinions in the courtroom, the second day in a row he has been absent.  —  Alito's absence, for which the Supreme Court … ",
    "url": "https://www.cnn.com/2024/06/21/politics/samuel-alito-not-present-supreme-court/"
  },
  {
    "text": "Amid GOP infighting, judge strips Ohio House speaker of control over Republican caucus campaign fund  —  A county judge stripped Republican Ohio House Speaker Jason Stephens of his control over the GOP caucus' campaign fund on Friday, escalating intraparty tensions in the chamber headed into November's election.",
    "url": "https://apnews.com/article/ohio-house-speaker-gop-caucus-campaign-fund-d654fce42b9e877d4e6dac56bcb0c6fb"
  },
  {
    "text": "The Supreme Court Just Made an 8-1 Mad Dash Away From Clarence Thomas' Extremism  —  The Supreme Court upheld a federal law disarming domestic abusers on Friday, significantly narrowing a radical 2022 precedent in the process.  Its 8-1 ruling in U.S. v. Rahimi is a major victory for gun safety laws … ",
    "url": "https://slate.com/news-and-politics/2024/06/supreme-court-clarence-thomas-guns-extremism-rahimi-bruen.html"
  },
  {
    "text": "How Misleading Videos Are Trailing Biden as He Battles Age Doubts  —  A flurry of recent clips, many of them edited or lacking context, laid bare a major challenge for the president as he tries to persuade voters he has the energy for a second term.  —  President Biden has many adversaries in this year's election.",
    "url": "https://www.nytimes.com/2024/06/21/us/politics/biden-age-videos.html"
  },
  {
    "text": "Kyle Rittenhouse's Family: We're His Collateral Damage  —  ROGUE SON  —  The far-right darling is accused of leaving his mom and sister high and dry as they fight eviction.  —  Kyle Rittenhouse has been publicly dragged by his own family, who say the far-right darling left them high and dry … ",
    "url": "https://www.thedailybeast.com/kyle-rittenhouses-family-publicly-throws-him-under-the-bus"
  },
  {
    "text": "Upside-down American flag flying outside Etna Township trustee's home angers local vets  —  An upside-down American flag, a symbol connected with false claims that the 2020 election was stolen from former President Donald Trump, has been flying outside an elected official's Licking County home in recent weeks.",
    "url": "https://www.dispatch.com/story/news/local/2024/06/21/vets-criticize-etna-trustee-over-upside-down-flag-flying-at-her-home/74157096007/"
  },
  {
    "text": "US farmers turn towards Biden over Trump's past agricultural policies  —  A growing number of rural Americans now plan to vote for Biden, fearing Trump could cost farmers again  —  For two decades, Christopher Gibbs, a row crop and cattle farmer in Shelby county, Ohio, was an ardent Republican party member.",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/21/trump-biden-agriculture-policies"
  }
]