[
  {
    "text": "Trump and his allies had a plan for how to hit Harris.  Then he opened his mouth.  —  “He's grasping around,” said Chuck Coughlin, an Arizona-based political strategist.  —  Scrambling to put an end to Kamala Harris' ascent, Donald Trump's campaign and outside allies came up with a plan … ",
    "url": "https://www.politico.com/news/2024/08/01/donald-trump-kamala-harris-attack-plan-00172178"
  },
  {
    "text": "JD Vance Says Trump's Comments About Kamala Harris' Racial Identity Were ‘Hysterical’  —  “I think he pointed out the fundamental chameleon-like nature of Kamala Harris,” Vance told reporters on his plane.  — Copy  —  PHOENIX — Sen. JD Vance told reporters it's “hysterical how much the media … ",
    "url": "https://www.notus.org/trump-2024/jd-vance-kamala-harris-race"
  },
  {
    "text": "A Vintage Trump Meltdown  —  Huge prisoner-swap news breaking this morning: Russia has agreed to release Wall Street Journal reporter Evan Gershkovich, former Marine Paul Whelan, and Russian-British activist Vladimir Kara-Murza, all of whom had been detained on trumped-up charges.",
    "url": "https://www.thebulwark.com/p/a-vintage-trump-meltdown"
  },
  {
    "text": "Trump's usual sexist sneers don't work against Harris - and to top it off, she's laughing at him  —  Younger, slicker and more telegenic than her rival, the Democratic candidate really might just beat him  —  A funny thing happened in the hours after the exit of Joe Biden from the US presidential race … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/aug/01/kamala-harris-donald-trump-democrat-candidate"
  },
  {
    "text": "Republicans reel at Trump's “embarrassing” remarks about Harris … - “It was awful,” one House Republican said of the interview, telling Axios it raised concerns about whether Trump can contain his impulses while running against the first woman, Black and Asian American vice president.",
    "url": "https://www.axios.com/2024/07/31/house-senate-republicans-trump-nabj-interview"
  },
  {
    "text": "Trump Remarks on Harris Evoke a Haunting and Unsettling History  —  White America has long sought to define racial categories — and who can belong to them.  —  The audience of Black journalists was prepared for a combative exchange well before Donald J. Trump took the stage on Wednesday … ",
    "url": "https://www.nytimes.com/2024/07/31/us/politics/trump-harris-race.html"
  },
  {
    "text": "US Reporter to Be Freed by Russia in Major Prisoner Swap  — Wall Street Journal reporter Gershkovich to be let go in deal  — US, Russia had held extensive talks on prisoner exchange  —  Russia is releasing Wall Street Journal reporter Evan Gershkovich and former US Marine Paul Whelan … ",
    "url": "https://www.bloomberg.com/news/articles/2024-08-01/us-reporter-released-by-russia-in-multi-country-prisoner-swap"
  },
  {
    "text": "WSJ Reporter Evan Gershkovich Is Free  —  Release of 32-year-old American from Russia secured as part of largest East-West prisoner swap since Cold War  —  Russia freed wrongly convicted Wall Street Journal reporter Evan Gershkovich as part of the largest and most complex East-West prisoner swap since … ",
    "url": "https://www.wsj.com/world/russia/evan-gershkovich-free-cde745b3"
  },
  {
    "text": "U.S., Russia agree to prisoner swap to free Americans Evan Gershkovich, Paul Whelan and others  —  The Biden administration has agreed to a prisoner exchange with Russia and is expected to soon secure the release of three American citizens imprisoned in Russia including Wall Street Journal … ",
    "url": "https://www.cbsnews.com/news/us-russia-prisoner-swap-frees-americans-evan-gershkovich-paul-whelan/"
  },
  {
    "text": "How Hamas Leader Ismail Haniyeh Was Killed in Iran … A photograph circulating on Telegram and among Iranian officials on Wednesday showed a damaged building in northern Tehran.Provided to The New York Times  —  Ismail Haniyeh, a top leader of Hamas, was assassinated on Wednesday … ",
    "url": "https://www.nytimes.com/2024/08/01/world/middleeast/how-hamas-leader-haniyeh-killed-iran-bomb.html?unlocked_article_code=1._k0.5p-b.ORvQNs8_SL9A&smid=url-share"
  },
  {
    "text": "Democrats pitch No Kings Act to override supreme court's Trump immunity ruling  —  Bill would stipulate that Congress, not the supreme court, has authority to determine to whom federal criminal laws are applied  —  Chuck Schumer will introduce a bill in the Senate today to declare explicitly … ",
    "url": "https://www.theguardian.com/us-news/article/2024/aug/01/no-kings-act-trump-immunity-supreme-court"
  },
  {
    "text": "Senate Democrats will force vote to expand child tax credit despite GOP opposition  —  It's not clear the legislation has the votes to advance as top Republicans rally opposition.  The vote comes amid criticism over Sen. JD Vance's comments about “childless cat ladies.”",
    "url": "https://www.nbcnews.com/politics/congress/senate-democrats-will-force-vote-expand-child-tax-credit-gop-oppositio-rcna164499"
  },
  {
    "text": "Why Tim Walz's progressive support is great for Democrats  —  Also: Trump's racist self-immolation in front of Black journalists. … Two weeks ago, Minnesota Gov. Tim Walz was largely unknown nationally.  Today, he's a widely beloved Democratic figure and a leading candidate to become Kamala Harris's running mate.",
    "url": "https://www.publicnotice.co/p/tim-walz-kamala-harris-progressive-support-dems"
  },
  {
    "text": "Critics Stunned By Donald Trump's ‘Heartless’ Punch Line About Man Killed At His Rally  —  The Republican nominee was slammed as horrible, unkind and a “self-centered sadistic monster” over the line.  —  LOADING  —  Donald Trump drew fierce criticism for making a crass comment about the wife … ",
    "url": "https://www.huffpost.com/entry/donald-trump-rally-joke-ripped_n_66ab2032e4b088c373ceeab5"
  },
  {
    "text": "What polling shows about the top VP contenders for Kamala Harris  —  As Vice President Kamala Harris prepares to announce her running mate, a new poll from The Associated Press-NORC Center for Public Affairs Research finds that several of the top contenders for the role are largely unknown to Americans.",
    "url": "https://apnews.com/article/harris-shapiro-kelly-beshear-walz-vp-democrats-d01c79817844b66c5bf466a1cd403c50"
  },
  {
    "text": "Plea Agreements Reached with 9/11 Defendants Khalid Shaikh Mohammad, Walid Bin 'Attash and Mustafa al Hawsawi  —  The Convening Authority for Military Commissions, Susan Escallier, has entered into pretrial agreements with Khalid Shaikh Mohammad, Walid Muhammad Salih Mubarak Bin 'Attash … ",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3857257/plea-agreements-reached-with-911-defendants-khalid-shaikh-mohammad-walid-bin-at/"
  },
  {
    "text": "Trump loses appeal of gag order in hush money criminal case  —  A New York state appeals court on Thursday rejected former U.S. President Donald Trump's challenge to a gag order in his criminal case on charges stemming from hush money paid to a porn star.  —  The Appellate Division's ruling … ",
    "url": "https://www.reuters.com/legal/trump-loses-appeal-gag-order-hush-money-criminal-case-2024-08-01/"
  },
  {
    "text": "First, Murdoch papers targeted me.  Now there is evidence they falsely implicated me in a cover-up  —  Asked why millions of News Group emails were deleted, Washington Post publisher Will Lewis pointed the finger at me  —  Blazoned across the top of every edition of the Washington Post is the statement “Democracy dies in darkness”.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/31/gordon-brown-tom-watson-news-international-william-lewis-rupert-murdoch"
  },
  {
    "text": "Prompted by right-wing radio host, JD Vance linked Roe v. Wade to Dred Scott decision allowing slavery  —  Shortly after the Supreme Court overturned Roe v. Wade in 2022, Sen. JD Vance appeared on an anti-abortion right-wing radio program.  After the host compared the decision to overturning precedent … ",
    "url": "https://www.mediamatters.org/jd-vance/prompted-right-wing-radio-host-jd-vance-linked-roe-v-wade-dred-scott-decision-allowing"
  }
]