[
  {
    "text": "Elon Musk accused of censoring conservatives on X who disagree with him about immigration  —  The claims came after Elon Musk was involved in a public feud with some Republicans over immigration.  —  Tech billionaire Elon Musk faced accusations of censorship Friday from fellow conservatives … ",
    "url": "https://www.nbcnews.com/tech/social-media/elon-musk-accused-censoring-laura-loomer-maga-republicans-x-rcna185569"
  },
  {
    "text": "Musk calls MAGA element “contemptible fools” as virtual civil war brews … - The schism may force Trump to ultimately take sides between the largely white, working-class supporters who first made MAGA succeed, and the techno-libertarian billionaires like Musk who are at the center of his new administration.",
    "url": "https://www.axios.com/2024/12/27/elon-musk-contemptible-fools-maga-doge"
  },
  {
    "text": "Elon Musk pledges “war” over H-1B visa program, calls opponents racists … - Trump, who has remained silent thus far on the schism, faces a quickly deepening conflict between his richest and most powerful advisors on one hand, and the people who swept him to office on the other.",
    "url": "https://www.axios.com/2024/12/28/musk-war-h1b-racists-maga-doge"
  },
  {
    "text": "Maga v Musk: Trump camp divided in bitter fight over immigration policy  —  Feud flared up when president-elect chose Sriram Krishnan, an Indian-born entrepreneur, as his AI adviser  —  Bitter in-fighting has broken out between the tech billionaire Elon Musk and Donald Trump's hardline … ",
    "url": "https://www.theguardian.com/us-news/2024/dec/27/trump-elon-musk-sriram-krishnan"
  },
  {
    "text": "Janet Yellen tells Congress US could hit debt limit in mid-January  —  Treasury Secretary Janet Yellen said her agency will need to start taking “extraordinary measures,” or special accounting maneuvers intended to prevent the nation from hitting the debt ceiling, as early as January 14 … ",
    "url": "https://apnews.com/article/treasury-debt-limit-yellen-trump-elections-republicans-9c5d27c08feb744f5ee59dc2c87a06d5"
  },
  {
    "text": "Yellen: US will hit debt ceiling in mid- or late-January  —  Treasury Secretary Janet Yellen said Friday she expects the U.S. will officially run up against its borrowing limit in mid- to late-January, starting the clock on a major fiscal challenge facing President-elect Donald Trump in his first months in office.",
    "url": "https://www.politico.com/live-updates/2024/12/27/congress/yellen-sees-u-s-hitting-debt-ceiling-in-early-2025-00196091"
  },
  {
    "text": "Man accused of attacking TV reporter, saying 'This is Trump's America now'  —  A Colorado man is facing possible bias-motivated charges for allegedly attacking a television news reporter after demanding to know whether he was a citizen, saying “This is Trump's America now,” according to court documents.",
    "url": "https://apnews.com/article/tv-reporter-attack-trumps-america-40c4c3622bf85baef9cefbd50d50fcec"
  },
  {
    "text": "Dean Phillips Was Right About Joe Biden.  He Finds It ‘Awfully Unsatisfying.’  —  The three-term lawmaker and presidential candidate is deeply disappointed with his fellow Democrats.  —  Outgoing Minnesota Rep. Dean Phillips poses for a portrait at his home in Capitol Hill in Washington on Dec. 16.",
    "url": "https://www.politico.com/news/magazine/2024/12/28/dean-phillips-congress-exit-interview-00195232"
  },
  {
    "text": "Elon Musk pens German newspaper opinion piece supporting far-right AfD party  —  Billionaire Trump adviser said his ‘significant investments’ in the country justified his wading into German politics  —  The tech entrepreneur and close adviser to Donald Trump Elon Musk has taken a stunning … ",
    "url": "https://www.theguardian.com/world/2024/dec/28/elon-musk-germany-afd-party"
  },
  {
    "text": "Trump Urges Supreme Court to Pause TikTok Ban  —  The president-elect took no position on the app's First Amendment challenge to the law, which sets a Jan. 19 deadline to sell or close the popular platform.  —  President-elect Donald J. Trump filed an unusual brief on Friday asking … ",
    "url": "https://www.nytimes.com/2024/12/27/us/politics/tiktok-ban-supreme-court-trump.html"
  },
  {
    "text": "Does Trump Jan 6.  Pardon Plan Include the Seditionists?  —  Trump's transition team is not ruling it out  —  With Donald Trump winning back the White House, his Big Lie that Jan. 6 was just an enthusiastic rally that got out of hand, rather than an insurrectionist mob he unleashed to disrupt … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-january-6-pardon-seditionists-oath-keepers-proud-boys-1235219409/"
  },
  {
    "text": "US sanctions former Georgia prime minister amid political turmoil  —  The U.S. has imposed sanctions on Georgia's former prime minister and billionaire Bidzina Ivanishvili, accusing him and the ruling party he founded of “undermining” the country's “democratic and Euro-Atlantic future” to benefit Russia.",
    "url": "https://thehill.com/policy/international/5058366-bidzina-ivanishvili-georgia-sanctions/"
  },
  {
    "text": "Acute respiratory infections complicated by malaria (previously undiagnosed disease) - Democratic Republic of the Congo  —  Situation at a glance  —  This is an update to the Disease Outbreak News on Undiagnosed disease in the Democratic Republic of the Congo published on 8 December 2024 … ",
    "url": "https://www.who.int/emergencies/disease-outbreak-news/item/2024-DON547"
  },
  {
    "text": "Experts confused but delighted by low rates of teen drug use  —  A new study has experts beaming with hope as it shows teen drug use at a record low, but they admit confusion as to why the trend is happening and how to ensure it continues.  —  The annual national Monitoring the Future survey found … ",
    "url": "https://thehill.com/homenews/education/5051213-teen-drug-use-vaping-marijuana-alcohol/"
  },
  {
    "text": "'He's Not Going to Please Everyone.' John Thune's Delicate Task Under Trump  —  The small-town South Dakotan rose to the Senate's top post by deftly navigating spending fights and the ascent of MAGA",
    "url": "https://www.wsj.com/politics/john-thune-senate-majority-leader-profile-aa1eb7b1"
  },
  {
    "text": "Homelessness surged 18% to a new record in 2024 amid a lack of affordable housing across the U.S.  —  Homelessness in the U.S. jumped 18.1% this year, hitting a record level, with the dramatic rise driven mostly by a lack of affordable housing as well as devastating natural disasters and a surge … ",
    "url": "https://www.cbsnews.com/news/homelessness-record-level-2024-up-18-percent-housing-costs-migrants/"
  }
]