[
  {
    "text": "Jack Smith's Big New Jan. 6 Brief Is a Major Indictment of the Supreme Court  —  It's rare to simultaneously feel red-hot anger and wistfulness, especially when merely reading a document.  But those are exactly the emotions that washed over me when I read the redacted version … ",
    "url": "https://slate.com/news-and-politics/2024/10/trump-election-interference-trial-jack-smith-brief-supreme-court-failure.html"
  },
  {
    "text": "John Roberts' Sordid Legacy: 14 Pages of Mean Tweets  —  “One of the ways Trump” disseminated false claims of election fraud, Jack Smith's immunity briefing describes, “was by Tweet, day in and day out.”  —  I'm still wading through Jack Smith's immunity briefing.",
    "url": "https://www.emptywheel.net/2024/10/03/john-roberts-sordid-legacy-14-pages-of-mean-tweets/"
  },
  {
    "text": "Trump casts ‘election interference’ label on everything while facing federal charges  —  Trump is already laying the groundwork to dispute the results of another election, leveling baseless charges of interference as his own federal election interference case progresses.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-casts-election-interference-label-everything-facing-federal-char-rcna173754"
  },
  {
    "text": "October 2, 2024  —  When moderator Margaret Brennan noted during last night's vice presidential debate that Republican nominee J.D. Vance had, once again, lied about the legal status of migrants in Springfield, Ohio, Vance retorted: “The rules were that you guys weren't going to fact-check!”",
    "url": "https://heathercoxrichardson.substack.com/p/october-2-2024"
  },
  {
    "text": "11 damning details in Jack Smith's new brief in the Trump election case  —  From Trump's fictitious stats about voter fraud to the FBI's forensic analysis of Trump's phone, prosecutors previewed how they would make their case at trial.  —  Special counsel Jack Smith won't get a chance … ",
    "url": "https://www.politico.com/news/2024/10/02/jack-smith-trump-election-brief-details-00182287"
  },
  {
    "text": "Trump Is Absolutely Fuming Over the Release of Bombshell Election Case Doc  —  OUTRAGED  —  The former president took to Truth Social to vent his anger over the release of documents filed by special counsel Jack Smith, then went straight to the press.  —  Donald Trump is clearly not happy … ",
    "url": "https://www.thedailybeast.com/trump-is-absolutely-fuming-over-the-release-of-bombshell-election-case-doc"
  },
  {
    "text": "Jack Smith Lays Out New Evidence in Trump's Jan. 6 Case  —  Judge Tanya Chutkan made public portions of a filing by prosecutors setting out their argument for why the case should go forward despite the Supreme Court's ruling on presidential immunity.  —  When told by an aide … ",
    "url": "https://www.nytimes.com/2024/10/02/us/politics/trump-jan-6-case-jack-smith-evidence.html?unlocked_article_code=1.PE4.CPV7.DVbtr_zR8EME&smid=url-share"
  },
  {
    "text": "Behind the Curtain: Vance's “Minnesota nice” ploy … Walz was girded for war against Vance, who has spent the past 10 weeks defending past controversial remarks.  — Instead, Vance greeted Walz with a big smile, and the two shook hands warmly right off the bat.",
    "url": "https://www.axios.com/2024/10/03/jd-vance-vp-debate-nice"
  },
  {
    "text": "Trump fear factor hits Senate GOP … - “I said, 'Sir, if I was you, I would stay out of the race, because there's no win for you in this,'” Sen. Markwayne Mullin (R-Okla.) told us about a recent call with Trump.  — “I hope not,” said Sen. Thom Tillis, when asked if he thinks Trump will weigh in.",
    "url": "https://www.axios.com/2024/10/03/trump-senate-republicans-mcconnell-thune-cornyn"
  },
  {
    "text": "Melania Trump says she forced Donald to drop hardline immigration policy  —  Ex-first lady says she told Trump to stop separating children from parents and addresses jacket controversy in book  —  Melania Trump describes in her new memoir how she made her husband, then president Donald Trump … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/03/melania-trump-donald-immigration-jacket-slogan-book"
  },
  {
    "text": "Melania Trump passionately defends abortion rights in upcoming memoir  —  Exclusive: ‘I have carried this belief with me throughout my entire adult life’, former first lady writes in memoir  —  Melania Trump made an extraordinary declaration in an eagerly awaited memoir to be published … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/02/melania-trump-memoir-defends-abortion-rights"
  },
  {
    "text": "Giuliani's daughter: ‘The biggest threat to our country is Trump’  —  Former New York City Mayor Rudy Giuliani's (R) daughter said she thinks the biggest threat to America is former President Trump.  —  Caroline Giuliani has spoken out in recent days about her father's entanglements with Trump and the upcoming election.",
    "url": "https://thehill.com/blogs/in-the-know/4913595-giuliani-daughter-trump-threat/"
  },
  {
    "text": "UK will give sovereignty of Chagos Islands to Mauritius  —  The UK has announced it is giving up sovereignty of a remote but strategically important cluster of islands in the Indian Ocean after more than half a century.  —  The deal - reached after years of negotiations … ",
    "url": "https://www.bbc.com/news/articles/c98ynejg4l5o"
  },
  {
    "text": "Liz Cheney to join Harris on campaign trail at birthplace of GOP  —  Former Rep. Liz Cheney (R-Wyo.) will join Vice President Harris at a campaign event on Thursday in Ripon, Wisc., known as the birthplace of the Republican Party, according to a senior campaign official.",
    "url": "https://thehill.com/homenews/campaign/4912623-liz-cheney-kamala-harris-wisconsin/"
  },
  {
    "text": "Mayorkas warns FEMA doesn't have enough funding to last through hurricane season … The Federal Emergency Management Agency can meet immediate needs but does not have enough funding to make it through the hurricane season, Homeland Security Secretary Alejandro Mayorkas told reporters Wednesday.",
    "url": "https://apnews.com/article/hurricane-helene-congress-fema-funding-5be4f18e00ce2b509d6830410cf2c1cb"
  },
  {
    "text": "How We Report on Maternal Health — and How to Get in Touch With Our Team  —  More than a dozen ProPublica journalists are working across the country to cover reproductive health in the wake of abortion bans.  We hope to hear from medical providers, families and policymakers.",
    "url": "https://www.propublica.org/article/help-propublica-report-on-maternal-health-abortion-bans"
  },
  {
    "text": "Trump Promised to Release His Medical Records.  He Still Won't Do It.  —  If elected again, he would become the oldest president by the end of his term.  Yet he is refusing to disclose even basic health information.  —  As a presidential candidate in 2015, Donald J. Trump declined to release … ",
    "url": "https://www.nytimes.com/2024/10/03/health/trump-health-records.html"
  },
  {
    "text": "Trump campaign brings in $160 million in September  —  Hundreds of millions of dollars raised by each campaign are going towards expensive television buys in battleground states.  —  Donald Trump's campaign reported raising over $160 million in September as it gears up for the final five weeks of the presidential election.",
    "url": "https://www.politico.com/news/2024/10/02/trump-fundraising-september-2024-00182263"
  }
]