[
  {
    "text": "Key Bridge collapses into Patapsco River in Baltimore after vessel hits support column; state of emergency declared  —  Baltimore's Francis Scott Key Bridge collapsed early Tuesday after a container ship struck a support column, sending at least seven cars into the Patapsco River … ",
    "url": "https://www.baltimoresun.com/2024/03/26/key-bridge-collapses-into-patapsco/"
  },
  {
    "text": "Cargo ship hits Baltimore's Key Bridge, bringing it down.  Rescuers are looking for people in water  —  Watch live views from Baltimore where a major bridge snapped and collapsed after a container ship rammed into it early Tuesday, and several vehicles fell into the river below.",
    "url": "https://apnews.com/article/baltimore-bridge-collapse-53169b379820032f832de4016c655d1b"
  },
  {
    "text": "Mick Mulvaney defends Ronna McDaniel amid NBC turmoil  —  Former White House chief of staff Mick Mulvaney is dismissing criticism NBC News is facing from some of the network's biggest stars over its decision to hire former Republican National Committee Chair Ronna McDaniel as a paid contributor.",
    "url": "https://thehill.com/homenews/media/4556337-mick-mulvaney-ronna-mcdaniel-nbc-news-msnbc/"
  },
  {
    "text": "What Were They Thinking?  —  Journalism Lesson #1 for 2024:  —  The mainstream media should not normalize Donald Trump's behavior, nor should they give a platform to his lies or those of his sycophants, who for years have spread disastrous untruths that may have irreparably damaged our nation.",
    "url": "https://steady.substack.com/p/what-were-they-thinking"
  },
  {
    "text": "Biden Gains Ground Against Trump in Six Key States, Poll Shows  —  The move in the president's direction comes after five months of mostly consistent Trump leads.  —  President Joe Biden has gained ground against Republican Donald Trump in six of seven key swing states, and significantly so in at least two of them.",
    "url": "https://www.bloomberg.com/news/articles/2024-03-26/election-2024-poll-biden-gains-on-trump-in-six-swing-states"
  },
  {
    "text": "MAGA candidates tanked the midterms.  Biden thinks they could again.  —  Democrats are hoping to re-run a strategy that got them through the midterms.  —  When President Joe Biden takes the stage in Raleigh, N.C. on Tuesday, Attorney General Josh Stein will dutifully serve as a warm-up act.",
    "url": "https://www.politico.com/news/2024/03/26/biden-down-ballot-maga-2024-election-00149055"
  },
  {
    "text": "Alina Habba mocks New York AG after appeals court reduces Trump bond  —  Alina Habba, attorney to former President Donald Trump, mocked New York Attorney General Letitia James, after an appeals court significantly reduced the cost of a bond he must pay while he appeals his multimillion-dollar civil fraud penalty.",
    "url": "https://thehill.com/regulation/court-battles/4556222-habba-mocks-new-york-ag-appeals-court-reduces-trump-bond/"
  },
  {
    "text": "No One Is Above the Law, Except, Apparently, Donald Trump  —  As the week began, it looked as though Donald Trump would finally face consequences — or at least, a consequence — for his actions.  —  Last month, a New York state trial court found the former president liable for inflating … ",
    "url": "https://www.nytimes.com/2024/03/26/opinion/trump-trials-bond-invincibility.html"
  },
  {
    "text": "‘Feeble, Confused And Tired’: Donald Trump Torched After Bizarre Gaffe-Filled Appearance  —  The former president delivered a rambling performance as his legal battles heat up.  —  LOADING  —  President Joe Biden's campaign on Monday released an unusually blunt statement tearing into Donald Trump as … ",
    "url": "https://www.huffpost.com/entry/trump-feeble-gaffes_n_660263bde4b0269c5d2d12ac"
  },
  {
    "text": "Trump accuses hush money judge of bias, points to daughter's political work as trial nears … Former President Donald Trump speaks during a press conference at 40 Wall Street on March 25, 2024 in New York City.  —  Donald Trump on Tuesday lashed out at the judge in his criminal hush money case … ",
    "url": "https://www.cnbc.com/2024/03/26/trump-attacks-hush-money-judge-points-to-daughters-political-work.html"
  },
  {
    "text": "Bowman reverses after calling reports of Oct. 7 sexual assaults in Israel ‘propaganda’  —  In a statement Thursday, the New York Democrat said: “The UN confirmed that Hamas committed rape and sexual violence, a reprehensible fact that I condemn entirely.”",
    "url": "https://www.politico.com/live-updates/2024/03/26/congress/bowman-house-israel-october-7-sexual-assault-hamas-00148426"
  },
  {
    "text": "Truth Social Stock Price Surges on First Day of Trading, Increasing Trump's Fortune  —  Board members including Donald Trump's son and former cabinet members will decide when he can cash in  —  Shares of Donald Trump's social-media company surged about 30% on their first day of trading, boosting the presidential candidate's fortune.",
    "url": "https://www.wsj.com/finance/truth-social-stock-trades-dwac-trump-18a6cd74"
  },
  {
    "text": "RFK Jr. intends to name attorney Nicole Shanahan as his VP pick  —  The attorney and entrepreneur, like Kennedy himself, has never run for elected office, but she has contributed to his campaign and allied super PAC.  —  Independent presidential candidate Robert F. Kennedy Jr. intends … ",
    "url": "https://www.nbcnews.com/politics/2024-election/rfk-jr-intends-name-attorney-nicole-shanahan-vp-pick-rcna144983"
  },
  {
    "text": "Inside the squatting hysteria  —  On March 17, a provocateur named Leonel Moreno posted a video on TikTok where he purports to give instructions on how people can successfully “squat” in other people's houses.  It was one of many videos he made about how to exploit American law.",
    "url": "https://popular.info/p/inside-the-squatting-hysteria"
  },
  {
    "text": "Qatari royal invested about $50 million in pro-Trump network Newsmax  —  Before and after the investment, senior newsroom leaders urged Newsmax staff to soften coverage of Qatar, current and former employees said  —  A member of the Qatari royal family invested roughly $50 million in Newsmax … ",
    "url": "https://www.washingtonpost.com/nation/2024/03/26/qatar-newsmax-investment/"
  },
  {
    "text": "Social Media Accounts Spew Conspiracy Theories About Key Bridge Collapse  —  Right-wing influencers on X used the tragedy in Baltimore to boost their brands.  —  Social media accounts were serving up conspiracy theories within hours of a container ship knocking down the Francis Scott Key Bridge in Baltimore on Tuesday.",
    "url": "https://www.huffpost.com/entry/francis-scott-key-bridge-conspiracy-theories_n_6602e6cbe4b0f0f5f948bca0"
  },
  {
    "text": "Texas AG Ken Paxton reaches deal to end securities fraud charges after 9 years  —  Prosecutors on Tuesday announced an agreement with Texas Attorney General Ken Paxton that would ultimately dismiss securities fraud charges he has been facing for nearly a decade.",
    "url": "https://apnews.com/article/ken-paxton-texas-securities-fraud-9ed5eecc30c1f967ec51f7e58ad9d0af"
  },
  {
    "text": "Former Trump DOJ official Jeffrey Clark fights to save law license as disciplinary trial begins  —  Clark faces potential disbarment for his efforts to subvert the 2020 election.  —  Jeffrey Clark, a former Justice Department official who worked closely with former President Donald Trump … ",
    "url": "https://www.politico.com/news/2024/03/26/former-trump-doj-official-disciplinary-trial-00149060"
  },
  {
    "text": "Exclusive: US lawmaker seeks answers on FDA inspection of Musk's Neuralink  —  A U.S. lawmaker involved in health policy has asked the Food and Drug Administration why it did not inspect Elon Musk's Neuralink before allowing the brain implant company to test its device in humans.",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-lawmaker-seeks-answers-fda-inspection-musks-neuralink-2024-03-26/"
  },
  {
    "text": "Erin Hawley: The Woman Arguing Against the Abortion Pill  —  Erin Hawley is best known as the wife of Senator Josh Hawley, but now the spotlight is on her in a Supreme Court case.  —  It was 2014, and Erin Morrow Hawley was fighting against the egg-laying hens of Missouri.",
    "url": "https://www.nytimes.com/2024/03/26/us/erin-hawley-abortion-pill-supreme-court.html"
  },
  {
    "text": "Protesters arrested outside Supreme Court as justices weigh future of abortion pill  —  Several protesters have been arrested outside the Supreme Court, as justices are scheduled to hear arguments in a case over the Food and Drug Administration's approval of the abortion pill mifepristone.",
    "url": "https://www.washingtonexaminer.com/news/justice/2938582/protesters-arrested-outside-supreme-court-justices-weigh-future-of-abortion-pill/"
  },
  {
    "text": "Why Was Operation Thor Shut Down by the Biden Admin?  —  Retired ATF Assistant Director Peter Forcelli is giving us the details on Sen. Chuck Grassley's investigation into Operation Thor, a multi-agency effort to combat cartel weapons trafficking that was abruptly and inexplicably shut down by the Biden administration.",
    "url": "https://hotair.com/videos/2024/03/26/why-was-operation-thor-shut-down-by-the-biden-admin-n3785408"
  }
]