[
  {
    "text": "How Trump was talked into — and out of — a run for speaker  —  A behind-the-scenes campaign coaxed the former president out of a quixotic campaign.  —  Just hours after Kevin McCarthy was deposed as House speaker, the “draft Trump” movement began.  —  “I called him and I said, 'Sir … ",
    "url": "https://www.politico.com/news/2023/10/06/trump-jim-jordan-house-speaker-endorsements-00120320"
  },
  {
    "text": "Inside Trump's earlier secret bid for House speaker as McCarthy nomination drama unfolded  —  From ABC News Chief Washington Correspondent Jonathan Karl's upcoming book.  —  Former U.S. President Donald Trump arrives to deliver remarks at the South Carolina State House, Jan. 28, 2023 in Columbia, SC.",
    "url": "https://abcnews.go.com/Politics/inside-trumps-earlier-secret-bid-house-speaker-mccarthy/story?id=103779066"
  },
  {
    "text": "How a Texas Congressman ‘Totally F—d’ Trump's House Speaker Race Strategy (Exclusive)  —  According to one adviser, the former president is ‘pissed’ at Rep. Troy Nehls  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing an external link … ",
    "url": "https://themessenger.com/politics/donald-trump-house-speaker-race-troy-nehls"
  },
  {
    "text": "Trump Drops Lawsuit Against Judge Who Doomed His Company  —  The former president's attempt to throw a wrench in the New York AG's case against him by suing Justice Arthur F. Engoron was a failure.  —  A week into his bank fraud trial, Donald Trump late Thursday night dropped … ",
    "url": "https://www.thedailybeast.com/trump-drops-lawsuit-against-judge-arthur-f-engoron-who-doomed-his-company"
  },
  {
    "text": "Trump seeks pause in New York fraud trial  —  Attorneys for former President Trump are seeking to temporarily pause his civil fraud trial, along with the enforcement of a ruling issued before the trial started that found Trump and his business liable for fraud, until after the case has been appealed.",
    "url": "https://thehill.com/regulation/court-battles/4242026-trump-seeks-pause-in-new-york-fraud-trial/"
  },
  {
    "text": "Kevin McCarthy considers resigning from the House before the end of his term  —  The deposed former speaker has made clear he plans to stay at least through the speakership election before ending his House career, two people familiar with the matter tell POLITICO.",
    "url": "https://www.politico.com/news/2023/10/06/kevin-mccarthy-considers-resigning-congress-00120381"
  },
  {
    "text": "America needs to talk about the right's ‘Red Caesar’ plan for U.S. dictatorship  —  The incredible scenes this week on Capitol Hill — leaving the U.S. House without a speaker and promising an autumn of sheer chaos in Congress — marked a rapid escalation of the downward spiral of American democracy.",
    "url": "https://www.inquirer.com/opinion/red-caesar-right-american-dictatorship-20231005.html"
  },
  {
    "text": "‘What Is Broken in American Politics Is the Republican Party’  —  Fourteen experts on the roots of Kevin McCarthy's ouster and what's broken in American politics  —  “McCarthy chose to accept his fate” “Trump acted as a lightning rod” “The culture of democracy is robust” “A project at war with the Constitution”",
    "url": "https://www.politico.com/news/magazine/2023/10/06/republican-leaders-mccarthy-expert-roundup-00120170"
  },
  {
    "text": "Iowa police dispute Ramaswamy campaign's claim that protesters rammed their car  —  “Our investigation has revealed no evidence to substantiate” the claim that protesters hit Ramaswamy's car on purpose and fled, police said.  —  Republican presidential candidate Vivek Ramaswamy's campaign claimed Thursday … ",
    "url": "https://www.politico.com/news/2023/10/06/vivek-ramaswamy-iowa-car-00120318"
  },
  {
    "text": "During an online fundraiser, Matt Gaetz denounced the Biden impeachment effort as unserious  —  As the House tries to replace Kevin McCarthy, the future of the impeachment inquiry could become a bargaining chip in the wrangling to win the speakership.  —  WASHINGTON — Days before Rep. Matt Gaetz led … ",
    "url": "https://www.nbcnews.com/politics/congress/gaetz-biden-impeachment-rosendale-rcna119131"
  },
  {
    "text": "Many GOP anti-Trumpers are throwing in the towel … They've concluded that the GOP's base can't quit Trump. … - Republican Accountability PAC — a group of former Trump voters dedicated to moving beyond the former president — is giving up on the primary after spending $1 million on ads in Iowa.",
    "url": "https://www.axios.com/2023/10/06/gop-anti-trump-fading-away-2024"
  },
  {
    "text": "A bipartisan coalition is the way forward for the House  —  Hakeem Jeffries (N.Y.) is the Democratic leader of the House of Representatives.  —  In recent days, Democrats have tried to show our colleagues in the Republican majority a way out of the dysfunction and rancor they have allowed to engulf the House.",
    "url": "https://www.washingtonpost.com/opinions/2023/10/06/hakeem-jeffries-bipartisan-coalition-house-gop/"
  },
  {
    "text": "Payrolls soared by 336,000 in September, defying expectations for a hiring slowdown  — Nonfarm payrolls increased by 336,000 for the month, better than the Dow Jones consensus estimate for 170,000.  — Average hourly earnings rose 0.2% for the month and 4.2% from a year ago, compared to respective estimates for 0.3% and 4.3%.",
    "url": "https://www.cnbc.com/2023/10/06/jobs-report-september-2023.html"
  },
  {
    "text": "Moms for Liberty Is Taking Over Banned Books Week  —  It's the American Library Association's annual Banned Books Week, a tradition that started in 1982.  This year, the theme is “Let Freedom Read!” in honor of record-breaking efforts to censor books now sweeping the nation's libraries and schools.",
    "url": "https://www.motherjones.com/politics/2023/10/moms-for-liberty-is-taking-over-banned-books-week/"
  },
  {
    "text": "Iowa surrenders, falls back to Super Tuesday for Democrats in 2024  —  Iowa Democrats say they will compete for an earlier nominating contest in future years.  —  ST. LOUIS — Iowa Democrats will surrender their first-in-the-nation caucuses next year, party officials said Friday … ",
    "url": "https://www.politico.com/news/2023/10/06/iowa-democrats-super-tuesday-00120337"
  },
  {
    "text": "Massive Changes Could Be Coming From the Vatican.  Conservative US Catholics Are Mad as Hell.  —  This week, hundreds of delegates from around the world began a monthlong meeting as part of Pope Francis' “Synod on Synodality”—a gathering to discuss the future of the Catholic church.",
    "url": "https://www.motherjones.com/politics/2023/10/catholic-church-vatican-pope-francis-raymond-burke-same-sex-marriage-women-priests/"
  },
  {
    "text": "Running Spoiler Campaigns Does Not Protect ‘Democracy’ … Most Americans who oppose Donald Trump agree the threat to democracy is the major issue of the 2024 election.  But what, precisely, constitutes the threat?  To most Democrats, the danger is that the election will install into power … ",
    "url": "https://nymag.com/intelligencer/2023/10/running-spoiler-campaigns-does-not-protect-democracy.html"
  },
  {
    "text": "33 Lawmakers Urge Biden To Release Leonard Peltier — Including 1 Republican  —  We must “hold our government accountable when we see a case of injustice,” they said of the Indigenous activist who has been in prison for nearly 50 years.  —  LOADING  —  Nearly three dozen members of Congress … ",
    "url": "https://www.huffpost.com/entry/leonard-peltier-clemency-joe-biden_n_652036bce4b091a3dc271cdb"
  },
  {
    "text": "New front opens in abortion wars as pharmacies begin dispensing pills  —  A handful of pharmacies are offering the pills 10 months after the Biden administration allowed them to do so.  —  A handful of independent pharmacies across the country have quietly begun dispensing … ",
    "url": "https://www.politico.com/news/2023/10/06/pharmacies-begin-dispensing-abortion-pills-00120397"
  },
  {
    "text": "N.J. Attorney General Opens Inquiry Into Nadine Menendez's Fatal Crash  —  The scrutiny could create fresh legal and political peril for Senator Robert Menendez, a Democrat, who has been charged with accepting bribes.  —  The New Jersey attorney general's office seized records on Thursday … ",
    "url": "https://www.nytimes.com/2023/10/06/nyregion/nadine-menendez-investigation-koop.html"
  },
  {
    "text": "UAW holds off on widening strike citing ‘significant progress’ in talks  —  United Auto Workers President Shawn Fain said Friday that the union will not expand its strike and that contract talks have made “significant progress” in recent days.  —  United Auto Workers President Shawn Fain … ",
    "url": "https://www.politico.com/news/2023/10/06/uaw-holds-off-on-widening-strike-citing-significant-progress-in-talks-00120412"
  },
  {
    "text": "Former Army sergeant indicted for efforts to give classified information to China  —  He allegedly pinged China's security services offering classified information.  —  A former U.S. Army sergeant was arrested Friday at the San Francisco airport and indicted on charges that he unlawfully … ",
    "url": "https://abcnews.go.com/Politics/former-army-sergeant-indicted-efforts-give-classified-information/story?id=103789204"
  }
]