[
  {
    "text": "How Mark Meadows Pursued a High-Wire Legal Strategy in Trump Inquiries  —  The former White House chief of staff, a key witness to Donald J. Trump's efforts to remain in power after his 2020 election loss, maneuvered to provide federal prosecutors only what he had to.",
    "url": "https://www.nytimes.com/2023/08/22/us/politics/mark-meadows-trump-legal-strategy.html"
  },
  {
    "text": "State senator eyes new panel as way to punish Fani Willis over Trump indictments  —  Commission, starting in October, will have power to sanction and even remove prosecutors  —  X  —  Several Republican lawmakers are seeking ways to sanction Fulton County District Attorney Fani Willis … ",
    "url": "https://www.ajc.com/politics/trumps-georgia-allies-search-for-ways-to-punish-fani-willis/LYUKIOKBJJBMBAXFD3JCWO2ZTQ/"
  },
  {
    "text": "Several key cases that could bear on special counsel Jack Smith's election case against Trump await DC Circuit rulings  —  As the US Circuit Court of Appeals in Washington, DC, gets ready to begin its new term next month, the next two weeks could usher in several consequential rulings … ",
    "url": "https://www.cnn.com/2023/08/22/politics/dc-circuit-trump-jack-smith-election/"
  },
  {
    "text": "Scoop: Fox News restricts Trump team's access to debate “spin room”  —  Fox News hit back at former President Trump late Monday after he declined to appear at the GOP presidential debate the network will host Wednesday in Milwaukee. … - Trump senior aides who had indicated they'd be in the spin room … ",
    "url": "https://www.axios.com/2023/08/22/fox-news-restricts-trump-campaign-access-debate-spin-room"
  },
  {
    "text": "Majority of likely Iowa GOP caucusgoers believe Trump won the 2020 election  —  The new NBC News/Des Moines Register/Mediacom poll shows Trump's unfounded claims he won the last election remain salient ahead of the Iowa GOP caucus.  —  More than half of likely Iowa Republican caucusgoers … ",
    "url": "https://www.nbcnews.com/politics/2024-election/majority-likely-iowa-gop-caucusgoers-say-trump-won-2020-election-rcna100955"
  },
  {
    "text": "John Eastman Statement Upon Self-Surrender in Fulton County  —  I am here today to surrender to an indictment that should never have been brought.  It represents a crossing of the Rubicon for our country, implicating the fundamental First Amendment right to petition the government for redress of grievances.",
    "url": "https://www.burnhamgorokhov.com/john-eastman-statement-upon-self-surrender-in-fulton-county/"
  },
  {
    "text": "Sen. Rick Scott picks up a Democratic challenger for 2024  —  Former Rep. Debbie Mucarsel-Powell announced Tuesday that she's taking on the incumbent Republican in what's considered an uphill climb for Democrats.  —  Former Democratic Rep. Debbie Mucarsel-Powell announced Tuesday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/rep-debbie-mucarsel-powell-challening-rick-scott-senate-2024-rcna101023"
  },
  {
    "text": "Biden names former Obama-era lawyer as White House counsel  —  The appointment comes as Biden seeks to advance his legislative agenda and faces ongoing Republican-led congressional investigations.  —  WASHINGTON — President Joe Biden named former federal prosecutor and Chicago lawyer Ed Siskel … ",
    "url": "https://www.nbcnews.com/politics/white-house/biden-names-former-obama-era-lawyer-white-house-counsel-rcna101146"
  },
  {
    "text": "‘I Could Use a Little More Self-Flagellation’  —  Before Chris Christie became Donald Trump's sharpest critic, he was an important early booster.  Does he need to apologize for that?  —  Mary Beth Koeth for POLITICO  —  SOUTH MIAMI, Fla. —  Early this past Friday morning … ",
    "url": "https://www.politico.com/news/magazine/2023/08/22/chris-christie-donald-trump-critic-00112106"
  },
  {
    "text": "Popular GOP governor reveals key for candidates onstage at Republican presidential debate  —  Fox News is hosting the first Republican presidential nomination debate on Wednesday at 9pm ET in Milwaukee, Wisconsin  —  LONDONDERRY, N.H. - Republican Gov. Chris Sununu of New Hampshire … ",
    "url": "https://www.foxnews.com/politics/popular-gop-governor-reveals-key-candidates-onstage-republican-presidential-debate"
  },
  {
    "text": "Tropical Storm Harold makes landfall on Padre Island, Texas: Latest forecast  —  Heavy rain, gusty winds and flooding are possible.  —  Tropical Storm Harold made landfall on Padre Island, Texas, Tuesday morning as heavy rain and tropical storm-force winds slammed the region.",
    "url": "https://abcnews.go.com/US/tropical-storm-harold-strengthens-gulf-mexico-approaches-texas/story?id=102442797"
  },
  {
    "text": "Trump indictments boost MSNBC primetime ratings  —  MSNBC has seen a boost in primetime ratings this summer, thanks in large part to its coverage of the slew of indictments against former President Donald Trump. … But Trump's legal woes, combined with Tucker Carlson's departure from Fox … ",
    "url": "https://www.axios.com/2023/08/22/msnbc-trump-indictments-ratings-boost"
  },
  {
    "text": "US businessman is wannabe ‘warlord’ of secretive far-right men's network  —  Revealed: Charles Haywood, creator of the Society for American Civic Renewal, has said he might serve as ‘warlord’ at the head of an ‘armed patronage network’  —  The founder and sponsor of a far-right network of secretive … ",
    "url": "https://www.theguardian.com/world/2023/aug/22/charles-haywood-claremont-institute-sacr-far-right"
  },
  {
    "text": "Trump's bond set for $200,000 in Fulton County  —  X  —  Former President Donald Trump was granted a $200,000 bond on Monday ahead of the Republican's expected surrender at the Fulton County jail.  —  Under the terms of the consent bond order, Trump can't perform any acts of witness intimidation … ",
    "url": "https://www.ajc.com/politics/trumps-bond-set-for-200000-in-fulton-county/YVM7QOLFL5FDRGIVL6A7FR6JMI/"
  },
  {
    "text": "Biden admin launches new income-driven student loan repayment program  —  The Biden administration officially launched the new income-driven student loan repayment plan for borrowers on Tuesday, ahead of repayments restarting this fall.  —  The official launch of the Saving on a Valuable Education … ",
    "url": "https://thehill.com/homenews/education/4163126-biden-admin-launches-new-income-driven-student-loan-repayment-program/"
  },
  {
    "text": "Biden taking break from Lake Tahoe vacation at billionaire's mansion to tour Maui wildfire damage  —  LAHAINA, Hawaii — President Biden was greeted with middle fingers, chants of protest, and signs that said “No Comment” Monday as he arrived in Maui to tour wildfire damage after repeatedly declining … ",
    "url": "https://nypost.com/2023/08/21/biden-takes-break-from-vacation-to-tour-hawaii-fire-damage/"
  }
]