[
  {
    "text": "Live Updates: Supreme Court to Hear Trump's Claim to ‘Absolute Immunity’  —  The justices will consider whether the former president must face trial on charges that he tried to subvert the 2020 election.  The decision will help determine whether that trial starts before the 2024 election.",
    "url": "https://www.nytimes.com/live/2024/04/25/us/trump-immunity-supreme-court"
  },
  {
    "text": "Live updates Supreme Court hears arguments in Trump immunity case  —  The Supreme Court is hearing oral arguments over the unprecedented question of whether Donald Trump is immune from prosecution for actions taken while in office to try to retain power after losing the 2020 election.",
    "url": "https://www.washingtonpost.com/politics/2024/04/25/supreme-court-trump-immunity-case/"
  },
  {
    "text": "A day all about Trump: Mostly out of sight, but still ubiquitous  —  From the Supreme Court to a Manhattan courtroom, Thursday showed how much of the 2024 campaign centers on Trump's legal dramas.  —  From the lofty chambers of the Supreme Court to the gutters of tabloid journalism … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/25/trump-trials-supreme-court/"
  },
  {
    "text": "Playbook PM: How SCOTUS might save Trump from his biggest trial  —  DEPT. OF HEADLINES TO RUIN YOUR DAY — “As bird flu spreads in cows, fractured U.S. response has echoes of early covid,” by WaPo's Lena Sun and Rachel Roubein  —  MEGATREND — “US fertility rate dropped to lowest in a century … ",
    "url": "https://www.politico.com/newsletters/playbook-pm/2024/04/25/how-scotus-might-save-trump-from-his-biggest-trial-00132333"
  },
  {
    "text": "Live Updates: Harvey Weinstein's Conviction Is Overturned by New York's Top Court  —  Manhattan prosecutors must now decide whether to retry Mr. Weinstein, the disgraced Hollywood producer whose sexual abuse case sparked the #MeToo movement.  —  Harvey Weinstein's Conviction Is Overturned by New York's Top Court",
    "url": "https://www.nytimes.com/live/2024/04/25/nyregion/harvey-weinstein-appeal"
  },
  {
    "text": "The Petty Feud Between the NYT and the White House  —  Biden's people think they're “entitled.”  The Times says “they're not being realistic.”  —  When news broke one Saturday night in March 2023 that President Joe Biden's nominee to lead the Federal Aviation Administration was withdrawing … ",
    "url": "https://www.politico.com/news/magazine/2024/04/25/new-york-times-biden-white-house-00154219"
  },
  {
    "text": "A Principal Was Removed, Faced Threats for Making Racist Comments.  There's Just One, Major Problem.  —  A black ex-employee allegedly used artificial intelligence to frame the white principal of a Baltimore-area high school as a racist and an antisemite, resulting in relentless threats … ",
    "url": "https://townhall.com/tipsheet/miacathell/2024/04/25/baltimore-high-school-hate-crime-hoax-n2638281"
  },
  {
    "text": "Ex-athletic director framed principal with AI-generated voice, police say  —  Baltimore County Police arrested Pikesville High School's former athletic director Thursday morning and charged him with using artificial intelligence to impersonate Principal Eric Eiswert, leading the public … ",
    "url": "https://www.thebaltimorebanner.com/education/k-12-schools/eric-eiswert-ai-audio-baltimore-county-YBJNJAS6OZEE5OQVF5LFOFYN6M/"
  },
  {
    "text": "MAGA begins to panic: Trump may not make it to the ballot  —  Donald Trump.  —  Those two words spoken out loud can elicit an emotional response on par with the worst invectives, curses or insults you can conjure.  —  The man himself is capable of the same emotional outbursts under the proper stimuli.",
    "url": "https://www.salon.com/2024/04/25/maga-begins-to-panic-may-not-make-it-to-the-ballot/"
  },
  {
    "text": "US preparing to announce $6B in weapons contracts for Ukraine  —  The package could be finalized and announced as soon as Friday, and will include Patriot systems.  —  The U.S. is putting the finishing touches on one of its largest Ukraine military aid packages to date … ",
    "url": "https://www.politico.com/news/2024/04/25/us-weapons-contract-ukraine-00154450"
  },
  {
    "text": "Trump leads in swing-state polls and is tied with Biden nationally  —  How 538's new 2024 presidential general election polling averages work.  —  How 538's new 2024 presidential general election polling averages work.  —  It's the moment you've all been waiting for: Today … ",
    "url": "https://abcnews.go.com/538/trump-leads-swing-state-polls-tied-biden-nationally/story?id=109506070"
  },
  {
    "text": "The US supreme court heard one of the most sadistic, extreme anti-abortion cases yet  —  Idaho's law requires doctors to treat pregnant women's health as disposable - and the loss of their lives as an acceptable risk  —  The risk of stating plainly what Idaho argued at the US supreme court … ",
    "url": "https://www.theguardian.com/commentisfree/2024/apr/25/supreme-court-idaho-anti-abortion-case"
  },
  {
    "text": "In Historic Vote, the FCC Reasserts Its Authority to Protect the Open Internet and Safeguard Online Users  —  Contact: Timothy Karr, 201-533-8838  —  WASHINGTON — On Thursday, in a 3-2 vote, the Federal Communications Commission voted to restore Net Neutrality protections … ",
    "url": "https://www.freepress.net/news/press-releases/historic-fcc-vote-restore-net-neutrality-title-ii"
  },
  {
    "text": "Gaza-based militants attack Israeli forces preparing for US pier  —  No U.S. equipment was damaged.  —  Gaza-based militants launched mortar rounds on Wednesday at Israeli forces making preparations for the U.S.-led effort to establish a new maritime aid route for Gaza, according to two U.S. officials.",
    "url": "https://www.politico.com/news/2024/04/25/gaza-terrorists-attack-israeli-pier-00154386"
  },
  {
    "text": "The GOP's “Election Integrity” Lawyer Was Just Indicted for Election Subversion  —  Christina Bobb tried to overturn the 2020 election, and Arizona just charged her for it.  —  The attorney running the Republican National Committee's “election integrity” effort has been criminally charged … ",
    "url": "https://www.motherjones.com/politics/2024/04/arizona-indictments-christina-bobb/"
  },
  {
    "text": "Federal judge rejects Donald Trump's bid for new E. Jean Carroll defamation trial, upholds $83M judgment  —  The judge said Trump delivered “malicious and unceasing attacks” against her.  —  E. Jean Carroll leaves federal court in Manhattan, New York City on April 26, 2023 following testimony … ",
    "url": "https://abcnews.go.com/Politics/federal-judge-rejects-donald-trumps-bid-new-jean/story?id=109634929"
  },
  {
    "text": "Dow closes lower by more than 370 points as inflation, growth worries resurface: Live updates  —  Stocks tumbled Thursday after the latest U.S. economic data showed a sharp slowdown in growth and pointed to persistent inflation.  —  The Dow Jones Industrial Average slid 375.12 points … ",
    "url": "https://www.cnbc.com/2024/04/25/dow-drops-more-than-600-points-on-inflation-and-growth-concerns-live-updates.html"
  },
  {
    "text": "8 years after the National Enquirer's deal with Donald Trump, the iconic tabloid is limping badly  —  NEW YORK (AP) — Catch and kill.  Checkbook journalism.  Secret deals.  Friends helping friends.  —  Even by National Enquirer standards, testimony by its former publisher David Pecker … ",
    "url": "https://apnews.com/article/trump-national-enquirer-catch-kill-57f0c462af437fb07967a041b6f66022"
  },
  {
    "text": "Justice Department fight with House GOP heats up over Biden recording … The letter from the DOJ on Thursday argues it has complied with the GOP's oversight of the Hur investigation.  — \"\"It seems that the more information you receive, the less satisfied you are, and the less justification … ",
    "url": "https://www.axios.com/2024/04/25/justice-department-hur-biden-recording"
  },
  {
    "text": "Ex-F.B.I. Lawyer Who Criticized Trump Says Bureau Failed to Warn Her About Stalker  —  A man who pleaded guilty to stalking the lawyer, Lisa Page, had been discharged from the Marines after expressing an obsession with her as well as mass shootings, information that was shared with the F.B.I.",
    "url": "https://www.nytimes.com/2024/04/25/us/politics/lisa-page-john-perez-stalker.html"
  },
  {
    "text": "Tough-on-crime rethink  —  THE BUZZ: PLAYBOOK EXCLUSIVE — Sacramento Democrats have been working to prevent a rigid tough-on-crime ballot measure from making it to voters in November, offering an alternative through bills on topics like drug use and retail theft.",
    "url": "https://www.politico.com/newsletters/california-playbook/2024/04/25/tough-on-crime-rethink-00154265"
  }
]