[
  {
    "text": "Congress has the power to block Trump from taking office, but lawmakers must act now  —  The Constitution provides that an oath-breaking insurrectionist is ineligible to be president.  This is the plain wording of Section 3 of the 14th Amendment to the Constitution.",
    "url": "https://thehill.com/opinion/congress-blog/5055171-constitution-insurrection-trump-disqualification/"
  },
  {
    "text": "Trump has pressed for voting changes.  GOP majorities in Congress will try to make that happen  —  Republicans plan to move quickly in their effort to overhaul the nation's voting procedures, seeing an opportunity with control of the White House and both chambers of Congress … ",
    "url": "https://apnews.com/article/voting-congress-citizenship-voter-id-republicans-88342cf09d01b0555851aa3d64c45432"
  },
  {
    "text": "Breaking news.  Exclusive: Preliminary investigation confirms Russian missile caused Azerbaijan Airlines crash  —  38 passengers were killed on Wednesday after Azerbaijan Airlines Flight 8432 crashed as it attempted to make an emergency landing near the city of Aktau in Kazakhstan.",
    "url": "https://www.euronews.com/2024/12/26/exclusive-preliminary-investigation-confirms-russian-missile-over-grozny-caused-aktau-cras"
  },
  {
    "text": "Trump's top border adviser says he will bring back family detention  —  Tom Homan oversaw implementation of the “zero tolerance” policy that separated more than 4,000 children from their parents during Trump's first term.  —  U.S. immigration authorities will once more put families with children … ",
    "url": "https://www.washingtonpost.com/immigration/2024/12/26/immigration-border-tom-homan-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM1MTg5MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM2NTcxNTk5LCJpYXQiOjE3MzUxODkyMDAsImp0aSI6Ijk0ODdiMTM5LWYyYTgtNDU3Zi04NjZjLWZjNDU5YzlhZDdkMSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI0LzEyLzI2L2ltbWlncmF0aW9uLWJvcmRlci10b20taG9tYW4tdHJ1bXAvIn0.iuWuZkZoFh7kuZyqfHOQ3GPSgGn2hB-7fUtq-rubSEo&itid=gfta"
  },
  {
    "text": "I'M RUNNING FOR DNC CHAIR!  —  My letter to members of the Democratic National Committee  —  To Democratic National Committee Members,  —  This year's election of a DNC Chair feels different than in past years.  Before now, the party had faced defeats to be sure.  But our playbook still basically worked.",
    "url": "https://www.transformarticles.com/p/im-running-for-dnc-chair"
  },
  {
    "text": "These MAGA farmers could be ruined if Trump follows through with mass deportations  —  California's farm owners bet on President-elect Donald Trump and won.  His campaign promise of mass deportations could ruin them.  —  SACRAMENTO, California — California farmers could soon enjoy bumper crops thanks … ",
    "url": "https://www.politico.com/news/2024/12/26/california-farmers-trump-water-workers-00195839"
  },
  {
    "text": "A Reflective Biden Harbors Some Regrets as His Term Winds Down  —  President Biden will seek solace and “relief” during a visit with Pope Francis next month, according to people familiar with his plans.  His public comments have offered a glimpse into what is on his mind.",
    "url": "https://www.nytimes.com/2024/12/25/us/politics/biden-regrets-reflection.html?unlocked_article_code=1.kE4.eiZZ.adeFQoL3r6wq&smid=re-share"
  },
  {
    "text": "After backing Trump, low-income voters hope he doesn't slash their benefits  —  Voters in the struggling Pennsylvania city of New Castle backed Trump hoping he'd curb inflation.  But the incoming president will be under pressure to cut spending.  —  NEW CASTLE, Pennsylvania … ",
    "url": "https://www.washingtonpost.com/nation/2024/12/26/trump-voters-federal-benefits-food/"
  },
  {
    "text": "Behind Closed Doors: The Spy-World Scientists Who Argued Covid Was a Lab Leak  —  The idea that the pandemic's origins lie with a research facility in China was once labeled a conspiracy theory",
    "url": "https://www.wsj.com/politics/national-security/fbi-covid-19-pandemic-lab-leak-theory-dfbd8a51?st=oZiMmz&reflink=article_copyURL_share"
  },
  {
    "text": "Elon Musk reveals he's taking drug for weight loss in bizarre ‘Ozempic Santa’ post  —  The world's richest man has clashed with incoming Health and Human Services chief Robert F. Kennedy Jr. over the role weight-loss medications should play in making Americans healthier and thinner.",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/elon-musk-weight-loss-mounjaro-b2670186.html"
  },
  {
    "text": "Americans are exhausted by political news.  TV ratings and a new AP-NORC poll show they're tuning out  —  As a Democrat who immersed himself in political news during the presidential campaign, Ziad Aunallah has much in common with many Americans since the election.  He's tuned out.",
    "url": "https://apnews.com/article/politics-fatigue-trump-gop-democrat-cnn-msnbc-b67aebae1a0853a1a3170ac588100bbd"
  },
  {
    "text": "'It's a scary time': US universities urge international students to return to campus before Trump inauguration  —  Fear and uncertainty are spreading across many US college campuses ahead of President-elect Donald Trump's January 20 inauguration, with some schools advising international students … ",
    "url": "https://www.cnn.com/2024/12/26/us/international-students-us-colleges-trump/"
  },
  {
    "text": "Israeli airstrike hits Sana'a, Hodeidah airports during Houthi leader's ‘victory’ speech  —  Sources confirmed to The Jerusalem Post that the IDF carried out the strikes with the knowledge of the United States.  —  Israeli airstrikes targeted a host of Houthi infrastructure near the airports … ",
    "url": "https://www.jpost.com/breaking-news/article-835006"
  },
  {
    "text": "Republicans Quietly Axed IRS Funding While No One Was Looking  —  During last week's negotiations to avert a government shutdown, Congress quietly slashed $20 billion from the Internal Revenue Service.  —  Republicans have long targeted the tax agency, and their cuts will hurt its efforts … ",
    "url": "https://newrepublic.com/post/189672/republicans-cut-irs-funding-government-shutdown"
  },
  {
    "text": "Counting down the DOGE Days of Winter  —  Good afternoo from upstate New York, where we continue to celebrate the holidays with grandparents in the frigid climes of my birth.  I hope you and yours are warm, dry, and safe today.  —  The holidays can be joyous, but also hard times for many of us … ",
    "url": "https://civic-texts.ghost.io/counting-down-the-doge-days-of-winter/"
  }
]