[
  {
    "text": "Supreme Court upholds domestic violence gun restriction  —  The case was a test for how far the court's conservative majority is willing to go in backing gun rights following a major ruling in 2022.  —  WASHINGTON — The Supreme Court on Friday upheld a federal law that prohibits people subjected … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-upholds-domestic-violence-gun-restriction-rcna137782"
  },
  {
    "text": "The Supreme Court Just Made an 8-1 Mad Dash Away From Clarence Thomas' Extremism  —  The Supreme Court upheld a federal law disarming domestic abusers on Friday, significantly narrowing a radical 2022 precedent in the process.  Its 8-1 ruling in U.S. v. Rahimi is a major victory for gun safety laws … ",
    "url": "https://slate.com/news-and-politics/2024/06/supreme-court-clarence-thomas-guns-extremism-rahimi-bruen.html"
  },
  {
    "text": "Clarence Thomas Says Domestic Abusers Should Own Guns  —  BOOM  —  He wrote the lone dissent as the Supreme Court overwhelmingly upheld the constitutionality of a federal ban on gun ownership on Friday.  —  The Supreme Court on Friday overwhelmingly upheld the constitutionality of a federal ban … ",
    "url": "https://www.thedailybeast.com/supreme-court-justice-clarence-thomas-says-domestic-abusers-should-own-guns"
  },
  {
    "text": "Trump Mega Donor Miriam Adelson Opens Up Cash Spigot  —  MONEY, MONEY, MONEY  —  After sitting out the Republican primary, the fifth-richest woman in America has given money to Trump and to House and Senate Republicans including Ted Cruz.  —  Republican mega-donor Miriam Adelson … ",
    "url": "https://www.thedailybeast.com/trump-mega-donor-miriam-adelson-opens-up-cash-spigot"
  },
  {
    "text": "Judge dismisses Nevada fake electors case over lack of jurisdiction  —  Judge Mary Kay Holthus ruled that Clark County was not an appropriate place to decide the case.  —  Courts Election 2020  —  A Clark County judge has dismissed the charges filed against the six Nevada Republicans … ",
    "url": "https://thenevadaindependent.com/article/judge-dismisses-nevada-fake-electors-case-over-lack-of-jurisdiction"
  },
  {
    "text": "Judge dismisses charges in Nevada fake electors case over venue question, attorney general to appeal  —  A judge in Las Vegas dismissed an indictment Friday against six Republicans accused of submitting certificates to Congress falsely declaring Donald Trump the winner of the state's 2020 … ",
    "url": "https://apnews.com/article/nevada-republicans-fake-electors-indictment-trump-9d06ffc619314f85e0bdb321b820a557"
  },
  {
    "text": "Judge Aileen Cannon pushes Trump's lawyer to defend claim that special counsel is part of a ‘shadow government’  —  Fort Pierce, Florida CNN  —  One day after it was reported that two federal judges urged Judge Aileen Cannon not to oversee the classified documents case against Donald Trump … ",
    "url": "https://www.cnn.com/2024/06/21/politics/aileen-cannon-trump-classified-documents-special-counsel-constitutional-hearing/"
  },
  {
    "text": "Newly named Washington Post editor decides not to take job after backlash, will stay in Britain  —  The Washington Post said Friday that newly named editor Robert Winnett has decided not to take the job and remain in Britain instead, another upheaval at a news outlet where a reorganization plan has gone disastrously wrong.",
    "url": "https://apnews.com/article/washington-post-editor-england-telegraph-quits-e650409305a2f1011926306791bc97b1"
  },
  {
    "text": "Missouri attorney general to sue New York over Trump prosecutions  —  Andrew Bailey's lawsuit is part of series of actions against NY attorney general and Manhattan DA, who both secured Trump convictions  —  The Missouri attorney general, Andrew Bailey, has confirmed that he's suing the state … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/21/missouri-ag-ny-lawsuit-trump"
  },
  {
    "text": "Bragg Asks Judge to Extend Trump's Gag Order, Citing Deluge of Threats  —  Donald J. Trump claims the order has unfairly restricted his free speech rights ahead of his sentencing on 34 felony counts.  He has nonetheless attacked the judge, prosecutor and justice system.",
    "url": "https://www.nytimes.com/2024/06/21/nyregion/trump-gag-order-bragg.html"
  },
  {
    "text": "Trump ally Bannon asks the Supreme Court to delay his 4-month prison sentence on contempt charges  —  Steve Bannon, a longtime ally of former President Donald Trump, asked the Supreme Court on Friday to delay his prison sentence while he fights his convictions for defying a subpoena … ",
    "url": "https://apnews.com/article/steven-bannon-supreme-court-contempt-donald-trump-f5c90cf82a1588e737e30903f69def1b"
  },
  {
    "text": "Change Healthcare confirms ransomware hackers stole medical records on a ‘substantial proportion’ of Americans  —  Change Healthcare has confirmed a February ransomware attack on its systems, which brought widespread disruption to the U.S. healthcare system for weeks, resulted in the theft … ",
    "url": "https://techcrunch.com/2024/06/21/change-healthcare-confirms-ransomware-hackers-stole-medical-records-on-a-substantial-proportion-of-americans/"
  },
  {
    "text": "Israeli Official Describes Secret Government Bid to Cement Control of West Bank  —  Israeli judges have long ruled that Israel's control of the territory is a temporary military occupation and complies with international law.  A powerful minister's recent speech, caught on tape, suggested the government is trying to change that.",
    "url": "https://www.nytimes.com/2024/06/21/world/middleeast/israel-west-bank-netanyahu-bezalel-smotrich.html"
  },
  {
    "text": "2 killed, 8 wounded in mass shooting outside Arkansas grocery store  —  Two people were killed and eight wounded in a mass shooting Friday outside of a grocery store in Fordyce, Arkansas, state police said.  One law enforcement officer was among those wounded and has non-life-threatening injuries, police said.",
    "url": "https://www.cbsnews.com/news/arkansas-grocery-store-shooting-deaths-injuries/"
  },
  {
    "text": "DJT share price down nearly 50% since Trump guilty verdict … The stock price of Trump Media has nearly been cut in half in the roughly three weeks since a New York jury convicted the company's majority owner, former President Donald Trump, of criminal charges.",
    "url": "https://www.cnbc.com/2024/06/21/trump-media-freefall-continues-djt-stock-down-6percent.html"
  },
  {
    "text": "Teamsters' leader lands speaking slot at GOP convention  —  Union President Sean O'Brien has been making overtures to both President Joe Biden and former President Donald Trump this election year.  —  Teamsters union General President Sean O'Brien will be a guest at the Republican National … ",
    "url": "https://www.politico.com/news/2024/06/21/teamsters-obrien-lands-rnc-slot-00164507"
  },
  {
    "text": "Club urges members to donate for Aubuchon winner's hospice care  —  The National Press Club is grieved to learn that freelance photojournalist Linda Tirado, the recipient of the Club's 2020 domestic John Aubuchon Press Freedom Award, is dying and has entered hospice care as a result … ",
    "url": "https://www.press.org/newsroom/club-urges-members-donate-aubuchon-winners-hospice-care"
  },
  {
    "text": "Why Conceding To Lies About The Economy Is A Big Mistake  —  It's not just about voter sentiment ahead of the election, it's about what kind of party we want Democrats to be in a post-Trump future.  —  Before going solo almost a year ago, I hosted an interview show that was essentially about finding the good in the bad.",
    "url": "https://www.offmessage.net/p/conceding-to-lies-economy-mistake"
  },
  {
    "text": "On the House Floor, Republicans Gag Mentions of Trump's Conviction  —  During official proceedings of the G.O.P.-controlled chamber, speaking about former President Donald J. Trump's felony conviction has been forbidden, while disparaging President Biden and Democrats is routine.",
    "url": "https://www.nytimes.com/2024/06/21/us/politics/house-republicans-trump.html"
  }
]