[
  {
    "text": "Judge in Trump classified documents case proposes ‘insane’ jury instructions, experts say  —  U.S. District Judge Aileen Cannon proposed to instruct jurors a president has sole authority to declare records personal, which legal experts say would amount to dismissing the case against Trump.",
    "url": "https://www.usatoday.com/story/news/politics/2024/03/19/donald-trump-classified-documents-jury-instructions/73027873007/"
  },
  {
    "text": "Mar-a-Lago Judge's Stark Ruling: Jury Sees Secret Files or Trump Wins  —  Trump-appointed Judge Aileen Cannon handed the jury in his Mar-a-Lago case a shocking ultimatum on Monday.  —  The MAGA-friendly federal judge who keeps siding with Donald Trump in his Mar-a-Lago classified records case … ",
    "url": "https://www.thedailybeast.com/mar-a-lago-judge-rules-jury-sees-top-secret-files-or-trump-wins"
  },
  {
    "text": "Judge Aileen Cannon Could Get Herself Booted From Trump's Classified Documents Case  —  The Trump-friendly judge is so obviously putting her thumb on the scales of justice in favor of the ex-president that she might not end up adjudicating the trial at all.",
    "url": "https://www.thedailybeast.com/judge-aileen-cannon-could-get-herself-booted-from-trumps-classified-documents-case"
  },
  {
    "text": "Trump needs a $464m bond in six days.  What if he can't get it?  —  The former president must pay the full amount in cash or secure a bond by 25 March  —  Donald Trump's lawyers are asking a New York court to put a $464m (£365m) fine in a civil fraud case on hold … ",
    "url": "https://www.bbc.com/news/world-us-canada-68609685"
  },
  {
    "text": "Doug Emhoff Decries ‘Antisemitic’ Trump Comments on Jewish Democrats  — Husband of Vice President Harris visited Omaha on Tuesday  — Trump's remarks widely condemned by Jewish groups, Democrats  —  Second gentleman Doug Emhoff condemned Republican Donald Trump for accusing Jews … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-19/emhoff-decries-antisemitic-trump-comments-on-jewish-democrats"
  },
  {
    "text": "Trump Asks Supreme Court for Absolute Immunity on Election Charges  —  The court will hear arguments on April 25 over whether former presidents can be prosecuted for things they did while in office.  —  Former President Donald J. Trump urged the Supreme Court on Tuesday to rule … ",
    "url": "https://www.nytimes.com/2024/03/19/us/trump-supreme-court-immunity.html"
  },
  {
    "text": "Why Won't Rich Republicans Loan Money to Upstanding Businessman Donald Trump? … The Republican Party is united in its belief that Donald Trump's court-ordered financial distress is the product of Democratic Party “lawfare.”  Liberal prosecutors and courts have set out to persecute … ",
    "url": "https://nymag.com/intelligencer/article/donald-trump-fines-broke-court-fraud-rich-republicans-loan.html"
  },
  {
    "text": "Nelson Peltz to vote for Donald Trump over fears of Joe Biden's ‘mental condition’  —  Billionaire disavowed ex-president after January 6 riot but plans to back him again in November election  —  Billionaire investor Nelson Peltz plans to vote for Donald Trump, saying his assessment … ",
    "url": "https://www.ft.com/content/5c460531-f261-4828-a7ae-6180bb275147"
  },
  {
    "text": "Divided Supreme Court lifts stay on a Texas law giving police broad powers to arrest migrants  —  A divided Supreme Court on Tuesday allowed Texas to begin enforcing a law that gives police broad powers to arrest migrants suspected of crossing the border illegally while a legal battle over the measure plays out.",
    "url": "https://apnews.com/article/supreme-court-migrant-arrests-texas-13ffaed316d16f42e928f6958f0658f2"
  },
  {
    "text": "Supreme Court allows Texas to enforce immigration law  —  The Biden administration sued to block the law, saying it tramples on the federal government's exclusive authority to oversee immigration issues.  —  WASHINGTON — The Supreme Court on Tuesday allowed Texas to enforce a contentious … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-texas-enforce-immigration-law-rcna142971"
  },
  {
    "text": "Jared Kushner says Gaza's ‘waterfront property could be very valuable’  —  Donald Trump's son-in-law also says Israel should bulldoze an area of the Negev desert and move Palestinians there  —  Jared Kushner has praised the “very valuable” potential of Gaza's “waterfront property” … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/19/jared-kushner-gaza-waterfront-property-israel-negev"
  },
  {
    "text": "Inside the Biden effort to recruit Nikki Haley donors to help defeat Donald Trump  — President Joe Biden's team is successfully recruiting some former donors to Nikki Haley's campaign.  — With Haley formally out the of the primary race, this effort has gone into overdrive.",
    "url": "https://www.cnbc.com/2024/03/19/biden-campaign-recruits-nikki-haley-donors-to-help-defeat-donald-trump.html"
  },
  {
    "text": "Trump-backed Bernie Moreno wins Ohio GOP Senate primary  —  Trump-backed candidate Bernie Moreno has won the Republican nomination for Senate in Ohio to face off against incumbent Sen. Sherrod Brown (D) this November, according to Decision Desk HQ.  —  Moreno, a former car dealership owner … ",
    "url": "https://thehill.com/homenews/campaign/4542855-bernie-moreno-donald-trump-ohio-primary-senate-matt-dolan/"
  },
  {
    "text": "McCaul apologizes after telling GOP colleague to ‘go f—’ himself at hearing  —  Rep. Michael McCaul (R-Texas) apologized for hurling an expletive at a GOP colleague after growing frustrated during a House committee hearing Tuesday.  —  McCaul told Rep. Darrell Issa (R-Calif.) to “go f … ",
    "url": "https://thehill.com/homenews/house/4543218-mccaul-apologizes-after-telling-gop-colleague-to-go-f-himself-at-hearing/"
  },
  {
    "text": "Trump Golf Club Settlement Hangs Alina Habba Out to Dry  —  The former president's lawyer may still face fallout for her involvement in an ex-employee's hush money deal over harassment claims at Trump's Bedminster club. … Donald Trump's golf club in Bedminster, New Jersey … ",
    "url": "https://www.thedailybeast.com/trump-new-jersey-golf-club-settlement-hangs-lawyer-alina-habba-out-to-dry"
  },
  {
    "text": "Climate researcher on what's causing the record rise in ocean temperatures  —  The World Meteorological Organization issued a red alert warning Tuesday about warming and climate change, saying 2024 is shaping up to be another record year.  One of the many worries about how the planet is changing … ",
    "url": "https://www.pbs.org/newshour/show/climate-researcher-on-whats-causing-the-record-rise-in-ocean-temperatures"
  },
  {
    "text": "Brazil's Bolsonaro is indicted for first time over alleged falsification of his own vaccination data  —  Former Brazilian President Jair Bolsonaro was formally accused Tuesday of falsifying his COVID-19 vaccination data, marking the first indictment for the embattled far-right leader, with more allegations potentially in store.",
    "url": "https://apnews.com/article/bolsonaro-brazil-federal-police-indicted-covid-a0c1f1dba71553096d0de0f4f39d4caa"
  },
  {
    "text": "Mississippi ex-deputy gets 20-year sentence in racist torture of two Black men  —  A former Mississippi sheriff's deputy was sentenced Tuesday to about 20 years in prison for his part in torturing two Black men last year.  Hunter Elward was sentenced by U.S. District Judge Tom Lee … ",
    "url": "https://apnews.com/article/mississippi-goon-squad-sentencing-d2eb6ba7e2f337ac1f17035cc97f2934"
  },
  {
    "text": "Biden wins Illinois Democratic primary  —  President Biden has won the Democratic primary in Illinois, according to a projection from Decision Desk HQ.  —  Biden has already hit the delegate count he needs to clinch the Democratic nomination, but a win in the Prairie State could add … ",
    "url": "https://thehill.com/homenews/campaign/4541866-joe-biden-wins-illinois-democratic-primary/"
  },
  {
    "text": "Nebraska lawmaker faces calls to resign after invoking colleague's name in book's rape scene passage  —  Republican Nebraska state Sen. Steve Halloran later defended reading the graphic text but apologized for adding his colleague's name to it.  —  Republican Nebraska state Sen. Steve Halloran … ",
    "url": "https://www.nbcnews.com/politics/politics-news/nebraska-lawmaker-faces-calls-resign-invoking-colleagues-name-books-ra-rcna144050"
  },
  {
    "text": "The U.S. crime rate is still dropping, FBI data shows  —  Why does the public think it's going up?  “There is definitely more disorder in cities than there was five years ago,” said one expert.  “People confuse disorder and crime.”  —  New FBI data confirms previous indications that crime … ",
    "url": "https://www.nbcnews.com/news/crime-courts/us-crime-rate-still-dropping-says-fbi-rcna144100"
  },
  {
    "text": "Trump sues ABC and Stephanopoulos, alleging defamation over Mace interview  —  Former President Trump sued ABC News and George Stephanopoulos, alleging defamation over the anchor's questioning of Rep. Nancy Mace (R-S.C.) about her endorsement of Trump.  —  The March 10 interview on “This Week” … ",
    "url": "https://thehill.com/regulation/court-battles/4541257-trump-sues-abc-stephanopoulos-alleging-defamation-mace-interview/"
  },
  {
    "text": "Pro-Trump Michigan attorney arrested after hearing in DC over leaking Dominion documents  —  An attorney facing criminal charges for illegally accessing Michigan voting machines after the 2020 election was arrested Monday after a hearing in a separate case in federal court in Washington, D.C.",
    "url": "https://apnews.com/article/voting-machines-dominion-defamation-68d3f3a4e840ccb7a81d72837c4f6b3e"
  },
  {
    "text": "Trump II Architect Russ Vought Embraces A Christian Nationalist Vision For America  —  One of the key architects of Donald Trump's plans for a second administration has been quite public about the driving force animating that radical agenda: a “cold civil war” to be won by those willing to use … ",
    "url": "https://talkingpointsmemo.com/news/russ-vought"
  },
  {
    "text": "Bad Journalism Is Giving Life to the “Fetal Personhood” Lie  —  For years, reproductive-justice activists have been warning that the GOP's “fetal personhood” bills would endanger access to birth control and fertility treatment—especially IVF.  Why hasn't the media taken them to task?",
    "url": "https://www.damemagazine.com/2024/03/19/bad-journalism-is-giving-life-to-the-fetal-personhood-lie/"
  },
  {
    "text": "Rep. Katie Porter regrets saying the California Senate primary she lost was rigged  —  “Obviously I wish I'd chosen a different word,” the House Democrat said on a podcast two weeks after the election.  —  Rep. Katie Porter says she regrets claiming that billionaires tried to “rig” … ",
    "url": "https://www.nbcnews.com/politics/2024-election/katie-porter-regrets-saying-california-senate-primary-was-rigged-rcna144154"
  },
  {
    "text": "Washington Supreme Court Rules That Bar Exam No Longer A Requirement To Practice Law, Cites Impact On “Marginalized Groups”  —  The Washington State Supreme Court has ruled that the bar exam is no longer a requirement for prospective lawyers.  On Friday, The Bar Licensure Task Force explained that the bar is … ",
    "url": "https://www.thepublica.com/washington-supreme-court-rules-that-bar-exam-no-longer-a-requirement-to-practice-law-cites-impact-on-marginalized-groups/"
  }
]