[
  {
    "text": "Lisa Murkowski, done with Donald Trump, won't rule out leaving GOP  —  Hear more on Sen. Lisa Murkowski's plans on “Inside Politics Sunday with Manu Raju” at 8 a.m. ET and 11 a.m. ET.﻿  —  Sen. Lisa Murkowski, aghast at Donald Trump's candidacy and the direction of her party, won't rule out bolting from the GOP.",
    "url": "https://www.cnn.com/2024/03/24/politics/lisa-murkowski-done-with-trump/"
  },
  {
    "text": "‘The train is coming’: Fani Willis has warning for Trump in wake of hearing to try to oust her  —  In an exclusive interview with CNN, Fulton County District Attorney Fani Willis says the work on the case against former President Donald Trump has not been delayed in the wake of a hearing … ",
    "url": "https://www.cnn.com/videos/politics/2024/03/23/fulton-county-da-fani-willis-exclusive-intv-nr-vpx.cnn"
  },
  {
    "text": "Trump escalates solidarity with Jan. 6 rioters as his own trials close in  —  The presumptive Republican nominee is aligning himself with the rioters and intensifying his use of dark, graphic and at times violent language  —  Shortly after Donald Trump walked onstage at a recent rally … ",
    "url": "https://www.washingtonpost.com/elections/2024/03/23/trump-jan-6-rioters-rhetoric-campaign/"
  },
  {
    "text": "Stormy Daniels' Description of Sex With Trump Is All Too Familiar for Sex Workers  —  “I didn't want it, but I allowed it to happen,” the adult film star says in a new documentary that sheds lights on their fateful encounter. … Many things have been said about Stormy Daniels.",
    "url": "https://www.thedailybeast.com/stormy-daniels-description-of-sex-with-trump-is-all-too-familiar-for-sex-workers"
  },
  {
    "text": "Two suspects in Moscow attack detained, others flee after car chase, lawmaker says  —  Russia said on Saturday it had arrested all four gunmen suspected of carrying out a shooting massacre in a concert hall near Moscow, and President Vladimir Putin pledged to track down and punish those behind the attack.",
    "url": "https://www.reuters.com/world/europe/two-suspects-moscow-attack-detained-after-car-chase-lawmaker-2024-03-23/"
  },
  {
    "text": "What to know about Islamic State group, which claimed the Moscow attack  —  The Islamic State group has claimed responsibility for Friday's deadly attack on a popular concert venue on the outskirts of Moscow, which killed at least 133 people.  —  The group's rapid capture of large swaths of Iraq and Syria in 2014 shocked the world.",
    "url": "https://www.washingtonpost.com/world/2024/03/23/islamic-state-khorasan-isis-moscow-explainer/"
  },
  {
    "text": "Moscow concert attack: ‘No Ukrainian involvement’ in deadly attack, U.S. says  —  The Russian president accused Ukraine of preparing a “window” for the suspects to escape.  Kyiv has staunchly denied any role in the attack. … Coverage on this live blog has ended.",
    "url": "https://www.nbcnews.com/news/world/live-blog/moscow-concert-attack-live-updates-rcna144768"
  },
  {
    "text": "MSNBC Has No Plans to Have Ex-RNC Chief on Network  —  Cable network head seeks to address employee and talent backlash over appointment of Ronna McDaniel as an NBC News contributor  —  MSNBC has no plans to have former Republican National Committee Chairwoman Ronna McDaniel on the cable network … ",
    "url": "https://www.wsj.com/business/media/msnbc-has-no-plans-to-have-ex-rnc-chief-on-network-0d88e70c"
  },
  {
    "text": "NBC News hires former GOP chairwoman Ronna McDaniel  —  Ronna McDaniel, who stepped down as chairwoman of the Republican National Committee this month, will join NBC News as a political analyst, angering media critics because of her work to overturn the results of the 2020 election.",
    "url": "https://www.washingtonpost.com/politics/2024/03/23/nbc-news-ronna-mcdaniel-rnc/"
  },
  {
    "text": "Oath Keepers' son emerges from traumatic childhood to tell his own story in a long shot election bid  —  KALISPELL, Mont. (AP) — The eldest son of one of America's most infamous seditionists is building a new life since breaking free from his father's control — juggling work, college classes and volunteer firefighting.",
    "url": "https://apnews.com/article/oath-keepers-stewart-rhodes-dakota-adams-montana-e0b46f25dfe319afe29617fd7325eb10"
  },
  {
    "text": "Biden Signs Final Bill to Fund the Government, Ending Shutdown Fears  —  The president signed a $1.2 trillion spending package that passed early on Saturday morning, narrowly avoiding a shutdown.  —  President Biden signed a $1.2 trillion spending package on Saturday, putting an end … ",
    "url": "https://www.nytimes.com/2024/03/23/us/politics/biden-signs-spending-bill.html"
  },
  {
    "text": "Why Mike Johnson Can't Run the House Without Democrats' Help  —  A bipartisan coalition has been needed to pass key bills, while GOP's thin majority puts Republican agenda at risk  —  WASHINGTON—When Republicans won control of the House in November 2022, the big question was whether … ",
    "url": "https://www.wsj.com/politics/why-mike-johnson-cant-run-the-house-without-democrats-help-a9f5dd23"
  },
  {
    "text": "How a Pandemic Malaise Is Shaping American Politics … Confidence in the presidency, public schools, the criminal justice system, the news media and Congress has yet to recover from its slump in surveys in the aftermath of the coronavirus pandemic.Jonah Markowitz for The New York Times",
    "url": "https://www.nytimes.com/2024/03/24/us/politics/pandemic-politics-malaise.html"
  },
  {
    "text": "What happens when an AG dares to investigate Leonard Leo's network  —  Brian Schwalb's probe followed a complaint that nonprofit groups associated with the judicial activist violated their tax status.  —  Allies of Leonard Leo have mounted a monthslong offensive against the man investigating … ",
    "url": "https://www.politico.com/news/2024/03/23/brian-schwalb-leonard-leo-investigation-00148385"
  },
  {
    "text": "In New Jersey, an insurgent upends a Democratic machine  —  Rep. Andy Kim's Senate campaign is upsetting what most thought would be the coronation of Tammy Murphy, the spouse of the Democratic governor, Phil Murphy  —  Rep. Andy Kim (D-N.J.) sat quietly off to the side of a big hall … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/23/andy-kim-tammy-murphy-new-jersey-senate/"
  }
]