[
  {
    "text": "Trump's co-defendants are already starting to turn against him  —  There's a nascent courtroom strategy by some people close to Donald Trump: Heap blame on the former president.  —  The finger-pointing among Donald Trump's inner circle has begun.  —  And as his four criminal cases march toward trials … ",
    "url": "https://www.politico.com/news/2023/09/05/trump-cases-defendants-flipping-00113910"
  },
  {
    "text": "CNN Exclusive: Special counsel election probe continues with focus on fundraising, voting equipment breaches  —  Special counsel Jack Smith is still pursuing his investigation into efforts to overturn the 2020 election a month after indicting Donald Trump for orchestrating a broad conspiracy … ",
    "url": "https://www.cnn.com/2023/09/05/politics/special-counsel-election-probe-continues-fundraising-voting-equipment-breaches-sidney-powell/"
  },
  {
    "text": "Three service secretaries to Tuberville: Stop this dangerous hold on senior officers  —  Carlos Del Toro is secretary of the Navy.  Frank Kendall is secretary of the Air Force.  Christine Wormuth is secretary of the Army.  —  As the civilian leaders of the Navy, Air Force, Space Force and Army … ",
    "url": "https://www.washingtonpost.com/opinions/2023/09/04/army-navy-air-force-secretaries-tuberville-military-hold/"
  },
  {
    "text": "Navy, Air Force, Army secretaries call on Tuberville to end hold on promotions  —  The secretaries of the Navy, Air Force and Army are calling on Sen. Tommy Tuberville (R-Ala.) to release his hold on military promotions, accusing him of putting national security “at risk.”",
    "url": "https://thehill.com/homenews/senate/4187089-navy-air-force-army-secretaries-call-on-tuberville-to-end-hold-on-promotions/"
  },
  {
    "text": "Disney tickets, PS5s, and big-screen TVs: Florida parents exploit DeSantis' school vouchers  —  Florida parents are taking advantage of an expanded school voucher program championed by Governor Ron DeSantis (R), according to messages from private Facebook groups obtained by Popular Information.",
    "url": "https://popular.info/p/disney-tickets-ps5s-and-big-screen"
  },
  {
    "text": "Consistent Signs of Erosion in Black and Hispanic Support for Biden  —  It's a weakness that could manifest itself as low Democratic turnout even if Trump and Republicans don't gain among those groups.  —  President Biden is underperforming among nonwhite voters in New York Times/Siena College national polls … ",
    "url": "https://www.nytimes.com/2023/09/05/upshot/biden-trump-black-hispanic-voters.html"
  },
  {
    "text": "First lady Jill Biden tests positive for Covid-19  —  First lady Jill Biden tested positive for Covid-19 Monday, the White House announced.  —  “This evening, the First Lady tested positive for COVID-19.  She is currently experiencing only mild symptoms.  She will remain at their home … ",
    "url": "https://www.cnn.com/2023/09/04/politics/jill-biden-covid/"
  },
  {
    "text": "Inside MTG and Kari Lake's ‘Death Race’ To Become Trump's VP  —  His allies say they'd be “stupid” choices, but Trump has repeatedly discussed with senior staffers Marjorie Taylor Greene and Kari Lake as potential #2s  —  MARJORIE TAYLOR GREENE and Kari Lake have been locked in what one source close … ",
    "url": "https://www.rollingstone.com/politics/politics-features/marjorie-taylor-greene-kari-lake-trump-vice-president-1234817930/"
  },
  {
    "text": "I'm a Pro-Life Priest.  Anti-Abortion Groups Are Wrong to Oppose PEPFAR.  —  In 1997, the global AIDS crisis was growing more dire by the day.  That year, I was on a mission as a Roman Catholic priest and social worker to help care for people with H.I.V. in Tanzania.  —  I witnessed pure horror.",
    "url": "https://www.nytimes.com/2023/09/05/opinion/abortion-pepfar.html"
  },
  {
    "text": "Fan thrown out of U.S. Open after German star says they used ‘famous Hitler phrase’  —  Alexander Zverev, who won the match against Jannik Sinner, said that the fan had started “singing the anthem of Hitler that was back in the day.”  —  A fan was removed from a U.S. Open tennis match … ",
    "url": "https://www.nbcnews.com/news/us-news/us-open-fan-thrown-out-zverev-match-famous-hitler-phrase-rcna103338"
  },
  {
    "text": "Vivek Ramaswamy Seeks Meeting With Julian Assange  —  The presidential candidate has vowed to pardon the Wikileaks founder if elected  —  Vivek Ramaswamy is seeking a meeting with Wikileaks founder Julian Assange, he told the Washington Free Beacon, which could make him the first U.S. presidential candidate … ",
    "url": "https://freebeacon.com/national-security/vivek-ramaswamy-seeks-meeting-with-julian-assange/"
  },
  {
    "text": "Peter Navarro to Face Contempt Trial Over Defiance of Jan. 6 Committee  —  A federal judge allowed the trial to proceed after finding little evidence that the former president authorized Mr. Navarro to ignore a subpoena from Congress.  —  For weeks after the 2020 election had been called … ",
    "url": "https://www.nytimes.com/2023/09/04/us/politics/peter-navarro-trial-contempt-congress-jan-6.html"
  },
  {
    "text": "Biden will nominate longtime aide who worked for the first lady to become US ambassador to UNESCO  —  President Joe Biden will nominate a longtime aide who once worked for the first lady to represent the United States at the United Nations agency devoted to education, science and culture, a White House official said Monday.",
    "url": "https://apnews.com/article/joe-biden-unesco-courtney-odonnell-harris-emhoff-4dbed3967fb212b49aaccafb9db7e441"
  },
  {
    "text": "Why Hunter Biden might not be the slam dunk issue GOP commentators hoped  —  The controversy surrounding Hunter Biden is falling flat in the GOP primary.  —  Aides to President Joe Biden had braced for the Republican candidates to pile on the Hunter Biden attacks during the first primary debate.",
    "url": "https://www.politico.com/news/2023/09/05/hunter-biden-gop-primary-00113820"
  }
]