[
  {
    "text": "Visibly Distressed Putin Pals Shaken Up by Trump Verdict  —  ‘THEY WRONGED OUR DONALD’  —  Kremlin state TV propagandists couldn't hide dismay over Trump's conviction but they confirmed that Russia is still desperate for him to win back the White House.  —  Russian state-controlled media … ",
    "url": "https://www.thedailybeast.com/visibly-distressed-putin-pals-shaken-up-by-trump-verdict"
  },
  {
    "text": "Johnson urges Supreme Court to “step in” on Trump verdict … - Trump's legal team has said they plan to appeal, though they would first have to go through New York appellate courts before reaching the U.S. Supreme Court. … - “I think that the Justices on the court - I know many of them personally … ",
    "url": "https://www.axios.com/2024/05/31/mike-johnson-trump-supreme-court"
  },
  {
    "text": "Trump Bungled the Trial  —  A conviction wasn't inevitable.  —  It may not have been the trial that the country deserves, but it's the trial that we got.  —  On Thursday, Donald Trump became the first president in U.S. history to become a convicted felon thanks to a jury of 12 New Yorkers.",
    "url": "https://www.politico.com/news/magazine/2024/05/31/trump-bungled-the-trial-00160941"
  },
  {
    "text": "Queens man convicted  —  Former Jamaica Estates resident Donald Trump was convicted by a Manhattan jury on Thursday of 34 counts of falsifying business records in an effort to cover up a sex scandal he feared would ruin his chances of winning the 2016 presidential election.",
    "url": "https://queenseagle.com/all/2024/5/30/queens-man-convicted"
  },
  {
    "text": "‘I Want To See Lists of Which Democrats Are Going to Prison’  —  It's a different world than the one we woke up in yesterday: Donald Trump has been convicted on all charges in his New York hush money/business records trial.  The rest of the cases against him might not be wrapped up before the November election—or ever, if he wins.",
    "url": "https://www.thebulwark.com/p/i-want-to-see-lists-of-which-democrats"
  },
  {
    "text": "Trump supporters call for riots and violent retribution after verdict  —  Supporters of former President Donald Trump, enraged by his conviction on 34 felony counts by a New York jury, flooded pro-Trump websites with calls for riots, revolution and violent retribution.",
    "url": "https://www.reuters.com/world/us/trump-supporters-call-riots-violent-retribution-after-verdict-2024-05-31/"
  },
  {
    "text": "Trump will likely be allowed to vote, despite felony convictions  —  The former president is expected to remain eligible because he was convicted in New York, where felon voting laws are more lenient than in Republican-dominated Florida.  —  Thousands of Florida residents lose their right … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/31/will-trump-be-allowed-vote/"
  },
  {
    "text": "A possibility many Republicans won't consider: Trump did something wrong  —  What if the indictments and the investigations were not, as Trump insists, political attacks but, instead, a valid response to Trump's actions?  —  When Alvin Bragg first announced his candidacy to serve … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/31/trump-republicans-conviction-weaponization/"
  },
  {
    "text": "Guilt Complex: Trump's Felony Convictions Are a Big Political Problem  —  Even for a politician who skates away from scandal, this week complicates Trump's path to election.  —  Yes, it's obviously true that a 34-count felony conviction would be enough to demolish the career of any normal politician.",
    "url": "https://www.politico.com/news/magazine/2024/05/31/trump-felony-convictions-political-problem-2024-elections-00160943"
  },
  {
    "text": "Prosecutors Got Trump — But They Contorted the Law  —  The first time I ever took a jury verdict, I almost passed out.  I was a brand-new prosecutor, 29 years old, and had just given my first closing argument a few days earlier.  Since then, the trial team and I had been whiling away our time … ",
    "url": "https://nymag.com/intelligencer/article/trump-was-convicted-but-prosecutors-contorted-the-law.html"
  },
  {
    "text": "Donald Trump, Felon  —  In a humble courtroom in Lower Manhattan on Thursday, a former president and current Republican standard-bearer was convicted of 34 felony counts of falsifying business records.  The jury's decision, and the facts presented at the trial, offer yet another reminder … ",
    "url": "https://www.nytimes.com/2024/05/30/opinion/trump-trial-guilty-felony.html"
  },
  {
    "text": "America's seething right … - To Democrats, the unanimous conviction by a jury of Trump's peers is a stamp of accountability they've been pursuing for years — the ultimate proof that no one is above the law.  — To Republicans, it's a mockery of the justice system engineered for one purpose … ",
    "url": "https://www.axios.com/2024/05/31/trump-trial-guilty-verdict-republican-revenge"
  },
  {
    "text": "Joe Manchin leaves the Democratic Party, files as independent  —  Sen. Joe Manchin (D-W.Va.) officially left the Democratic Party on Friday and registered as an independent.  —  Why it matters: Manchin, who flirted with an independent presidential bid earlier this year, has said he's not running for Senate re-election.",
    "url": "https://www.axios.com/2024/05/31/joe-manchin-leaves-democratic-party-independent"
  },
  {
    "text": "Texas Supreme Court rejects challenge to abortion laws  —  The court ruled against 20 women who said they were denied medically necessary abortions, saying the medical exceptions in the law were broad enough.  —  The Texas Supreme Court has unanimously rejected the most significant challenge … ",
    "url": "https://www.texastribune.org/2024/05/31/texas-supreme-court-zurawski-abortion/"
  },
  {
    "text": "Manchin registering as independent in West Virginia  —  A longtime Democrat, Manchin's decision comes ahead of a deadline for filing as an independent in West Virginia.",
    "url": "https://www.politico.com/live-updates/2024/05/31/congress/manchin-independent-west-virginia-senate-governor-00160969"
  }
]