[
  {
    "text": "Let People Eat  —  In the worst conditions you can imagine — after hurricanes, earthquakes, bombs and gunfire — the best of humanity shows up.  Not once or twice but always.  —  The seven people killed on a World Central Kitchen mission in Gaza on Monday were the best of humanity.",
    "url": "https://www.nytimes.com/2024/04/03/opinion/jose-andres-let-people-eat.html"
  },
  {
    "text": "Chef Jose Andres says Israel targeted his aid workers ‘systematically, car by car’  —  Celebrity chef Jose Andres told Reuters in an emotional interview on Wednesday that an Israeli attack that killed seven of his food aid workers in Gaza had targeted them “systematically, car by car.”",
    "url": "https://www.reuters.com/world/middle-east/chef-jose-andres-says-israel-targeted-his-aid-workers-systematically-car-by-car-2024-04-03/"
  },
  {
    "text": "Biden blasts Israel over aid workers, but his Gaza policy is unchanged  —  Angry statement highlights growing discrepancy between the president's increasingly tough rhetoric on Israel and his unwavering policy support  —  As outrage built Tuesday over an Israeli strike that killed seven workers … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/03/biden-world-central-kitchen-tough-statement-israel-policy/"
  },
  {
    "text": "Exclusive: Trump Media saved in 2022 by Russian-American under criminal investigation  —  Trump's social media company went public relying partly on loans from trust managed by person of interest to prosecutors  —  Donald Trump's social media company Trump Media managed to go public last week … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/03/trump-media-es-family-trust-2022-loans"
  },
  {
    "text": "Family of woman found dead on highway angered by Trump's speech  —  GRAND RAPIDS, Mich. (WOOD) — The sister of murder victim Ruby Garcia said she and her family were home watching live, in disbelief, as former President Donald Trump told an audience in Grand Rapids that he had spoken with “some of her family.”",
    "url": "https://www.woodtv.com/news/target-8/family-of-woman-found-dead-on-highway-angered-by-trumps-speech/"
  },
  {
    "text": "Trump Leads Biden in Six of Seven Swing States, WSJ Poll Finds  —  Incumbent trails in most battlegrounds that decided 2016 and 2020 elections",
    "url": "https://www.wsj.com/politics/elections/trump-biden-poll-swing-states-ad594acb"
  },
  {
    "text": "Two Individuals Plead Guilty To Participating In Insider Trading Scheme Based On SPAC Merger With Trump Media & Technology Group  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of New York  —  Michael Shvartsman and Gerald Shvartsman Made More Than $22 Million … ",
    "url": "https://www.justice.gov/usao-sdny/pr/two-individuals-plead-guilty-participating-insider-trading-scheme-based-spac-merger"
  },
  {
    "text": "‘Lavender’: The AI machine directing Israel's bombing spree in Gaza  —  The Israeli army has marked tens of thousands of Gazans as suspects for assassination, using an AI targeting system with little human oversight and a permissive policy for casualties, +972 and Local Call reveal.",
    "url": "https://www.972mag.com/lavender-ai-israeli-army-gaza/"
  },
  {
    "text": "Frustrated Prosecutors Ask Trump Documents Judge to Act on Key Claim  —  The push for a quick decision on one of the former president's most far-fetched claims is an unusual and risky move in a case Judge Aileen Cannon has allowed to become bogged down.  —  In an open display of frustration … ",
    "url": "https://www.nytimes.com/2024/04/03/us/politics/trump-documents-case-judge-cannon.html"
  },
  {
    "text": "Scoop: Anti-Trump lawyer George Conway gives $900,000 to Biden … The minimum gift for the event is $500.  — The lead hosts are Melissa Moss, a strategic consultant who's very visible around Washington, and her husband, Jonathan Silver.",
    "url": "https://www.axios.com/2024/04/03/george-conway-biden-donation-fundraiser-campaign"
  },
  {
    "text": "Yes, we're divided.  But new AP-NORC poll shows Americans still agree on most core American values  —  WASHINGTON (AP) — Despite the country's deep political polarization, most Americans share many core beliefs about what it means to be an American, according to a new poll.",
    "url": "https://apnews.com/article/ap-poll-democracy-rights-freedoms-election-b1047da72551e13554a3959487e5181a"
  },
  {
    "text": "What I Saw Working at The National Enquirer During Donald Trump's Rise … I was outside Manhattan criminal court.  It was a sunny spring day, and the Secret Service and the Police Department had blocked off the streets with barricades.  The sidewalks were clogged with news crews from around the world.",
    "url": "https://www.nytimes.com/2024/04/03/magazine/national-enquirer-trump-lachlan-cartwright.html"
  },
  {
    "text": "Trump and GOP leaders push to change Nebraska electoral votes to winner-take-all  —  It's unclear if the bill has enough support or time to pass before the end of Nebraska's legislative session.  But if it did, it could have a big 2024 effect.  —  Former President Donald Trump and Nebraska … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-gop-leaders-push-change-nebraska-electoral-votes-winner-take-rcna146195"
  },
  {
    "text": "Federal judge condemns ‘normalization’ of January 6 while sentencing defiant rioter  —  A federal judge on Wednesday blasted a convicted January 6 rioter for downplaying the US Capitol attack and using the kind of revisionist rhetoric that former President Donald Trump often uses on the campaign trial.",
    "url": "https://www.cnn.com/2024/04/03/politics/trump-criticism-judge-royce-lamberth-january-6/"
  },
  {
    "text": "‘They Cut My Quote’: RFK, Jr. Claims He Didn't Say Biden Is a Worse Threat Than Trump — But Here's What He Said  —  Presidential candidate Robert F. Kennedy Jr. took a lot of flak in the media after a sharp criticism of President Joe Biden on CNN.  —  Kennedy's Monday interview … ",
    "url": "https://www.mediaite.com/news/they-cut-my-quote-rfk-jr-claims-he-didnt-say-biden-is-worse-threat-than-trump-but-heres-what-he-said/"
  },
  {
    "text": "Statement from Congresswoman Lauren Boebert's campaign:  —  Yesterday afternoon, Congresswoman Lauren Boebert was admitted to UCHealth Medical Center of the Rockies in Loveland after experiencing severe swelling in her upper left leg.  After undergoing a CT Scan, doctors found an acute blood clot … ",
    "url": "https://www.facebook.com/laurenboebert/posts/pfbid02mzadSWknemesgQEGFZt97nqzduL1Cb89fvYksuEQ4dMnbRn48sKPS7MBUSE9mHHQl"
  },
  {
    "text": "Former ESPN host says her Biden interview was entirely ‘scripted’ by network execs: ‘Every single question’  —  Former ESPN host Sage Steele revealed that her 2021 interview with President Biden was “scripted” by network executives.  —  In an interview with Fox News Digital, Steele recalled the … ",
    "url": "https://www.foxnews.com/media/former-espn-host-says-biden-interview-scripted-network-execs"
  },
  {
    "text": "Trump, RNC raised $65.6 million in March  —  Trump's allies hope the amount will ease concerns about his fundraising.  —  Former President Donald Trump and the Republican National Committee raised $65.6 million in March and ended the month with $93.1 million in cash on hand, according to figures provided to POLITICO.",
    "url": "https://www.politico.com/news/2024/04/03/trump-rnc-raised-65-6-million-march-00150300"
  }
]