[
  {
    "text": "Ex-Trump aide Cassidy Hutchinson claims Rudy Giuliani groped her on January 6  —  Exclusive: in a new book, Hutchinson describes incident in which the former New York mayor put his hand ‘under my blazer, then my skirt’  —  Cassidy Hutchinson, the former Trump aide turned crucial January 6 witness … ",
    "url": "https://www.theguardian.com/us-news/2023/sep/20/rudy-giuliani-grope-cassidy-hutchinson-claim-january-6-trump-aide"
  },
  {
    "text": "Trump Privately Frets He Could Be Headed to Prison  —  Would he be sent to a “club fed” style prison — or a “bad” one?  Would he have Secret Service protection?  And what would they make him wear?  Those are some of the questions Donald Trump is asking his lawyers as his many trials loom",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-prison-conviction-trial-1234828231/"
  },
  {
    "text": "CNN Poll: Trump leads in New Hampshire while Ramaswamy, Haley, Christie and DeSantis battle for second  —  Former President Donald Trump holds a sizable lead in the race for the 2024 Republican presidential nomination in New Hampshire, but a close contest for second place … ",
    "url": "https://www.cnn.com/2023/09/20/politics/cnn-poll-new-hampshire/"
  },
  {
    "text": "Trump Leads, DeSantis Crashes in NH GOP Primary 9/20/2023  —  Former President Donald Trump continues to lead among likely 2024 Republican primary voters in New Hampshire, followed by entrepreneur Vivek Ramaswamy, former UN Ambassador Nikki Haley, former New Jersey Governor Chris Christie, and Florida Governor Ron DeSantis.",
    "url": "https://scholars.unh.edu/survey_center_polls/762/"
  },
  {
    "text": "DeSantis Slams Biden Climate Policy: ‘An Agenda to Control You’  —  The Florida governor delivered an address in Texas that favored oil and gas development over climate agreements and electric vehicles.  —  Gov. Ron DeSantis of Florida on Wednesday unveiled an energy plan in the heart of oil country … ",
    "url": "https://www.nytimes.com/2023/09/20/us/politics/desantis-climate-energy-biden.html"
  },
  {
    "text": "Centrist Dems and McCarthy's allies are in secret talks to strike a deal  —  Any Democratic participation in a plan to stop a shutdown — let alone save the speaker's gavel — would have huge conditions attached.  —  The long-shot idea that Democrats could bail out the beleaguered Speaker Kevin McCarthy is suddenly getting real.",
    "url": "https://www.politico.com/news/2023/09/20/bipartisan-mccarthy-bailout-talks-gaining-steam-thanks-to-house-chaos-00117179"
  },
  {
    "text": "Merrick Garland faced fire from Republicans on Hunter Biden, Trump  —  House Republicans peppered Attorney General Merrick Garland with criticisms during the nearly six-hour House Judiciary Committee hearing.  The divide between Democratic and Republican lawmakers on a range of issues … ",
    "url": "https://www.washingtonpost.com/national-security/2023/09/20/merrick-garland-attorney-general-testimony-house-judiciary/"
  },
  {
    "text": "Lin Wood: 'I didn't flip on President Trump'  —  X  —  Former Atlanta attorney Lin Wood pushed back Wednesday on the notion that he would testify against Donald Trump in Fulton County's racketeering case.  —  Wood's name turned up in a new filing by Fulton County District Attorney Fani Willis naming … ",
    "url": "https://www.ajc.com/news/lin-wood-i-didnt-flip-on-president-trump/K36BYKE4LRABFKAPTKCZCXPQLM/"
  },
  {
    "text": "Trumpism costs the GOP in a crucial election, again  —  The Republican Party's increasing Trump-era tendency toward more extreme nominees and its struggles to account for the Supreme Court's decision to overturn Roe v. Wade have already cost it plenty.  It's quite possible that these things cost … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/20/trumpism-costs-gop-crucial-election-again/"
  },
  {
    "text": "Free COVID test kits are coming back.  Here's how to get them.  —  The Biden administration is preparing to resume taking orders for free at-home COVID-19 tests starting September 25, officials announced Wednesday.  The administration is also planning a new infusion of money to boost domestic manufacturing of the test kits.",
    "url": "https://www.cbsnews.com/news/free-covid-tests-how-to-order-online/"
  },
  {
    "text": "The Untold Story of One Indicted Fake Trump Elector in Georgia  —  Before she was indicted for taking part in Trump's scheme to stay in power, Cathy Latham professed to hating politics for being a dirty business.  Now she's knee-deep in the mud. … In the weeks before she became … ",
    "url": "https://www.thedailybeast.com/the-untold-story-of-one-indicted-fake-trump-elector-in-georgia"
  },
  {
    "text": "Senate Poised to Confirm Military Chiefs, Sidestepping Tuberville Blockade  —  Three generals were on track for confirmation, but Senator Tommy Tuberville, the Alabama Republican who has been blocking them, said he would continue to hold up others over a Pentagon abortion policy.",
    "url": "https://www.nytimes.com/2023/09/20/us/politics/senate-military-nominations-tuberville.html"
  },
  {
    "text": "Kari Lake to launch Arizona Senate bid next month  —  The close ally of Trump is looking to run in the swing state again.  —  Arizona Republican Kari Lake will launch a Senate run as soon as early next month, according to three people familiar with her plans.",
    "url": "https://www.politico.com/news/2023/09/20/kari-lake-arizona-senate-bid-00117148"
  },
  {
    "text": "‘We knew the numbers were bad’: Law enforcement staff raised concerns about Ron DeSantis' top crime talking point  —  Three former staffers in Florida's top law enforcement agency told NBC News they could not get behind the statement that state crime was at “a 50-year low.”",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-florida-law-enforcement-crime-50-percent-low-rcna105091"
  },
  {
    "text": "Former prosecutor who quit Trump-Russia probe says she left over concerns with Barr  —  Nora Dannehy had been part of the investigation led by John Durham.  —  HARTFORD, Conn. — A former federal prosecutor who helped investigate the origins of the Trump-Russia probe said Wednesday she left … ",
    "url": "https://www.politico.com/news/2023/09/20/former-prosecutor-resigned-trump-russia-probe-barr-00117255"
  },
  {
    "text": "Trump vows expanded travel ban if reelected  —  Former President Trump on Wednesday vowed to reimpose and expand a travel ban that targeted several majority-Muslim countries and said he would shift parts of federal law enforcement to focus on immigration if he is elected to a second White House term.",
    "url": "https://thehill.com/homenews/campaign/4214942-trump-vows-expanded-travel-ban-if-reelected/"
  },
  {
    "text": "Paxton on possible challenge to Cornyn: 'Everything's on the table for me'  —  Texas Attorney General Ken Paxton (R), who was acquitted last week in his historic impeachment trial in the state, took swipes at Sen. John Cornyn (R-Texas) and kept the door open to a possible run for the senator's seat in 2026 … ",
    "url": "https://thehill.com/homenews/state-watch/4215575-paxton-on-possible-challenge-to-cornyn-everythings-on-the-table-for-me/"
  },
  {
    "text": "Federal Reserve issues FOMC statement  —  For release at 2:00 p.m. EDT  —  Recent indicators suggest that economic activity has been expanding at a solid pace.  Job gains have slowed in recent months but remain strong, and the unemployment rate has remained low.  Inflation remains elevated.",
    "url": "https://www.federalreserve.gov/newsevents/pressreleases/monetary20230920a.htm"
  },
  {
    "text": "Florida's “War on Woke” Is Spurring a Brain Drain  —  Thanks to Ron DeSantis's education policies, the state is seeing an unprecedented exodus of teachers, professors, and college students.  —  Pocket  —  This article appears in the October 2/9, 2023 issue, with the headline “Florida's Brain Drain.”",
    "url": "https://www.thenation.com/article/society/desantis-florida-education/"
  },
  {
    "text": "The Federal Government Should Not Be Held Hostage for Ukraine Funding  —  Simply put: We have no extra money to send to Ukraine.  —  Today I am putting leadership of the House, the Senate, and the President of the United States on notice.  I will not consent to the expedited passage … ",
    "url": "https://www.theamericanconservative.com/the-federal-government-should-not-be-held-hostage-for-ukraine-funding/"
  }
]