[
  {
    "text": "Playbook: Inside the Dems' shutdown strategy  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  DON'T QUIT YOUR DAY JOB — “Rep. Ken Buck eyes CNN job while criticizing Biden impeachment inquiry,” by NY Post's Steven Nelson: “Buck, 64, confirmed … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/09/20/inside-the-dems-shutdown-strategy-00116988"
  },
  {
    "text": "McCarthy Capitulates Again as House GOP Implodes Spectacularly Over Spending Bill  —  Members didn't hold back from trashing their colleagues in public over the doomed plan to avoid a government shutdown.  —  Republican House Speaker Kevin McCarthy (R-CA) appeared to capitulate for the second … ",
    "url": "https://www.thedailybeast.com/house-gop-implodes-over-its-doomed-government-shutdown-plan"
  },
  {
    "text": "Republican infighting paralyzes the House as some call a shutdown inevitable  —  With 11 days to go until a government shutdown, a House GOP stalemate over messaging bills is deepening.  —  WASHINGTON — Republican divisions paralyzed the House again on Tuesday as a small band … ",
    "url": "https://www.nbcnews.com/politics/congress/republican-infighting-paralyzes-house-call-shutdown-inevitable-rcna105882"
  },
  {
    "text": "Rep. Ken Buck eyes CNN job while criticizing Biden impeachment inquiry  —  WASHINGTON — The White House's go-to Republican critic of the impeachment inquiry into President Biden is considering leaving Congress for a new job — and has expressed interest in being an on-air commentator for CNN, The Post has learned.",
    "url": "https://nypost.com/2023/09/19/rep-ken-buck-eyes-cnn-job-amid-biden-impeachment-criticism/"
  },
  {
    "text": "Former congressman sentenced to nearly 2 years in prison for insider trading  —  Stephen Buyer, a Republican who represented an Indiana district, was convicted in March of insider trading related to his consulting work.  —  A former Republican lawmaker who served in Congress for nearly … ",
    "url": "https://www.nbcnews.com/politics/politics-news/former-rep-stephen-buyer-sentenced-22-months-insider-trading-rcna105927"
  },
  {
    "text": "Democrats retake razor-thin majority in Pennsylvania state House  —  Democrat Lindsay Powell won the open state House seat in a special election in Allegheny County, restoring a one-seat Democratic majority in the swing state.  —  Democrat Lindsay Powell, a nonprofit worker and former staffer … ",
    "url": "https://www.nbcnews.com/politics/elections/democrats-retake-razor-thin-majority-pennsylvania-state-house-rcna105803"
  },
  {
    "text": "Tim Ballard has resigned from Operation Underground Railroad amid reports of sexual misconduct  —  Ballard, an anti-sex trafficking activist, said in a statement that “the latest tabloid-driven sexual allegations are false.”  —  Tim Ballard, the anti-sex trafficking activist whose exploits inspired … ",
    "url": "https://www.nbcnews.com/news/tim-ballard-resigned-operation-underground-railroad-reports-sexual-mis-rcna105835"
  },
  {
    "text": "Tuberville to try going around his own blockade to confirm Marine commandant  —  Sen. Tommy Tuberville (R-Ala.) told senators that he will attempt to force a one-off vote on Wednesday to confirm Gen. Eric Smith to become the new commandant for the Marine Corps while he maintains his blockade on more than 300 military promotions.",
    "url": "https://thehill.com/homenews/senate/4212731-tuberville-to-try-going-around-his-own-blockade-to-confirm-marine-commandant/"
  },
  {
    "text": "Biden's 2024 campaign plans aggressive social media misinfo fight  —  With social-media platforms pulling back from policing false political claims, and Trump gearing up for a fight, Biden's 2024 campaign is rebooting its online defenses.  —  Joe Biden's presidential campaign is overhauling … ",
    "url": "https://www.politico.com/news/2023/09/19/bidens-social-media-misinfo-fight-00116721"
  },
  {
    "text": "Biden to create new office of gun violence prevention  —  The move, long sought by gun-control groups, comes amid stalled progress on firearms legislation  —  President Biden on Friday will announce the creation of a new office for gun violence prevention, an escalation of the administration's efforts … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/19/biden-creates-gun-violence-prevention-office/"
  },
  {
    "text": "Rishi Sunak considers weakening key green policies  —  Rishi Sunak is considering weakening some of the government's key green commitments in a major policy shift.  —  It could include delaying a ban on the sales of new petrol and diesel cars and phasing out gas boilers, multiple sources have told the BBC.",
    "url": "https://www.bbc.com/news/uk-politics-66857551"
  },
  {
    "text": "Marjorie Taylor Greene pens tell-all, ‘setting the record straight’  —  EXCLUSIVE — Rep. Marjorie Taylor Greene, the Georgia Republican who overcame Democratic silencing efforts to become one of the most effective voices on the Right, is getting ready to settle some scores with an autobiography … ",
    "url": "https://www.washingtonexaminer.com/news/washington-secrets/marjorie-taylor-greene-tell-all-book-autobiography"
  },
  {
    "text": "Temple's acting president, JoAnne A. Epps, has died after falling ill on stage at university event  —  JoAnne A. Epps, acting president of Temple University and long-time employee, has died after falling ill on stage Tuesday afternoon during a university event, said Mitchell L. Morgan, chair of the board of trustees.",
    "url": "https://www.inquirer.com/education/joanne-epps-temple-university-president-dies-20230919.html"
  },
  {
    "text": "Right-Wing Group That Compares Biden Conservation Plan to Genocide Is Getting Taxpayer Money  —  American Stewards of Liberty paints apocalyptic visions about environmental programs.  Counties are buying the hype, for tens of thousands in taxpayer funds.",
    "url": "https://www.thedailybeast.com/american-stewards-of-liberty-which-compares-biden-conservation-plan-to-genocide-is-getting-taxpayer-mone"
  },
  {
    "text": "Murdoch Called Hannity ‘Retarded’ and DeSantis ‘Kicked’ Tucker's Dog, Wild New Book Claims  —  Michael Wolff's new book from inside the Fox News universe is heavy on salacious gossip about Tucker and the Murdochs.  Here are some of those juicy tidbits.",
    "url": "https://www.thedailybeast.com/murdoch-called-hannity-retarded-and-desantis-kicked-tuckers-dog-wild-new-book-claims"
  },
  {
    "text": "Justice Department Probe Scrutinizes Elon Musk Perks at Tesla Going Back Years  —  Federal prosecutors also have sought information about transactions between Tesla and other entities related to the billionaire  —  Federal prosecutors are scrutinizing personal benefits",
    "url": "https://www.wsj.com/tech/justice-department-probe-scrutinizes-elon-musk-perks-at-tesla-going-back-years-3493e321?mod=followamazon"
  },
  {
    "text": "Sen. John Fetterman Mocks Right-Wing Conspiracy Theory That He Has A Body Double  —  He also joked about GOP outrage over the new Senate dress code: “Republicans think I'm going to burst in through the doors and start break dancing on the floor.”  —  LOADING",
    "url": "https://www.huffpost.com/entry/john-fetterman-body-double-conspiracy-theory_n_6509d9c9e4b0b49f330a08f4"
  },
  {
    "text": "Man Facing Rape Charges Faked His Death—but Was Wearing an Ankle Monitor, Cops Say  —  Police say they tracked him to a Walmart on the day of his supposed drowning in a kayaking mishap.  —  A North Carolina man is in custody after police say he tried but failed to fake his own death … ",
    "url": "https://www.thedailybeast.com/alleged-rapist-melvin-emde-faked-his-deathbut-was-wearing-ankle-monitor-cops-say"
  },
  {
    "text": "Germany went from envy of the world to the worst-performing major developed economy.  What happened?  —  For most of this century, Germany racked up one economic success after another, dominating global markets for high-end products like luxury cars and industrial machinery … ",
    "url": "https://apnews.com/article/germany-economy-energy-crisis-russia-8a00eebbfab3f20c5c66b1cd85ae84ed"
  },
  {
    "text": "Governor Shapiro Implements Automatic Voter Registration in Pennsylvania, Joining Bipartisan Group of States That Have Taken Commonsense Step to Make Voter Registration More Streamlined and Secure  —  By automatically combining the verification processes of DMV registration and voter registration … ",
    "url": "https://www.governor.pa.gov/newsroom/governor-shapiro-implements-automatic-voter-registration-in-pennsylvania-joining-bipartisan-group-of-states-that-have-taken-commonsense-step-to-make-voter-registration-more-streamlined-and-secure/"
  }
]