[
  {
    "text": "No Matter How Bad You Think an Attorney General Matt Gaetz Would Be, He'll Be Worse  —  On Wednesday, Donald Trump announced his intent to nominate Republican Congressman Matthew Gaetz to lead the Department of Justice—the same agency that once investigated Gaetz for the sex trafficking of an underage girl.",
    "url": "https://slate.com/news-and-politics/2024/11/matt-gaetz-donald-trump-attorney-general-disaster.html"
  },
  {
    "text": "Republicans “stunned and disgusted” as Trump taps Matt Gaetz for AG … - “We wanted him out of the House ... this isn't what we were thinking,” quipped one House Republican, who spoke on the condition of anonymity to speak frankly about Trump's decision.",
    "url": "https://www.axios.com/2024/11/13/matt-gaetz-republicans-trump-attorney-general"
  },
  {
    "text": "Gaetz resigns from Congress — possibly skirting long-awaited Ethics report  —  His resignation came the same day Donald Trump nominated him to be attorney general, but some Republicans think he had other motivations.  —  GOP Rep. Matt Gaetz resigned from the House Wednesday … ",
    "url": "https://www.politico.com/news/2024/11/13/matt-gaetz-resigns-congress-00189488"
  },
  {
    "text": "Trump Chooses Tulsi Gabbard for Director of National Intelligence  —  Ms. Gabbard, a former congresswoman who left the Democratic Party, would hold a top job in the administration, overseeing 18 spy agencies.  —  President-elect Donald J. Trump on Wednesday chose Tulsi Gabbard … ",
    "url": "https://www.nytimes.com/2024/11/13/us/politics/trump-tulsi-gabbard-director-national-intelligence.html"
  },
  {
    "text": "Justice Dept. employees stunned at Trump's ‘insane,’ ‘unbelievable’ choice of Matt Gaetz for attorney general  —  The president-elect selected Gaetz, who has repeatedly spread falsehoods about the Jan. 6 Capitol attack and was previously investigated by the Justice Department, to run DOJ.",
    "url": "https://www.nbcnews.com/politics/justice-department/justice-department-stunned-trumps-choice-matt-gaetz-attorney-general-rcna180071"
  },
  {
    "text": "Tulsi Gabbard's Nomination Is a National-Security Risk  —  The Senate can stop her.  —  President-elect Donald Trump has nominated former Representative Tulsi Gabbard as the director of national intelligence.  The Office of the Director of National Intelligence was created after 9/11 … ",
    "url": "https://www.theatlantic.com/newsletters/archive/2024/11/tulsi-gabbard-nomination-security/680649/"
  },
  {
    "text": "Trump taps Matt Gaetz for attorney general  —  Gaetz's nomination was met with surprise from House lawmakers, where the Florida congressman had been the subject of an Ethics Committee investigation.  —  President-elect Trump on Wednesday announced Rep. Matt Gaetz, R-Fla. … ",
    "url": "https://www.foxnews.com/politics/trump-taps-matt-gaetz-attorney-general"
  },
  {
    "text": "Trump picks Matt Gaetz for attorney general, Tulsi Gabbard for director of national intelligence  —  President-elect Donald Trump announced Wednesday that he plans to nominate Matt Gaetz as attorney general — the Republican congressman from Florida resigned his seat the same day … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/13/trump-administration-transition/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMxNDc0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMyODU2Mzk5LCJpYXQiOjE3MzE0NzQwMDAsImp0aSI6ImRkMjZjNjA1LTNhNWItNDViZS1hNzliLWJhNDljNTBmNTRhMCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzExLzEzL3RydW1wLWFkbWluaXN0cmF0aW9uLXRyYW5zaXRpb24vIn0.RxskMnaT1W4eLpWOTY-nF9D6kf16F1-ekeyEDycTTLM&itid=gfta"
  },
  {
    "text": "Donald Trump reveals exclusively to The Post what he and Biden spoke about at DC meeting  —  President-elect Donald Trump told The Post Wednesday that he and President Biden “both really enjoyed seeing each other” when they sat down for a historic post-election get-together in the Oval Office.",
    "url": "https://nypost.com/2024/11/13/us-news/donald-trump-reveals-what-he-and-biden-spoke-about-at-dc-meeting-really-enjoyed-seeing-each-other/"
  },
  {
    "text": "A Foul Fireside Chat  —  It was such a cozy moment in the Oval Office on Wednesday morning, with the roaring fire and the warm handshake and the past presidents — including George Washington, Abraham Lincoln and F.D.R. — looking down benignly on the scene.  —  So why did it feel so nauseating?",
    "url": "https://www.nytimes.com/2024/11/13/opinion/a-foul-fireside-chat.html"
  },
  {
    "text": "‘I made a mistake’: House Foreign Affairs chief detained by airport police for appearing intoxicated  —  The Scoop  —  House Foreign Affairs Committee Chair Michael McCaul was detained by police at Dulles International Airport earlier this month in an incident that he described as … ",
    "url": "https://www.semafor.com/article/11/13/2024/house-foreign-affairs-chief-detained-by-airport-police"
  },
  {
    "text": "Republicans Ran a Dysfunctional House.  Voters Shrugged and Re-elected Them.  —  The success of the G.O.P. push to keep the majority suggests that it paid no political price for the chaos and paralysis of its past two years in control of the House.  —  A historically long and divisive fight to choose one speaker.",
    "url": "https://www.nytimes.com/2024/11/13/us/politics/republican-house-majority.html"
  },
  {
    "text": "Pete Hegseth Was Removed from Biden's Inauguration, Labeled ‘Extremist’  —  commentator who saw active service with the Minnesota National Guard, as his  —  .  —  Hegseth was one of a number of National Guard members ordered to stand down from  —  's inauguration, according to",
    "url": "https://www.newsweek.com/pete-hegseth-was-removed-bidens-inauguration-labelled-extremist-1984882"
  },
  {
    "text": "Pennsylvania Senate contest headed toward a recount, and possibly litigation  —  The U.S. Senate election in Pennsylvania between Democratic incumbent Sen. Bob Casey and Republican David McCormick is headed for a statewide recount, as counties continued Wednesday to sort through outstanding ballots … ",
    "url": "https://apnews.com/article/casey-mccormick-pennsylvania-senate-recount-f0da8720c540fc1b10328da37135a1ee"
  },
  {
    "text": "Smith asks for pause in Trump Florida document case  —  Special counsel Jack Smith on Wednesday asked the 11th Circuit Court of Appeals to pause proceedings in an appeal launched in President-elect Trump's Florida documents case.  —  The filing comes as the court has been tasked with reviewing … ",
    "url": "https://thehill.com/regulation/court-battles/4989489-special-counsel-jack-smith-appeal/"
  },
  {
    "text": "House Republicans strike deal to make it harder to oust Speaker  —  Hard-line conservatives have struck a tentative deal with House Republicans concerned about chaos in the chamber, agreeing to raise the threshold to force a vote to oust the Speaker in exchange for concessions on rule changes … ",
    "url": "https://thehill.com/homenews/house/4989395-republicans-oust-speaker-motion-to-vacate-deal/"
  },
  {
    "text": "Spotify Hits 252M Premium Subscribers, On Track For First Full Year of Profitability  —  “We're where we set out to be — if not a little further — and on a steady path toward achieving our long-term goals,” said CEO Daniel Ek.  —  Monthly active users at Spotify rose 11 percent year … ",
    "url": "https://www.hollywoodreporter.com/business/business-news/spotify-earnings-profitability-subscribers-1236060081/"
  },
  {
    "text": "Kamala Harris ditched Joe Rogan podcast interview over progressive backlash fears  —  Decision seen as major blunder for campaign that lost male votes to Donald Trump  —  Kamala Harris's fears of a progressive backlash killed a plan for her to appear on Joe Rogan's podcast … ",
    "url": "https://www.ft.com/content/9292db59-8291-4507-8d86-f8d4788da467"
  },
  {
    "text": "Trump's win turns online censorship case upside-down  —  with research by Andrea Jiménez and Aaron Schaffer  —  The Washington Post's essential guide to tech policy news  —  Happy Wednesday!  Hope you weren't counting on snow this winter.  Send news tips to: will.oremus@washpost.com.",
    "url": "https://www.washingtonpost.com/politics/2024/11/13/missouri-v-biden-social-media-censorship-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMxNDc0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMyODU2Mzk5LCJpYXQiOjE3MzE0NzQwMDAsImp0aSI6ImMzMWI1NjE5LTJmM2QtNGMzMS1hZDUwLTQ3YzBlMjM5NmJmZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzExLzEzL21pc3NvdXJpLXYtYmlkZW4tc29jaWFsLW1lZGlhLWNlbnNvcnNoaXAtdHJ1bXAvIn0.aTRy7GvfKitYqPD6b4jCq_fvevDxod_UDXpAWKwabCY&itid=gfta"
  }
]