[
  {
    "text": "Cassidy Hutchinson's new book reveals a Trump White House even more chaotic than previously known  —  In her new book “Enough,” former White House aide Cassidy Hutchinson paints the closing days of the Trump White House as even more chaotic and lawless than she previously disclosed in her shocking televised testimony last summer.",
    "url": "https://www.cnn.com/2023/09/26/politics/cassidy-hutchinson-book-trump-white-house-chaos/"
  },
  {
    "text": "Cassidy Hutchinson Book Reveals Chaos at End of Trump White House: 'I Don't Want People To Know We Lost'  —  Hutchinson recounts the final days of the Trump administration, including Jan. 6, 2021, in her new book  —  A Facebook icon representing an external link to share the article on Facebook … ",
    "url": "https://themessenger.com/politics/cassidy-hutchinson-book-reveals-chaos-at-end-of-trump-white-house-i-dont-want-people-to-know-we-lost"
  },
  {
    "text": "Trump urges judge to reject proposed gag order in federal election case  —  Prosecutors have asked Judge Tanya Chutkan to order Trump to stop attacking potential witnesses.  —  Donald Trump's lawyers said Monday that a gag order proposed by prosecutors would unconstitutionally silence … ",
    "url": "https://www.politico.com/news/2023/09/26/trump-gag-order-chutkan-00118094"
  },
  {
    "text": "Cassidy Hutchinson Begs GOP to Stop Donald Trump Before It's Too Late  —  On MSNBC, the former White House aide warned that Trump “almost destroyed democracy in one day” and “wants to do it again.”  —  Former Trump White House aide Cassidy Hutchinson, whose testimony before the House Jan. 6 Committee … ",
    "url": "https://www.thedailybeast.com/cassidy-hutchinson-begs-gop-to-stop-trump-before-its-too-late-on-msnbc"
  },
  {
    "text": "Scoop: Biden team's don't-let-him-trip mission … - With a physical therapist, Biden has been doing exercises to improve his balance as far back as November 2021.  — Since his stumble in June, he has been wearing tennis shoes more often to avoid slipping — and using the short stairs on Air Force One … ",
    "url": "https://www.axios.com/2023/09/26/biden-trip-2024-campaign-sneakers"
  },
  {
    "text": "Ralph Nader, wary of Trump, offers to help Joe Biden win  —  The political firebrand, long estranged from Democrats, fears fascism will be on the ballot in 2024 and it must be defeated  —  The liberal activist Ralph Nader still remembers nearly the exact words Joe Biden used to banish … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/26/ralph-nader-joe-biden-election/"
  },
  {
    "text": "Cassidy and the Guys  —  Plus: Menendez is an old-school crook.  —  Catching up:  — Biden Heads to UAW Picket Line in Michigan - The New York Times  — New Poll by Saint Anselm College Survey Center shows Nikki Haley surging ahead of Ron DeSantis in New Hampshir e",
    "url": "https://morningshots.thebulwark.com/p/cassidy-and-the-guys"
  },
  {
    "text": "Hunter Biden sues former Trump lawyer Rudy Giuliani over infamous laptop  — Hunter Biden sued former Trump lawyer Rudy Giuliani and another attorney over alleged violations of computer fraud and data access related to a laptop computer Biden is said to have left at a Delaware repair shop.",
    "url": "https://www.cnbc.com/2023/09/26/hunter-biden-sues-rudy-giuliani-over-infamous-laptop.html"
  },
  {
    "text": "Hunter Biden sues Rudy Giuliani and his former attorney, alleging they tried to hack his devices  —  Hunter Biden filed a civil lawsuit Tuesday against Rudy Giuliani and his former attorney, claiming they caused “total annihilation” of his digital privacy and violated federal … ",
    "url": "https://www.cnn.com/2023/09/26/politics/hunter-biden-rudy-giuliani-lawsuit/"
  },
  {
    "text": "Supreme Court rejects Alabama's bid to use congressional map with just one majority-Black district  —  The court's decision is in line with its June ruling in the same case that reaffirmed key protections for minority voters.  —  WASHINGTON — The Supreme Court on Tuesday handed a defeat … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rejects-alabamas-bid-use-congressional-map-just-one-majo-rcna105688"
  },
  {
    "text": "What Is J.D. Vance's Angle?  —  J.D. Vance was trying to find his groove.  I had just shown up at his office last week to interview the Ohio Republican about his first nine months in the Senate, where he has proved curiously hard to pigeonhole.  As we sat down, Mr. Vance — at 39 … ",
    "url": "https://www.nytimes.com/2023/09/26/opinion/jd-vance-trump.html"
  },
  {
    "text": "Trump is crushing it in California.  His rivals are ‘in denial.’  —  Republicans will descend on California this week for the second presidential debate and speeches before thousands of state party activists.  On the ground, it's a snoozer with Trump ascendent.",
    "url": "https://www.politico.com/news/2023/09/26/trump-california-2024-republican-debate-00118063"
  },
  {
    "text": "JPMorgan Settles Epstein Suits With U.S. Virgin Islands and James Staley  —  The bank agreed to pay $75 million to settle with the U.S. Virgin Islands and also reached a confidential settlement with a former top banker who pushed to keep the disgraced financier as a client.",
    "url": "https://www.nytimes.com/2023/09/26/business/jpmorgan-jeffrey-epstein-virgin-islands.html"
  },
  {
    "text": "JPMorgan Chase settles Jeffrey Epstein sex trafficking suit by U.S. Virgin Islands for $75 million  — JPMorgan Chase said it will pay $75 million to settle a lawsuit by the U.S. Virgin Islands alleging that the huge American bank facilitated and benefited from sex trafficking of young women by its longtime customer Jeffrey Epstein.",
    "url": "https://www.cnbc.com/2023/09/26/jpmorgan-to-settle-jeffrey-epstein-suit-by-virgin-islands.html"
  },
  {
    "text": "Asa Hutchinson misses out as seven candidates qualify for second GOP debate  —  Former President Donald Trump is skipping another debate, while Hutchinson is the only candidate who made the first debate to miss the second one.  —  Former Arkansas Gov. Asa Hutchinson fell short of qualifying … ",
    "url": "https://www.nbcnews.com/politics/2024-election/who-qualified-second-republican-debate-participants-rcna111370"
  },
  {
    "text": "Florida school district orders librarians to purge all books with LGBTQ characters  —  Librarians in public schools in Charlotte County, Florida, were instructed by the school district superintendent to remove all books with LGBTQ characters or themes from school and classroom libraries.",
    "url": "https://popular.info/p/florida-school-district-orders-librarians"
  },
  {
    "text": "House Oversight launches investigation into Granholm electric vehicle road trip  —  The House Oversight Committee is launching an investigation into Energy Secretary Jennifer Granholm's electric vehicle road trip this summer, which drew attention after charging hiccups resulted in a family calling … ",
    "url": "https://www.washingtonexaminer.com/policy/energy-environment/oversight-launches-investigation-granholm-electric-vehicle-road-trip"
  },
  {
    "text": "Is McCarthy losing MTG?  —  The News  —  House Speaker Kevin McCarthy's closely watched alliance with Rep. Marjorie Taylor Greene is suddenly looking a little bit wobbly, as the Georgia hardliner has helped frustrate his efforts to pass a budget.  —  Greene announced on Sunday afternoon that she was a … ",
    "url": "https://www.semafor.com/article/09/25/2023/shutdown-showdown-is-mccarthy-losing-mtg"
  },
  {
    "text": "McCarthy's dilemma: Save his speakership, or keep the government open  —  Some conservatives say they won't vote for a short-term bill to keep the government open.  If Speaker Kevin McCarthy wants to avoid a shutdown, he'll likely need help Democrats' help.",
    "url": "https://www.nbcnews.com/politics/congress/government-shutdown-or-job-as-speaker-kevin-mccarthy-democrats-rcna117200"
  },
  {
    "text": "In some states, more than half of the local election officials have left since 2020  —  Josh Daniels got into running elections by accident.  —  A Marine veteran and registered Republican, Daniels was recruited in 2019 by a friend who'd been elected clerk in Utah County, Utah, to be her deputy.",
    "url": "https://www.npr.org/2023/09/26/1200616113/election-official-threats-harassment-turnover"
  },
  {
    "text": "The Coming Attack on an Essential Element of Women's Freedom  —  No-fault divorce has improved the lives of millions.  Now some extreme Republicans want to abandon it.  —  For the past half century, many women in America have enjoyed an unprecedented degree of freedom and legal protection … ",
    "url": "https://www.theatlantic.com/ideas/archive/2023/09/no-fault-divorce-laws-republicans-repeal/675371/"
  }
]