[
  {
    "text": "Democrats flip the script, eyeing debt limit to block Trump's agenda  —  Republicans have leveraged the debt ceiling for years to block Democrats' agenda.  Now liberals see an opening to stymie Trump.  —  DORAL, Florida — Democrats in Congress are considering forcing a showdown … ",
    "url": "https://www.washingtonpost.com/business/2025/01/27/trump-debt-ceiling-democrats/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3OTU0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5MzM2Mzk5LCJpYXQiOjE3Mzc5NTQwMDAsImp0aSI6IjQ3MzcwZTdjLTU3MzQtNDhiNi1hNDYyLWRmZWY1NzVjMWVkOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAxLzI3L3RydW1wLWRlYnQtY2VpbGluZy1kZW1vY3JhdHMvIn0.CeBmBdI_3R6YKWuAvfAu3bNJaA36oizBOCjo3MT5iOk&itid=gfta"
  },
  {
    "text": "Democrats move to condemn Trump pardons of violent Jan. 6 defendants  —  Senate Democrats offered a resolution Monday to condemn President Donald Trump's decision to pardon Jan. 6 defendants who assaulted Capitol Police officers, saying the move invites future political violence.",
    "url": "https://www.politico.com/live-updates/2025/01/27/congress/senate-dems-jan-6-pardons-00200696"
  },
  {
    "text": "China's DeepSeek AI app sends U.S. tech stocks reeling  —  The tech-heavy Nasdaq index lost nearly 4 percent in early trading Monday, with chipmaker Nvidia down nearly 12 percent.  —  The sudden popularity of a Chinese artificial intelligence model called DeepSeek pummeled stocks Monday … ",
    "url": "https://www.washingtonpost.com/business/2025/01/27/deep-seek-ai-markets-nvidia/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3OTU0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5MzM2Mzk5LCJpYXQiOjE3Mzc5NTQwMDAsImp0aSI6ImMxYmRlNjA2LWQ4NDUtNDEzYy05Yzk1LTZmYmQxMTEwMmQwNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAxLzI3L2RlZXAtc2Vlay1haS1tYXJrZXRzLW52aWRpYS8ifQ.ZhGnYIYWV0ZO5LnShC4usjfCwZ95kPKrKe3NHBhUQR0&itid=gfta"
  },
  {
    "text": "Nvidia falls 12% in premarket trading as China's DeepSeek triggers global tech sell-off … WATCH NOW  —  U.S. technology firms plunged in premarket trading, as Chinese startup DeepSeek sparked concerns over competitiveness in AI and America's lead in the sector, triggering a global sell-off.",
    "url": "https://www.cnbc.com/2025/01/27/nvidia-falls-10percent-in-premarket-trading-as-chinas-deepseek-triggers-global-tech-sell-off.html"
  },
  {
    "text": "Colombia yields on US deportation flights to avert trade war  —  A looming trade war between the US and Colombia appears to have been averted after the Colombian government agreed to allow US military flights carrying deported migrants to land in the Andean country.",
    "url": "https://www.bbc.com/news/articles/c20p36e62gyo"
  },
  {
    "text": "Behind the Colombia Blowup: Mapping Trump's Rapid-Escalation Tactics  —  There were no Situation Room meetings and no quiet calls to de-escalate a dispute with an ally.  Just threats, counterthreats, surrender and an indication of the president's approach to Greenland and Panama.",
    "url": "https://www.nytimes.com/2025/01/27/us/politics/trump-colombia-tariffs-deportation-flights.html"
  },
  {
    "text": "Trump Just Broke the Law.  Blatantly.  And He Might Get Away With It.  —  Imagine that there were a particularly dirty NFL player—call him Thompson—who developed a habit of doing something new and possibly dangerous to opposing players.  Penalty flags didn't deter him.  On and on he went.",
    "url": "https://newrepublic.com/article/190704/trump-fires-inspectors-general-broke-law-blatantly"
  },
  {
    "text": "Trump expected to sign executive orders to reshape the military, including banning transgender troops  —  President Donald Trump on Monday is expected to sign three executive orders that would reshape the military, including banning transgender service members from serving in the US armed forces … ",
    "url": "https://www.cnn.com/2025/01/27/politics/donald-trump-military-executive-orders/"
  },
  {
    "text": "Chief Corruption Prosecutor Resigns From Justice Dept.  —  Corey Amundson chose to leave the department after being told he was being reassigned by the Trump administration to a position related to immigration enforcement.  —  The head of the Justice Department's public integrity section … ",
    "url": "https://www.nytimes.com/2025/01/27/us/politics/chief-corruption-prosecutor.html"
  },
  {
    "text": "Navajo Nation leaders raise alarm over reports of Indigenous people being questioned and detained during immigration sweeps  —  At least 15 Indigenous people in Arizona and New Mexico have reported being stopped at their homes and workplaces, questioned or detained by federal law enforcement … ",
    "url": "https://www.cnn.com/2025/01/27/us/navajo-detained-ice-indigenous-immigration-trump/"
  },
  {
    "text": "Dr. Phil Tags Along On ICE Raid And Gets Recognized  —  A man being taken into custody suspected he had seen the TV shrink before.  —  LOADING  —  A man being taken into custody during a U.S. Immigration and Customs Enforcement raid in Chicago found himself suddenly face to face with Dr. Phil McGraw.",
    "url": "https://www.huffpost.com/entry/dr-phil-recognized-ice-raid_n_6797c5dde4b0792017b78827"
  },
  {
    "text": "Trump's Flaming Turd of an Argument for Ending Birthright Citizenship  —  My late father, an old-school seersucker-and-bow-tie Virginia lawyer, had his good days in court and his other days.  After one particularly fraught session in another city, he called my mother to report.  “I did just fine,” he said.",
    "url": "https://washingtonmonthly.com/2025/01/27/trumps-flaming-turd-of-an-argument-for-ending-birthright-citizenship/"
  },
  {
    "text": "US reports first outbreak of H5N9 bird flu in poultry  —  The United States has reported its first outbreak of H5N9 bird flu in poultry on a duck farm in California, the World Organisation for Animal Health (WOAH) said on Monday.  —  U.S. authorities also detected the more common H5N1 strain … ",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-reported-first-outbreak-h5n9-bird-flu-poultry-woah-says-2025-01-27/"
  },
  {
    "text": "No. We Should Not Move Beyond ‘That’  —  The Philadelphia Eagles are going to the Super Bowl.  (So are the Kansas City Chiefs, but who cares?)  The last time the Eagles won it all, in 2018, many of the players declined an invitation to the White House to celebrate with President Trump … ",
    "url": "https://www.thebulwark.com/p/no-we-should-not-move-beyond-that"
  },
  {
    "text": "Florida Legislature defies DeSantis on illegal immigration as Republican foes assert power  —  House Speaker Danny Perez and Senate President Ben Albritton pushed back in a way the governor hasn't seen before.  —  TALLAHASSEE, Florida — Gov. Ron DeSantis suffered a stunning defeat courtesy … ",
    "url": "https://www.politico.com/news/2025/01/27/florida-legislature-defies-desantis-00200715"
  },
  {
    "text": "Why Trump won't be deporting “millions” of criminals … - About 13,100 of those were convicted in homicides and are imprisoned in the U.S. They'll have deportation hearings after serving their sentences. … But being in the U.S. illegally is a civil violation, not a criminal one.",
    "url": "https://www.axios.com/2025/01/27/undocumented-immigrants-crime-deportations-trump"
  },
  {
    "text": "Europe's Elon Musk Problem … During an american election, a rich man can hand out $1 million checks to prospective voters.  Companies and people can use secretly funded “dark money” nonprofits to donate unlimited money, anonymously, to super PACs, which can then spend it on advertising campaigns.",
    "url": "https://www.theatlantic.com/magazine/archive/2025/03/musk-tech-oligarch-european-election-influence/681453/?gift=hVZeG3M9DnxL4CekrWGK34_jHWNsAU1mvPsKLSJcYGQ&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Some GOP senators want open committee vote on Gabbard  —  Any Republican opposition could doom the top intelligence nominee's confirmation.  —  Some Republican senators are pushing for the unusual step of making public a key vote on Tulsi Gabbard's nomination in the Senate Intelligence Committee … ",
    "url": "https://www.politico.com/news/2025/01/27/tulsi-gabbard-senate-intelligence-committee-vote-006977"
  },
  {
    "text": "Gangster's Paradise  —  Today we're going to the Bad Place.  I'm sorry in advance.  —  The argument I'm going to walk you through is that President Trump keeps inching closer to violence and his decision to remove protection from former government employees who are being targeted by Iran is a message about his intentions.",
    "url": "https://www.thebulwark.com/p/gangsters-paradise"
  },
  {
    "text": "JD Vance says of Pete Hegseth: ‘Pete is a disrupter’  —  The vice president expects Hegseth to shake things up at the Pentagon.  —  “Pete is a disrupter” said Vice President JD Vance in explaining why he is pleased that Pete Hegseth is now the nation's secretary of Defense.",
    "url": "https://www.politico.com/news/2025/01/26/jd-vance-pete-hegseth-disrupter-00200624"
  },
  {
    "text": "In Exacting Retribution, Trump Aims at the Future as Well as the Past  —  The president made good on promises to seek revenge against enemies during his first week back in power, signaling in the process that anyone who crosses him in the future could also suffer.",
    "url": "https://www.nytimes.com/2025/01/27/us/politics/trump-politics-enemies-pompeo-fauci.html?unlocked_article_code=1.sU4.-EdJ.cbOxwSY0f-20&smid=url-share"
  },
  {
    "text": "Ex-inspector general on Trump firings: 'We're looking at what amounts to a threat to democracy'  —  Former Inspector General for Small Business Administration Hannibal “Mike” Ware said he and others are looking into whether actions taken by President Trump amount to a threat on democracy.",
    "url": "https://thehill.com/homenews/administration/5109013-trump-threats-democracy/"
  },
  {
    "text": "The Meme Coin Is Just the Beginning  —  The Market for Foreign Government Business Under Trump's New Ethics Policy  —  President Trump's new meme crypto token has dropped from its pre-inaugural highs and in recent days has been valued at only $ 29 billion, a fall of 60 per cent from its peak.",
    "url": "https://executivefunctions.substack.com/p/the-meme-coin-is-just-the-beginning"
  },
  {
    "text": "It's pretty easy to cut $2 trillion from the federal budget, actually (permalink)  —  If Elon Musk wants to cut $2t from the US federal budget, there's a pretty straightforward way to get there - just eliminate all the beltway bandits who overcharge Uncle Sucker for everything from pharmaceuticals … ",
    "url": "https://pluralistic.net/2025/01/27/beltway-bandits/#henhouse-foxes"
  },
  {
    "text": "Oil Companies Embrace Trump, but Not ‘Drill, Baby, Drill’  —  Oil and gas executives welcomed President Trump's early moves on energy policy, but many said they did not plan to increase production unless prices rose significantly.  —  President Trump is swinging American energy policy sharply … ",
    "url": "https://www.nytimes.com/2025/01/27/business/energy-environment/oil-trump-drill-baby-drill.html"
  }
]