[
  {
    "text": "CBS News analysis: Most Republicans agree with “poisoning the blood” language  —  As Donald Trump dominates the GOP nomination race and some of his inflammatory comments find favor with the party faithful, CBS News measured how the public feels about his “poisoning the blood” language.",
    "url": "https://www.cbsnews.com/news/cbs-news-analysis-most-republicans-agree-with-poisoning-the-blood-language/"
  },
  {
    "text": "Live updates: GOP presidential candidates get last endorsements on frigid eve of Iowa caucuses  — With just a day to go before the Iowa caucuses, the candidates are braving subzero weather to deliver their closing arguments to caucusgoers.  — North Dakota Gov. Doug Burgum … ",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/live-updates-gop-presidential-campaigns-make-closing-arguments-eve-iow-rcna133857#rcrd30611"
  },
  {
    "text": "Majority of Iowa caucusgoers say Trump conviction wouldn't affect their support  —  The Iowa poll shows 18% of likely caucusgoers would be less likely to back Trump in 2024 if he's convicted of a crime before the general election.  —  More than 6-in-10 likely Republican caucusgoers … ",
    "url": "https://www.nbcnews.com/meet-the-press/meetthepressblog/majority-iowa-caucusgoers-say-trump-conviction-wouldnt-affect-support-rcna133876"
  },
  {
    "text": "Trump consolidates evangelical vote in Iowa  —  Kari Lake swooped into Bob Vander Plaats' church on Sunday, a show of force — if not an outright troll — ahead of the caucuses.  —  WEST DES MOINES, Iowa — Just as the Sunday morning service started here at Soteria church … ",
    "url": "https://www.politico.com/news/2024/01/14/trump-consolidates-evangelical-vote-iowa-00135556"
  },
  {
    "text": "Texas Blasted As ‘Cruel, Inhumane’ By Homeland Security After Blocking Rescue Efforts For 3 Migrants That Drowned  —  Texas denied federal agents access to a section of the southern border where they were trying to save migrants who eventually drowned in the Rio Grande, the U.S. Homeland … ",
    "url": "https://www.forbes.com/sites/saradorn/2024/01/14/texas-blasted-as-cruel-inhumane-by-homeland-security-after-blocking-rescue-efforts-for-3-migrants-that-drowned/"
  },
  {
    "text": "Iowa principal who risked life to protect students during a school shooting has died  —  Perry High School Principal Dan Marburger “placed himself in harm's way” Jan. 4.  —  DES MOINES, Iowa — An Iowa principal who put himself in harm's way to protect students during a school shooting earlier … ",
    "url": "https://www.politico.com/news/2024/01/14/iowa-principal-school-shooting-died-00135533"
  },
  {
    "text": "California Invents a Crazy New Tort  —  Golden State judges rule that Gilead can be sued for taking too long to develop an HIV drug.  —  Businesses are often sued for selling allegedly faulty products that aren't actually defective.  Last week a California appeals court ruled that businesses … ",
    "url": "https://www.wsj.com/articles/california-gilead-hiv-drug-lawsuit-tort-law-2143597c?mod=followamazon"
  },
  {
    "text": "RFK Jr. defends Kennedy administration wiretap of Martin Luther King Jr.  —  The independent presidential candidate said his father and uncle knew the FBI was “out to ruin King” in an exclusive interview with POLITICO.  —  ATLANTA — Robert F. Kennedy Jr. on Sunday defended his family's role … ",
    "url": "https://www.politico.com/news/2024/01/14/rfk-jr-defends-wiretap-mlk-00135543"
  },
  {
    "text": "Convicted Russian Ex-Mayor Cuts Jail Time by Agreeing to Fight in Ukraine  —  A disgraced former Russian mayor convicted over bribery had his prison sentence cut short after signing a contract to fight with Russia's military in Ukraine, local media reported Sunday.",
    "url": "https://www.bloomberg.com/en/news/thp/2024-01-14/convicted-former-russian-mayor-cuts-jail-time-short-by-agreeing-to-fight-in-ukraine"
  },
  {
    "text": "Caucuses leave many Iowans out in the cold - and not just in bad weather  —  Far fewer voters participate in the Iowa caucuses than in primaries in other states.  Snow and freezing cold temperatures will likely dampen turnout further.  —  DES MOINES — Bob Ray has participated … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/14/iowa-caucus-low-turnout-primaries/"
  },
  {
    "text": "Speaker Johnson reaches a crossroads in leading an unruly House GOP conference  —  The speaker is only a few months into his position, but is facing a critical funding deadline and a hard-right flank pondering open revolt  —  Just a few weeks into his tenure as House Speaker, Mike Johnson … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/14/house-republicans-government-funding-shutdown/"
  },
  {
    "text": "Fulton DA defends special prosecutor during church speech  —  Fani Willis speaks publicly for first time since bombshell allegations  —  Fulton County District Attorney Fani Willis on Sunday defended the special prosecutor overseeing the Donald Trump election interference case amid bombshell allegations … ",
    "url": "https://www.ajc.com/news/crime/fulton-da-defends-special-prosecutor-during-church-speech/HLHFIKVP4FHIJH4ANZYV7HKHP4/"
  },
  {
    "text": "Trump's embrace of far-right activist Laura Loomer worries his allies  —  One Trump ally told NBC News that Loomer, who has a history of making anti-Muslim remarks, is widely seen as a “liability” by people who work for the former president.  —  When Florida Gov. Ron DeSantis entered a hotel … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trumps-embrace-far-right-activist-laura-loomer-worries-allies-rcna133190"
  },
  {
    "text": "Scientist cited in push to oust Harvard's Claudine Gay has links to eugenicists  —  Christopher Rufo, credited with helping oust school's first Black president, touted critic associated with ‘scientific racists’  —  A data scientist promoted by the rightwing activist Christopher Rufo … ",
    "url": "https://www.theguardian.com/world/2024/jan/14/christopher-rufo-jonatan-pallesen-eugenics-racism-claudine-gay-harvard"
  }
]