[
  {
    "text": "Fear and loathing grips the House GOP  —  While Republicans appear to be turning next to Jim Jordan, some are already airing open doubts that he can pull off what the majority leader couldn't.  —  The House GOP has entered an angrier and more bewildered phase in its leadership crisis.",
    "url": "https://www.politico.com/news/2023/10/13/republicans-speaker-mccarthy-jim-jordan-00121370"
  },
  {
    "text": "Bipartisan talk grows as GOP fails to find a speaker  —  Lawmakers in both parties are expressing growing openness, both in public and in private, to a bipartisan deal to elect a House speaker as Republicans are continually thwarted in their efforts to do it alone.",
    "url": "https://www.axios.com/2023/10/13/house-speaker-bipartisan-deal-votes"
  },
  {
    "text": "House GOP in total chaos: So much for fascist order and discipline!  —  Aren't far-right movements supposed to make the trains run on time?  GOP can't elect a speaker from its own tribe  —  Nearly eight decades after the end of World War II, the thing we ought to understand most clearly … ",
    "url": "https://www.salon.com/2023/10/13/in-total-chaos-so-much-for-fascist-order-and-discipline/"
  },
  {
    "text": "Live updates House GOP voting on speaker hopefuls Jim Jordan and Austin Scott  —  House Republicans on Friday afternoon are holding a closed-door vote between two nominees for speaker: Reps. Jim Jordan (Ohio) and Austin Scott (Ga.).  The conference is scrambling to find a nominee … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/13/house-speaker-vote/"
  },
  {
    "text": "Israel orders unprecedented evacuation of 1 million in Gaza as possible ground offensive looms  —  Gaza's energy crisis risk hospitals turning into morgues  —  Israel Defense Forces release footage of assault on Gaza-adjacent outpost  —  Israel's military told some 1 million Palestinians … ",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-war-c8b4fc20e4fd2ef381d5edb7e9e8308c"
  },
  {
    "text": "Ground invasion of Gaza ‘imminent,’ Israeli officials say  —  The operation was expected following Hamas' brutal terrorist attack and has been seen as likely after Israel ordered an evacuation of northern Gaza.  —  Israel's ground invasion of Gaza is “imminent,” two Israeli officials said Friday … ",
    "url": "https://www.politico.com/news/2023/10/13/gaza-ground-invasion-israel-00121452"
  },
  {
    "text": "Will Narcissist Trump's Bizarre Praise for Hezbollah Hurt Him?  —  DONALD TRUMP HAS DEMONSTRATED YET AGAIN that he is a man without a single ounce of human decency.  At an event in West Palm Beach on Wednesday night, just four days after Hamas's brutal attack on Israeli civilians, Trump did the unthinkable.",
    "url": "https://plus.thebulwark.com/p/narcissist-trumps-bizarre-praise-hezbollah"
  },
  {
    "text": "Donald Trump's Israeli War Insight  —  He attacks Netanyahu in a crisis because of old personal grudges.  —  The front-runner for the GOP presidential nomination for some reason used the words “smart” and “Hezbollah” in the same sentence on Wednesday night.",
    "url": "https://www.wsj.com/articles/donald-trump-israel-benjamin-netanyahu-hezbollah-gaza-hamas-54a426c8?mod=followamazon"
  },
  {
    "text": "Fraudster freed from prison by Trump faces prosecution under Biden  —  Philip Esformes received clemency from Trump in the final weeks of his presidency after well-connected supporters pushed for his release.  —  Philip Esformes beat the system.  Or so it seemed.",
    "url": "https://www.washingtonpost.com/politics/2023/10/13/trump-pardon-philip-esformes-biden-justice-department/"
  },
  {
    "text": "Ex-Trump Organization CFO Allen Weisselberg's Testimony Abruptly Ended After Forbes Story Accused Him of Perjury  —  A source close to New York Attorney General Letitia James confirmed that her office is looking into the latest report about the former Trump CFO's testimony",
    "url": "https://themessenger.com/politics/allen-weisselberg-trump-organization-cfo-testimony-forbes-perjury"
  },
  {
    "text": "US intelligence warned of the potential for violence days before Hamas attack  —  The US intelligence community produced at least two assessments based in part on intelligence provided by Israel warning the Biden administration of an increased risk for Palestinian-Israeli conflict in the weeks ahead … ",
    "url": "https://www.cnn.com/2023/10/13/politics/us-intelligence-warnings-potential-gaza-clash-days-before-attack/"
  },
  {
    "text": "Even with last-minute challenger, Jordan poised to move toward speaker's gavel  —  Republicans are meeting to hear directly from Jordan and Rep. Austin Scott, who threw his hat into the ring just before the close-door meeting",
    "url": "https://www.politico.com/live-updates/2023/10/13/congress/scott-jordan-gop-house-speaker-race-00121455"
  },
  {
    "text": "DeSantis, voter have heated exchange over Gaza bombings: 'You had my vote, but you don't now'  —  Florida Gov. Ron DeSantis (R), a 2024 presidential candidate, had a heated exchange with a voter over Israel's airstrikes in Gaza after Hamas militants launched a deadly attack against Israel last weekend.",
    "url": "https://thehill.com/homenews/campaign/4254261-desantis-israel-gaza-bombings-voter-heated-exchange/"
  },
  {
    "text": "Supreme Court Justices Avoid Falling Chunk Of Marble In Courtyard  —  Democratic institutions in D.C. are literally crumbling, apparently.  —  LOADING  —  The Supreme Court avoided a catastrophic accident last year when a piece of marble at least 2 feet long crashed to the ground … ",
    "url": "https://www.huffpost.com/entry/supreme-court-falling-chunk-of-marble_n_65293963e4b03ea0c004c463"
  },
  {
    "text": "Ukrainian pilots expected to start F-16 training in Arizona next week  —  News comes after Washington announced it will lead a coalition of countries training Ukrainian pilots.  —  Ukrainian pilots are expected to begin training to fly the F-16 fighter jet at an Air National Guard base in Tuscon … ",
    "url": "https://www.politico.com/news/2023/10/13/ukrainian-pilots-expected-to-start-f-16-training-in-arizona-next-week-00121460"
  }
]