[
  {
    "text": "Maurene Comey, daughter of James Comey and prosecutor of Jeffrey Epstein, is fired … In recent weeks, President Donald Trump and Attorney General Pam Bondi have faced a firestorm of criticism over their decision not to release additional files related to Epstein, the disgraced financier … ",
    "url": "https://www.politico.com/news/2025/07/16/maurene-comey-fired-doj-00458921"
  },
  {
    "text": "Maurene Comey, federal prosecutor in Epstein case, fired from SDNY  —  Maurene Comey, a federal prosecutor in Manhattan and the daughter of former FBI Director James Comey, has been fired from her job in the Southern District of New York, according to people familiar with the situation.",
    "url": "https://cnn.com/2025/07/16/politics/maurene-comey-fired-sdny"
  },
  {
    "text": "Manhattan Prosecutor Who Handled Epstein Cases Is Fired  —  Maurene Comey, who is the daughter of the former F.B.I. director James Comey, worked on the criminal cases against Jeffrey Epstein and his associate Ghislaine Maxwell.  —  Santul Nerkar and Maggie Haberman",
    "url": "https://www.nytimes.com/2025/07/16/nyregion/maurene-comey-prosecutor-fired-jeffrey-epstein.html"
  },
  {
    "text": "Justice Department fires Maurene Comey, prosecutor on Epstein case and daughter of ex-FBI director  —  The Justice Department has fired Maurene Comey, the daughter of former FBI director James Comey and a veteran federal prosecutor who worked on the cases against Sean “Diddy” Combs and Jeffrey Epstein … ",
    "url": "https://apnews.com/article/justice-department-james-comey-maurene-trump-dda5d1f40f08346bd97696ce4791e8ec"
  },
  {
    "text": "Justice Department Fires Ghislaine Maxwell Prosecutor Maurene Comey  —  Daughter of former FBI Director James Comey had also worked on the cases against Jeffrey Epstein and Sean ‘Diddy’ Combs  —  The Justice Department on Wednesday fired federal prosecutor Maurene Comey … ",
    "url": "https://www.wsj.com/us-news/law/justice-department-fires-ghislaine-maxwell-prosecutor-maurene-comey-1edc5091"
  },
  {
    "text": "Jeez, I wonder why Trump won't release the Epstein files  —  SFGATE columnist Drew Magary unpacks what could be the biggest scandal of our time  —  When Donald Trump doesn't want to talk about something, that usually means that we need to talk about it.  That's especially true of the president's … ",
    "url": "https://www.sfgate.com/sf-culture/article/i-wonder-why-trump-wont-release-epstein-files-20772363.php"
  },
  {
    "text": "Inside Trump's Frantic, Failing Mission to Crush the Epstein ‘MAGA Rebellion’  —  The president and his administration are telling supporters to forget about the convicted sex offender.  It isn't working … By the time it was over, the president had sustained more blowback and political damage … ",
    "url": "https://www.rollingstone.com/politics/politics-features/inside-trump-failing-mission-crush-maga-revolt-epstein-1235387313/"
  },
  {
    "text": "Elon Musk Blows Major Hole in Trump's Epstein ‘Hoax’ Theory  —  ‘WOW’  —  Trump's former right-hand man is defiantly refusing to let the Jeffrey Epstein story go away.  —  Elon Musk went on a posting spree Wednesday afternoon to slam President Donald Trump's claim that the so-called “Epstein Files” are a lefty-created hoax.",
    "url": "https://www.thedailybeast.com/elon-musk-blows-major-hole-in-trumps-epstein-hoax-theory/"
  },
  {
    "text": "Loomer delivers searing warning: Epstein could ‘consume’ Trump presidency … The debacle over a new government review of evidence relating to Epstein, the notorious sex offender, has blown up in recent days, causing a schism within Trump's MAGA movement over his administration's approach to the case.",
    "url": "https://www.politico.com/news/2025/07/16/trump-epstein-maga-anger-00456207"
  },
  {
    "text": "Don't Fire Jerome Powell, Mr. President  —  Whatever the Fed chief's errors, canning him early would be worse.  —  It's often hard to know when President Trump is serious about something, or merely creating a distraction.  But in case he really meant it this week when he told Republican lawmakers … ",
    "url": "https://www.wsj.com/opinion/jerome-powell-donald-trump-federal-reserve-chairman-c7376c12"
  },
  {
    "text": "Trump, 79, Can't Remember Appointing His Own Fed Chair  —  ‘BIDEN DID THAT!’  —  The president blamed Joe Biden for selecting Jerome Powell as the U.S. Central Bank head when it was in fact him who made the appointment.  —  President Donald Trump was raging against Federal Reserve Chairman Jerome Powell … ",
    "url": "https://www.thedailybeast.com/trump-79-cant-remember-appointing-his-own-fed-chair-jerome-powell/"
  },
  {
    "text": "Senate approves Trump's bill to cut spending, sending it to the House  —  The legislation hands the Trump administration a victory in its ongoing power struggle with Congress over federal spending.  The bill now heads to the House.  —  Summary170  —  The Senate narrowly approved President … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/17/senate-recissions-bill-foreign-aid-npr-pbs-passage/"
  },
  {
    "text": "7/17/25 ☀️ AM: … “If Texas goes, we are going.” … Rep. Zoe Lofgren (D-Calif.), the chair of the delegation, hosted the meeting with Democratic Caucus Chair Pete Aguilar.  —  California Democrats were overwhelmingly on board with drawing a new map, but members want input in how the lines are drawn.",
    "url": "https://punchbowl.news/archive/71725-am-2/"
  },
  {
    "text": "Trump's Plans to Put Emil Bove on the Supreme Court  —  The nomination of Emil Bove III to a federal appeals court suggests that President Trump has a new prototype and a new agenda when it comes to the law: Out with the eggheads and in with the street fighters.",
    "url": "https://www.nytimes.com/2025/07/16/opinion/emil-bove-trump-loyalty.html?unlocked_article_code=1.W08.vCuw.fC4twrtFcbap&smid=url-share"
  },
  {
    "text": "Trump says Coca-Cola agreed to use real cane sugar in US drinks: 'It's just better!'  —  WASHINGTON — President Trump was on a sugar high Wednesday, announcing that Coca-Cola would soon include the real sweet stuff in its US-sold beverages.  —  “I have been speaking to Coca-Cola … ",
    "url": "https://nypost.com/2025/07/16/us-news/trump-says-coca-cola-agrees-to-use-real-cane-sugar-in-us-drinks-its-just-better/"
  },
  {
    "text": "Chief Justice Roberts Secretly Praised Trump in Crisis Talks With Judges  —  FRIENDS IN HIGH PLACES  —  The comments came as tensions escalated between Trump and judges who had blocked his agenda.  —  Supreme Court Chief Justice John Roberts praised Donald Trump at a secret meeting … ",
    "url": "https://www.thedailybeast.com/roberts-secretly-praised-trump-in-crisis-talks-with-judges/"
  },
  {
    "text": "California to provide LGBTQ suicide prevention hotline after Trump administration axes it  —  The move comes weeks after the Trump administration announced it would no longer provide specialized support for LGBTQ+ youth on the national suicide prevention hotline",
    "url": "https://www.mercurynews.com/2025/07/16/california-lgbtq-suicide-hotline-trump/"
  },
  {
    "text": "African Nation Says It Will Repatriate Migrants Deported by U.S.  —  The Trump administration sent five deportees to Eswatini, an African kingdom, saying that their own countries would not take them.  But Eswatini says it will send them home.  —  The tiny African kingdom of Eswatini announced … ",
    "url": "https://www.nytimes.com/2025/07/16/world/africa/eswatini-trump-migrants-deportation.html?unlocked_article_code=1.W08.zTF_.hxDPfgLBQx53&smid=url-share"
  },
  {
    "text": "The Chaotic Early Days Inside Florida's ‘Alligator Alcatraz’ Detention Center  —  Several immigrant detainees described high tension and anxiety at the remote, hastily constructed facility over a lack of information, recreation and access to medication.  —  The men at the new immigrant detention center … ",
    "url": "https://www.nytimes.com/2025/07/16/us/the-chaotic-early-days-inside-floridas-alligator-alcatraz-detention-center.html"
  },
  {
    "text": "White House Tries to Shake Off Trump's Bizarre Hand Make-Up  —  SHAKE IT OFF  —  Trump was speaking to reporters when a camera zoomed in on the president's hand.  —  The mysterious recurring bruise on the back of Donald Trump's right hand reappeared on Tuesday, prompting a fresh wave of concern over the president's health.",
    "url": "https://www.thedailybeast.com/white-house-explains-after-trumps-hand-pictured-caked-with-makeup/"
  },
  {
    "text": "Andrew Cuomo, conceding his failed primary campaign was flawed, takes to NYC streets  —  Andrew Cuomo is shifting gears and taking personal responsibility for running what he admits was a lackluster campaign in the Democratic mayoral primary, acknowledging that any strategic mistakes ultimately fall on him.",
    "url": "https://www.nydailynews.com/2025/07/16/andrew-cuomo-failed-primary-campaign-flawed-mamdani-adams-nyc-streets/"
  },
  {
    "text": "Judge halts deportation of non-binary American in ruling after Trump's gender edicts  —  ////world//A Federal Court judge has halted the deportation of a non-binary American in a ruling that criticized Ottawa's Immigration Department for not properly considering the situation … ",
    "url": "https://www.theglobeandmail.com/politics/article-judge-halts-deportation-non-binary-american-trump-gender-edicts/"
  },
  {
    "text": "Trump officials halt ‘dangerous’ research, overriding NIH career scientists  —  The Trump administration's actions on NIH gain-of-function research have raised concerns among scientists, who argue the move could block experiments that are safe and potentially lead to new treatments and medicines.",
    "url": "https://www.washingtonpost.com/science/2025/07/16/nih-research-viruses-trump-administration/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUyNjM4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU0MDIwNzk5LCJpYXQiOjE3NTI2Mzg0MDAsImp0aSI6IjkwOGYzYTVhLTZkNDctNGNkNS1hOTdlLWY0N2ViMGYzZWFhOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9zY2llbmNlLzIwMjUvMDcvMTYvbmloLXJlc2VhcmNoLXZpcnVzZXMtdHJ1bXAtYWRtaW5pc3RyYXRpb24vIn0.HMKtL880vNUF7mwhmSVSzTiP0isriG0q_nczrxq7bpY&itid=gfta"
  },
  {
    "text": "Trump administration taking new steps to block wind and solar projects, undisclosed memo says … Gregory Wischer, Interior's deputy chief of staff for policy, wrote in the memo that “all decisions, actions, consultations, and other undertakings — including but not limited to the following … ",
    "url": "https://www.politico.com/news/2025/07/16/interior-requires-burgum-sign-off-for-solar-wind-projects-00458999"
  },
  {
    "text": "Despite vow to remove the worst offenders, ICE data shows less than 1% of deportees had murder convictions  —  President Trump campaigned on a vow to round up the “worst of the worst” offenders among the criminals who were living illegally inside the United States.",
    "url": "https://www.cbsnews.com/news/trump-administration-ice-data-shows-less-than-1-of-deportees-had-murder-convictions/"
  },
  {
    "text": "Spurned U.S. Attorney Clings to Job by Being Appointed His Own Assistant  —  District judges recently denied John Sarcone, who was interim U.S. attorney, the permanent position.  The Justice Department then gave him a special appointment so he could continue in the role.",
    "url": "https://www.nytimes.com/2025/07/16/nyregion/sarcone-albany-us-attorney.html"
  }
]