[
  {
    "text": "Trump supports immigration visas backed by Musk: ‘I have many H-1B visas on my properties’  —  President-elect Trump told The Post Saturday he supports immigration visas for highly skilled workers, appearing to side with Elon Musk in the roiling intra-MAGA debate on the issue.",
    "url": "https://nypost.com/2024/12/28/us-news/donald-trump-backs-h-1b-visa-program-supported-by-elon-musk/"
  },
  {
    "text": "Trump Weighs In on Immigrant Visa Debate but Offers Little Clarity  —  He said in an interview that he had used the visas for skilled workers “many times.”  But he has mainly used visas for unskilled workers like housekeepers.  —  President-elect Donald J. Trump appeared to weigh in on Saturday … ",
    "url": "https://www.nytimes.com/2024/12/28/business/trump-immigration-h1b-visa.html"
  },
  {
    "text": "Trump appears to side with Musk, tech allies in debate over foreign workers roiling his supporters  —  President-elect Donald Trump appears to be siding with Elon Musk and his other backers in the tech industry as a dispute over immigration visas has divided his supporters.",
    "url": "https://apnews.com/article/trump-maga-immigration-visas-musk-91ab17e141cc9764fb18b8bc862c84dc"
  },
  {
    "text": "Biden reportedly regrets ending re-election campaign and says he'd have defeated Trump  —  President also regrets picking Merrick Garland for attorney general, as he was slow to prosecute Trump for January 6  —  Joe Biden regrets having pulled out of this year's presidential race and believes … ",
    "url": "https://www.theguardian.com/us-news/2024/dec/28/joe-biden-regrets-dropping-out-re-election"
  },
  {
    "text": "The Blaming of Joe Biden  —  We are now in the final weeks of Joe Biden's presidency, and I've been thinking about the year he had — how different it was from what he hoped last winter as he sought re-election.  All presidents think about what they wanted to achieve, in the end, and how Americans will regard them.",
    "url": "https://www.nytimes.com/2024/12/28/opinion/joe-biden-presidency.html"
  },
  {
    "text": "Musk Doubles Down on Support for German Far-Right Party  —  The world's richest man, a key adviser to President-elect Donald J. Trump, ridicules critics over his backing of the German extremist party AfD, as Germany prepares for elections.  —  Elon Musk, the world's richest man and a close adviser … ",
    "url": "https://www.nytimes.com/2024/12/28/world/europe/musk-support-for-german-far-right-afd.html"
  },
  {
    "text": "Trump calls federal judge's decision on border wall “major, crucial WIN” … - The attorney general's office said in a news release Paxton asked for a probe “to uncover potential legal violations committed by the Biden Administration after recent reports that segments of the border wall were auctioned off for pennies on the dollar.”",
    "url": "https://www.axios.com/2024/12/28/trump-border-wall-federal-judge-blocks-biden"
  },
  {
    "text": "Democrats taunt Trump with ‘President Musk’ moniker  —  Democrats are taunting President-elect Trump with claims that billionaire entrepreneur Elon Musk is calling the shots instead of the incoming president.  —  And with Musk set to play a major role in Trump's second term … ",
    "url": "https://thehill.com/homenews/administration/5056934-president-musk-democrats-taunt-trump/"
  },
  {
    "text": "How Donald Trump Went From Backing a TikTok Ban to Backing Off  —  In 2020, he moved to ban the Chinese-owned app.  Now, he is opposing the Biden administration's effort to do just that.  —  Four years ago, President Donald J. Trump denounced TikTok, the Chinese-owned video sharing app, as a threat to America's national security.",
    "url": "https://www.nytimes.com/2024/12/28/us/politics/trump-tik-tok-ban.html"
  },
  {
    "text": "Putin Apologizes but Does Not Take Responsibility for Azerbaijani Plane Crash  —  President Vladimir V. Putin of Russia told the Azerbaijani leader, Ilham Aliyev, in a phone call, “that the tragic incident took place in Russian airspace.”  —  President Vladimir V. Putin of Russia … ",
    "url": "https://www.nytimes.com/2024/12/28/world/europe/kazakhstan-russia-azerbaijan-plane-crash.html"
  },
  {
    "text": "Mexico, Betting Trump Is Bluffing on Tariffs, Sees an Opportunity  —  Business leaders in Mexico say the incoming U.S. administration will enhance the appeal of their factories as an alternative to plants in China.  —  Monterrey in Mexico, a country that emerged as an attractive manufacturing hub … ",
    "url": "https://www.nytimes.com/2024/12/28/business/trump-tariffs-mexico-china.html"
  },
  {
    "text": "University of Iowa announces plans to close Gender, Women's, and Sexuality Studies department  —  The University of Iowa announced that it would close its Gender, Women's, and Sexuality Studies department as public universities in the state continue to respond to a changing DEI landscape.",
    "url": "https://www.foxnews.com/media/university-iowa-announces-plans-close-gender-womens-sexuality-studies-department"
  },
  {
    "text": "Dear Jurisprudence: Can Trump Really Run for a Third Term?  —  At the end of 2024, we consider reader questions (and worries) about 2025. … Dear (Juris)Prudence,  —  Every so often, Trump throws out the phrase “If I'm reelected.”  Politicos talk about Trump being a lame duck and how impossible that is … ",
    "url": "https://slate.com/news-and-politics/2024/12/can-trump-run-for-a-third-term.html"
  },
  {
    "text": "Democracy in 2024 was noisy and chaotic.  It was also resilient.  —  Voters want government to work better, but they prefer democratic systems to the alternatives.  —  In Japan, the long-ruling Liberal Democratic Party suffered its worst defeat in over a decade, and Prime Minister Shigeru … ",
    "url": "https://www.washingtonpost.com/opinions/2024/12/28/democracy-elections-year-of-democracy-results/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM1MzYyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM2NzQ0Mzk5LCJpYXQiOjE3MzUzNjIwMDAsImp0aSI6ImVlNTVmZmY5LWY3OTItNDRmZS1hNTEyLTBkMDdhY2VmNTYxMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzEyLzI4L2RlbW9jcmFjeS1lbGVjdGlvbnMteWVhci1vZi1kZW1vY3JhY3ktcmVzdWx0cy8ifQ.slmIvAOJb0gpqEpWD12L0w-Yyrn-qbpVf9i_TvDo_FI&itid=gfta"
  }
]