[
  {
    "text": "Exclusive: Harris' election effort raises around $500 million in a month, sources say  —  U.S. Vice President Kamala Harris' election effort has raised around $500 million since she became the Democratic presidential candidate, sources told Reuters, an unprecedented money haul … ",
    "url": "https://www.reuters.com/world/us/harris-election-effort-raises-around-500-million-month-sources-say-2024-08-20/"
  },
  {
    "text": "Democrats Take On Trump With Devastating ‘Law & Order’ Parody During DNC … LOADING",
    "url": "https://www.huffpost.com/entry/democratic-convention-trump-law-order-parody_n_66c4afd3e4b0047d36bf635b"
  },
  {
    "text": "RFK Jr.'s running mate drops the pretense about helping Trump  —  Nicole Shanahan offered some surprisingly unvarnished comments that played into Democrats' long-standing allegations.  —  For as long as Robert F. Kennedy Jr. has been running for president, Democrats have cast him as a stalking horse for Donald Trump.",
    "url": "https://www.washingtonpost.com/politics/2024/08/20/rfk-jr-shanahan-on-helping-trump/"
  },
  {
    "text": "Trump says he'd consider appointing RFK Jr. to role in administration  —  Donald Trump said Tuesday he would “certainly” be open to Robert F. Kennedy Jr. playing a role in his administration if the independent candidate drops out of the 2024 race and endorses the former president.",
    "url": "https://www.cnn.com/2024/08/20/politics/trump-consider-appointing-rfk-jr-administration-role/"
  },
  {
    "text": "Biden's DNC speech delayed, pushed past prime-time coverage  —  (NewsNation) — President Joe Biden's highly anticipated speech at the Democratic National Convention was delayed, pushing past prime-time network coverage as the program ran more than an hour behind schedule.",
    "url": "https://www.newsnationnow.com/politics/2024-election/bidens-dnc-speech-delayed-pushed-past-prime-time-coverage/amp/"
  },
  {
    "text": "Harris campaign knocks Trump over event in ‘KKK capital of Michigan’  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/homenews/campaign/4837311-trump-rally-michigan-harris-criticizes/"
  },
  {
    "text": "Trump Campaign Brazenly Steals Kamala Harris' Beyoncé Anthem  —  COPYCAT  —  Trump's campaign co-opted the star's song “Freedom” just days after accusing Harris of “copying” him.  —  Not even a week after telling the crowd at a North Carolina rally that Kamala Harris was copying him … ",
    "url": "https://www.thedailybeast.com/trump-campaign-brazenly-steals-kamala-harris-beyonce-anthem-freedom"
  },
  {
    "text": "Trump baffles onlookers with claim Americans can't buy bread without getting raped or shot  —  Former President Donald Trump took time out of his day Tuesday to muse that people can't even go to the grocery store anymore without getting raped, mugged or even shot.",
    "url": "https://www.rawstory.com/trump-crime-stories-confuse/"
  },
  {
    "text": "Kamala Harris Supports a 25% Wealth Tax on Unrealized Gains  —  Joe Bide was up to his old tricks last night when talking about billionaires and what they pay in taxes.  He has been lying about this for years so why stop now.  CNN fact-checked him this morning: … I've gone over all of this before.",
    "url": "https://hotair.com/john-s-2/2024/08/20/kamala-harris-supports-bidens-plan-for-a-25-wealth-tax-on-unrealized-gains-n3793442"
  },
  {
    "text": "Accessibility and Access: Reporters Have Complaints About the DNC  —  There are only about 15% of the assigned press seats for print news publications this year than there were at the last Democratic National Convention.  — Copy  —  CHICAGO — Outside the United Center on Monday … ",
    "url": "https://www.notus.org/harris-2024/accessibility-and-access-reporter-complaints-dnc"
  },
  {
    "text": "North Carolina Moves to Toss-up, Setting Up November Battle for Magnificent Seven Swing States  —  KEY POINTS FROM THIS ARTICLE  —North Carolina moves from Leans Republican to Toss-up in our Electoral College ratings, further emphasizing a focus on 7 key swing states to the exclusion of almost everywhere else.",
    "url": "https://centerforpolitics.org/crystalball/north-carolina-moves-to-toss-up-setting-up-november-battle-for-magnificent-seven-swing-states/"
  },
  {
    "text": "Ex-Trump aide: Former president called supporters “basement dwellers” … - “When people were dying in the ICU, he was mad that cameras weren't watching him,” she alleged in an apparent reference to the early stages of the COVID pandemic.  — “He has no empathy.",
    "url": "https://www.axios.com/2024/08/20/dnc-trump-stephanie-grisham"
  },
  {
    "text": "Arizona Supreme Court clears way for voters to decide on constitutional right to abortion  —  The Arizona Supreme Court ruled Tuesday that a 200-word summary that abortion advocates used to collect signatures for a ballot measure is valid, clearing the way for voters to decide on the constitutional right to an abortion.",
    "url": "https://apnews.com/article/arizona-supreme-court-abortion-61c2a4c0565af8879801cdc7226410d0"
  },
  {
    "text": "'It's not a pro-life position': Anger after Trump says no to Comstock  —  Many prominent conservatives and anti-abortion activists were outraged by the remark, calling it “nonsensical” and “cowardly.”  —  Former President Donald Trump gave his clearest answer to date on the federal regulation … ",
    "url": "https://www.politico.com/news/2024/08/20/trump-comstock-enforcement-00175068"
  },
  {
    "text": "GOP megadonor drops another $50M into pro-Trump super PAC  —  Timothy Mellon has now given $115 million this cycle to the group.  —  A reclusive Republican megadonor gave $50 million to a pro-Trump super PAC in July, following two other massive donations to boost the former president this cycle.",
    "url": "https://www.politico.com/news/2024/08/20/timothy-mellon-maga-inc-00175249"
  },
  {
    "text": "Gaetz fends off primary challenge in Florida, dealing blow to McCarthy  —  Rep. Matt Gaetz (R-Fla.) has won the Republican primary for his seat in Florida's 1st Congressional District, according to Decision Desk HQ, fending off a challenger backed by Kevin McCarthy (R-Calif.) … ",
    "url": "https://thehill.com/homenews/campaign/4837655-gaetz-wins-florida-congressional-race/"
  },
  {
    "text": "Republican leader in Montgomery County swatted after publicly endorsing Kamala Harris  —  UPPER MERION, Pennsylvania (WPVI) — A Republican leader in Montgomery County is facing backlash for publicly supporting Kamala Harris for president instead of Donald Trump.",
    "url": "https://6abc.com/post/republican-leader-montgomery-county-matt-mccaffery-swatted-after-publicly-endorsing-kamala-harris-president/15207035/"
  },
  {
    "text": "Chuck Schumer outlines 2025 agenda if Democrats sweep, eying filibuster changes  —  Schumer said he expects party consensus on piercing the 60-vote rule for voting rights bills.  Abortion is also on his radar.  And he outlined budget priorities if Harris wins.",
    "url": "https://www.nbcnews.com/politics/congress/chuck-schumer-outlines-2025-agenda-democrats-sweep-eying-filibuster-ch-rcna167433"
  },
  {
    "text": "Pritzker says Harris ‘spent four years’ cleaning up Trump's ‘mess’  —  CHICAGO — Illinois Gov. JB Pritzker (D) contrasted Donald Trump and Vice President Harris as “the man who left our country a total mess and the woman who has spent four years cleaning it up” while speaking on the second night of the Democratic National Convention.",
    "url": "https://thehill.com/homenews/campaign/4838362-pritzker-attacks-trump-at-dnc/"
  },
  {
    "text": "Trump attorney was targeted by hackers, sources say  —  One of Donald Trump's attorneys was targeted in a hacking attempt, three sources familiar with the matter tell CNN, marking a potentially serious new development as American intelligence agencies confirmed Monday that they have concluded Iran … ",
    "url": "https://www.cnn.com/2024/08/20/politics/trump-attorney-targeted-hackers"
  },
  {
    "text": "Elon Musk's Twitter Takeover Is Now the Worst Buyout for Banks Since the Financial Crisis  —  Loans of around $13 billion have remained ‘hung’ for nearly two years, bringing in interest payments but weighing on banks' balance sheets  —  The $13 billion that Elon Musk borrowed to buy Twitter … ",
    "url": "https://www.wsj.com/tech/elon-musks-twitter-takeover-is-now-the-worst-buyout-for-banks-since-the-financial-crisis-3f4272cb?st=rhkmf50w84i9epx&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Federal judge blocks FTC noncompete ban  —  A federal judge Tuesday blocked a nationwide ban on noncompete agreements from taking effect in September.  —  The Federal Trade Commission (FTC) voted in April to ban most noncompete agreements, which prevent tens of millions of employees … ",
    "url": "https://thehill.com/business/4837806-ftc-noncompete-ban-blocked/"
  },
  {
    "text": "Harris leads Trump in new Nebraska 2nd District poll  —  Most recent local Biden-Trump polling had shown Trump narrowly leading or slightly behind  —  OMAHA — A new poll in Nebraska's 2nd Congressional District shows Vice President Kamala Harris has reinvigorated local Democrats, infusing them with renewed hope.",
    "url": "https://nebraskaexaminer.com/2024/08/20/harris-leads-trump-in-new-nebraska-2nd-district-poll/"
  }
]