[
  {
    "text": "U.S. votes against U.N. resolution condemning Russia for Ukraine war  —  BREAKING NEWS: U.S. sides with Russia to vote against a U.N. resolution condemning Moscow for the Ukraine  —  Washington's dramatic shift on the conflict marks a major break with its European allies and coincides … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/24/united-nations-ukraine-russia-trump/"
  },
  {
    "text": "U.S. Clashes With European Allies at the U.N. Over Ukraine  —  The United States voted against a resolution, backed by most of Europe, demanding Russian withdrawal from Ukraine — a deep fissure between allies, and a sharp shift in American policy.  —  A showdown over Ukraine between … ",
    "url": "https://www.nytimes.com/2025/02/24/world/middleeast/us-eurpe-russia-ukraine-un.html?unlocked_article_code=1.zU4.zd2_.IHXjZnPY4Q1L&smid=url-share"
  },
  {
    "text": "Ukraine diplomacy live: UN assembly condemns Russia's Ukraine invasion despite US opposition  —  Vote came shortly after G7 leaders failed to agree on a joint statement condemning Russia's war  —  Edited by Alexandra White, Zehra Munir, Peter Wells  —  UN General Assembly passes resolution condemning Russia's invasion of Ukraine",
    "url": "https://www.ft.com/content/d0f3547c-3fa0-405c-a4c0-8296a5ba08b9"
  },
  {
    "text": "Trump administration backs off Musk's 5 things threat  —  An administration official said it is “not a one-size-fits-all” approach.  —  The Trump administration is backing off Elon Musk's weekend mandate that federal employees submit five things they accomplished in the last week or face dismissal ahead of a Monday evening deadline.",
    "url": "https://www.politico.com/news/2025/02/24/trump-back-off-musk-five-things-threat-00205743"
  },
  {
    "text": "Federal workers sue over Elon Musk's threat to fire them if they don't explain their accomplishments  —  Billionaire Trump adviser Elon Musk violated the law with his weekend demand that federal employees explain their accomplishments or risk being fired, attorneys for the workers said Monday in a lawsuit.",
    "url": "https://apnews.com/article/musk-trump-federal-workers-firings-email-9785e7f74eb2a8b8fde5e01ff0c7717f"
  },
  {
    "text": "A new document undercuts Trump admin's denials about $400 million Tesla deal  —  The controversy started in a very Washington way: as a line item in a government spreadsheet buried on the State Department's website.  —  It appeared as if the State Department was taking steps to award Elon Musk's Tesla … ",
    "url": "https://www.npr.org/2025/02/24/nx-s1-5305269/tesla-state-department-elon-musk-trump"
  },
  {
    "text": "Right-Wing Commentator Named F.B.I. Deputy Director  —  The choice of Dan Bongino is a radical departure from the bureau's history of having a veteran agent serve in the key role that oversees operations.  —  Dan Bongino, a former New York City police officer and Secret Service agent turned right-wing pundit … ",
    "url": "https://www.nytimes.com/2025/02/23/us/politics/dan-bongino-fbi-deputy-director.html?unlocked_article_code=1.zU4.1vIW.Wcj-dF2XlL1J"
  },
  {
    "text": "Trump names podcaster Dan Bongino as deputy FBI director  —  US President Donald Trump has appointed podcaster and commentator Dan Bongino as deputy director of the FBI.  —  Trump posted on social media that Bongino was “a man of incredible love and passion for our Country” … ",
    "url": "https://www.bbc.com/news/articles/cpwd2qrn1e2o"
  },
  {
    "text": "An Obituary for the FBI  —  America's dream of a politically independent bureau is officially dead  —  The 117-year-old Federal Bureau of Investigation, long heralded as the nation's premier national law enforcement agency — an avowedly nonpartisan, independent investigator that for decades … ",
    "url": "https://www.doomsdayscenario.co/p/an-obituary-for-the-fbi"
  },
  {
    "text": "DOGE is the Theranos of Cost-Cutting  —  And other notes from the Chaos  —  Today's post will really be two short posts on different but related topics: The failure of DOGE to make any progress on its stated goals, and what's beginning to look like a rapid loss of confidence in Donald Trump's economic policies.",
    "url": "https://paulkrugman.substack.com/p/doge-is-the-theranos-of-cost-cutting"
  },
  {
    "text": "MSNBC drama intensifies as network axes shows hosted by 3 more lefty anchors in wake of Joy Reid's ouster: sources  —  MSNBC's new president continued to overhaul the embattled network Monday — canceling shows hosted by anchors left-wing anchors Ayman Mohyeldin, Katie Phang and Jonathan Capehart, The Post has learned.",
    "url": "https://nypost.com/2025/02/24/media/msnbc-drama-intensifies-as-network-axes-shows-hosted-by-3-more-lefty-anchors-in-wake-of-joy-reids-ouster-sources/"
  },
  {
    "text": "Here's how Republicans are planning to throw millions off Medicaid and lie about it  —  Trump is teaching his minions to say, “We didn't insure anyone\"/\"They deserved it.\"  —  A lot of the horror in the Donald Trump sequel is new.  —  Sure, he was terrible the first time James Comey and Vladimir Putin made him president.",
    "url": "https://thelastbillionaires.com/heres-how-republicans-are-planning-to-throw-millions-off-medicaid-and-lie-about-it/"
  },
  {
    "text": "AI Video of Trump Kissing Elon's Bare Feet Plays Throughout HUD Office  —  Federal workers are becoming increasingly incensed over DOGE's attacks on their departments  —  As Donald Trump and Elon Musk prepare to bring their next round of arbitrary cuts to the Department of Housing and Urban Development … ",
    "url": "https://www.rollingstone.com/politics/politics-news/ai-video-trump-kissing-elon-musk-feet-plays-hud-office-1235278135/"
  },
  {
    "text": "Fair or Not, Zelensky Is Angering Trump.  Is His Style Hurting Ukraine?  —  Through three years of wartime leadership, Ukraine's president has mostly played weak hands wisely.  But his approach has fallen flat with the Trump administration.  —  When the secretary of the treasury … ",
    "url": "https://www.nytimes.com/2025/02/24/world/europe/ukraine-zelensky-trump.html"
  },
  {
    "text": "New Idaho bill would cost you $100K, five years in jail for lying about someone  —  BOISE — House Speaker Mike Moyle on Friday introduced a bill to make it a felony crime to knowingly communicate a false statement about another person.  —  “I'm a firm believer in our First Amendment right … ",
    "url": "https://bonnercountydailybee.com/news/2025/feb/23/new-idaho-bill-would-cost-you-100k-5-years-in-jail/"
  },
  {
    "text": "America Has a Rogue President  —  President Trump's decision to fire senior military leaders without cause is foolish and a disgrace.  It politicizes our professional military in a dangerous and debilitating way.  What frightens me even more is the removal of three judge advocates general … ",
    "url": "https://www.nytimes.com/2025/02/24/opinion/trump-hegseth-cq-brown-pentagon-firings-jag.html?unlocked_article_code=1.zU4.F50P.yoYFQ95Pg-8o&smid=url-share"
  },
  {
    "text": "Lester Holt is stepping down as anchor of ‘NBC Nightly News’ after a decade  —  Holt will move full time to NBC's news magazine show “Dateline” at the beginning of the summer.  —  Lester Holt, the anchor and managing editor of “NBC Nightly News” for a decade, announced Monday that he is stepping … ",
    "url": "https://www.nbcnews.com/news/us-news/lester-holt-anchor-nbc-nightly-news-rcna193445"
  },
  {
    "text": "Budget won't be changed to address Medicaid concerns, Johnson says  —  Speaker Mike Johnson said Monday that he isn't planning to make any changes to his budget plan to placate Republicans concerned about possible Medicaid cuts.  “No,” Johnson replied when asked if he would offer any concessions … ",
    "url": "https://www.politico.com/live-updates/2025/02/24/congress/mike-johnson-medicaid-cuts-00205771"
  },
  {
    "text": "Oversight agency finds Trump's federal worker firings unlawful, asks for some employees to be reinstated  —  An independent federal oversight agency has deemed at least some of President Trump's mass firings of probationary period employees unlawful, creating a pathway for those employees to regain their jobs.",
    "url": "https://www.govexec.com/workforce/2025/02/oversight-agency-finds-trumps-federal-worker-firings-unlawful-asks-some-employees-be-reinstated/403218/"
  },
  {
    "text": "The Coup Has Failed  —  Trump's falling approval ratings reveal an out-of-touch presidency, and have given space for allies to turn against him.  —  President Donald Trump walks from the Oval Office to board Marine One as he departs from the South Lawn of the White House, February 14, 2025, in Washington.",
    "url": "https://prospect.org/politics/2025-02-24-trump-coup-has-failed/"
  },
  {
    "text": "Angry Democratic donors turn off the flow of money  —  Democrats are anxious to rebuild their party on the heels of President Trump's victory in November.  But they have a major problem as they try to refashion their brand: The money isn't there.  —  Democratic donors … ",
    "url": "https://thehill.com/homenews/campaign/5158323-democrats-struggle-rebuild-party/"
  },
  {
    "text": "UPDATE on town hall chaos: Woman who was dragged out speaks, police chief condemns security, name of security firm confirmed  —  COEUR d'ALENE — A legislative town hall organized by the Kootenai County Republican Central Committee devolved into chaos Saturday when unidentified … ",
    "url": "https://cdapress.com/news/2025/feb/23/update-on-town-hall-chaos-woman-who-was-dragged-out-speaks-police-chief-condemns-security-name-of-security-firm-confirmed/"
  },
  {
    "text": "Trump Just Fired 6,700 I.R.S. Workers in the Middle of Tax Season.  That's a Huge Mistake.  —  If you were to ask the top chief executives in the world to name the best strategy to attack waste in their organizations and balance the books, there is one answer you would be very … ",
    "url": "https://www.nytimes.com/2025/02/24/opinion/irs-taxes-trump.html?unlocked_article_code=1.zU4.-lFt.4XVjzzGf7NV5&smid=bs-share"
  },
  {
    "text": "NYC Mayor Eric Adams to close Roosevelt Hotel migrant center targeted by Musk, Trump administration  —  The hotel's closure comes as Adams promises to close another 53 emergency shelter sites by June.  —  New York City Mayor Eric Adams announced Monday that the city will close … ",
    "url": "https://www.nbcnews.com/news/us-news/nyc-mayor-eric-adams-close-roosevelt-hotel-migrant-center-targeted-mus-rcna193433"
  },
  {
    "text": "Roberta Flack, '70s R&B Vocalist Known for ‘Killing Me Softly,’ Dies at 88  —  Legendary pop/R&B vocalist Roberta Flack, who was launched to stardom in the early '70s by the Grammy-winning hits “The First Time Ever I Saw Your Face” and “Killing Me Softly With His Song,” has died … ",
    "url": "https://variety.com/2025/music/news/roberta-flack-singer-killing-me-softly-dead-1236318888/"
  },
  {
    "text": "Trump personally decided to limit Associated Press' access to White House  —  The acknowledgement came in a lawsuit filed by the news organization.  —  President Donald Trump personally decided to bar The Associated Press from some White House events and spaces, the White House said in court documents Monday.",
    "url": "https://www.politico.com/news/2025/02/24/trump-white-house-associated-press-lawsuit-00205723"
  },
  {
    "text": "Neo-Nazi group plots rebuild as Trump's FBI chief takes helm, audio reveals  —  Exclusive: Terrorist group the Base appears defiant as new administration aims to deprioritize threat from far right  —  An international neo-Nazi terrorist group with origins in the US appears to be quickly rebuilding … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/24/neo-nazi-trump-fbi-chief"
  },
  {
    "text": "The U.S. Economy Depends More Than Ever on Rich People  —  The highest-earning 10% of Americans have increased their spending far beyond inflation.  Everyone else hasn't.",
    "url": "https://www.wsj.com/economy/consumers/us-economy-strength-rich-spending-2c34a571?st=ohfAkF&reflink=desktopwebshare_permalink"
  },
  {
    "text": "One Word Describes Trump  —  A century ago, a German sociologist explained precisely how the president thinks about the world.  —  What exactly is donald trump doing?  —  Since taking office, he has reduced his administration's effectiveness by appointing to essential agencies people … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/02/corruption-trump-administration/681794/"
  },
  {
    "text": "As Facebook Abandons Fact-Checking, It's Also Offering Bonuses for Viral Content  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Hours after Donald Trump was sworn in as president … ",
    "url": "https://www.propublica.org/article/facebook-meta-abandons-fact-checking-boosts-viral-content"
  },
  {
    "text": "DOGE Is Inside the National Institutes of Health's Finance System  —  At least three people linked to Elon Musk's DOGE task force have access to NIH systems that control budgets, procurement, and more, according to records and internal documents viewed by WIRED.",
    "url": "https://www.wired.com/story/doge-is-inside-the-national-institutes-of-health-nih/"
  },
  {
    "text": "Tesla Is More Vulnerable Than You Think  —  Elon Musk, an impossibly wealthy, drug-addled Nazi sympathizer, is making drastic, devastating, unaccountable cuts to our federal government.  He is making decisions of great global consequence based on nothing but his own demonstrably ignorant ideas.",
    "url": "https://www.hamiltonnolan.com/p/tesla-is-more-vulnerable-than-you"
  },
  {
    "text": "Trump aid freeze disrupts anti-narcotics program at Mexican ports  —  U.S. President Donald Trump's sweeping foreign aid freeze has stalled a United Nations program in Mexico aimed at stopping imported fentanyl chemicals from reaching the country's drug cartels, according to eight people familiar with the situation.",
    "url": "https://www.reuters.com/world/americas/trump-aid-freeze-disrupts-anti-narcotics-program-mexican-ports-2025-02-24/"
  },
  {
    "text": "February 23, 2025  —  Something is shifting,\" scholar of authoritarianism Timothy Snyder posted on Bluesky yesterday. “  They are still breaking things and stealing things.  And they will keep trying to break and to steal.  But the propaganda magic around the oligarchical coup is fading.",
    "url": "https://heathercoxrichardson.substack.com/p/february-23-2025"
  }
]