[
  {
    "text": "Maxwell offers to testify before Congress but with major conditions, including immunity  —  Jeffrey Epstein accomplice Ghislaine Maxwell has offered to testify before Congress, but with major conditions, including immunity, according to a list of her demands sent to the House Oversight Committee by her attorneys.",
    "url": "https://cnn.com/2025/07/29/politics/maxwell-conditions-congressional-testimony"
  },
  {
    "text": "Ghislaine Maxwell plays hardball with lawmakers on giving Epstein testimony  —  Ghislaine Maxwell, a convicted co-conspirator of the deceased sex offender Jeffrey Epstein, is asking to postpone her scheduled congressional deposition — and making a series of other demands as conditions of her cooperation with Hill investigators.",
    "url": "https://www.politico.com/live-updates/2025/07/29/congress/maxwell-makes-demands-00481769"
  },
  {
    "text": "In a Game-Changing Climate Rollback, E.P.A. Aims to Kill a Bedrock Scientific Finding  —  If upheld in court, the repeal would make it almost impossible for future administrations to rein in greenhouse gases.  —  Lee Zeldin, the administrator of the Environmental Protection Agency … ",
    "url": "https://www.nytimes.com/2025/07/29/climate/epa-endangerment-finding-repeal-proposal.html"
  },
  {
    "text": "EPA moves to end climate regulation under Clean Air Act  —  The agency announced a proposal to rescind the landmark “endangerment finding,” which says that greenhouse gases are a threat to public health.  —  The Environmental Protection Agency on Tuesday announced a proposal to rescind … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/07/29/epa-endangerment-finding-clean-air-act/"
  },
  {
    "text": "There was no “missing minute” in Epstein jail video, government source says  —  The “missing minute” from the surveillance video at the Manhattan Metropolitan Correctional Center where Jeffrey Epstein died in 2019 may not be missing after all, CBS News has learned.",
    "url": "https://www.cbsnews.com/news/jeffrey-epstein-jail-video-no-missing-minute-government-source-says/"
  },
  {
    "text": "The Democratic image is underwater — but they're not losing  —  Polls show the party near a 30-year low, yet they're favored in the House popular vote.  —  ∙ Paid … A new poll from the Wall Street Journal has Democrats in a panic.  According to the WSJ's pollsters … ",
    "url": "https://www.gelliottmorris.com/p/democratic-party-favorability-ratings-low"
  },
  {
    "text": "Gunman who killed 4 at NYC building was targeting NFL offices but took wrong elevator, mayor says  —  A gunman who killed four people at a Manhattan office building before killing himself was trying to target the headquarters of the National Football League but took the wrong elevator, Mayor Eric Adams said Tuesday.",
    "url": "https://apnews.com/article/manhattan-office-shooting-nfl-nyc-d32bec88dfe208af1a413cec02034a14"
  },
  {
    "text": "Poll: New York Dems side with Mamdani on Israel, Netanyahu  —  The Scoop  —  New York City's Democratic primary voters overwhelmingly believe that Israel is “committing genocide” in Gaza and that the United States should stop arming the Jewish state, according to new polling from a pro-Palestinian group and shared first with Semafor.",
    "url": "https://www.semafor.com/article/07/28/2025/poll-new-york-dems-side-with-mamdani-on-israel-netanyahu"
  },
  {
    "text": "Donald Trump's tariff blitz brings US levies to highest levels since 1930s  —  Washington has locked in tariffs on almost 45% of American imports  —  Donald Trump has pushed US tariffs on foreign goods to the highest level since before the second world war as he enacts his sweeping protectionist agenda.",
    "url": "https://www.ft.com/content/50f85d9b-cea8-407f-bde7-d543c7bf869a"
  },
  {
    "text": "Trump lawsuit against Murdoch and ‘Wall Street Journal’ turns personal  —  President Trump's defamation lawsuit against the Wall Street Journal and its powerful owner has taken a personal turn.  —  In the legal filings — and on social media — Trump says he personally told media mogul Rupert Murdoch … ",
    "url": "https://www.npr.org/2025/07/29/nx-s1-5482955/trump-epstein-murdoch-deposition-lawsuit"
  },
  {
    "text": "Trump says Epstein ‘stole’ underage victim Virginia Giuffre from his Mar-a-Lago spa leading to feud  —  President tells reporters he cut off contact with Epstein because he was poaching employees from his club … President Donald Trump on Tuesday said he ended his friendship … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-epstein-virginia-giuffre-mar-a-lago-b2798336.html"
  },
  {
    "text": "Navy Set to Unplug Critical Hurricane Satellites this Week  —  The U.S. Navy will permanently cut its stream of data from three weather satellites essential to hurricane forecasters this Thursday, with the peak of the Atlantic hurricane season just weeks away.",
    "url": "https://michaelrlowry.substack.com/p/navy-set-to-unplug-critical-hurricane"
  },
  {
    "text": "UK will recognise Palestinian state in September unless Israel agrees to Gaza ceasefire and other conditions  —  Summary  — Keir Starmer says the UK will recognise a Palestinian state at a UN meeting in September unless Israel meets certain conditions  — He says the recognition … ",
    "url": "https://www.bbc.com/news/live/cdrkj810plvt"
  },
  {
    "text": "Portrait of a Young DOGE Coder Dismantling America's Institutions",
    "url": "https://www.bloomberg.com/features/2025-luke-farritor-doge/"
  },
  {
    "text": "Renaming the Kennedy Center for Donald and Melania Trump would violate the law that created it  —  The Kennedy Center can't include new memorials or plaques — for donors or presidents — under U.S. law.  Republicans would need to change that to rename it for the Trumps.",
    "url": "https://www.nbcnews.com/politics/donald-trump/renaming-kennedy-center-donald-melania-trump-violate-law-created-rcna221505"
  },
  {
    "text": "Why Trump Might Free Ghislaine  —  For a guy who's absolutely furious that everyone keeps talking about the Epstein story, Donald Trump sure does keep making a lot of news about it that keeps it stuck to the headlines.  One of these days, we're going to manage to get you a Morning Shots item off this news—but today is not that day.",
    "url": "https://www.thebulwark.com/p/why-trump-might-free-ghislaine-maxwell-jeffrey-epstein-price-beef"
  },
  {
    "text": "Scientist on green card detained for a week without explanation, lawyer says  —  Tae Heung Kim, a Korean citizen studying in the United States, is being held in San Francisco after returning from his brother's wedding overseas.  —  A Korean-born researcher and longtime U.S. legal permanent resident … ",
    "url": "https://www.washingtonpost.com/immigration/2025/07/29/korean-scientist-green-card-detained/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzNzYxNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1MTQzOTk5LCJpYXQiOjE3NTM3NjE2MDAsImp0aSI6IjM1YzljYzgwLTYxN2EtNDYyMC04MmJhLWVkZmZjYTVhMzM3MyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzA3LzI5L2tvcmVhbi1zY2llbnRpc3QtZ3JlZW4tY2FyZC1kZXRhaW5lZC8ifQ.5BctpJoDDLFBrYKsaiV0fvWyZoFqW86Sl5JHsqc3ih4&itid=gfta"
  },
  {
    "text": "We texted nearly 1,100 Americans about Trump and the Epstein files.  Here's what they said.  —  How closely are Americans following news about government files from the federal investigation of Jeffrey Epstein, and what do they think about President Donald Trump's handling of the issue?",
    "url": "https://www.washingtonpost.com/politics/interactive/2025/epstein-files-poll-trump-doj/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzNzYxNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1MTQzOTk5LCJpYXQiOjE3NTM3NjE2MDAsImp0aSI6IjI2OTg2ZTIxLTI1NzktNDJmZC05ZWZlLTk3NDYzY2JmNjg2NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy9pbnRlcmFjdGl2ZS8yMDI1L2Vwc3RlaW4tZmlsZXMtcG9sbC10cnVtcC1kb2ovIn0.PLTsCFApSpTaz0gZEVN82YR5tLdlqezDbKtSd-AJEoI&itid=gfta"
  },
  {
    "text": "Trump-CBS deal is even worse than you thought  —  Every so often there comes a moment of clarity about what immigration really means in America, often wrapped in tragedy.  The essential work that immigrants do was hammered home last year when six of them perished in the collapse of Baltimore's Key Bridge.",
    "url": "https://www.inquirer.com/columnists/attytood/trump-cbs-paramount-media-press-freedom-authoritarian-censorship-20250729.html"
  },
  {
    "text": "Exclusive: Inside the Preparations for Trump's Next Supreme Court Nominee  —  Updates on Manhattan shooting, Gaza, and more  —  White House officials and a close circle of conservative lawyers are preparing for President Donald Trump to be able to hit the ground running if a Supreme Court vacancy opens … ",
    "url": "https://time.com/7305987/donald-trump-supreme-court-justices/"
  },
  {
    "text": "The FBI's Leaders 'Have No Idea What They're Doing'  —  A casualty of Trump's purge speaks out.  —  michael feinberg had not been planning to leave the FBI.  But on May 31, he received a phone call from his boss asking him about a personal friendship with a former FBI agent who was known for criticizing President Donald Trump.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/07/trump-fbi-michael-feinberg/683685/"
  },
  {
    "text": "Chris Kluwe, fired as football coach, sues Huntington Beach Union High School District  —  High school football practices started all across Southern California on Monday.  —  One person not on the gridiron this year at Edison High is former NFL punter Chris Kluwe.",
    "url": "https://www.latimes.com/socal/daily-pilot/news/story/2025-07-28/chris-kluwe-fired-as-football-coach-sues-huntington-beach-union-high-school-district"
  },
  {
    "text": "Hawley Introduces Legislation to Send Rebate Checks to Working Americans  —  Today, U.S. Senator Josh Hawley (R-Mo.) introduced the American Worker Rebate Act, legislation that would send rebate checks to working Americans following the historic revenue accrued through President Trump's tariff policy.",
    "url": "https://www.hawley.senate.gov/hawley-introduces-legislation-to-send-rebate-checks-to-working-americans/"
  },
  {
    "text": "The Biggest House GOP Bullies Are Now Impotent  —  From the moment they formed in early 2015, the far-right House Freedom Caucus has been a pest, but one to be reckoned with on Capitol Hill.  Any time government funding was in jeopardy, or a fiscal cliff loomed, or a Republican party boss … ",
    "url": "https://www.thebulwark.com/p/house-freedom-caucus-became-impotent-continuing-resolution-congress-budget-big-beautiful-bill-ralph-norman-andy-harris-chip-roy"
  },
  {
    "text": "Exclusive: Trump administration slashed federal funding for gun violence prevention  —  The Trump administration has terminated more than half of all federal funding for gun violence prevention programs in the U.S., cutting $158 million in grants that had been directed to groups in cities like New York … ",
    "url": "https://www.reuters.com/legal/government/trump-administration-slashed-federal-funding-gun-violence-prevention-2025-07-29/"
  },
  {
    "text": "Maine Sec. of State to Trump DOJ: ‘Go Jump in the Gulf of Maine’  —  AUGUSTA, ME — Maine Secretary of State Shenna Bellows (D) issued a defiant response to the wide-ranging request from the U.S. Department of Justice (DOJ) — first reported by Democracy Docket — for the state's sensitive voter information and voting systems data.",
    "url": "https://www.democracydocket.com/news-alerts/maine-sec-of-state-to-trump-doj-go-jump-in-the-gulf-of-maine/"
  },
  {
    "text": "Burchett kicked by horse, breaks rib  —  Rep. Tim Burchett is on the mend after suffering a horse-related snafu.  —  The Tennessee Republican was “accidentally kicked by a horse” while working on his farm over the weekend, according to his office.  —  While the 60-year-old Congress member's … ",
    "url": "https://thehill.com/homenews/house/5426101-tim-burchett-kicked-by-horse-tennessee/"
  }
]