[
  {
    "text": "Mike Johnson Scrapes Speakership Win After Republicans Change Votes  —  The congressional leader's attempt to hold the gavel in a straight vote was foiled by disgruntled Republicans — until it wasn't  —  The House Republican caucus kicked off the 119th U.S. Congress with what is becoming … ",
    "url": "https://www.rollingstone.com/politics/politics-news/mike-johnson-house-speaker-vote-1235224706/"
  },
  {
    "text": "Trump Has Reached the Mountaintop  —  Big day for Mike Johnson, whose job and reputation are on the line, to say nothing of his role as dedicated MAGA selfie background guy.  The speaker told reporters this morning he feels confident he can retain his gavel, and do so on the first ballot.",
    "url": "https://www.thebulwark.com/p/trump-has-reached-the-mountaintop"
  },
  {
    "text": "Johnson expected to fail on first vote to reclaim speakership  —  At least one Republican has joined Rep. Thomas Massie in opposing Johnson for speaker on the floor.  —  Mike Johnson is expected to come up short in his bid to remain speaker on the first ballot.",
    "url": "https://www.politico.com/news/2025/01/03/mike-johnson-to-fail-first-house-speaker-vote-00196387"
  },
  {
    "text": "Judge upholds Trump's felony conviction, but does not plan to order jail time  —  Donald Trump was found guilty in May of falsifying business records to conceal a payment to adult-film star Stormy Daniels ahead of the 2016 election.  —  NEW YORK — President-elect Donald Trump will be sentenced … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/03/trump-new-york-hush-money-conviction-sentence/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM1ODgwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM3MjYyNzk5LCJpYXQiOjE3MzU4ODA0MDAsImp0aSI6ImNhNmJhZTk5LTM2NzQtNDA1OS1iNGYzLWUwODA1MGMwOTQ1NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAxLzAzL3RydW1wLW5ldy15b3JrLWh1c2gtbW9uZXktY29udmljdGlvbi1zZW50ZW5jZS8ifQ._xSiYrmilUvxjopNjH7qphaLD2AitGvr3Vzv68-Pd2E&itid=gfta"
  },
  {
    "text": "Judge Upholds Trump's Conviction but Signals No Jail Time  —  The New York judge who oversaw President-elect Donald J. Trump's hush-money trial scheduled his sentencing for Jan. 10.  Mr. Trump is expected to appeal his conviction.  —  A New York judge on Friday upheld President-elect Donald … ",
    "url": "https://www.nytimes.com/2025/01/03/nyregion/trump-sentencing-hush-money-case-ny.html"
  },
  {
    "text": "Why I'm quitting the Washington Post  —  I've worked for the Washington Post since 2008 as an editorial cartoonist.  I have had editorial feedback and productive conversations—and some differences—about cartoons I have submitted for publication, but in all that time I've never had a cartoon killed … ",
    "url": "https://anntelnaes.substack.com/p/why-im-quitting-the-washington-post"
  },
  {
    "text": "Scoop: Apple CEO Tim Cook donates $1 million to Trump inauguration … The company is not expected to give.  — Cook, with a consistent presence in Washington, has made it clear over the years that he believes in participation, not sitting on the sidelines, and engaging with policymakers from both sides of the aisle.",
    "url": "https://www.axios.com/2025/01/03/tim-cook-apple-donate-1-million-trump-inauguration"
  },
  {
    "text": "Order Regarding the Proposed Acquisition of United States Steel Corporation by Nippon Steel Corporation  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, including section 721 of the Defense Production Act of 1950, as amended … ",
    "url": "https://www.whitehouse.gov/briefing-room/presidential-actions/2025/01/03/order-regarding-the-proposed-acquisition-of-united-states-steel-corporation-by-nippon-steel-corporation/"
  },
  {
    "text": "Meta's AI Profiles Are Indistinguishable From Terrible Spam That Took Over Facebook  —  Earlier this week, Meta executive Connor Hayes told the Financial Times that the company is going to roll out AI character profiles on Instagram and Facebook that “exist on our platforms … ",
    "url": "https://www.404media.co/metas-ai-profiles-are-indistinguishable-from-terrible-spam-that-took-over-facebook/"
  },
  {
    "text": "Vegas Cybertruck bomber Matthew Livelsberger's vile marriage secrets revealed  —  Cybertruck suicide bomber Matthew Livelsberger was ‘unstable, misogynistic’ and emotionally ‘abusive’ to his first wife, says a pal of the active-duty Green Beret's ex.  —  'I never considered him stable or solid … ",
    "url": "https://www.dailymail.co.uk/news/article-14247555/matthew-livelsberger-marriage-vegas-cybertruck-trump.html"
  },
  {
    "text": "Alabama mom hit by truck, then shot in Bourbon Street attack: 'It's just so disturbing'  —  A night of revelry was coming to a close for Alexis Scott-Windham and her friends in the early hours of New Year's Eve after they came from Mobile, Alabama to ring in the new year on Bourbon Street.",
    "url": "https://www.nola.com/news/crime_police/alabama-mom-is-hit-by-truck-then-shot-in-new-orleans-attack/article_f985df4e-c965-11ef-8ec3-a3bc378dd1ae.html"
  },
  {
    "text": "UK Right Warns Trump Allies That Musk's Posts Have Gone Too Far  — Billionaire calls for release of far-right activist Robinson  — Reform leader Nigel Farage has distanced himself from Robinson  —  Senior politicians on the UK right have privately contacted Donald Trump's allies … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-03/uk-right-warns-trump-allies-that-musk-s-posts-have-gone-too-far"
  },
  {
    "text": "You're In Woke Hands With Allstate  —  Remember when insurance companies tried very, very hard to be boring?  Recall the days when all we wanted to hear from insurers was, “Your claim will be paid right now?”  —  Instead, these days insurance companies act more like comedy clubs than financial underwriters.",
    "url": "https://hotair.com/ed-morrissey/2025/01/03/with-allstate-youre-in-woke-hands-n3798444"
  },
  {
    "text": "The resistance to Trump is different this time.  Just look at immigration.  —  Democrats look for a message that's responsive to the election outcome but also puts up a fight against Trump.  —  Democrats — stung by an election that in part repudiated the party's approach to immigration … ",
    "url": "https://www.politico.com/news/2025/01/03/democrats-border-immigration-trump-resistance-001839"
  },
  {
    "text": "Thune says preserving the Senate filibuster will be a top priority  —  Sen. John Thune (R-S.D.) in his first prepared address as Senate majority leader says “preserving” the filibuster will be one of his top priorities, making an early move to quash any talk of major filibuster reform … ",
    "url": "https://thehill.com/homenews/senate/5065389-senator-thune-filibuster-reform/"
  },
  {
    "text": "US surgeon general sounds alarm about link between alcohol and cancer  —  US Surgeon General Dr. Vivek Murthy issued an advisory Friday warning Americans that alcohol consumption can increase their cancer risk and called for an updated health warning label on alcoholic beverages.",
    "url": "https://www.cnn.com/2025/01/03/health/alcohol-cancer-surgeon-generals-advisory"
  },
  {
    "text": "Memorandum on the Designation of Officials of the United States Agency for Global Media to Act as Chief Executive Officer  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, including the Federal Vacancies Reform Act of 1998, as amended, 5 U.S.C. 3345 et seq.",
    "url": "https://www.whitehouse.gov/briefing-room/presidential-actions/2025/01/03/memorandum-on-the-designation-of-officials-of-the-united-states-agency-for-global-media-to-act-as-chief-executive-officer/"
  },
  {
    "text": "Bird flu causing egg prices to soar to new record high … - In California, prices have reached $8.97, a 70% increase in the last month, per the U.S. Department of Agriculture's egg markets report.  — Reports of egg shortages have been on the rise and some retailers are limiting how many eggs consumers can purchase.",
    "url": "https://www.axios.com/2025/01/03/egg-prices-2025-bird-flu-avian-influenza"
  },
  {
    "text": "I Want Your Attention.  I Need Your Attention.  Here Is How I Mastered My Own.  —  I try to hold people's attention for a living.  For more than 13 years, I've been hosting a cable news show, and when I'm not doing that, I spend a lot of time alternating between reading the internet … ",
    "url": "https://www.nytimes.com/2025/01/03/opinion/chris-hayes-msnbc-attention.html?unlocked_article_code=1.mU4.ly68.9KHcNYTwqgCS&smid=url-share"
  },
  {
    "text": "Yoon's team claims immunity from insurrection charges, citing Trump ruling  —  The legal team of suspended President Yoon Suk Yeol claimed Friday that Yoon's impeachment trial does not warrant a ruling as he should have immunity from prosecution, citing the U.S. Supreme Court's ruling on Donald Trump.",
    "url": "https://m-en.yna.co.kr/view/AEN20250103011400320"
  }
]