[
  {
    "text": "Trump White House reverses course, rescinds freeze on federal grants  —  The budget office came under immense pressure over the impacts on a sudden pause in key government spending  —  The White House budget office on Wednesday rescinded an order freezing federal grants … ",
    "url": "https://www.washingtonpost.com/business/2025/01/29/white-house-budget-office-spending-freeze/"
  },
  {
    "text": "White House rescinds Trump's funding freeze after massive backlash  —  The White House Office of Management and Budget (OMB) rescinded a memo Wednesday that had ordered a “temporary pause” on federal funding and unleashed major confusion across the country.",
    "url": "https://www.axios.com/2025/01/29/federal-funding-freeze-memo-rescinded"
  },
  {
    "text": "Tracker: Legal Challenges to Trump Administration Actions  —  This public resource tracks legal challenges to Trump administration actions.  If you think we are missing anything, you can email us at lte@justsecurity.org.  Special thanks to Just Security Student Staff Editors Rick Da and Jeremy Venook.",
    "url": "https://www.justsecurity.org/107087/tracker-legal-challenges-trump-administration-actions/"
  },
  {
    "text": "The Trump White House Wants A Court Challenge Over Frozen Funds  —  An internal OMB document shows that it is official administration policy to block funding to provoke a constitutional challenge.  —  LOADING  —  The Trump administration's federal government funding freeze instituted Monday … ",
    "url": "https://www.huffpost.com/entry/donald-trump-omb-funding-freeze-courts_n_679a8d92e4b02e7053bf8d23"
  },
  {
    "text": "White House says Trump funding freeze remains in effect despite rescinding OMB memo … The White House on Wednesday said a “federal funding freeze” remains in “full force and effect” despite it rescinding a controversial memo ordering that freeze on grants and loans to give agencies … ",
    "url": "https://www.cnbc.com/2025/01/29/white-house-rescinds-federal-funds-freeze-memo.html"
  },
  {
    "text": "Another judge is preparing to block Trump's spending freeze, despite White House cleanup  —  U.S. District Judge Jack McConnell said a bid by the White House to rescind a “hugely ambiguous” order implementing the freeze appeared to be undercut by White House press secretary Karoline Leavitt's … ",
    "url": "https://www.politico.com/news/2025/01/29/spending-freeze-blocked-trump-judge-00201341"
  },
  {
    "text": "Trump's First Big Fiasco Triggers Stephen Miller's Rage—Take Note Dems  —  Admitting failure is anathema to the authoritarian leader, who is perpetually in danger of being diminished by those who are resentful of his glory—which is why White House adviser Stephen Miller is frantically searching … ",
    "url": "https://newrepublic.com/article/190875/trump-stephen-miller-rage-democratss"
  },
  {
    "text": "Trump Signs Agreement Calling for Meta to Pay $25 Million to Settle Suit  —  The president had sued the social-media company after his accounts were suspended  —  President Trump has signed settlement papers that are expected to require Meta Platforms to pay roughly $25 million to resolve … ",
    "url": "https://www.wsj.com/us-news/law/trump-signs-agreement-calling-for-meta-to-pay-25-million-to-settle-suit-6f734c8c?st=7ms8uR&reflink=article_imessage_share"
  },
  {
    "text": "Why Meta Is Paying $25 Million to Settle a Trump Lawsuit  —  Donald Trump spent decades in business gleefully suing and angrily being sued by his adversaries in civil court.  But since winning reelection, he has suddenly posted a remarkable string of legal victories as litigants rush to settle their cases.",
    "url": "https://www.theatlantic.com/politics/archive/2025/01/trump-meta-x-settlements/681503/"
  },
  {
    "text": "USDA inspector general escorted out of her office after defying White House  —  Security agents escorted the inspector general of the U.S. Department of Agriculture out of her office on Monday after she refused to comply with her firing by the Trump administration, sources familiar with the matter told Reuters.",
    "url": "https://www.usatoday.com/story/news/politics/2025/01/29/usda-inspector-general-escorted-office-trump-white-house/78024513007/"
  },
  {
    "text": "Fetterman: RFK Jr.'s nomination in trouble after rocky hearing  —  Sen. John Fetterman (D-Pa.), who was thought to be open to voting for Robert F. Kennedy Jr.'s nomination to head the Department of Health and Human Services, now says the nominee is in serious trouble after his rocky confirmation hearing.",
    "url": "https://thehill.com/homenews/senate/5114271-fetterman-rfk-jr-nomination-hearing/"
  },
  {
    "text": "Trump plans to build mass detention camp for deportees at Guantánamo Bay  —  The president ordered construction of a facility with room for 30,000 migrants on the U.S. naval base in Cuba.  —  President Donald Trump on Wednesday ordered the construction of a detention camp with 30,000 beds … ",
    "url": "https://www.washingtonpost.com/immigration/2025/01/29/guantanamo-cuba-el-salvador-deportations/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4MTI2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NTA5MTk5LCJpYXQiOjE3MzgxMjY4MDAsImp0aSI6Ijc5NTk4MzkyLTdkMzctNGM3YS1hZWI3LThmYWM3YTZiYmExNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzAxLzI5L2d1YW50YW5hbW8tY3ViYS1lbC1zYWx2YWRvci1kZXBvcnRhdGlvbnMvIn0.p6vAFrI-7mf90ewNMEqKF2Ey47OMu5V1dELEze-eXwM&itid=gfta"
  },
  {
    "text": "Declassified CIA Guide to Sabotaging Fascism Is Suddenly Viral  —  A declassified World War II-era government guide to “simple sabotage” is currently one of the most popular open source books on the internet.  The book, called “Simple Sabotage Field Manual,” was declassified in 2008 by the CIA and … ",
    "url": "https://www.404media.co/declassified-cia-guide-to-sabotaging-fascism-is-suddenly-viral/"
  },
  {
    "text": "FBI Overhaul Off to a Rocky Start as Kash Patel Prepares to Defend His Vision  —  White House mixes up who is temporarily in charge of agency as Trump loyalist heads into Senate confirmation hearing  —  WASHINGTON—Trump officials tried to start their shake-up of the Federal Bureau … ",
    "url": "https://www.wsj.com/politics/policy/fbi-overhaul-off-to-a-rocky-start-as-kash-patel-prepares-to-defend-his-vision-1085c6f8?st=ChdHtS&reflink=mobilewebshare_permalink"
  },
  {
    "text": "R.F.K. Jr. Appears Unfamiliar With Key Elements of Medicare and Medicaid  —  In testimony to the Senate Finance Committee, Mr. Kennedy seemed to confuse the two government programs that cover more than 150 million Americans.  —  In a tense exchange with Senator Bill Cassidy, Republican of Louisiana … ",
    "url": "https://www.nytimes.com/2025/01/29/health/medicaid-medicare-rfk-jr.html"
  },
  {
    "text": "Ending Radical Indoctrination in K-12 Schooling  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose and Policy.  Parents trust America's schools to provide their children … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/ending-radical-indoctrination-in-k-12-schooling/"
  },
  {
    "text": "I Just Got Trump's “Buyout” Offer at My Job.  Let Me Tell You How That's Going.  —  The author is a federal civil servant who has been granted the use of a pen name to protect them and their family from reprisals.  —  The new Trump administration's effort to both get a grip on and dismantle … ",
    "url": "https://slate.com/news-and-politics/2025/01/donald-trump-news-executive-orders-buyout-freeze-elon-musk.html"
  },
  {
    "text": "Beware the “Deferred Resignation” Offer: A Legally Dubious Proposal for Federal Employees  —  On Tuesday, the Office of Personnel Management (OPM) released a memorandum outlining the details of a “Deferred Resignation Program.”  —  According to OPM, the program allows federal employees … ",
    "url": "https://www.justsecurity.org/107094/deferred-resignation-dubious-federal-employees/"
  },
  {
    "text": "Elon Musk rose to the top of video game charts.  Now he has confessed to cheating.  —  The world's richest man has admitted to paying to boost his online warriors into global leaderboards, raising questions about his gaming prowess — and his need for digital praise.",
    "url": "https://www.washingtonpost.com/technology/2025/01/29/elon-musk-video-games-diablo-path-exile/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4MTI2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NTA5MTk5LCJpYXQiOjE3MzgxMjY4MDAsImp0aSI6ImE5NzNiNzFmLWZhY2ItNDM1OC04MzVjLTgxMDllYzRlOTRmZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDEvMjkvZWxvbi1tdXNrLXZpZGVvLWdhbWVzLWRpYWJsby1wYXRoLWV4aWxlLyJ9.6bhaQaNRUCuNxmd60eJAcRSeK6MxHzLlHhzT1E7HbZ4&itid=gfta"
  },
  {
    "text": "Justice Dept. Is Said to Discuss Dropping Case Against Eric Adams  —  Senior officials under President Trump have talked with prosecutors in Manhattan about the possibility of abandoning the corruption case against Mr. Adams, the mayor of New York City.  —  Senior Justice Department officials … ",
    "url": "https://www.nytimes.com/2025/01/29/us/politics/justice-department-trump-charges-eric-adams.html?unlocked_article_code=1.s04.B-oP.OpKu5OrpcZNe&smid=url-share"
  },
  {
    "text": "Trump's Tech Donors Have Big Plans For Greenland  —  A Trump takeover of Greenland could open the door to tech moguls' mineral interests and their utopian aspirations.  —  President Donald Trump started his second term with his sights set on Greenland.",
    "url": "https://www.levernews.com/trumps-tech-donors-have-big-plans-for_greenland/"
  },
  {
    "text": "Denver schools under investigation over all-gender bathroom  —  The Department of Education launched an investigation Tuesday against Denver Public Schools for converting a girl's restroom into an all-gender bathroom.  —  The department's Office for Civil Rights said it is investigating … ",
    "url": "https://thehill.com/homenews/education/5112890-denver-public-schools-all-gender-bathroom-investigation/"
  },
  {
    "text": "RFK Jr. Accidentally Reveals Trump's Plan on Abortion  —  Here we go: At his confirmation hearing today, RFK Jr. revealed how the Trump administration is thinking about restricting abortion—dropping hints not just about mifepristone, but abortion ‘complication’ reporting, emergency abortions, and the possibility of a national ban.",
    "url": "https://jessica.substack.com/p/rfk-jr-hearing-abortion-transcript"
  },
  {
    "text": "Pentagon agency pauses celebrations for Martin Luther King Jr. Day, Black History Month and more  —  The Defense Department's intelligence agency has paused observances of Martin Luther King Jr. Day, Pride Month, Holocaust Days of Remembrance and other cultural or historical annual events … ",
    "url": "https://apnews.com/article/trump-holiday-mlk-day-pride-black-hispanic-dei-047bbdbfc12ea6e9a9731f5861d84e70"
  },
  {
    "text": "Former Sen. Bob Menendez sentenced to 11 years corruption and bribery case  —  Menendez resigned from the Senate after his conviction last year  —  Former U.S. Sen. Bob Menendez was sentenced Wednesday to 11 years in prison for selling his once-considerable clout in Washington for gold bars … ",
    "url": "https://www.nbcnewyork.com/new-jersey/former-new-jersey-senator-bob-menendez-sentence/6126544/"
  },
  {
    "text": "All flights halted at Reagan National Airport due to plane crash  —  At this time it is unclear what caused the plane to go down.  —  WASHINGTON — Police are investigating a plane crash near Ronald Reagan Washington National Airport.  —  DC Fire and EMS say, on Wednesday night … ",
    "url": "https://www.wusa9.com/article/travel/all-flights-halted-at-reagan-national-airport-due-to-plane-crash-potomac-river-dc/65-e2090f2d-0bca-4a4c-944c-215a6398a52d"
  },
  {
    "text": "Musk team's push to gut federal workforce bypassed key Trump officials  —  Billionaire Elon Musk has worked behind the scenes on an initiative aimed at depleting the civil service, prompting questions about its legality.  —  Billionaire Elon Musk's influence over a traditionally nonpartisan agency … ",
    "url": "https://www.washingtonpost.com/business/2025/01/29/elon-musk-opm-federal-workers-buyout-trump/"
  },
  {
    "text": "Trump's Inaugural Approval Rating Is Historically Low Again  —  Americans divided over whether Trump's pace in addressing major U.S. problems is about right or too fast  —  WASHINGTON, D.C. — At 47%, President Donald Trump's initial job approval rating for his second term is similar … ",
    "url": "https://news.gallup.com/poll/655955/trump-inaugural-approval-rating-historically-low-again.aspx"
  },
  {
    "text": "Franklin County woman pardoned for Capitol riot is sentenced to 10 years in fatal crash  —  UNION, Mo. — The Franklin County woman pardoned for her participation in the U.S. Capitol insurrection on Jan. 6, 2021 was sentenced Wednesday to 10 years in prison for her role in a fatal drunk driving crash.",
    "url": "https://www.stltoday.com/news/local/crime-courts/emily-hernandez-pardoned-for-capitol-riot-sentenced-to-17-years-in-fatal-dwi-crash/article_bf4def6e-de51-11ef-a3a0-97de6fd4bd53.html"
  },
  {
    "text": "Trump administration to cancel student visas of pro-Palestinian protesters  —  U.S. President Donald Trump will sign an executive order on Wednesday to combat antisemitism and pledge to deport non-citizen college students and others who took part in pro-Palestinian protests, a White House official said.",
    "url": "https://www.reuters.com/world/us/trump-administration-cancel-student-visas-all-hamas-sympathizers-white-house-2025-01-29/"
  }
]