[
  {
    "text": "Trump Aborts Interview after Smart Black Women Ask Tough Questions  —  I'm an outlier about the value of the disastrous interview Donald Trump just did with three Black women journalists: Rachel Scott, Kadia Goba, and Harris Faulkner.  I think the interview will help Trump reclaim the attention of the press.",
    "url": "https://www.emptywheel.net/2024/07/31/trump-aborts-interview-after-smart-black-women-ask-tough-questions/"
  },
  {
    "text": "Hostile Trump takes the stage at Black journalists' conference  —  The former president claimed to be the best president for Black people since Abraham Lincoln and suggested his Democratic opponent, Kamala Harris, used her race to help her get elected.  —  Within moments of Donald Trump taking … ",
    "url": "https://www.politico.com/news/2024/07/31/donald-trump-nabj-interview-00172104"
  },
  {
    "text": "Donald Trump falsely questions Kamala Harris' race as he appears at gathering of Black journalists  —  CHICAGO (AP) — Donald Trump falsely questioned Kamala Harris' race during an appearance before the National Association of Black Journalists in Chicago that quickly turned hostile on Wednesday.",
    "url": "https://apnews.com/article/trump-black-journalists-convention-nabj-1e96aa530e88013ed6f577feaf89ccb6"
  },
  {
    "text": "White Man Tells Black Journalists His Black Opponent Is Not Black  —  Former President Donald Trump's appearance at the National Association of Black Journalists' annual convention on Wednesday shocked audience members within its opening minutes, as the GOP presidential nominee insulted the moderators … ",
    "url": "https://www.motherjones.com/politics/2024/07/trump-nabj-racist-harris-interview/"
  },
  {
    "text": "Trump questions whether Harris is ‘Black’ at conference of Black journalists  —  Republican presidential candidate Donald Trumpquestioned whether his Democratic rival Kamala Harris is “Black” during a contentious appearance at the country's largest annual gathering of Black journalists on Wednesday.",
    "url": "https://www.reuters.com/world/us/trump-sitdown-black-journalists-convention-sparks-backlash-2024-07-31/"
  },
  {
    "text": "Hamas leader Ismail Haniyeh assassinated in Tehran  —  Hamas: Haniyeh killed in “a treacherous Zionist raid” in the Iranian capital  • Israel yet to take responsibility for assassination  —  Hamas leader Ismail Haniyeh was assassinated in the Iranian capital of Tehran early Wednesday morning … ",
    "url": "https://www.jpost.com/breaking-news/article-812649"
  },
  {
    "text": "Trump Flipped Out That ‘Lunatic’ Project 2025 Could Tank His Campaign  —  The former president effectively “birthed” Project 2025.  Now that the project is a political liability, one of Trump's foot soldiers is out of a job  —  AS HE ENTERED the final stretch of the 2024 presidential race … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-project-2025-abortion-campaign-1235071152/"
  },
  {
    "text": "Accused Sept. 11 Plotters Agree to Plead Guilty at Guantánamo Bay  —  Word of the deal emerged in a letter from prosecutors to family members of victims of the attacks.  —  The man accused of plotting the attacks of Sept. 11 and two of his accomplices have agreed to plead guilty … ",
    "url": "https://www.nytimes.com/2024/07/31/us/politics/sept-11-guilty-plea.html"
  },
  {
    "text": "Trump Allies Believe Kellyanne Conway Is Badmouthing JD Vance  —  DONALD TRUMP'S 2024 PRESIDENTIAL CAMPAIGN is facing its biggest stress-test yet.  And already the pressure is widening subterranean cracks of mistrust and rivalry.  —  The fault lines emerged rapidly as Trump's VP pick … ",
    "url": "https://www.thebulwark.com/p/trump-allies-kellyanne-conway-badmouthing-vance"
  },
  {
    "text": "Army's $11 Million Deal With The Rock Backfires Spectacularly  —  ‘CATASTROPHIC’  —  The Army reportedly spent millions getting Dwayne ‘The Rock’ Johnson and his United Football League to drive up recruitment, only to end up losing enlistments.  —  The U.S. Army's $11 million advertising deal … ",
    "url": "https://www.thedailybeast.com/us-armys-dollar11-million-deal-with-the-rock-backfires-spectacularly"
  },
  {
    "text": "I Was at the Kamala Harris Rally in Atlanta.  What You're Seeing Is Very Real.  —  In the past two years, Vice President Kamala Harris has made so many visits to Georgia that Atlantans frustratedly joke that perhaps she doesn't know that there are 49 other states or that maybe she's looking for real estate in the Southern city.",
    "url": "https://slate.com/news-and-politics/2024/07/kamala-harris-say-it-to-my-face-atlanta-quavo-megan-thee-stallion-trump-debate.html"
  },
  {
    "text": "Autoworkers Union Endorses Kamala Harris for President  —  The United Automobile Workers had backed President Biden but did not immediately endorse the vice president.  Ms. Harris will rally with U.A.W. members in Detroit next week.  —  The United Automobile Workers endorsed Vice President Kamala Harris … ",
    "url": "https://www.nytimes.com/2024/07/31/us/politics/uaw-kamala-harris.html"
  },
  {
    "text": "More Than 100 Silicon Valley Investors Pledge to Support Kamala Harris  —  The group, including Democratic donors such as Reid Hoffman and Vinod Khosla, has been organized under an effort called VCsForKamala.  —  More than 100 venture capitalists said on Wednesday that they had pledged … ",
    "url": "https://www.nytimes.com/2024/07/31/technology/silicon-valley-investors-support-kamala-harris.html"
  },
  {
    "text": "Maya Rudolph returning to play Harris on ‘SNL’  —  Maya Rudolph is reportedly making her return as Kamala Harris on “Saturday Night Live” as the vice president's White House campaign kicks into full gear.  —  The “SNL” alum, who famously first portrayed the then-California senator … ",
    "url": "https://thehill.com/blogs/in-the-know/4803190-maya-rudolph-kamala-harris-snl-saturday-night-live-nbc/"
  },
  {
    "text": "New Jan. 6 security tapes reveal Trump alleged co-conspirator handing off fake elector docs to aides for key lawmaker: Report  —  Newly released security tapes from House Republicans appear to show key evidence underpinning elements of Donald Trump's alleged fake electors scheme in multiple states … ",
    "url": "https://lawandcrime.com/high-profile/new-jan-6-security-tapes-reveal-trump-alleged-co-conspirator-handing-off-fake-elector-docs-to-aides-for-key-lawmaker-report/"
  },
  {
    "text": "Scoop: Wall Street thinks Kamala Harris picking governor for VP … - If the campaign signals are being correctly interpreted, that would narrow the veepstakes down to Kentucky Gov. Andy Beshear, Pennsylvania Gov. Josh Shapiro, and Minnesota Gov. Tim Walz.  — Some donors in the financial services … ",
    "url": "https://www.axios.com/2024/07/31/kamala-harris-vp-pick-wall-street-donors"
  },
  {
    "text": "RFK Jr.'s campaign struggles with Harris in race  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions  — descriptions off, selected",
    "url": "https://thehill.com/homenews/campaign/4800614-robert-kennedy-campaign-troubles/"
  },
  {
    "text": "X suspends ‘White Dudes for Harris’ account after massive fundraiser  —  The account was reinstated, but the issue sparked concerns about how Musk could use X to sway voters, even as Republicans welcome his influence.  —  SAN FRANCISCO — Elon Musk's social media platform X suspended … ",
    "url": "https://www.washingtonpost.com/technology/2024/07/30/white-dudes-harris-suspended-x-twitter/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIyMzEyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzIzNjk0Mzk5LCJpYXQiOjE3MjIzMTIwMDAsImp0aSI6IjU5OTM0MmVhLTlkYzAtNGE1Ny05YjBiLWQ1ZjkyOTYzZjcwYyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjQvMDcvMzAvd2hpdGUtZHVkZXMtaGFycmlzLXN1c3BlbmRlZC14LXR3aXR0ZXIvIn0.cWe0jwql8I6h06KSd2FGzP1C99fsKs9IAfOFqCBCpPA&itid=gfta"
  },
  {
    "text": "Rick Wilson on the weirdness of JD Vance  —  “The Mountain Dew jokes, the awkward campaign videos — it just doesn't connect.”  —  ∙ Paid … Like many liberals, I quietly hoped heading into the RNC that Donald Trump would pick JD Vance as his running mate, because I suspected it might go badly.",
    "url": "https://www.publicnotice.co/p/rick-wilson-interview-jd-vance-trump-weird"
  },
  {
    "text": "10 Days: Kamala Harris has not held a press conference since emerging as presumptive Democratic nominee  —  Critics feel Harris is copying President Biden's 2020 playbook  —  Vice President Kamala Harris has gone 10 days without holding a press conference since becoming the presumptive Democratic nominee.",
    "url": "https://www.foxnews.com/media/10-days-kamala-harris-not-held-press-conference-since-emerging-presumptive-democratic-nominee"
  },
  {
    "text": "Exclusive: How Samuel Alito got canceled from the Supreme Court social media majority  —  The hardline approach Supreme Court Justice Samuel Alito takes usually gets him what he wants.  —  This year it backfired.  —  Behind the scenes, the conservative justice sought to put a thumb … ",
    "url": "https://www.cnn.com/2024/07/31/politics/samuel-alito-supreme-court-netchoice-social-media-biskupic/"
  }
]