[
  {
    "text": "On the Campaign Trail, Elon Musk Juggled Drugs and Family Drama  —  As Mr. Musk entered President Trump's orbit, his private life grew increasingly tumultuous and his drug use was more intense than previously known.  —  As Elon Musk became one of Donald J. Trump's closest allies last year … ",
    "url": "https://www.nytimes.com/2025/05/30/us/elon-musk-drugs-children-trump.html?unlocked_article_code=1.LE8.YA7T.1z0vkogrzeCV&smid=url-share"
  },
  {
    "text": "Trump's Team Plots Plan B for Imposing Tariffs  —  If a court appeal fails, president's advisers are considering a stopgap tariff regime  —  WASHINGTON—President Trump's trade team is readying its Plan B.  —  The administration's tariff strategy was undermined when a court this week found … ",
    "url": "https://www.wsj.com/economy/trade/trump-trade-tariff-strategy-pivot-bfe11596"
  },
  {
    "text": "Elon Musk's Legacy Is Disease, Starvation and Death  —  There is an Elon Musk post on X, his social media platform, that should define his legacy.  “We spent the weekend feeding USAID into the wood chipper,” he wrote on Feb. 3.  He could have “gone to some great parties.  Did that instead.”",
    "url": "https://www.nytimes.com/2025/05/30/opinion/elon-musk-doge-usaid.html?unlocked_article_code=1.LE8.M8Vw.raMdU_L48AEh&smid=bs-share"
  },
  {
    "text": "White House Health Report Included Fake Citations  —  A report on children's health released by the Make America Healthy Again Commission referred to scientific papers that did not exist.  —  The Trump administration released a report last week that it billed as a “clear, evidence-based foundation” … ",
    "url": "https://www.nytimes.com/2025/05/29/well/maha-report-citations.html"
  },
  {
    "text": "White House MAHA Report may have garbled science by using AI, experts say  —  The report, led by Health and Human Services Secretary Robert F. Kennedy Jr., was intended to address the reasons for the decline in Americans' life expectancy.  —  Some of the citations that underpin the science … ",
    "url": "https://www.washingtonpost.com/health/2025/05/29/maha-rfk-jr-ai-garble/"
  },
  {
    "text": "Trump Taps Palantir to Compile Data on Americans … Alex Karp, a co-founder and the chief executive of Palantir, at a forum in Washington in April.  The Trump administration has expanded Palantir's work across the federal government.Caroline Gutman for The New York Times",
    "url": "https://www.nytimes.com/2025/05/30/technology/trump-palantir-data-americans.html?unlocked_article_code=1.LE8.jmh8.yvBmMb_-hjDt&smid=url-share"
  },
  {
    "text": "Trump Administration Knew Vast Majority of Venezuelans Sent to Salvadoran Prison Had Not Been Convicted of U.S. Crimes  —  Homeland Security records reveal that officials knew that more than half of the 238 deportees were labeled as having no criminal record in the U.S. and had only violated immigration laws.",
    "url": "https://www.propublica.org/article/trump-el-salvador-deportees-criminal-convictions-cecot-venezuela"
  },
  {
    "text": "Federal Authorities Probe Effort to Impersonate White House Chief of Staff  —  An unknown individual impersonated Susie Wiles in calls and texts to prominent Republicans and business executives  —  WASHINGTON—Federal authorities are investigating a clandestine effort to impersonate White House chief … ",
    "url": "https://www.wsj.com/politics/policy/federal-authorities-probe-effort-to-impersonate-white-house-chief-of-staff-65da0d59?st=gJtJuu"
  },
  {
    "text": "State Department set to launch ‘Office of Remigration’  —  The concept of remigration has explicitly neo-Nazi roots and has been popularized in Europe. … Secretary Marco Rubio's State Department published a reorganization chart Thursday morning showing massive cuts to diplomatic offices and functions, plus a few new additions.",
    "url": "https://www.thehandbasket.co/p/state-department-office-of-remigration"
  },
  {
    "text": "Stocks slide after Trump accuses China of violating Geneva trade agreement  —  “So much for being Mr. NICE GUY!” the president wrote on Truth Social.  —  President Donald Trump sent stock futures diving early Friday after he accused China of breaking a handshake pact the two countries … ",
    "url": "https://www.nbcnews.com/business/business-news/trump-accuses-china-violating-geneva-trade-agreement-rcna209920"
  },
  {
    "text": "Supreme Court allows Trump to revoke legal status for 530K migrants for now  —  The decision lets the Trump administration end, for now, a program that let migrants from Cuba, Haiti, Nicaragua and Venezuela live and work in the U.S. for up to two years.  —  A divided Supreme Court … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/30/scotus-parole-immigration-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ4NTc3NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ5OTU5OTk5LCJpYXQiOjE3NDg1Nzc2MDAsImp0aSI6IjVhMmRhN2VhLWQyMWYtNGY3Yi1iODk1LThkNTQ2NTQzYmRjOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA1LzMwL3Njb3R1cy1wYXJvbGUtaW1taWdyYXRpb24tdHJ1bXAvIn0.iYJ2JrkkDs3R1ycjI5c3qrN2euYMv8wdI5bNJbtdBGs&itid=gfta"
  },
  {
    "text": "White House pressure for increased immigration arrests strains law enforcement agencies  —  The Trump administration is building up federal manpower and resources to meet the White House's desire to triple the number of daily immigration arrests - signaling a renewed push to go well beyond efforts from previous administrations.",
    "url": "https://cnn.com/2025/05/29/politics/white-house-immigration-arrests-law-enforcement-agencies"
  },
  {
    "text": "State begins rolling out expanded student visa vetting — starting with Harvard  —  The State Department issued instructions to consulates and embassies late Thursday telling them to start the vetting immediately.  —  The State Department has told U.S. consulates and embassies … ",
    "url": "https://www.politico.com/news/2025/05/30/state-implements-reviews-of-harvard-visa-applicants-social-media-accounts-00375921"
  },
  {
    "text": "OPM ‘merit’ hiring plan includes bipartisan reforms, politicized new test  —  Federal job applicants will soon be quizzed on their favorite Trump administration policy as part of the hiring process, according to the Office of Personnel Management's new “merit hiring plan.”",
    "url": "https://www.govexec.com/workforce/2025/05/opm-merit-hiring-plan-includes-bipartisan-reforms-politicized-new-test/405687/"
  },
  {
    "text": "Trump's Flurry of Pardons Signals a Wholesale Effort to Redefine Crime  —  Critics say President Trump has used the vast pardon powers of the presidency not to settle accounts, as President Biden did, but to burn the ledger.  —  President Trump is employing the vast power of his office … ",
    "url": "https://www.nytimes.com/2025/05/29/us/politics/trumps-pardons-redefine-crime.html?unlocked_article_code=1.LE8.J1iu.p7ywbZmZeUcj&smid=nytcore-android-share"
  },
  {
    "text": "Michigan Gov. Whitmer says Trump promised not to pardon kidnapping plotters  —  On Wednesday, Trump told reporters that he would “take a look at” pardoning the men, saying the trial looked “like somewhat of a railroad job.”  —  Michigan Gov. Gretchen Whitmer (D) said Thursday … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/29/trump-pardon-whitmer-kidnapping-plot/"
  },
  {
    "text": "How Trump's Regulatory Rollbacks Are Increasing Costs on Americans  —  A new DOGE tally claims that erasing rules on credit card fees, appliance standards and health insurance “saves the American people” money.  Data show the opposite.  —  When the Biden administration enacted regulations … ",
    "url": "https://www.nytimes.com/2025/05/30/us/politics/doge-cuts-elon-musk-trump.html"
  },
  {
    "text": "Go, Elon, and Never Darken Our Doors Again  —  The worst ultra-billionaire on Earth says he's leaving government.  Let's hope he actually does it.  —  Elon Musk in Doha, Qatar, earlier this month  —  Elon Musk is out of the Trump administration—or is he?",
    "url": "https://prospect.org/power/2025-05-30-go-elon-never-darken-our-doors-again/"
  },
  {
    "text": "WIRED Talked to a Fired DOGE Staffer About Who Was Really in Charge  —  Sahil Lavingia, who says he was fired from DOGE after speaking out about his experiences there, told WIRED about how he communicated with the group, who appears to be in charge, and what might be coming next.",
    "url": "https://www.wired.com/story/fired-doge-staffer-who-is-in-charge/"
  },
  {
    "text": "Bernard Kerik, who led NYPD on 9/11 before prison and pardon, has died at 69  —  Bernard Kerik, who served as New York City's police commissioner on 9/11 and later pleaded guilty to tax fraud before being pardoned, has died.  He was 69.  —  The New York Police Department confirmed his death Thursday on social media.",
    "url": "https://apnews.com/article/bernie-kerik-obit-1ed18ffa7da87bd824dc976eabd51fbf"
  },
  {
    "text": "Why Are Republicans Planning to Tax University Endowments More Heavily Than Other Forms of Private Wealth?  —  There isn't a legitimate public purpose.  The intent is punitive and political.  —  A view of the Harvard University campus on May 24, 2025, in Cambridge, Massachusetts",
    "url": "https://prospect.org/education/2025-05-30-why-republicans-planning-to-tax-university-endowments/"
  },
  {
    "text": "I'm Normally a Mild Guy.  Here's What's Pushed Me Over the Edge.  —  When I was a baby pundit, my mentor, Bill Buckley, told me to write about whatever made me angriest that week.  I don't often do that, mostly because I don't get angry that much — it's not how I'm wired.  But this week I'm going with Bill's advice.",
    "url": "https://www.nytimes.com/2025/05/29/opinion/trump-vance-morality.html?unlocked_article_code=1.LE8._YF_.4_wxgGNln2k6&smid=url-share"
  },
  {
    "text": "Digital Corruption Takes Over DC  —  I spent my very early years in Utica, New York.  I was too young to know anything about the city's reputation — I left when I was 8 — but I would later learn that it was known at the time as “Crime City,” because it was reportedly controlled by the Mob.",
    "url": "https://paulkrugman.substack.com/p/digital-corruption-takes-over-dc"
  },
  {
    "text": "Red State Voters Approved Progressive Measures.  GOP Lawmakers Are Trying to Undermine Them.  —  Across the country, Republican lawmakers have been working to undermine or altogether undo the will of the voters by making it harder to pass amendments and laws through citizen-led initiatives.",
    "url": "https://www.propublica.org/article/red-state-ballot-initiatives-gop-republicans-florida-missouri"
  },
  {
    "text": "SpaceX Starship failure casts further doubt on NASA's moon landing timeline  —  NASA needs Starship for its scheduled lunar landing in 2027, but three consecutive test missions have ended with the spacecraft breaking apart and raining debris.  —  NASA hopes to put astronauts on the moon in just two years … ",
    "url": "https://www.washingtonpost.com/science/2025/05/29/spacex-starship-launch-nasa-moon-landing/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ4NDkxMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ5ODczNTk5LCJpYXQiOjE3NDg0OTEyMDAsImp0aSI6ImQ4NDM5YTc2LTk0OWItNDE3NS04ZTRiLTljZjllOWFhYzc1OCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9zY2llbmNlLzIwMjUvMDUvMjkvc3BhY2V4LXN0YXJzaGlwLWxhdW5jaC1uYXNhLW1vb24tbGFuZGluZy8ifQ.hRibLOw4EkmIT1WmFLM9XyPBzRyn7nTXAydNPnAmzI8&itid=gfta"
  },
  {
    "text": "Alexandria Ocasio-Cortez: ‘The People Will Show Me the Way’  —  The New York Congresswoman talks about her Fight Oligarchy tour, artificial intelligence, cuts to Medicaid, and taking on Trump  —  I  —  t's an early May afternoon in Washington, D.C., and as a group of demonstrators gather outside … ",
    "url": "https://www.rollingstone.com/politics/politics-features/alexandria-ocasio-cortez-fight-oligarchy-interview-1235349605/"
  },
  {
    "text": "American doctors look to relocate to Canada to avoid the Trump administration  —  Earlier this year, as President Donald Trump was beginning to reshape the American government, Michael, an emergency room doctor who was born, raised, and trained in the United States, packed up his family and left the country.",
    "url": "https://www.npr.org/sections/shots-health-news/2025/05/29/nx-s1-5414345/american-doctors-look-to-relocate-to-canada-to-avoid-the-trump-administration"
  }
]