[
  {
    "text": "Embattled Voice of America's fate uncertain after brief apparent reprieve  —  Trump has targeted the government-funded media outlet that has been off the air for almost two months.  —  The future of Voice of America remains in flux after a federal appellate court Saturday paused a ruling reversing … ",
    "url": "https://www.politico.com/news/2025/05/03/voice-of-america-resume-broadcasting-00325193"
  },
  {
    "text": "Voice of America's fate still in flux after appeals court pauses back-to-work orders  —  Less than two months ago, when the Trump administration turned off the Voice of America's networks and websites, Kari Lake, a fierce loyalist to President Donald Trump, said the agency is “unsalvageable.”",
    "url": "https://cnn.com/2025/05/03/media/voice-of-america-return-trump-lake"
  },
  {
    "text": "How Trump lost conservatives the Australian election  —  Prime Minister Anthony Albanese is on track to form a majority government, powered by a backlash to U.S.-style MAGA politics.  —  SYDNEY, Australia — Incumbent Prime Minister Anthony Albanese secured a come-from-behind win … ",
    "url": "https://www.politico.eu/article/donald-trump-cost-conservative-australia-election-takeaway/"
  },
  {
    "text": "L.A. federal prosecutors resign over plea deal for convicted sheriff's deputy, sources say  —  Several federal prosecutors — including the chief of the Public Corruption and Civil Rights Section — have submitted their resignations following a plea deal offered by the new U.S. attorney … ",
    "url": "https://www.latimes.com/california/story/2025-05-03/los-angeles-federal-prosecutors-resign-deputy-plea"
  },
  {
    "text": "Vance defends Trump's post depicting AI-generated image of himself as pope  —  The vice president said he is “fine with people telling jokes.”  —  Vice President JD Vance defended President Donald Trump after he posted an AI image of himself as pope on Truth Social, dismissing the post as a joke.",
    "url": "https://www.politico.com/news/2025/05/03/vance-ai-pope-trump-00325197"
  },
  {
    "text": "Company Boasts Spending Up To $20 Million On Trump Crypto Coin To Buy Influence  —  The arrangement puts money in Trump's pocket in return for the opportunity to change policy — exactly the sort of pay-to-play scheme critics warned about.  —  WASHINGTON — An international trucking logistics firm … ",
    "url": "https://www.huffpost.com/entry/trump-coins-freight-influence_n_68153967e4b03d516aad99d3"
  },
  {
    "text": "Here's the source code for the unofficial Signal app used by Trump officials  —  Yesterday, I published an analysis of what I could publicly find about TM SGNL, the obscure and unofficial Signal app used by Mike Waltz, and presumably also by Pete Hegseth, JD Vance, Tulsi Gabbard, and other fascists in Trump's government.",
    "url": "https://micahflee.com/heres-the-source-code-for-the-unofficial-signal-app-used-by-trump-officials/"
  },
  {
    "text": "Elon Musk's Starbase on its way to becoming a Texas city after lopsided early voting results  —  The South Texas home of Elon Musk's SpaceX rocket company is on its way to becoming an official city with a galactic name: Starbase.  A vote Saturday to formally organize Starbase as a city … ",
    "url": "https://apnews.com/article/elon-musk-starbase-texas-city-7863bf3bac65e9718eef19b27978933b"
  },
  {
    "text": "‘A cocktail for a misinformed world’: why China and Russia are cheering Trump's attacks on media  —  Today on World Press Freedom Day, there are warnings that US attempts to withdraw from promoting independent journalism will have far-reaching effects  —  As Donald Trump's executive order … ",
    "url": "https://www.theguardian.com/global-development/ng-interactive/2025/may/03/a-cocktail-for-a-misinformed-world-why-china-and-russia-are-cheering-trumps-attacks-on-us-media"
  },
  {
    "text": "AP PHOTOS: Many in Gaza face malnutrition and hunger as blockade enters its third month  —  Malnutrition and hunger are becoming increasingly prevalent in the Gaza Strip as Israel's total blockade enters its third month.  A shortage of food and supplies has driven the territory toward starvation, according to aid agencies.",
    "url": "https://apnews.com/article/gaza-israel-palestinians-malnutrition-children-2756d23409216bf1721ae3b2ca9d9d31"
  },
  {
    "text": "How Misinformation and Partisan ‘New Media’ Changed a California Town  —  Residents of Oakdale, Calif., have abandoned traditional media outlets for a mishmash of online sources.  These days, they're often not sure what information to trust.  —  As time has gone on, traditional news outlets in Oakdale … ",
    "url": "https://www.nytimes.com/2025/05/03/technology/news-misinformation-facebook-oakdale.html"
  },
  {
    "text": "Trump is trying to chill the investigative journalism that holds him to account  —  So much of what the public knows about President Trump's chaotic governance stems from robust reporting, including leaks from anonymous sources in the government.  —  But Trump and his aides are now actively trying … ",
    "url": "https://cnn.com/2025/05/03/media/analysis-trump-world-press-freedom-day-chill-journalism"
  },
  {
    "text": "Lawsuit Against Humanities Endowment Offers Details on DOGE  —  Three scholarly groups are challenging the recent cancellation of most grants by the National Endowment for the Humanities.  —  Three major scholarly groups have sued the National Endowment for the Humanities and Elon Musk's Department … ",
    "url": "https://www.nytimes.com/2025/05/02/arts/humanities-endowment-doge-grants.html"
  },
  {
    "text": "Visual Analysis Shows U.S. Likely Bombed Yemen Migrant Detention Center  —  Videos and photos reveal remnants of at least three U.S.-made GBU-39 bombs at the site of an April 28 attack.  The strike killed 68 African migrants, according to the Houthis, a militant group that controls northern Yemen.",
    "url": "https://www.nytimes.com/video/world/middleeast/100000010137049/us-bombing-yemen-migrant-shelter.html?smtyp=cur&smid=bsky-nytimes"
  },
  {
    "text": "Trump Rages at Own Judge After Ruling Halting Deportations Under Wartime Act  —  DID IT TO YOURSELF  —  “Our Country, as we know it, is finished!” the president wrote after a court ruled he could not deport migrants without due process.  —  President Donald Trump had a meltdown Saturday … ",
    "url": "https://www.thedailybeast.com/trump-rages-at-own-judge-after-ruling-halting-deportations-under-wartime-act/"
  },
  {
    "text": "Justice Department hasn't filed Eric Adams docs, despite court order  —  The public may not see any other documents in this case.  —  NEW YORK — The Justice Department failed to publicly disclose documents in the now-dismissed corruption case against New York City Mayor Eric Adams by a Friday deadline … ",
    "url": "https://www.politico.com/news/2025/05/03/eric-adams-search-warrant-00325199"
  },
  {
    "text": "Trump administration plans to cut thousands of employees at spy agencies  —  Sources familiar with the situation said the downsizing would cut about 1,000 to 1,200 employees at the Central Intelligence Agency.  —  The Trump administration plans to significantly shrink the workforce … ",
    "url": "https://www.nbcnews.com/politics/national-security/trump-administration-cut-thousands-employees-spy-agencies-rcna204648"
  },
  {
    "text": "More than 15,000 USDA employees take Trump's offer to resign  —  Their departures will affect how the department administers food safety and nutrition programs, conducts research and offers services to farmers.  —  At least 15,000 Agriculture Department employees have taken … ",
    "url": "https://www.politico.com/news/2025/05/03/more-than-15000-employees-resign-agriculture-department-trump-00324834"
  },
  {
    "text": "An unwelcome surge of rightwing populism in Britain  —  Rise of Nigel Farage's Reform UK threatens the Labour-Conservative duopoly  —  The populist-nationalist bug first gripped the UK in the 2016 referendum vote to leave the EU.  Yet Britain has long seemed an outlier among its peers … ",
    "url": "https://www.ft.com/content/dd6dff7d-c2c4-49ec-a11e-eb9e2130ccbb"
  },
  {
    "text": "Harvard's President Alan Garber Talks About His Legal Fight With Trump  —  Alan Garber became a hero to liberals after Harvard resisted the federal government.  At the same time, he is trying to remake campus culture in ways the Trump administration might appreciate.",
    "url": "https://www.nytimes.com/2025/05/03/us/harvard-alan-garber-trump-administration.html"
  },
  {
    "text": "Justice Department will switch its focus on voting and prioritize Trump's elections order, memo says  —  The Justice Department unit that ensures compliance with voting rights laws will switch its focus to investigating voter fraud and ensuring elections are not marred by “suspicion,” … ",
    "url": "https://apnews.com/article/trump-justice-department-voting-rights-elections-fraud-0717d58a10daa11b3957d277a7ca8e0e"
  }
]