[
  {
    "text": "The NIH budget is on a fast track to disaster  —  An NIH insider explains what Republicans are likely to do next, and what we can do … A Trump administration budget proposal leaked a few days ago specifies a massive budget cut for NIH — 44%, for over $20 billion in cuts.",
    "url": "https://donmoynihan.substack.com/p/the-nih-budget-is-on-a-fast-track"
  },
  {
    "text": "Rough Night for Republican at Town Hall in N.Y. Swing District  —  Representative Mike Lawler faced shouts, groans and mockery at a high school auditorium in Rockland County.  —  No one was expecting a love fest when Representative Mike Lawler, Republican of New York, faced constituents in his suburban swing district on Sunday night.",
    "url": "https://www.nytimes.com/2025/04/27/nyregion/mike-lawler-town-hall-trump.html"
  },
  {
    "text": "New Yorkers Boo and Jeer GOP's Lawler at Circus-Like Town Hall  —  Boos, shouts and insults dominated New York Representative Mike Lawler's rowdy town hall on Sunday as the GOP lawmaker's constituents seethed over President Donald Trump and Republicans in Congress.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-28/new-yorkers-boo-and-jeer-gop-s-lawler-at-circus-like-town-hall"
  },
  {
    "text": "The group chats that changed America  —  THE SCOOP  —  Last Thursday morning, a bit before 10 am in Austin and nearly 11 pm in Singapore, Joe Lonsdale had enough of Balaji Srinivasan's views on China.  —  “This is insane CCP thinking,” Lonsdale, a co-founder of Palantir, wrote to a 300-member Signal group.",
    "url": "https://www.semafor.com/article/04/27/2025/the-group-chats-that-changed-america"
  },
  {
    "text": "Why Trump's Sinking Poll Numbers Matter  —  The White House got an early start this morning.  Minutes ago, Press Secretary Karoline Leavitt took to the briefing-room podium to announce a pair of executive orders: one focused on “strengthening and unleashing” American law enforcement to pursue criminals … ",
    "url": "https://www.thebulwark.com/p/why-trump-sinking-poll-numbers-matter-unpopularity-india-pakistan-kashmir-canada-election"
  },
  {
    "text": "Public sours on Musk's role, is skeptical that government is cutting waste  —  Thirty-five percent of Americans approve of the way Musk is handling his job in the Trump administration, while 57 percent disapprove, a Washington Post-ABC News-Ipsos poll shows.",
    "url": "https://www.washingtonpost.com/politics/2025/04/28/elon-musk-approval-poll/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1ODEyODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3MTk1MTk5LCJpYXQiOjE3NDU4MTI4MDAsImp0aSI6IjU2NzQxYmFmLTc5YmItNGY5Yy04MjYxLWQwOWIwZjE2ZjIzNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA0LzI4L2Vsb24tbXVzay1hcHByb3ZhbC1wb2xsLyJ9.wh8fPuJZk0_CtAM_luC3gihhSi8XPSvRMlcizKm6NCc&itid=gfta"
  },
  {
    "text": "‘I Run the Country and the World’ … b  —  efore we begin, a primer on the science of arranging an interview with a sitting American president:  —  In ordinary times, reporters seeking an on-the-record encounter with the commander in chief first write an elaborate proposal.",
    "url": "https://www.theatlantic.com/magazine/archive/2025/06/trump-second-term-comeback/682573/?gift=6kW-3kpyH7tV4NcHqyTUk6dZXip7KOQwTq2ATPDn24k&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "White House threatens to veto Senate measure nixing Trump's global tariffs  —  The White House is warning that President Donald Trump will veto a bipartisan Senate resolution that would terminate his sweeping global “Liberation Day” tariffs.  The statement of administration policy from the Office … ",
    "url": "https://www.politico.com/live-updates/2025/04/28/congress/trump-tariff-veto-threat-00312199"
  },
  {
    "text": "Agriculture isn't nearing trade war tariffs crisis, ‘it is full blown crisis already’ farmers say … The clock is ticking on trade deals that the U.S. will need to strike with many nations, most notably China, to avoid what Trump's Treasury Secretary has described as an “unsustainable” tariffs war.",
    "url": "https://www.cnbc.com/2025/04/28/trade-war-tariffs-full-blown-crisis-us-farm-exporters-say.html"
  },
  {
    "text": "Trump's justice department appointees remove leadership of voting unit  —  Donald Trump's appointees at the Department of Justice have removed all of the senior civil servants working as managers in the department's voting section and directed attorneys to dismiss all active cases … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/28/trump-doj-voting-rights"
  },
  {
    "text": "Trump is softening his tariff talk.  But the damage may already be done.  —  The economic effects of new trade wars could be hard to dodge even if talks yield new deals soon.  —  With 14 months remaining before the United States' 250th birthday on July 4, 2026, Stacy Blake should be placing big orders … ",
    "url": "https://www.washingtonpost.com/business/2025/04/27/trump-tariffs-us-economy/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1NzI2NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3MTA4Nzk5LCJpYXQiOjE3NDU3MjY0MDAsImp0aSI6ImIxZDgxODFhLWQ5ZWItNDg4YS1hMzBhLTcxOTRhMTBhMmZmNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzA0LzI3L3RydW1wLXRhcmlmZnMtdXMtZWNvbm9teS8ifQ.AFsxxt-AEgGDofKnlVFLIlGGsZtUyGeOExVBICiMSsM&itid=gfta"
  },
  {
    "text": "Scoop: Trump staff puts immigrants' mug shots on White House lawn  —  Trump administration officials late Sunday began placing dozens of posters of arrested unauthorized immigrants along the White House driveway.  — It's a provocative, sure-to-be-controversial move aimed … ",
    "url": "https://www.axios.com/2025/04/28/trump-posters-white-house-arrested-immigrants"
  },
  {
    "text": "‘60 Minutes’ Calls Out Paramount for Executive Producer's Exit in Rare On-Air Rebuke  —  All seemed normal in the first 98% of Sunday's broadcast of “60 Minutes” on CBS.  But the remaining 2% may have shocked viewers.  —  In the show's “Last Minute” segment, correspondent Scott Pelley told … ",
    "url": "https://variety.com/2025/tv/news/60-minutes-scott-pelley-rebukes-paramount-bill-owens-exit-1236379735/"
  },
  {
    "text": "Lawyers for Deported U.S. Citizen Kids Say Moms Were ‘Coerced’ Into Taking Them  —  As Marco Rubio insists two deported Louisiana mothers voluntarily brought their children with them, attorneys for the families say that's a lie  —  Three U.S. citizen children were illegally removed … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-rubio-deported-us-citizen-children-mothers-coerced-1235326214/"
  },
  {
    "text": "UK and EU to defy Trump with ‘free and open trade’ declaration  —  BRUSSELS — Britain and the European Union are set to sign a formal declaration committing to “free and open trade” in defiance of Donald Trump's tariff agenda.  —  A leaked draft seen by POLITICO promises a “new strategic partnership” … ",
    "url": "https://www.politico.eu/article/uk-eu-defy-trump-free-open-trade-declaration/"
  },
  {
    "text": "The Age of Realtime Deepfake Fraud Is Here  —  “At least now I saw you're way more gorgeous and more beautiful than you were in the photo you sent me,” an older white man with a greying beard says during a Skype video call.  He is talking to an elderly woman who appears to be in her car, staring into her phone's front-facing camera.",
    "url": "https://www.404media.co/the-age-of-realtime-deepfake-fraud-is-here/"
  },
  {
    "text": "Elite Universities Form Private Collective to Resist Trump Administration  —  Separate from the public dissent, a group of school leaders are strategizing behind the scenes about how to respond and push back against the White House  —  Leaders of some of the nation's most prestigious universities … ",
    "url": "https://www.wsj.com/us-news/education/elite-universities-form-private-collective-to-resist-trump-administration-95a14ff3?st=wkgzD3&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump's second term will be the worst presidential term ever  —  Tragically, the president's second term is already more lawless and more authoritarian than any in US history  —  In his first 100 days back in office, Donald Trump has made a strong case that his second term will be by far the worst presidential term in US history.",
    "url": "https://www.theguardian.com/commentisfree/2025/apr/28/trump-second-term-worst-ever"
  },
  {
    "text": "An unprecedented scheme to profit from the presidency  —  President Trump has invited virtually anyone, including foreign governments, government contractors, and people under federal criminal investigation, to compete to see who can personally enrich Trump the most.",
    "url": "https://popular.info/p/an-unprecedented-scheme-to-profit"
  },
  {
    "text": "146. Denaturalization and Expatriation  —  There is no lawful way to “deport” U.S. citizens.  And although citizenship can be revoked, any attempt by the government would run into significant statutory, constitutional, and practical obstacles.  —  Welcome back to “One First,” … ",
    "url": "https://www.stevevladeck.com/p/146-denaturalization-and-expatriation"
  },
  {
    "text": "Over 100 immigrants arrested in raid on underground Colorado nightclub where active-duty military members worked, feds say  —  More than 100 immigrants, allegedly in the country illegally, were detained in Colorado Springs after an overnight raid at what authorities described as an underground nightclub in a strip mall.",
    "url": "https://cnn.com/2025/04/27/us/colorado-springs-ice-raid-club"
  },
  {
    "text": "April 27, 2025  —  Last night a new club opened in the wealthy Georgetown neighborhood in Washington, D.C. It's called “Executive Branch,” and it's an invitation-only club backed by Donald Trump Jr. and megadonor Omeed Malik.  Dasha Burns of Politico reported that it costs more than half a million dollars to join.",
    "url": "https://heathercoxrichardson.substack.com/p/april-27-2025"
  },
  {
    "text": "Did Peter Navarro Save Democracy?  —  Economic failure has given us a chance to stop Trump's authoritarianism  —  Just a few short weeks ago the prospects for American democracy looked bleak.  Donald Trump was elected despite the events of January 6th and his clear threats of retribution … ",
    "url": "https://paulkrugman.substack.com/p/did-peter-navarro-save-democracy"
  },
  {
    "text": "The bubble that created Trump is the reason he's stumbling  —  The White House is now a bubble where loyalty, not ability, defines success.  —  Consider Defense Secretary Pete Hegseth.  —  No one should be surprised that Hegseth is flailing in his new role, one of the most arduous … ",
    "url": "https://www.washingtonpost.com/opinions/2025/04/28/trump-second-term-struggles-bubble/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1ODEyODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3MTk1MTk5LCJpYXQiOjE3NDU4MTI4MDAsImp0aSI6IjQ1ZDU4MzJhLTg4N2EtNGY3Zi1iYTZkLTEzYjNmMzU4ZWJkMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA0LzI4L3RydW1wLXNlY29uZC10ZXJtLXN0cnVnZ2xlcy1idWJibGUvIn0.cvl75ynxzWxby_XsU2NZUYOkLX7MULNZ16OWcIffsPo&itid=gfta"
  }
]