[
  {
    "text": "Elon Musk Shares Manipulated Harris Video, in Seeming Violation of X's Policies  —  The billionaire owner of the social media platform X reposted a video that mimics Vice President Kamala Harris's voice, without disclosing that it had been altered.  —  Elon Musk, the world's richest man … ",
    "url": "https://www.nytimes.com/2024/07/27/us/politics/elon-musk-kamala-harris-deepfake.html"
  },
  {
    "text": "Harris camp responds to Trump telling Christians they 'don't have to vote again' if he gets elected  —  “I don't care how, but you have to get out and vote,” Trump said.  —  As former President Donald Trump wrapped his nearly 75-minute speech on Friday night, he delivered a final pitch … ",
    "url": "https://abcnews.go.com/Politics/harris-camp-responds-trump-telling-christians-dont-vote/story?id=112338473"
  },
  {
    "text": "Trump Says Americans 'Won't Have to Vote Anymore' If He Wins  —  Yesterday, former President Donald Trump told a group of supporters that they won't have to vote again if they elect him to the presidency.  “You won't have to do it anymore,” Trump said at the Turning Point Believers' Summit in Florida.",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/trump-vote-believers-summit/679273/?gift=mIBPPidhhodu0voIJGg1qH_-FS-Cq1IdsyHamr8U3nU&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Stricter Covid mask rules could've saved hundreds of thousands of lives, new study finds  —  Restrictions in Northeastern states likely ‘saved many lives’ say researchers  —  Support truly  —  independent journalism  —  Our mission is to deliver unbiased, fact-based reporting that holds power to account and exposes the truth.",
    "url": "https://www.independent.co.uk/news/world/americas/covid-mask-vaccine-rules-study-b2586693.html"
  },
  {
    "text": "Kelly emerges as a top contender for Harris's VP pick  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions  — descriptions off, selected",
    "url": "https://thehill.com/homenews/campaign/4795312-mark-kelly-kamala-harris-arizona-jd-vance/"
  },
  {
    "text": "Speaker Johnson blasts Olympics for mocking Christians, Last Supper  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/homenews/house/4796094-olympic-opening-ceremony-criticism/"
  },
  {
    "text": "5 Excerpts From JD Vance's Emails to a Transgender Classmate  —  A former Yale Law School classmate shared with The Times about 90 emails and text messages with Mr. Vance.  Here are some of the most revealing moments in their correspondence.  —  As Senator JD Vance seeks the vice presidency … ",
    "url": "https://www.nytimes.com/2024/07/27/us/jd-vance-emails-transgender-classmate-highlights.html?unlocked_article_code=1.-U0.0o22.h4tNePHHg-VH"
  },
  {
    "text": "The election has been totally upended.  Here's what the polls show.  —  It's clear the presidential contest is reshuffled.  —  The polls are in after a chaotic few weeks in the 2024 presidential election, and they point to a newly hyper-competitive race.  —  Vice President Kamala Harris' elevation … ",
    "url": "https://www.politico.com/news/2024/07/27/polling-kamala-harris-trump-00171514"
  },
  {
    "text": "Putin warns the United States of Cold War-style missile crisis  —  Russian President Vladimir Putin on Sunday warned the United States that if Washington deployed long-range missiles in Germany from 2026 then Russia would station similar missiles in striking distance of the West.",
    "url": "https://www.reuters.com/world/putin-warns-united-states-cold-war-style-missile-crisis-2024-07-28/"
  },
  {
    "text": "The Seagulls Descend  —  So I guess it's time to write about elections.  —  In the United States, I've noticed that elections seem to be a time for politically activated people to come together to bicker and fight and make points that everyone has already heard and considered … ",
    "url": "https://www.the-reframe.com/the-seagulls-descend/"
  },
  {
    "text": "Could Josh Shapiro win Kamala Harris the Electoral College?  —  Do home-state effects matter?  —  In a change from four years ago, when neither Kamala Harris nor Mike Pence were from anything resembling a swing state  —  1, Harris — now heading the Democratic ticket … ",
    "url": "https://www.natesilver.net/p/could-josh-shapiro-win-kamala-harris"
  },
  {
    "text": "Kamala Harris campaign seeks ‘reset’ with crypto companies  —  Vice-president's team aims to improve relations after industry criticism of the Biden administration  —  Kamala Harris's advisers have approached top crypto companies to “reset” relations between her Democratic party and a sector … ",
    "url": "https://www.ft.com/content/1a4c5066-9cc0-4849-993b-06a28022ad66"
  },
  {
    "text": "Golan Heights attack raises concerns of war between Israel and Hezbollah … - U.S. officials are also concerned that without a ceasefire in Gaza, a war between Israel and the Lebanese militant group is becoming more likely, which would exacerbate the regional crisis and draw the U.S. deeper into the conflict.",
    "url": "https://www.axios.com/2024/07/27/golan-heights-attack-israel-hezbollah-war"
  },
  {
    "text": "How ‘cat lady’ became an insult for women of a certain age  —  The stereotypical “cat lady” is one of pop culture's most bizarre characters — and easiest punching bags.  —  She's “The Simpsons” recurring character Eleanor Abernathy, a reclusive resident of Springfield who speaks in gibberish and hurls her cats at passersby.",
    "url": "https://www.cnn.com/2024/07/27/us/cat-lady-explained-cec/"
  }
]