[
  {
    "text": "Trump fires chairman of the Joint Chiefs of Staff and two other military officers  —  President Donald Trump abruptly fired Air Force Gen. CQ Brown Jr. as chairman of the Joint Chiefs of Staff on Friday, sidelining a history-making fighter pilot and respected officer as part of a campaign led … ",
    "url": "https://apnews.com/article/trump-brown-joint-chiefs-of-staff-firing-fa428cc1508a583b3bf5e7a5a58f6acf"
  },
  {
    "text": "Who is Dan Caine, Trump's pick as chairman of the Joint Chiefs of Staff?  —  Caine, a three-star general whom Trump has praised since at least 2019, helped lead an operation in Iraq against the Islamic State during Trump's first term.  —  President Donald Trump on Friday … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/22/dan-caine-trump-who-is/"
  },
  {
    "text": "U.S. Pressing Tough Demands in Revised Deal for Ukraine's Minerals  —  The Trump administration appears to be insisting that Ukraine relinquish half of its revenues from natural resource extraction, with no security guarantee in exchange.  —  Ukraine on Saturday was seriously considering … ",
    "url": "https://www.nytimes.com/2025/02/22/world/europe/ukraine-trump-minerals.html"
  },
  {
    "text": "US threatens to shut off Starlink if Ukraine won't sign minerals deal, sources tell Reuters  —  The United States has threatened to cut off Ukraine's access to Starlink satellite internet terminals if Kyiv does not reach a deal with the U.S. regarding critical mineral resources … ",
    "url": "https://kyivindependent.com/us-threatens-to-shut-off-starlink-if-ukraine-wont-sign-minerals-deal-sources-tell-reuters/"
  },
  {
    "text": "'It's blackmail': Ukrainians react to Trump demand for $500bn share of minerals  —  Ukraine's lithium deposits are among biggest in Europe and the US is looking for ‘payback’ for previous military assistance  —  Luke Harding in Liodiane, pictures by Julia Kochetova",
    "url": "https://www.theguardian.com/world/2025/feb/22/its-blackmail-ukrainians-react-to-trump-demand-for-500bn-share-of-minerals"
  },
  {
    "text": "New Social Security chief was being investigated when Musk team tapped him  —  Leland Dudek, a data analyst working in a small anti-fraud office, was suspected of sharing unauthorized access to information with representatives of Musk's U.S. DOGE Service.  Now he's the acting Social Security commissioner.",
    "url": "https://www.washingtonpost.com/politics/2025/02/22/social-security-trump-doge-musk/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwMjAwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxNTc5MTk5LCJpYXQiOjE3NDAyMDA0MDAsImp0aSI6IjU2YjkyYWU4LTA4ZWUtNDE1ZC1iOWJkLWVlNmM3MzRlZjczNCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAyLzIyL3NvY2lhbC1zZWN1cml0eS10cnVtcC1kb2dlLW11c2svIn0.0kUuRrAbqH__HvhpYAFPsmOnb9NsRmpXoIr8gKYhkaQ&itid=gfta"
  },
  {
    "text": "DOGE shared its receipts — and some of them don't match  —  “Everyone is very well-aware they're repeating the wrong numbers,” said one manager at a company on DOGE's list of cuts.  —  Elon Musk promised to deliver a “maximally transparent” government efficiency program.",
    "url": "https://www.politico.com/news/2025/02/22/doge-data-errors-inconsistencies-00002576"
  },
  {
    "text": "DOGE's Only Public Ledger Is Riddled With Mistakes  —  The figures from Elon Musk's team of outsiders represent billions in government cuts.  They are also full of accounting errors, outdated data and other miscalculations.  —  Elon Musk and his Department of Government Efficiency … ",
    "url": "https://www.nytimes.com/2025/02/21/upshot/doge-musk-trump-errors.html?unlocked_article_code=1.y04.8IDa.H_9Bh-vHgzGZ"
  },
  {
    "text": "Kristi Noem Says $200 Million DHS Ad Campaign Thanking Trump Was His Idea  —  Trump's Homeland Security Secretary said he instructed her to make ads that “thank me for closing the border”  —  NATIONAL HARBOR, Maryland  — The Department of Homeland Security has budgeted up to $200 million … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-kristi-noem-200-million-dhs-ad-campaign-thanks-president-1235276324/"
  },
  {
    "text": "February 21, 2025  —  In an appearance at the Conservative Political Action Conference (CPAC) yesterday, billionaire Elon Musk seemed to be having difficulty speaking.  Musk brandished a chainsaw like that Argentina's president Javier Milei used to symbolize the drastic cuts he intended … ",
    "url": "https://heathercoxrichardson.substack.com/p/february-21-2025"
  },
  {
    "text": "Meloni, Privately Startled by Trump, Avoids Any Criticism of US  — Premier, entourage taken aback by magnitude of Trump attacks  — Italian PM to address CPAC in Washington on Saturday  —  Italian Prime Minister Giorgia Meloni has been quiet lately, even as the US threatens to upend … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-22/meloni-privately-startled-by-trump-avoids-any-criticism-of-us"
  },
  {
    "text": "The Great Resegregation  —  The nostalgia behind the slogan “Make America great again” has always provoked the obvious questions of just when America was great, and for whom.  Early in the second Trump administration, we are getting the answer.  —  In August, speaking with someone he believed … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/02/trump-attacks-dei/681772/?gift=Je3D9AQS-C17lUTOnl2W8CfbS33sf5rPuBaDA0rzwEA&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump's Own Pollster Just Hit Him with Very Bad News—and a Warning  —  As you watch President Donald Trump and Elon Musk recklessly attempt to destroy the federal government like a pair of toddlers picking legs off a spider, it seems as if Republicans have decided public opinion no longer constrains them in the least.",
    "url": "https://newrepublic.com/article/191841/trump-approval-rating-pollster-bad-news-warning"
  },
  {
    "text": "Musk's cost-cutting team is laying off workers at the auto safety agency overseeing his car company  —  Elon Musk's cost-cutting team is eliminating jobs at the vehicle safety agency that oversees Tesla and has launched investigations into deadly crashes involving his company's cars.",
    "url": "https://apnews.com/article/musk-trump-autonomous-selfdriving-doge-auto-safety-99b369c5e3ccd3e7c09b6951604b3a0a"
  },
  {
    "text": "Recording reveals new details on controversial DOGE employee  —  Less than three years before Elon Musk tapped him to take part in a sweeping overhaul of the US government, Edward Coristine, then 17, was the subject of a heated dispute between two executives at the Arizona-based cybersecurity firm where he was an intern.",
    "url": "https://www.cnn.com/2025/02/21/politics/doge-musk-edward-coristine-invs"
  },
  {
    "text": "Pope Francis is in critical condition after long respiratory crisis, requiring oxygen at high flow  —  Pope Francis was in critical condition Saturday after he suffered a long asthmatic respiratory crisis that required high flows of oxygen, the Vatican said.",
    "url": "https://apnews.com/article/pope-francis-pneumonia-sepsis-vatican-respiratory-infection-bab5b9a141517171d4efc71fadafa0a4"
  },
  {
    "text": "The DOGE Project Will Backfire  —  Trump's war on public employees is bad for all of us.  —  President Donald Trump and his billionaire adviser Elon Musk justify dismantling the civil service as cost cutting.  The federal government has “billions and billions of dollars in waste, fraud … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/02/doge-elon-trump-government/681796/?gift=YUxxmh9QQAulSr5JPkTqQ8DAgWwZFABp0VN0HSZmjOY&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "How Federal Employees Are Fighting Back Against Elon Musk … Karen Ortiz, an administrative law judge at the Equal Employment Opportunity Commission, said her ability to send emails was shut off after she sent an agencywide message calling on the commission's acting chair to resign.Taurat Hossain for The New York Times",
    "url": "https://www.nytimes.com/2025/02/22/us/politics/federal-employees-elon-musk.html?unlocked_article_code=1.y04.uThj.JIKPWDn_GCQm&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "They Worked to Prevent Death.  The Trump Administration Fired Them.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Every day, they tackled complex issues with life-or-death stakes:",
    "url": "https://www.propublica.org/article/trump-federal-workers-public-health-hhs"
  },
  {
    "text": "Federal prisons prep to move trans inmates as early as next week  —  The Bureau of Prisons is pushing ahead with plans to move transgender inmates out of prisons that align with their gender identity and into facilities corresponding to their sex at birth.  The moves could happen as early as next week … ",
    "url": "https://www.npr.org/2025/02/21/nx-s1-5305282/trans-inmates-federal-prison-policy-transfers"
  },
  {
    "text": "NBC Settles Defamation Lawsuit With Georgia Doctor Whom Rachel Maddow Dubbed the ‘Uterus Collector,’ Avoiding High Stakes Trial  —  NBC's top anchors made ‘verifiably false’ statements about a doctor they accused of performing ‘mass hysterectomies’ on female inmates at ICE facility, a federal judge ruled last year",
    "url": "https://freebeacon.com/media/nbc-settles-defamation-lawsuit-with-georgia-doctor-whom-rachel-maddow-dubbed-the-uterus-collector-avoiding-high-stakes-trial/"
  },
  {
    "text": "Texas measles outbreak grows to 90 cases, worst level in 30 years  —  Epicenter of latest outbreak had one of state's highest immunization exemption rates for 2023-24 school year  —  The measles outbreak in Texas has grown to at least 90 cases, reaching historic levels, according to officials.",
    "url": "https://www.theguardian.com/us-news/2025/feb/22/texas-measles-outbreak"
  },
  {
    "text": "Alarm as bird flu now ‘endemic in cows’ while Trump cuts staff and funding  —  Experts say current US outbreak is unlikely to end without intervention with further mutation of virus likely  —  A newer variant of H5N1 bird flu has spilled over into dairy cows separately in Nevada and Arizona … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/22/bird-flu-virus-trump"
  },
  {
    "text": "Why Civ-Mil People Are Freaking Out?  —  Trump bravely waited until Friday night to purge the top level of the US military.  Why are people freaking out?  We knew this was going to happen.  Trump promised this before the election, and the selection of Hegseth, a misogynist and racist … ",
    "url": "https://saideman.blogspot.com/2025/02/why-civ-mil-people-are-freaking-out.html"
  },
  {
    "text": "The Trump team ups the trolling to 11  —  Provocative messages have become central to the Trump team's political efforts, inviting everyone to guess what's a joke and what's not.  —  A month ago, Elon Musk rang in President Donald Trump's second term with a straight-arm salute that divided a political nation.",
    "url": "https://www.washingtonpost.com/politics/2025/02/22/trump-team-ups-trolling-11/"
  },
  {
    "text": "Italy's Meloni defends Vance's Munich speech chastising Europe  —  The Italian prime minister said that Europe has been “sacrificed on the altar of wokeness, bureaucracy and mercantilism.”  —  Italian Prime Minister Giorgia Meloni came to Vice President JD Vance's defense on Saturday … ",
    "url": "https://www.politico.com/news/2025/02/22/giorgia-meloni-jd-vance-speech-022229"
  },
  {
    "text": "Prominent DOGE Staffer Is Grandson Of Turncoat KGB Spy  —  [A brief editorial note: About 10 years ago, I began researching the Year of the Spy and some famous Reagan-era espionage cases.  This post draws from that research.  See also my previously published article about the NSA traitor Ronald Pelton.]",
    "url": "https://www.jacobsilverman.com/p/prominent-doge-staffer-is-grandson"
  },
  {
    "text": "Governor Mills' Statement on Notice of Investigation From U.S. Department of Education  —  Washington, D.C. - Governor Janet Mills released the following statement today in response to the U.S. Department of Education notifying the Maine Department of Education that it has been directed … ",
    "url": "https://www.maine.gov/governor/mills/news/governor-mills-statement-notice-investigation-us-department-education-2025-02-21"
  }
]