[
  {
    "text": "People of Good Conscience Must Stop the Starvation in Gaza  —  Forty years ago, the world's conscience was shocked into action by images of emaciated children and starving babies dying in their mothers' arms.  There was a surge in international aid, airdrops of food and activism from the world's most popular artists.",
    "url": "https://www.nytimes.com/2025/07/27/opinion/gaza-starvation-famine-israel.html?unlocked_article_code=1.Zk8.uz5G.P2y2_u5h77fG&smid=url-share"
  },
  {
    "text": "Israel commits to daily pauses in fighting as six more malnutrition deaths reported in Gaza  —  Summary  — Israel commits to daily 10-hour pauses in military operations in parts of Gaza “for humanitarian purposes” as it says aid corridors are being set up to “refute the false claim on intentional starvation”",
    "url": "https://www.bbc.com/news/live/ckg42k37e2pt"
  },
  {
    "text": "The latest child to starve to death in Gaza weighed less than when she was born  —  A mother pressed a final kiss to what remained of her 5-month-old daughter and wept.  Esraa Abu Halib's baby now weighed less than when she was born.  —  On a sunny street in shattered Gaza … ",
    "url": "https://apnews.com/article/gaza-israel-starvation-children-malnutrition-baby-baf865b861c9a2fd9c75068936062146"
  },
  {
    "text": "What Will It Cost to Renovate the ‘Free’ Air Force One?  Don't Ask.  —  To hide the cost of renovating the plane Qatar donated to President Trump, the Air Force appears to have tucked it inside an over-budget, behind-schedule nuclear modernization program.  —  President Trump makes no secret … ",
    "url": "https://www.nytimes.com/2025/07/27/us/politics/air-force-one-trump-cost.html?unlocked_article_code=1.Zk8.1kZ2.llxYF3gaD7eI&smid=url-share"
  },
  {
    "text": "Trump once decried the idea of presidential vacations.  His Scotland trip is built around golf  —  During sweaty summer months, Abraham Lincoln often decamped about 3 miles (5 kilometers) north of the White House to the Soldiers' Home, a presidential retreat of cottages and parkland in what today … ",
    "url": "https://apnews.com/article/trump-scotland-golf-presidential-vacations-43364ff17b7ae49602909644be9fd260"
  },
  {
    "text": "Why Columbia gave in to Trump's extortion  —  On July 23, Columbia University entered into a resolution agreement with the federal government to settle claims that it didn't do enough to prevent harassment of Jewish students.  —  Columbia promised to pay $200 million in fines … ",
    "url": "https://thehill.com/opinion/education/5421287-why-columbia-gave-in-to-trumps-extortion/"
  },
  {
    "text": "100,000 People Marched at London Trans+ Pride.  The Transphobic UK Media Ignored It.  —  The UK's biggest news outlets ignored a record-breaking march for trans equality, despite publishing dozens of trans stories each week.  —  ·  —  Just now  —  This weekend, 100,000 people took … ",
    "url": "https://medium.com/@mimmymum/100-000-people-marched-at-london-trans-pride-the-transphobic-uk-media-ignored-it-a420b51c8a8e"
  },
  {
    "text": "The Ripple Effects of an ICE Raid on a Nebraska Meatpacking Company … They gathered in a conference room for the weekly management meeting, even though there was hardly anyone left to manage.  Chad Hartmann, the president of Glenn Valley Foods in Omaha, pushed a few empty chairs to the side … ",
    "url": "https://www.nytimes.com/2025/07/27/us/ice-glenn-valley-foods.html?unlocked_article_code=1.Zk8.OObR.AY8qhcrmmP1I&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "New details about police activity after lawmaker shootings raise questions about response  —  The Minnesota Star Tribune found that Brooklyn Park police waited more than 60 minutes to enter the Hortman home and that several law enforcement agencies were unaware of the situation for hours.",
    "url": "https://www.startribune.com/article/601432709"
  },
  {
    "text": "Trump Floats Prosecuting Oprah as Latest Epstein Distraction Tactic  —  O—NO!  —  The president has accused the Kamala Harris campaign of paying millions, “probably illegally,” to stars like Oprah and Beyoncé.  —  President Donald Trump has offered up yet another sacrifice … ",
    "url": "https://www.thedailybeast.com/trump-floats-prosecuting-oprah-as-latest-epstein-distraction-tactic/"
  },
  {
    "text": "Multiple people have been stabbed at a Walmart in Michigan and a suspect is in custody  —  Multiple people were stabbed at a Walmart in Traverse City, and a suspect was in custody, authorities said Saturday.  The Michigan State Police said the local sheriff's office is investigating the incident and details were limited.",
    "url": "https://apnews.com/article/walmart-stabbing-michigan-traverse-city-7d31d22005921a90e54c813a563c2457"
  },
  {
    "text": "Trump's tariffs start August 1, no extensions, Lutnick says  —  There will be no more extensions on tariff deadlines, and they will go into force as scheduled on August 1, Commerce Secretary Howard Lutnick said Sunday. … - Financial markets call it the “TACO trade” — “Trump always chickens out” … ",
    "url": "https://www.axios.com/2025/07/27/trump-tariffs-august-1"
  },
  {
    "text": "Democrats use new tactic to highlight Trump's gutting of Medicaid: billboards in the rural US  —  The ‘big, beautiful’ bill will cut more than $1tn from the health plan, with rural hospitals feeling the brunt of it  —  The road to four struggling rural hospitals now hosts a political message: “If this hospital closes, blame Trump.”",
    "url": "https://www.theguardian.com/us-news/2025/jul/27/medicaid-cuts-billboards-democrats"
  },
  {
    "text": "Massie, Khanna hammer Republican leadership for thwarting Epstein transparency push … The pair took particular issue with the Justice Department's statements that it was focusing on the needs of victims by declining to release more of the files.  —  “No one has asked the victims what they want,” Khanna said.",
    "url": "https://www.politico.com/news/2025/07/27/massie-khanna-epstein-transparency-push-00478485"
  },
  {
    "text": "Denied federal flood relief, a Maryland town is left on its own  —  The residents of Westernport, Maryland, overwhelmingly voted for Trump.  But after FEMA denied its aid request, the town feels like the president has turned his back on them.  —  Just now",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/07/27/allegany-county-flood-recovery-fema/"
  },
  {
    "text": "Can Mamdani's Message Play Outside New York?  It Already Has.  —  Zohran Mamdani's mayoral primary victory in New York follows wins by other big-city progressives.  Are voters more open to backing progressive stances?  —  In the glow of Zohran Mamdani's convincing win in the Democratic mayoral primary … ",
    "url": "https://www.nytimes.com/2025/07/27/nyregion/mamdani-wu-progressive-democrats.html"
  },
  {
    "text": "Parasitic sea vampire bites RFK Jr in health chief's bizarre new stunt  —  Robert F Kennedy Jr has found himself in another awkward situation involving animals.  —  On a tour of the Nez Perce salmon hatchery in Idaho on Thursday, RFK Jr let a parasitic sea vampire, also known as a lamprey … ",
    "url": "https://www.dailymail.co.uk/sciencetech/article-14941309/Parasitic-sea-vampire-bites-RFK-Jr-bizarre-stunt.html"
  },
  {
    "text": "Trump team's ‘pocket rescission’ idea runs into GOP opposition … The Trump administration has already clawed back funds through the use of a rescissions package that passed both chambers of Congress, and some GOP lawmakers are concerned about having to vote on a second, possibly politically tougher, package of cuts.",
    "url": "https://thehill.com/homenews/administration/5421246-rescission-funding-congress-concern/"
  },
  {
    "text": "You May Not Be Trump's Target This Time.  But You Could Be Next.  —  President Trump's actions targeting law firms, judges, media organizations, universities and labor unions have demonstrated a norm-shattering zeal for retribution and punishment of anyone who may disagree with his policies.",
    "url": "https://www.nytimes.com/2025/07/27/opinion/trump-executive-order.html?unlocked_article_code=1.Zk8.vgba.CuRhfBX0qMBP&smid=url-share"
  },
  {
    "text": "Trump urges Thailand, Cambodia ceasefire with trade talk  —  The aim of Trump and other world leaders is to halt the fiercest border clash between Thailand and Cambodia in 13 years  —  WASHINGTON - President Donald Trump urged the leaders of Cambodia and Thailand to end three days … ",
    "url": "https://www.usatoday.com/story/news/world/2025/07/26/trump-thailand-cambodia-border-dispute-trade/85389013007/"
  }
]