[
  {
    "text": "Exclusive: DOJ, FBI conclude Epstein had no “client list,” committed suicide … - The administration is releasing a video — in both raw and “enhanced” versions — that it says indicates no one entered the area of the Manhattan prison where Epstein was held the night he died in 2019.",
    "url": "https://www.axios.com/2025/07/07/jeffrey-epstein-suicide-client-list-trump-administration"
  },
  {
    "text": "Jeffrey Epstein didn't have a ‘client list,’ and committed suicide, DOJ and FBI reveal in findings that debunk conspiracy theories: report  —  Notorious sex predator Jeffrey Epstein didn't keep a supposed “client list,” and he was not murdered during his short-lived stay in a Manhattan lockup … ",
    "url": "https://nypost.com/2025/07/06/us-news/jeffrey-epstein-didnt-have-a-client-list-committed-suicide-doj-fbi-reveal-in-findings-that-debunk-conspiracy-theories/"
  },
  {
    "text": "Times pushed ahead to avoid being scooped on Mamdani Columbia story  —  The Scoop  —  The afternoon before a long holiday weekend isn't always the best time to drop a major scoop.  But the New York Times did not want to wait to publish its story about Zohran Mamdani's application … ",
    "url": "https://www.semafor.com/article/07/06/2025/times-pushed-ahead-to-avoid-being-scooped-on-mamdani-columbia-story"
  },
  {
    "text": "Texas lawmakers failed to pass a bill to improve local disaster warning systems this year  —  A GOP state lawmaker who represents Kerr County says he likely would vote differently now on House Bill 13, which would have established a grant program for counties to build new emergency communication infrastructure.",
    "url": "https://www.texastribune.org/2025/07/06/texas-disaster-warning-emergency-communication-bill-kerrville-floods/"
  },
  {
    "text": "At Least 82 Dead in Texas Floods as Families of Missing Wait and Hope  —  It's 'frustrating as somebody who's looking for, I mean, my whole family, almost,' says Hailey Chavarria, as searches enter third day  —  KERRVILLE, Texas—The search for those swept away by punishing flash floods … ",
    "url": "https://www.wsj.com/us-news/texas-river-floods-search-death-toll-8bef8045?st=oWi1kC&reflink=article_copyURL_share"
  },
  {
    "text": "Republicans just cut Medicaid.  Will it cost them control of Congress? … Justice voted for the megabill last week, despite his concerns over some of its Medicaid provisions — and after warning Republicans “cannot cut into the bone.”  Steep cuts, he said, would cost the GOP voters and lead the party to … ",
    "url": "https://www.politico.com/news/2025/07/06/republican-medicaid-cuts-midterms-big-beautiful-bill-00440023"
  },
  {
    "text": "The Party of Empathy...  I have a bookmark folder on X called “Democrat hate.”  —  When I think about it, I toss especially hateful posts into the folder as potential fodder for articles.  I rarely dip into them unless some particularly prominent person utters some particularly hateful thing.",
    "url": "https://hotair.com/david-strom/2025/07/06/the-party-of-empathy-n3804511"
  },
  {
    "text": "Israel Is Fast Alienating the Democratic Base  —  To grasp the significance of Zohran Mamdani's shocking victory in last month's Democratic primary for mayor of New York, it's worth recalling another upset, which took place 11 years ago and some 300 miles to the south, in a Republican … ",
    "url": "https://www.nytimes.com/2025/07/06/opinion/zohran-mamdani-democrats-israel.html"
  },
  {
    "text": "Summers: No economist ‘without a strong political agenda’ says Trump bill good for economy  —  Former Treasury Secretary Larry Summers railed against President Trump's massive tax and spending bill, saying no objective economist would characterize the legislation as a boon to the economy.",
    "url": "https://thehill.com/business/economy/5387158-summers-no-economist-without-a-strong-political-agenda-says-trump-bill-good-for-economy/"
  },
  {
    "text": "The Mamdani Millionaires Supporting the Socialist for NYC Mayor  —  Those pulling for the surprising primary winner include some inside the business community and even Wall Street—they are just quiet  —  In early September, Kathy Wylde, one of New York's undisputed power brokers … ",
    "url": "https://www.wsj.com/politics/elections/the-mamdani-millionaires-supporting-the-socialist-for-nyc-mayor-13c1636b"
  },
  {
    "text": "Social Security Email Says Policy Bill Eliminates Tax on Benefits.  Does It?  —  The Social Security Administration circulated an imprecise email about the provisions in the new law.  Here's what it actually does.  —  In a celebratory email sent to Americans across the country … ",
    "url": "https://www.nytimes.com/2025/07/06/your-money/social-security-tax.html"
  },
  {
    "text": "Nearly Half of America's Murderers Get Away With It  —  Most crimes go unsolved, emboldening criminals and potentially leading to more violence.  —  Someone murdered Raymel Atkins in Louisville, Ky., in 2023.  More than a year later, his mother and sister don't know who did it; the police have not made an arrest in the case.",
    "url": "https://www.nytimes.com/2025/07/06/us/murder-solve-rate-louisville.html?unlocked_article_code=1.UU8.LbXM.ICjC_SRSkoKD&smid=url-share"
  },
  {
    "text": "Knives, bullets and thieves: the quest for food in Gaza  —  Editor's note: Anas Baba is NPR's producer in the Gaza Strip.  His report is a rare account by a journalist inside a new food distribution site that the United States and Israel helped establish in the Palestinian territory.",
    "url": "https://www.npr.org/2025/07/06/g-s1-75874/gaza-food-hunger-ghf"
  },
  {
    "text": "Trump's effort to deport pro-Palestinian activists goes to trial … The case marks the first significant trial of Trump 2., a challenge to the president's agenda before a judge who has made no secret of his alarm over the administration's immigration tactics and who recently rebuked … ",
    "url": "https://www.politico.com/news/2025/07/06/trump-effort-deport-pro-palestinian-activists-trial-00439997"
  },
  {
    "text": "Musk says he's forming a new political party after split with Trump over tax cuts law  —  BRIDGEWATER, N.J. (AP) — Elon Musk said he's carrying out his threat to form a new political party after his fissure with President Donald Trump, announcing the America Party in response to the president's sweeping tax cuts law.",
    "url": "https://apnews.com/article/elon-musk-political-party-92353942308fee929a937b17113e077e"
  },
  {
    "text": "ICE Barbie Dodges Blame for Disastrous Texas Flooding on Trump's Watch  —  DODGE AND WEAVE  —  Kristi Noem was grilled over the delayed warning residents received during the flash floods in Texas.  —  Homeland Security Secretary Kristi Noem has defended the Trump administration from suggestions … ",
    "url": "https://www.thedailybeast.com/ice-barbie-kristi-noem-dodges-blame-for-disastrous-texas-flooding-on-trumps-watch/"
  }
]