[
  {
    "text": "Trump threatens lawyers, donors and election officials with prison for ‘unscrupulous behavior’  —  Trump and his allies filed dozens of unsuccessful cases after the 2020 election in an attempt to overturn the results.  —  Former President Donald Trump, who makes frequent false claims … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-warns-prison-sentences-people-cheated-2024-rcna170088"
  },
  {
    "text": "Trump wants 25th Amendment changed to impeach vice presidents  —  He has repeatedly accused Kamala Harris and Democrats of hiding the state of Biden's health.  —  Donald Trump on Saturday floated changing the 25th Amendment to allow Congress to impeach a vice president for covering … ",
    "url": "https://www.politico.com/news/2024/09/07/trump-25th-amendment-kamala-harris-biden-00177868"
  },
  {
    "text": "September 7, 2024  —  By rights, tonight's post should be a picture, but Trump's behavior today merits a marker because it feels like a dramatic escalation of the themes we've seen for years.  Please feel free to ignore—as I often say, I am trying to leave notes for a graduate student in 150 years … ",
    "url": "https://heathercoxrichardson.substack.com/p/september-7-2024"
  },
  {
    "text": "Trump and Harris Neck and Neck After Summer Upheaval, Times/Siena Poll Finds  —  The survey finds that Donald J. Trump is retaining his support and that, on the eve of the debate, voters are unsure they know enough about where Kamala Harris stands.  —  Former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/09/08/us/politics/trump-and-harris-times-siena-poll.html?unlocked_article_code=1.JE4.hi1f.f26wReRbISmY&smid=url-share"
  },
  {
    "text": "Anti-Abortion Extremists Call the Shots in Trump's GOP  —  Trump's epic flip flop abortion is why Democratic fears about Project 2025 and a Federal abortion ban are well-founded.  —  The generally accepted — and oft-repeated — narrative about Trump is that he is a cult-leader who can bend the Republican base to his will.",
    "url": "https://www.messageboxnews.com/p/anti-abortion-extremists-call-the"
  },
  {
    "text": "How Harris May Take the Fight to Trump on Abortion at the Debate  —  The candidates are all but certain to clash over the issue, which Kamala Harris sees as a major strength.  Donald Trump may try to avoid political blowback for his approach.  —  As Kamala Harris, Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/09/08/us/politics/harris-trump-debate-abortion.html"
  },
  {
    "text": "MAGA Turns on Trump for Admitting He's an Election ‘Loser’  —  BONUS PODCAST  —  “He's admitting... ‘I lost by a whisker’.  So what was the point?  What's the point of any of it you lost in 2020?” one-time Trump dinner companion Nick Fuentes asked.",
    "url": "https://www.thedailybeast.com/maga-and-nick-fuentes-turn-on-donald-trump-for-admitting-hes-an-election-loser"
  },
  {
    "text": "It's time for a permanent repeal of the global gag rule  —  Project 2025, the policy agenda created by conservative activists and spearheaded by The Heritage Foundation, envisions sweeping changes to U.S. government policy.  Among them, buried within the more than 900-page document … ",
    "url": "https://thehill.com/opinion/international/4866475-project-2025-global-gag-rule/"
  },
  {
    "text": "After a Year of Legal Peril, Trump Seeks Election as a Felon, but Free  —  Donald J. Trump's sentencing in Manhattan was delayed, thanks in part to his legal resources and political status.  It raised a question: Is he above the law?  —  One year ago, Donald J. Trump faced 91 felony counts … ",
    "url": "https://www.nytimes.com/2024/09/08/nyregion/trump-election-felon-sentence-delay.html"
  },
  {
    "text": "Nate Silver faces backlash for pro-Trump model skewing  —  X users say the FiveThirtyEight founder made some dubious data choices to boost Trump  —  Nate Silver, the celebrity statistician who gained notoriety for his FiveThirtyEight election models, is facing backlash over alleged skewing in his new model.",
    "url": "https://www.salon.com/2024/09/06/nate-silver-faces-backlash-for-pro-model-skewing/"
  },
  {
    "text": "Toplines: September 2024 Times/Siena Poll of Registered Voters Nationwide  —  Results of a nationwide New York Times/Siena College poll conducted among 1,695 registered voters from September 3 to 6, 2024.  —  Do you think the United States is on the right track, or is it headed in the wrong direction?",
    "url": "https://www.nytimes.com/interactive/2024/09/08/us/politics/times-siena-poll-toplines.html"
  },
  {
    "text": "Trump cashes in during final weeks of his presidential campaign  —  No presidential candidate has ever so closely linked his election with personal for-profit enterprises, selling items from shoes to books to pieces of his suit.  —  With less than 10 weeks before the presidential election … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/08/trump-cash-merchandise-books-cards/"
  },
  {
    "text": "Never-Before-Seen Details About Matt Gaetz's Alleged Sex Scandal May Soon Be Public — Thanks to a Friend  —  One of Matt Gaetz's friends sued a number of people in the alleged sex scandal, generating a number of juicy depositions.  Now those depositions could become public.  — Copy",
    "url": "https://www.notus.org/congress/never-before-seen-details-about-matt-gaetzs-alleged-sex-scandal-may-soon-be-public-thanks-to-a-friend"
  },
  {
    "text": "Trump Claims Harris's Rallies Are Smaller.  We Counted.  —  Kalina Borkiewicz, Malika Khurana, Karthik Patanjali and Bedel Saget  —  The sizable support Vice President Kamala Harris has generated at her rallies has rattled former President Donald J. Trump, who has emphasized, and frequently exaggerated, his crowd sizes for years.",
    "url": "https://www.nytimes.com/interactive/2024/09/07/us/politics/harris-trump-rally-crowds-size.html"
  }
]