[
  {
    "text": "Trump under oath: Six things to watch for as the former president testifies  —  Trump will take the stand in a case that could unravel his business empire.  —  NEW YORK — On Monday, Donald Trump will leave the campaign trail for a place where he'll still be the center of attention: a witness box.",
    "url": "https://www.politico.com/news/2023/11/06/trump-civil-fraud-trial-testimony-00125458"
  },
  {
    "text": "Ivanka Is Not Going to Save Trump in His New York Fraud Trial—and He's Not Going to Save Himself  —  His daughter is the only non-defendant among the Trumps, but Daddy shouldn't expect her to come to his rescue when she testifies. … Former President Donald Trump boasts about his children following in his footsteps.",
    "url": "https://www.thedailybeast.com/ivanka-is-not-going-to-save-trump-in-new-york-fraud-trial"
  },
  {
    "text": "Trump and His Lawyers Dare NY Judge to Throw Him in Jail  —  “When a defendant honestly believes he can't possibly get a fair trial from the judge, one of the tactics is to antagonize the judge to a point of causing reversible errors,” celebrity lawyer Alan Dershowitz says of the strategy",
    "url": "https://www.rollingstone.com/politics/politics-features/donald-trump-stand-trial-provoke-judge-arthur-engoron-jail-1234870655/"
  },
  {
    "text": "Tips for Questioning Trump Under Oath — From Someone Who's Done It  —  Deborah Baum tangled with Donald Trump in a deposition.  Here's her strategy.  —  Former President Donald Trump and his family are accused of fraudulently inflating Trump's net worth in a case that could upend his New York businesses.",
    "url": "https://www.politico.com/news/magazine/2023/11/06/tips-questioning-trump-under-oath-00125439"
  },
  {
    "text": "Trump Indictments Haven't Sunk His Campaign, but a Conviction Might  —  Polls by The New York Times and Siena College show his strength in key swing states, in part because of concerns about President Biden's age.  But a conviction could be the difference in 2024.",
    "url": "https://www.nytimes.com/2023/11/06/us/politics/trump-biden-times-siena-poll.html"
  },
  {
    "text": "Playbook: Trump testimony kicks off a jam-packed week  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  November kicked off with a brief reprieve from the drama that engulfed the House — and all of Washington — last month.",
    "url": "https://www.politico.com/newsletters/playbook/2023/11/06/trump-testimony-kicks-off-a-jam-packed-week-00125493"
  },
  {
    "text": "Poll shows Biden support slumping among Michigan Muslims  —  A new survey shows many Muslim Democrats would vote to replace Biden in a key swing state as Israel's U.S.-backed war in Gaza intensifies.  —  A new survey conducted by one of Joe Biden's former pollsters shows the president's support … ",
    "url": "https://www.nbcnews.com/politics/2024-election/poll-shows-biden-support-slumping-michigan-muslims-rcna123732"
  },
  {
    "text": "Mike Johnson Admits He and His Son Monitor Each Other's Porn Intake in Resurfaced Video  —  “I'm proud to tell ya, my son has got a clean slate,” Speaker of the House says of his “accountability partner”  —  SPEAKER OF THE House Mike Johnson admitted that he and his son monitored each other's porn intake … ",
    "url": "https://www.rollingstone.com/politics/politics-news/mike-johnson-son-monitor-porn-intake-covenant-eyes-1234870634/"
  },
  {
    "text": "Indy police arrest ‘terrorist’ for purposely driving her car into what she thought was a Jewish school  —  INDIANAPOLIS — IMPD officers arrested a woman, who they labeled a “terrorist,” after she drove her car into a building that she thought was a Jewish school.",
    "url": "https://fox59.com/news/indy-police-arrest-terrorist-for-purposely-driving-her-car-into-home-used-by-hate-group/"
  },
  {
    "text": "House GOP super PAC confident majority can grow after speaker chaos  —  Republicans are in a “strong position” to grow their majority, Congressional Leadership Fund President Dan Conston writes in a new donor memo.  —  The main GOP super PAC involved in House races says the party is poised … ",
    "url": "https://www.nbcnews.com/meet-the-press/meetthepressblog/house-gop-super-pac-confident-majority-can-grow-speaker-chaos-rcna123665"
  },
  {
    "text": "FACT SHEET: President Biden Advances Vision for World Class Passenger Rail by Delivering Billions in New Funding  —  $16.4 Billion from Bipartisan Infrastructure Law to Repair and Replace Critical Rail Infrastructure Along Northeast Corridor to Provide Faster and More Reliable Passenger Rail Experience … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/11/06/fact-sheet-president-biden-advances-vision-for-world-class-passenger-rail-by-delivering-billions-in-new-funding/"
  },
  {
    "text": "Horrific moment St Louis man, 19, tries to steal baby from woman's arms at crosswalk, before breaking 82 year-old woman's arms during rampage targeting strangers  — Anthony McGee, 19, is accused of trying to snatch the infant at a crosswalk  — He was charged in earlier attacks including … ",
    "url": "https://www.dailymail.co.uk/news/article-12712747/St-Louis-man-19-surveillance-steal-baby-breaking-82-year-old-arms-rampage.html"
  },
  {
    "text": "Ukrainian President Zelensky Calls Putin a ‘F—ing Terrorist’ in Interview  —  TOP ENEMY  —  Ukrainian President Volodymyr Zelensky did not mince words when discussing his Russian opponent Vladimir Putin during a Meet the Press interview on Sunday.  “I have a lot of power, back even feeling strong.",
    "url": "https://www.thedailybeast.com/ukrainian-president-volodymyr-zelensky-calls-vladimir-putin-a-f-ing-terrorist-in-interview"
  },
  {
    "text": "Netanyahu backed down from firing minister who called to nuke Gaza  —  The far-right lawmaker later said on X that ‘any sensible person’ knew the comments that Israel could use a nuclear weapon in the Gaza Strip were ‘metaphorical.’  —  Heritage Minister Amichai Eliyahu from Otzma Yehudit … ",
    "url": "https://www.jpost.com/israel-news/article-771766"
  },
  {
    "text": "Third Communications Blackout Hits Gaza Amid Heavy Strikes  —  Israel Announces ‘Large Attack’ as Communications Blackout Cuts Off Gaza … ‘At this hour, we are carrying out a large attack on terrorist infrastructure,’ an Israeli official says.  —  The Israeli military announced … ",
    "url": "https://www.nytimes.com/live/2023/11/05/world/israel-hamas-war-gaza-news"
  }
]