[
  {
    "text": "Trump, after mocking Harris over teleprompter use, stops rally to remove sign that fell on his  —  Former president often mocks Kamala Harris for using a teleprompter  —  Your support helps us to tell the story  —  This election is still a dead heat, according to most polls.",
    "url": "https://www.the-independent.com/news/world/americas/us-politics/trump-teleprompter-harris-reno-rally-b2628157.html"
  },
  {
    "text": "Note from the Editor: Legal Update  —  Georgia officials concluded that there was no widespread voter fraud by election workers who counted ballots at the State Farm Arena in November 2020.  The results of this investigation indicate that Ruby Freeman and Wandrea ‘Shaye’ Moss did not engage … ",
    "url": "https://www.thegatewaypundit.com/2024/10/note-editor-legal-update/"
  },
  {
    "text": "Far-right website admits there was no fraud at 2020 vote-count in Atlanta  —  Gateway Pundit settled defamation lawsuit brought by election workers it had falsely accused of wrongdoing  —  The far-right website The Gateway Pundit acknowledged for the first time on Saturday … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/12/gateway-pundit-admits-no-election-fraud-atlanta"
  },
  {
    "text": "Right-wing site Gateway Pundit acknowledges inquiry cleared two Georgia election workers  —  The statement comes a few days after Gateway Pundit reached a settlement in a defamation case filed by two Georgia election workers.  —  The Gateway Pundit, a far-right website … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/12/gateway-pundit-georgia-election-workers-settle/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI4NzA1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwMDg3OTk5LCJpYXQiOjE3Mjg3MDU2MDAsImp0aSI6ImRiMGIxODU3LTg5MzEtNGZhYy05MzllLWUzYjhhOGU0OGRhOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEwLzEyL2dhdGV3YXktcHVuZGl0LWdlb3JnaWEtZWxlY3Rpb24td29ya2Vycy1zZXR0bGUvIn0.obgqYohEBqQPchWRlbXx2nl3plg7ZLHmaG0NHb7UQls&itid=gfta"
  },
  {
    "text": "New York Times polls are betting on a political realignment  —  Should you buy it?  —  ∙ Paid  —  The past quarter-century of American politics has been dominated by two major trends.  One is simply increasing political polarization: red states have perpetually become redder, and blue states bluer.",
    "url": "https://www.natesilver.net/p/new-york-times-polls-are-betting"
  },
  {
    "text": "Black Voters Drift From Democrats, Imperiling Harris's Bid, Poll Shows  —  Vice President Kamala Harris is on track to win a majority of Black voters, and has brought many back to her party since taking over for President Biden.  Still, a significant gap in support persists.",
    "url": "https://www.nytimes.com/2024/10/12/us/politics/poll-black-voters-harris-trump.html"
  },
  {
    "text": "Is Ron DeSantis secretly preparing an effort to block Florida's abortion measure?  —  Late Friday, the Florida Department of State's office released a report alleging fraud relating to petition circulation and collection for the abortion rights measure that will be Amendment 4 on this fall's ballot in the state.",
    "url": "https://www.lawdork.com/p/is-ron-desantis-secretly-preparing"
  },
  {
    "text": "“Threatening to cancel votes”: Florida officials allege fraud to kneecap abortion rights amendment  —  The last-minute report threatens to “cancel” votes for an amendment to restore abortion rights in the state  —  In a last-minute effort to kill a proposed ballot amendment … ",
    "url": "https://www.salon.com/2024/10/12/threatening-to-cancel-votes-florida-officials-allege-fraud-to-kneecap-abortion-rights-amendment/"
  },
  {
    "text": "Donald's New Owner  —  [Substack was down for a while and is still a little glitchy.  I hope this reaches you.]  —  Donald Trump has always been for sale.  It used to be shocking how many people were willing to prop him up in the hopes of profiting off his increasingly seamy ventures.",
    "url": "https://www.marytrump.org/p/donalds-new-owner"
  },
  {
    "text": "Trump campaign worked with Musk's X to keep leaked JD Vance file off platform  —  Journalist who published vetting document on Republican running mate was kicked off site formerly known as Twitter  —  Donald Trump's presidential campaign worked with X to prevent information … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/12/x-twitter-jd-vance-leaked-file"
  },
  {
    "text": "A Conversation With JD Vance  —  Philip Montgomery for The New York Times  —  From the moment JD Vance came onto the national stage, he was inextricably linked to Donald Trump.  As the author of the best-selling book “Hillbilly Elegy,” Vance was initially the Trump whisperer … ",
    "url": "https://www.nytimes.com/2024/10/12/magazine/jd-vance-interview.html"
  },
  {
    "text": "A Frustrated Trump Lashes Out Behind Closed Doors Over Money  —  Donald J. Trump is feeling aggrieved, unappreciated by donors and fenced in by security concerns in the final stretch of the race.  —  Donald J. Trump took his seat at the dining table in his triplex penthouse apartment atop Trump Tower … ",
    "url": "https://www.nytimes.com/2024/10/12/us/politics/trump-gop-donors.html?unlocked_article_code=1.Rk4.43tn.hsPavZdYfmGB&smid=url-share"
  },
  {
    "text": "We watched 20 Trump rallies.  His racist, anti-immigrant messaging is getting darker.  —  A POLITICO analysis of more than 20 of his rallies and campaign events shows Trump has demonized minority groups in all of them.  —  Donald Trump vowed to “rescue” the Denver suburb of Aurora, Colorado … ",
    "url": "https://www.politico.com/news/2024/10/12/trump-racist-rhetoric-immigrants-00183537"
  },
  {
    "text": "Harris vs. Trump analyst tells panicky Dems: GOP is creating fake polls |  ‘Desperate, unhinged, Trumpian’  —  As polls seem to indicate that former president Donald Trump has momentum in some swing states with 24 days remaining until the Nov. 5 presidential election, Democratic strategist Simon Rosenberg says: Don't buy it.",
    "url": "https://www.nj.com/politics/2024/10/harris-vs-trump-analyst-tells-panicky-dems-gop-is-creating-fake-polls-desperate-unhinged-trumpian.html"
  },
  {
    "text": "The Other Hidden Secret in Olivia Nuzzi And RFK Jr.'s Affair  —  TROUBLED DYNASTIES  —  The D.C. golden couple of Olivia Nuzzi and Ryan Lizza was torn apart by her FaceTime affair with RFK Jr. But she was not the only one with a secret, the Daily Beast reveals.",
    "url": "https://www.thedailybeast.com/the-family-secrets-of-ryan-lizza-whose-fiancee-olivia-nuzzi-cheated-with-rfk-jr"
  },
  {
    "text": "Why Trump is Avoiding the Media (and Voters)  —  Trump's campaign wants swing voters to see as little of him as possible  —  Long before he entered politics, Donald Trump's life philosophy was “There is no such thing as bad press.”  All attention was good attention.",
    "url": "https://www.messageboxnews.com/p/why-trump-is-avoiding-the-media-and"
  }
]