[
  {
    "text": "Trump is planning 100 executive orders starting Day 1 on border, deportations and other priorities  —  President-elect Donald Trump is preparing more than 100 executive orders starting Day One of the new White House, in what amounts to a shock-and-awe campaign on border security, deportations and a rush of other policy priorities.",
    "url": "https://apnews.com/article/trump-day-one-border-executive-actions-30f78c3c983ae74555f281446fe22710"
  },
  {
    "text": "Trump's Hill weapon … - Miller has become instrumental as Senate GOP leader John Thune (R-S.D.) and House Speaker Mike Johnson (R-La.) haggle over how to pass MAGA priorities, fast.  — Miller also gets Congress: While he initially called for a two-bill approach to immigration and tax reform … ",
    "url": "https://www.axios.com/2025/01/10/trump-stephen-miller-congress-immigration"
  },
  {
    "text": "Read: Meta's memo to employees rolling back DEI programs",
    "url": "https://www.axios.com/2025/01/10/meta-dei-memo-employees-programs"
  },
  {
    "text": "Exclusive: Meta kills DEI programs … - The moves come just three days after Meta ended many of its efforts to fact-check and police speech on Facebook, Instagram and Threads.  — The announcement also follows a host of public moves by tech companies and executives to align with the politics … ",
    "url": "https://www.axios.com/2025/01/10/meta-dei-programs-employees-trump"
  },
  {
    "text": "Rudy Giuliani held in contempt for second time this week  —  Federal judge rips into Guiliani over “fabricated lies.”  —  A federal judge has held Rudy Giuliani in contempt for continuing to falsely accuse two Georgia women of election fraud in 2020, breaching a court order against further attacking … ",
    "url": "https://www.politico.com/news/2025/01/10/rudy-giuliani-contempt-second-time-defamation-case-00197627"
  },
  {
    "text": "Federal judge slams Rudy Giuliani as ‘outrageous and shameful’ as she holds him in contempt in 2020 election defamation case  —  Rudy Giuliani has been held in contempt of court for the second time in a week, as the former New York mayor and top Donald Trump lawyer's fall from grace continues … ",
    "url": "https://www.cnn.com/2025/01/10/politics/rudy-giuliani-contempt-hearing-defamation-case"
  },
  {
    "text": "Meta Deletes Trans and Nonbinary Messenger Themes  —  Meta deleted nonbinary and trans themes for its Messenger app this week, around the same time that the company announced it would change its rules to allow users to declare that LGBTQ+ people are “mentally ill,” 404 Media has learned.",
    "url": "https://www.404media.co/meta-deletes-trans-and-nonbinary-messenger-themes/"
  },
  {
    "text": "Inside Mark Zuckerberg's Sprint to Remake Meta for the Trump Era  —  After visiting President-elect Donald J. Trump in November, Mr. Zuckerberg decided to relax Meta's speech policies.  He asked a small team to carry out his goals within weeks.  The repercussions are just beginning.",
    "url": "https://www.nytimes.com/2025/01/10/technology/meta-mark-zuckerberg-trump.html?unlocked_article_code=1.oE4.jwD6.Qu-_MhilMnvv&smid=url-share"
  },
  {
    "text": "Did Mayor Karen Bass really cut the fire department budget?  The answer gets tricky  —  When Mayor Karen Bass unveiled her budget plan for 2024-25, she called for a 2.7% reduction in spending at the Los Angeles Fire Department.  —  Her proposal, unveiled in April, sought $23 million in cuts … ",
    "url": "https://www.latimes.com/california/story/2025-01-10/how-much-did-the-l-a-fire-department-really-cut-its-budget"
  },
  {
    "text": "Leaked memo reveals LA Mayor Karen Bass demanded her fire department cut an extra $49 million just ONE WEEK before wildfires broke out  —  Los Angeles Mayor Karen Bass demanded her Fire Department make an extra $49million of budget cuts last week, a leaked memo revealed.",
    "url": "https://www.dailymail.co.uk/news/article-14271021/los-angeles-mayor-karen-bass-fires-department-budget-cuts.html"
  },
  {
    "text": "State to probe why Pacific Palisades reservoir was offline, empty when firestorm exploded  —  A large reservoir in Pacific Palisades that is part of the Los Angeles water supply system was out of use when a ferocious wildfire destroyed thousands of homes and other structures nearby, the Los Angeles Times found.",
    "url": "https://www.latimes.com/california/story/2025-01-10/as-flames-raged-in-palisades-a-key-reservoir-nearby-was-offline"
  },
  {
    "text": "Mark Zuckerberg lies about content moderation to Joe Rogan's face … I'll spare you the experience of listening to one of the richest men in the world whine and just tell you straight out: Mark Zuckerberg's interview on The Joe Rogan Experience is full of lies.",
    "url": "https://www.theverge.com/2025/1/10/24341117/mark-zuckerberg-facebook-joe-rogan-lies"
  },
  {
    "text": "ICE warns Laken Riley Act could force it to release detained migrants … - ICE warned that without emergency funding, they could be forced to release tens of thousands of immigrants — including potentially some deemed to be public safety threats. … - ICE currently only has funding for 42,000 detention beds.",
    "url": "https://www.axios.com/2025/01/10/laken-riley-act-ice-detentions-beds"
  },
  {
    "text": "House GOP puts Medicaid, ACA, climate measures on chopping block  —  The menu of potential spending offsets has been circulated by House Budget Chair Jodey Arrington.  —  House Republicans are passing around a “menu” of more than $5 trillion in cuts they could use to bankroll President-elect … ",
    "url": "https://www.politico.com/news/2025/01/10/spending-cuts-house-gop-reconciliation-medicaid-00197541"
  },
  {
    "text": "Supreme Court to weigh reinstating Obamacare care requirements struck down by lower court  —  The Supreme Court agreed Friday to consider reinstating some preventative care coverage requirements under the Affordable Care Act that were struck down by a lower court.",
    "url": "https://apnews.com/article/affordable-care-act-preventative-care-supreme-court-3225f11fbb02f83dd29335d2c34885bb"
  },
  {
    "text": "Key senators receive Pete Hegseth's FBI background check days out from confirmation hearing  —  Democrats have expressed concern over the delay and how thorough the report on Trump's embattled defense secretary pick will be.  —  WASHINGTON — An FBI background check for Pete Hegseth … ",
    "url": "https://www.nbcnews.com/politics/congress/senators-receive-pete-hegseths-fbi-background-check-days-rcna187035"
  },
  {
    "text": "Biden Calls Meta's Ending of Fact-Checking Program ‘Shameful’  —  Responding to a question from a reporter, the president said he believed Americans “want to tell the truth.”  —  President Biden criticized Mark Zuckerberg, the chief executive of Meta, on Friday for deciding to abandon … ",
    "url": "https://www.nytimes.com/2025/01/10/us/politics/biden-meta-fact-checking.html"
  },
  {
    "text": "As a Felon, Trump Upends How Americans View the Presidency  —  President-elect Donald J. Trump has worked for years to discredit any and all criminal and civil cases against him as nothing more than politically motivated witch hunts.  —  A big economic package, mass deportations, maybe even some invasions of other countries.",
    "url": "https://www.nytimes.com/2025/01/10/us/politics/trump-felon-presidency.html"
  },
  {
    "text": "The 119th Congress opens to AI, SCOTUS dances around TikTok, and a celebration of the OGFAC  —  Good evening from Washington, where more snow is inbound later tonight.  If you're receiving this newsletter, it's because you subscribed to Civic Texts: so glad to see more of you in this new year!",
    "url": "https://civic-texts.ghost.io/119th-congress-ai-scotus-tiktok-ogfac/"
  },
  {
    "text": "The Architects Of L.A.'s Wildfire Devastation  —  Back in 2019, a California state climate task force issued a stark warning: Endless development in the state's high-risk wildfire zones was magnifying wildfires and putting more people in their path.  —  It was a call that has echoed … ",
    "url": "https://www.levernews.com/the-architects-of-l-a-s-wildfire-devastation/"
  },
  {
    "text": "In North Carolina, Republicans Try to Reverse a Supreme Court Election Loss  —  An incumbent Democrat narrowly won re-election to the state's highest court.  But the Republican-controlled court is considering an unusual protest from her challenger that could flip the result.",
    "url": "https://www.nytimes.com/2025/01/10/us/north-carolina-supreme-court.html"
  },
  {
    "text": "Trump can still vote after sentencing, but can't own a gun and will have to turn over DNA sample  —  President-elect Donald Trump doesn't have to go to jail, pay a fine or perform community service as a result of his New York hush money conviction.  A judge ended the case Friday with a sentence … ",
    "url": "https://apnews.com/article/trump-hush-money-felon-rights-708d782fe985f2c08d7b82ef13f17dd9"
  },
  {
    "text": "Biden's legacy as president  —  In his final weeks in the White House, 39% approve of how Biden is handling his job.  Compared to his predecessors, fewer say he was a great or good president. … As President Biden prepares to leave the White House, only a quarter of the public view him as a great or good president.",
    "url": "https://apnorc.org/projects/bidens-legacy-as-president/"
  },
  {
    "text": "The Consensus On Havana Syndrome Is Cracking  —  After long denying the possibility, some intelligence agencies are no longer willing to rule out a mystery weapon.  —  Two years ago, U.S. intelligence analysts concluded, in unusually emphatic language, that a mysterious and debilitating ailment known as … ",
    "url": "https://www.theatlantic.com/international/archive/2025/01/havana-syndrome-russia-intelligence/681282/"
  },
  {
    "text": "A delay in GOP's tax plans could push up costs by hundreds of billions  —  The price of extending Republicans' tax cuts will surge by hundreds of billions of dollars if lawmakers dawdle, new government figures show.  The Treasury Department released numbers Friday showing that rolling … ",
    "url": "https://www.politico.com/live-updates/2025/01/10/congress/gop-tax-plan-delay-costs-00197566"
  },
  {
    "text": "Drone collides with firefighting plane during Los Angeles wildfires  —  A drone crashed into a firefighting aircraft near the California Palisades fire Thursday, the Federal Aviation Administration announced.  —  The aircraft landed safely but sustained wing damage, and it is out of service.",
    "url": "https://www.washingtonexaminer.com/policy/energy-and-environment/3283207/drone-collides-firefighting-plane-los-angeles-wildfires/"
  },
  {
    "text": "Consultant who called Trump an ‘environmental hero’ to get environmental job in new administration  —  President-elect Donald Trump announced more hires Friday for his new administration, including tapping his business' longtime environmental consultant for an adviser role.",
    "url": "https://www.politico.com/live-updates/2025/01/10/congress/trumps-picks-for-sba-and-environmental-task-force-00197676"
  }
]