[
  {
    "text": "No one is replacing Joe Biden, ffs  —  The bed-wetting needs to stop. … New York Times columnist Ezra Klein argued last week that President Joe Biden should step aside and not run for another term.  Klein argues Biden is too old to successfully run for president, and that Democrats … ",
    "url": "https://www.publicnotice.co/p/joe-biden-ezra-klein-wtf-man"
  },
  {
    "text": "Guess What Just Disappeared From GOP's Biden Impeachment Website  —  House Oversight Republicans have yanked a reference to their major flop of an FBI informant on the committee website, where it previously had pride of place as part of the impeachment inquiry into Joe Biden.",
    "url": "https://newrepublic.com/post/179225/james-comer-scrubs-fbi-informant-biden-impeachment-site"
  },
  {
    "text": "The Hunter Biden story has done a total 180 but the MSM is in denial  —  The Hunter Biden impeachment drama has been transformed by the revelation that the most essential witness for the GOP is a pathological liar and Russian intelligence asset.  —  The story is no longer whether Joe Biden … ",
    "url": "https://presswatchers.org/2024/02/the-hunter-biden-story-has-done-a-total180-but-the-msm-is-in-denial/"
  },
  {
    "text": "Biden's Terrible Student Loan Gamble … President Biden traveled to the West Coast this week to raise money for his campaign.  While there, he decided to spend some money, too.  Yours.  —  On February 21, Biden announced that he was canceling $1.2 billion in federal student loans for 153,000 borrowers.",
    "url": "https://freebeacon.com/columns/bidens-terrible-student-loan-gamble/"
  },
  {
    "text": "Biden's cheat sheets at fundraisers worry donors … - The staged Q&A sessions have left some donors wondering whether Biden can withstand the rigors of a presidential campaign, let alone potential debates with former President Trump, 77.  —  Biden advisers say the president is given notecards … ",
    "url": "https://www.axios.com/2024/02/23/biden-notecards-fundraisers-donors-age"
  },
  {
    "text": "Ex-FBI informant charged with lying about the Bidens is re-arrested as prosecutors fight to keep him behind bars  —  Alexander Smirnov, the former FBI informant indicted for lying about President Joe Biden's family and their alleged dealings in Ukraine, has been re-arrested in Nevada.",
    "url": "https://www.cnn.com/2024/02/22/politics/alexander-smirnov-re-arrested"
  },
  {
    "text": "Biden impeachment effort on the brink of collapse  —  A wide swath of House Republicans are acknowledging they likely won't have the votes, especially given their struggle to recommend booting Alejandro Mayorkas.  —  The House GOP's push to impeach Joe Biden appears close to stalling out for good.",
    "url": "https://www.politico.com/news/2024/02/23/biden-impeachment-collapse-00142689"
  },
  {
    "text": "Trump Frames Election as Battle Against ‘Wicked’ System Bent on Attacking Christians  —  Speaking at a Christian media convention in Nashville, former President Donald J. Trump claimed that a “radical left, corrupt political class” was persecuting Christians.",
    "url": "https://www.nytimes.com/2024/02/22/us/politics/trump-national-christian-broadcasters.html"
  },
  {
    "text": "A New Orleans magician says a Democratic operative paid him to make the fake Biden robocall  —  Dean Phillips' presidential campaign denounced the alleged actions of one of its consultants and said it may take legal action against him.  —  NEW ORLEANS — A Democratic consultant who worked … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-robocall-new-hampshire-strategist-rcna139760"
  },
  {
    "text": "The Cash-Strapped Trump Campaign Is Trying to Get Away With a New Donor Loophole  —  As a cash crunch looms, Trump's campaign is miraculously not reporting donor refunds—an untested trick that makes it harder to tell how tired his donors really are. … Campaign donor refunds have been a part … ",
    "url": "https://www.thedailybeast.com/the-cash-strapped-trump-campaign-is-trying-to-get-away-with-a-new-donor-loophole"
  },
  {
    "text": "Florida surgeon general defies science amid measles outbreak  —  As a Florida elementary school tries to contain a growing measles outbreak, the state's top health official is giving advice that runs counter to science and may leave unvaccinated children at risk of contracting … ",
    "url": "https://www.washingtonpost.com/health/2024/02/22/florida-measles-outbreak-ladapo/"
  },
  {
    "text": "Alabama IVF ruling a political gift for Democrats, headache for Republicans  —  An Alabama court ruling that frozen embryos created through fertility treatment are children has delivered an election-year opportunity for Democrats - and a political headache for Republicans.",
    "url": "https://www.bbc.com/news/world-us-canada-68377136"
  },
  {
    "text": "Justice Who Ruled That Embryos Are ‘Children’ Appeared On QAnon Conspiracist's Show  —  Alabama Chief Justice Tom Parker indicated on the show he was a proponent of the “Seven Mountains Mandate,” an explicitly theocratic doctrine at the heart of Christian nationalism.",
    "url": "https://www.huffpost.com/entry/tom-parker-alabama-ivf-embryo_n_65d7ea34e4b0cc1f2f7b3e26"
  },
  {
    "text": "CBS seizes confidential files of fired reporter pursuing Hunter Biden laptop story in ‘unprecedented’ move: sources  —  The acclaimed CBS reporter who was investigating the Hunter Biden laptop scandal before she was fired last week had her personal files seized by the network in an “unprecedented” … ",
    "url": "https://nypost.com/2024/02/22/business/cbs-seizes-confidential-files-of-fired-reporter-pursuing-hunter-biden-laptop-story-in-unprecedented/"
  },
  {
    "text": "You'll Never Guess Who Was Behind Those Fake Biden Robocalls!  —  Hint: It wasn't a Republican.  —  Video  —  Can you help us out?  —  For nearly 20 years we have been exposing Washington lies and untangling media deceit, but now Facebook is drowning us in an ocean of right wing lies.",
    "url": "https://crooksandliars.com/2024/02/youll-never-guess-who-was-behind-those"
  },
  {
    "text": "Trump's Defense: He Intended to Steal Boxes and Boxes of Classified Documents  —  As I have been noting for months, in all of Jack Smith's rebuttals to Trump's claims that Presidents have absolute immunity, he floated scenarios that are pretty similar to stuff that Trump is known or suspected of doing.",
    "url": "https://www.emptywheel.net/2024/02/23/trumps-defense-he-intended-to-steal-boxes-and-boxes-of-classified-documents/"
  },
  {
    "text": "Nikki Haley Desperately Tries to Walk Back Comment on Alabama Embryo Ruling  —  Former South Carolina Governor Nikki Haley is frantically trying to quell the controversy over comments she made about IVF after an Alabama court's recent ruling that frozen embryos are children.",
    "url": "https://newrepublic.com/post/179228/nikki-haley-walk-back-comment-alabama-embryo-ruling"
  },
  {
    "text": "An ectopic pregnancy put her life at risk.  A Texas hospital refused to treat her.  —  The 25-year-old woman and her mother blame the state's abortion ban for a delay in care that doctors say put her “in extreme danger of losing her life”  —  ARLINGTON, Tex. — Kelsie Norris-De La Cruz tried … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/23/texas-woman-ectopic-pregnancy-abortion/"
  },
  {
    "text": "Bewildered Conservatives Greet a Fallen British Prime Minister  —  Former British Prime Minister Liz Truss spoke in a hotel conference room that was less than half full.  —  Former British Prime Minister Liz Truss speaks during the Conservative Political Action Conference at the National Harbor in Oxon Hill, Md. on Feb. 22, 2024.",
    "url": "https://www.politico.com/news/magazine/2024/02/22/truss-at-cpac-00142807"
  },
  {
    "text": "Biden announces more than 500 new sanctions on Russia after Navalny's death  —  The new sanctions come as Russia's invasion into Ukraine reaches two-year anniversary  —  President Joe Biden on Friday announced more than 500 new sanctions on Russia and its war machine in the largest tranche … ",
    "url": "https://www.politico.com/news/2024/02/23/biden-new-russia-sanctions-navalny-death-00142894"
  }
]