[
  {
    "text": "Ford says Trump's tariff threat ‘like a family member stabbing you in the heart’  —  Premier Doug Ford says tariff would be ‘devastating’ to both economies  —  Ontario Premier Doug Ford said Tuesday that U.S. president-elect Donald Trump's threat to slap a 25 per cent tariff on all Canadian goods is … ",
    "url": "https://www.cbc.ca/news/canada/toronto/ford-trump-tariffs-canada-reaction-1.7393414"
  },
  {
    "text": "Mexico suggests it would impose its own tariffs to retaliate against any Trump tariffs  —  President Claudia Sheinbaum suggested Tuesday that Mexico could retaliate with tariffs of its own, after U.S. President-elect Donald Trump threatened to impose 25% import duties on Mexican goods … ",
    "url": "https://apnews.com/article/mexico-tariffs-trump-retaliate-sheinbaum-fac0b0c6ee8c425a928418de7332b74a"
  },
  {
    "text": "Dark Times for Guac Lovers  —  If you're an enthusiast for cartoonish, naked graft and you weren't getting your fix in post-Trump Washington, have we got a great story for you, per the New York Times: … Only the best people!  Happy Tuesday.  —  Trade Wars Are Good, And Easy to Win",
    "url": "https://www.thebulwark.com/p/dark-times-for-guac-lovers"
  },
  {
    "text": "Angry Rudy Giuliani argues with judge overseeing defamation payout: 'I can't pay my bills'  —  The former New York City mayor was chastised by the judge for failing to comply with court orders to turn over his assets to the two former Georgia election workers he defamed.",
    "url": "https://www.nbcnews.com/politics/politics-news/angry-rudy-giuliani-argues-judge-overseeing-defamation-payout-cant-pay-rcna181723"
  },
  {
    "text": "'I can't pay my bills,' Rudy Giuliani says in courtroom outburst  —  Rudy Giuliani was rebuked by a federal judge on Tuesday after the former New York City mayor interrupted a court hearing, pleading he could not pay his bills because two Georgia election workers to whom he owes $148 million have tied up his assets.",
    "url": "https://www.reuters.com/world/us/i-cant-pay-my-bills-rudy-giuliani-says-courtroom-outburst-2024-11-26/"
  },
  {
    "text": "Rudy Giuliani draws rebuke for a courtroom outburst accusing judge in assets case of being unfair  —  In an angry outburst in a New York courtroom, Rudy Giuliani accused a judge Tuesday of making wrong assumptions about him as he tries to comply with an order requiring him to turn … ",
    "url": "https://apnews.com/article/giuliani-defamation-georgia-election-workers-415367da295e8aa5f7cfb3862f087ed6"
  },
  {
    "text": "Appeals court agrees to end Trump's classified documents case  —  The 11th Circuit Court of Appeals on Tuesday granted a request from special counsel Jack Smith to drop President-elect Trump's Florida documents case, ending the battle to charge him over retaining records with classified markings after leaving office.",
    "url": "https://thehill.com/regulation/court-battles/5010990-trump-classified-documents-case-dropped/"
  },
  {
    "text": "How Jack Smith quietly ensured Trump's Jan. 6 case isn't actually going anywhere  —  Smith's move could be an effort to keep the cases alive in the long term.  —  Special counsel Jack Smith filed a motion with the trial court in the District of Columbia to dismiss the Jan. 6 election interference case … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/jack-smith-trump-election-interference-why-motion-dismiss-rcna181852"
  },
  {
    "text": "Trump Has Late-Night Meltdown Over New York Times Story on Close Aide  —  Donald Trump took to Truth Social in the early hours of Tuesday to go on a lengthy rant about Maggie Haberman, likely set off by a recent article in The New York Times on his weird relationship with aide Natalie Harp.",
    "url": "https://newrepublic.com/post/188825/trump-meltdown-new-york-times-story-personal-aide-natalie-harp"
  },
  {
    "text": "Donald Trump Is a Weakling.  That's the Problem.  —  The pithiest summary of Donald Trump's last presidency was by the comedian John Mulaney.  He compared it to a horse being set loose in a hospital.  “No one knows what the horse is gonna do next,” Mulaney said, “least of all the horse.",
    "url": "https://newrepublic.com/article/188785/donald-trump-weak-second-administration-chaos"
  },
  {
    "text": "Trump transition signs White House agreement  —  The Trump team's unprecedented delay in signing these agreements had alarmed former officials and ethics experts.  —  The Trump transition has signed a memorandum of understanding with the Biden White House, incoming chief of staff Susie Wiles announced … ",
    "url": "https://www.politico.com/news/2024/11/26/trump-signs-transition-agreement-white-house-00191754"
  },
  {
    "text": "X's Objection to the Onion Buying InfoWars Is a Reminder You Do Not Own Your Social Media Accounts  —  “X CORP. OWNS THE X ACCOUNTS.” … On Monday, X filed an objection in The Onion's bid to buy InfoWars out of bankruptcy.  In the objection, Elon Musk's lawyers argued that X has … ",
    "url": "https://www.404media.co/xs-objection-to-the-onion-buying-infowars-is-a-reminder-you-do-not-own-your-social-media-accounts/"
  },
  {
    "text": "Don Jr. Says They're Discussing Replacing Some Journalists at the White House Press Briefing with Podcast Bros  —  MEET THE NEW PRESS  —  “That's gonna blow up some heads, so we'll see,” said President-elect Donald Trump's eldest son.  —  President-elect Donald Trump discussed giving podcast bros … ",
    "url": "https://www.thedailybeast.com/don-trmp-jr-were-discussing-replacing-some-journalists-at-the-white-house-press-briefing-with-podcast-bros/"
  },
  {
    "text": "Trump to Name Hassett National Economic Council Chief  — Hassett chaired Council of Economic Advisers under Trump  — Top economic aide will help steer tax and tariff agenda  —  President-elect Donald Trump is said to have selected Kevin Hassett to lead the National Economic Council … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-26/trump-poised-to-name-hassett-to-lead-national-economic-council"
  },
  {
    "text": "Trump officials to receive immediate clearances and easier FBI vetting  —  Exclusive: president-elect's team planning for background checks to occur only after administration takes over bureau  —  Donald Trump's transition team is planning for all cabinet picks to receive sweeping security clearances … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/26/trump-transition-team-fbi-security-clearances-background-checks"
  },
  {
    "text": "Walmart becomes latest — and biggest — company to roll back its DEI policies  —  Walmart, the world's largest retailer, is rolling back its diversity, equity and inclusion policies, joining a growing list of major corporations that have done the same after coming under attack by conservative activists.",
    "url": "https://apnews.com/article/walmart-dei-inclusion-diversity-34b06922e60e5116fe198696201ce4d9"
  },
  {
    "text": "Kash Patel and Cliff Sims are jostling for the deputy director gig at the CIA  —  Two Trump transition insiders, Cliff Sims and Kash Patel, are angling to be deputy director of the CIA — and angering others who feel they're using their roles on the transition to undermine any would-be contenders … ",
    "url": "https://www.politico.com/live-updates/2024/11/26/congress/kash-patel-cliff-sims-deputy-director-cia-00191715"
  },
  {
    "text": "LPO Announces Conditional Commitment to Rivian to Support the Construction of EV Manufacturing Facility in Georgia  —  On November 25, 2024, LPO announced a conditional commitment to Rivian New Horizon, LLC of up to $6.57 billion to finance the development and construction of Project Horizon … ",
    "url": "https://www.energy.gov/lpo/articles/lpo-announces-conditional-commitment-rivian-support-construction-ev-manufacturing"
  },
  {
    "text": "Trump team eyes funding showdown with ‘sanctuary cities’ over immigration  —  Allies of the president-elect discuss pulling funding from Chicago; mayor says the city is “not intimidated” by threats.  —  President-elect Donald Trump's advisers are discussing how to unilaterally strip federal resources … ",
    "url": "https://www.washingtonpost.com/business/2024/11/26/trump-mass-deportation-sanctuary-cities-doge-immigration/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMyNTk3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMzOTc5NTk5LCJpYXQiOjE3MzI1OTcyMDAsImp0aSI6ImY1M2Q4MzU1LWFlZjUtNDJiMS05NjY0LWE2ZGI1MzhkNjUwNCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI0LzExLzI2L3RydW1wLW1hc3MtZGVwb3J0YXRpb24tc2FuY3R1YXJ5LWNpdGllcy1kb2dlLWltbWlncmF0aW9uLyJ9.vHf-PRLgsSHZ5RJputtSGC7lVIX3Pc8YByhAbHFw-wg&itid=gfta"
  },
  {
    "text": "Biden Administration Wants To Protect IRS Funding As Budget Deadline Nears  —  Treasury's deputy secretary warned that the U.S. could lose $140 billion over a decade if it ends a recent funding boost to the IRS.  —  LOADING  —  President Joe Biden's administration wants Congress … ",
    "url": "https://www.huffpost.com/entry/biden-administration-protect-irs-funding-budget-deadline_n_67462341e4b0fffc5a469d1f"
  },
  {
    "text": "Texas committee won't examine maternal deaths in first years after abortion ban  —  The decision comes as maternal mortality committees across the country begin to investigate the potential impacts of abortion laws.  —  The Texas committee that examines all pregnancy-related deaths in the state … ",
    "url": "https://www.washingtonpost.com/investigations/2024/11/26/texas-committee-wont-examine-maternal-deaths-first-years-after-abortion-ban/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMyNTk3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMzOTc5NTk5LCJpYXQiOjE3MzI1OTcyMDAsImp0aSI6IjQ5MjMwMDQwLTcyMTItNGE2Mi1hOTA0LWNmYzgxMGI2Y2IxMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbnZlc3RpZ2F0aW9ucy8yMDI0LzExLzI2L3RleGFzLWNvbW1pdHRlZS13b250LWV4YW1pbmUtbWF0ZXJuYWwtZGVhdGhzLWZpcnN0LXllYXJzLWFmdGVyLWFib3J0aW9uLWJhbi8ifQ.V7PC0DKC1PAKYZkg2oc5w5UtGdDNu4RKRbKiSYJHAD8&itid=gfta"
  },
  {
    "text": "‘Unquestioning right-wing soldiers’: Analyst issues stark warning about MAGA's school plan  —  With Donald Trump set to return to office, the Christian nationalist far right is already plotting how to take control of the schools, and indoctrinate children with “mindless obedience” for their cause, Amanda Marcotte wrote for Salon.",
    "url": "https://www.rawstory.com/christian-nationalists-2670004614/"
  },
  {
    "text": "Fugitive on FBI's ‘Most Wanted Terrorist’ list captured in UK after 20 years  —  Daniel Andreas San Diego, a fugitive on the FBI's “Most Wanted Terrorist” list, was captured in the United Kingdom on Monday after more than 20 years.  —  San Diego, 46, wanted for his alleged involvement … ",
    "url": "https://thehill.com/policy/international/5011338-fugitive-on-fbis-most-wanted-terrorist-list-captured-in-u-k-after-20-years/"
  },
  {
    "text": "One of Trump's Alleged Attempted Assassins Sent Me a Letter  —  Ryan Routh allegedly tried to shoot Donald Trump.  What does he believe?  —  The day after the second attempt on his life this year, Donald Trump blamed Joe Biden and Kamala Harris.  “Their rhetoric is causing me to be shot at,” Trump said.",
    "url": "https://www.politico.com/news/magazine/2024/11/26/ryan-routh-trump-alleged-assassin-letter-column-00190211"
  },
  {
    "text": "Watch Live: President Biden to speak as ceasefire between Israel and Hezbollah expected to halt war in Lebanon within hours  —  Israeli Prime Minister Benjamin Netanyahu announced Tuesday that he will recommend a proposed ceasefire deal with Hezbollah to his Cabinet for approval and that a vote is expected later in the day.",
    "url": "https://www.cbsnews.com/news/israel-hezbollah-ceasefire-netanyahu-war-lebanon-gaza-hamas/"
  },
  {
    "text": "The U.N's Anti-Israel ‘Genocide’ Purge  —  Alice Nderitu said Israel's campaign in Gaza doesn't meet the definition of genocide.  She was fired.  —  The United Nations long ago lost credibility as a moral arbiter, but its assault on Israel is hitting a new low.",
    "url": "https://www.wsj.com/opinion/the-u-ns-anti-israel-genocide-purge-c8feef1a"
  },
  {
    "text": "Exclusive: The Harris Campaign On What Went Wrong  —   APPLE PODCASTS -   SPOTIFY -   STITCHER  —  In This Episode  —  In this candid interview, the leaders of the Harris-Walz Campaign speak for the first time about the challenges they faced and why they made the decisions they did.",
    "url": "https://crooked.com/podcast/exclusive-the-harris-campaign-on-what-went-wrong/"
  }
]