[
  {
    "text": "Trump's RNC officially kills the GOP's mail-in voter effort  —  The Trump-branded Republican Party is less interested in promoting voting by mail than in legal challenges aimed at voting systems.  —  In a victory for the extremist wing of the Republican Party, it looks like Donald Trump's … ",
    "url": "https://www.msnbc.com/the-reidout/reidout-blog/main-in-voting-bank-your-vote-republicans-rcna143291"
  },
  {
    "text": "Biden up by 1 point over Trump in new national survey  —  President Biden is holding a 1-point lead over former President Trump in a new national survey as the two head toward a likely rematch in November.  —  The new Reuters/Ipsos poll found Biden leading Trump with 39 percent … ",
    "url": "https://thehill.com/homenews/campaign/4531410-biden-up-by-1-point-over-trump-in-new-national-survey/"
  },
  {
    "text": "US firm that paid indicted FBI informant tied to Trump associates, records reveal  —  Alexander Smirnov was paid $600,000 in 2020 - the same year he allegedly began lying to FBI about Bidens' role in Ukraine business  —  An American company that paid the now indicted FBI informant Alexander Smirnov … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/14/company-paying-fbi-informant-trump-connections"
  },
  {
    "text": "Stormy Daniels Is Going to Screw Trump's Campaign Schedule  —  Trump is about to have his entire schedule derailed by courtroom appearances and, even if his campaign thinks he can make it work, Trump is about to have real time problems.  —  Having secured his third straight Republican … ",
    "url": "https://www.thedailybeast.com/the-courtroom-over-the-campaign-trail-inside-trumps-broken-schedule"
  },
  {
    "text": "Johnson signals shift on Ukraine to GOP senators  —  Speaker Mike Johnson (R-La.) told Republican senators Wednesday to expect the House to send them legislation to help Ukraine, but cautioned that what comes out of the House will look substantially different than the $95 billion foreign aid package the Senate passed last month.",
    "url": "https://thehill.com/homenews/senate/4530355-johnson-signals-shift-on-ukraine-to-gop-senators/"
  },
  {
    "text": "Trump in court for hearing on classified documents charges  —  FORT PIERCE, Fla. — Presumptive GOP presidential candidate Donald Trump attended a court hearing Thursday where his lawyers tried to convince a federal judge to throw out charges against him for allegedly mishandling highly classified documents … ",
    "url": "https://www.washingtonpost.com/national-security/2024/03/14/trump-classified-documents-presidential-records-act-espionage/"
  },
  {
    "text": "Voters don't have a clue about how much worse Trump's second term would be  —  Gameli Fenuku, a 22-year-old Black college student in Richmond, Va. is exactly the demographic you'd think would never vote for Donald Trump in November — and indeed he may not.  But Fenuku told the New York Times … ",
    "url": "https://www.inquirer.com/columnists/trump-47-second-term-dangers-authoritarianism-20240314.html#loaded"
  },
  {
    "text": "Former Treasury Secretary Mnuchin is putting together an investor group to buy TikTok  — Former Treasury Secretary Steven Mnuchin said he is putting together an investor group to try to buy TikTok.  — “I think the legislation should pass and I think it should be sold,” Mnuchin told CNBC's “Squawk Box” on Thursday.",
    "url": "https://www.cnbc.com/2024/03/14/former-treasury-secretary-mnuchin-is-putting-together-an-investor-group-to-buy-tiktok.html"
  },
  {
    "text": "Schumer to call for ‘new election’ in Israel in scathing speech on Netanyahu  —  “Israel cannot hope to succeed as a pariah opposed by the rest of the world,” the Senate majority leader is expected to say.  —  Senate Majority Leader Charles E. Schumer (D-N.Y.) will call for the Israeli government … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/14/israel-elections-netanyahu-charles-schumer/"
  },
  {
    "text": "Exclusive: Trump launched CIA covert influence operation against China  —  Two years into office, President Donald Trump authorized the Central Intelligence Agency to launch a clandestine campaign on Chinese social media aimed at turning public opinion in China against its government … ",
    "url": "https://www.reuters.com/world/us/trump-launched-cia-covert-influence-operation-against-china-2024-03-14/"
  },
  {
    "text": "Media compounds failure on Hur report  —  On February 8, Special Counsel Robert Hur released a report describing President Joe Biden as a “well-meaning, elderly man with a poor memory” and “diminished faculties.”  Although Hur concluded that criminal charges against Biden … ",
    "url": "https://popular.info/p/media-compounds-failure-on-hur-report"
  },
  {
    "text": "US ambassador hits out at Hungary's ‘unhinged anti-American messaging’  —  In speech in Budapest, David Pressman says while Hungary under Viktor Orbán tries to wait out US government, ‘we will act’  —  The US ambassador to Hungary has said Washington will act in response to Budapest's … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/14/us-ambassador-hungary-unhinged-anti-american-messaging-orban"
  },
  {
    "text": "Hair-Raising Details of New Jersey GOP Senate Candidate's DUI Emerge  —  Asked by a cop if he'd been in a crash, the New Jersey Republican said: “I don't think so,” according to a police report.  —  New details have emerged of an incident involving a New Jersey Republican candidate running … ",
    "url": "https://www.thedailybeast.com/hair-raising-details-of-gop-senate-candidate-alex-zdans-dui-emerge"
  },
  {
    "text": "In history-making visit, Harris plans to tour Minnesota abortion clinic  —  Vice President Harris plans to travel to Minnesota on Thursday to visit a reproductive health center that provides abortions, according to a White House official, in what is believed to be the first time an American president … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/14/kamala-harris-abortion-visit-minnesota/"
  },
  {
    "text": "Sen. Bob Menendez is considering running for re-election as an independent, sources say  —  The New Jersey Democrat has been indicted on 18 federal counts, including accepting bribes from a foreign government.  He and his wife have pleaded not guilty.  —  WASHINGTON — Indicted Sen. Bob Menendez … ",
    "url": "https://www.nbcnews.com/politics/2024-election/sen-bob-menendez-considering-running-re-election-independent-sources-s-rcna143406"
  },
  {
    "text": "“Experts are desperate to warn the public”: Hundreds sign Dr. John Gartner's Trump dementia petition  —  “They see the signs of Trump's cognitive decline through the eyes of years of training and experience”  —  Since at least 2016, a brave, determined, and stalwart group of psychologists … ",
    "url": "https://www.salon.com/2024/03/14/experts-are-desperate-to-warn-the-public-hundreds-sign-dr-john-gartners-dementia-petition/"
  },
  {
    "text": "Biden administration announces $120 million for tribal climate resilience  —  The Biden administration will fund 146 tribal climate resilience projects to the tune of $120 million, Interior Department officials announced Thursday.  —  The funds include $71 million in Inflation Reduction Act … ",
    "url": "https://thehill.com/policy/energy-environment/4531461-biden-administration-announces-120-million-for-tribal-climate-resilience/"
  }
]