[
  {
    "text": "Musk, Ramaswamy lay out plans for ‘mass’ federal layoffs, rule rollbacks under Trump  —  Tech entrepreneurs Elon Musk and Vivek Ramaswamy said Wednesday that their brand-new government efficiency panel will identify “thousands” of regulations for President-elect Trump to eliminate … ",
    "url": "https://thehill.com/policy/technology/5000448-elon-musk-vivek-ramaswamy-government-efficiency/"
  },
  {
    "text": "Elon Musk and Vivek Ramaswamy: The DOGE Plan to Reform Government  —  Following the Supreme Court's guidance, we'll reverse a decadeslong executive power grab.  —  Our nation was founded on the basic idea that the people we elect run the government.  That isn't how America functions today.",
    "url": "https://www.wsj.com/opinion/musk-and-ramaswamy-the-doge-plan-to-reform-government-supreme-court-guidance-end-executive-power-grab-fa51c020?st=9M7A13&reflink=article_imessage_share"
  },
  {
    "text": "Speaker Johnson announces policy barring trans women from Capitol bathrooms  —  Speaker Mike Johnson (R-La.) announced on Wednesday that transgender women are not permitted to use bathrooms in the Capitol that match their gender identity, taking a stance on the hot-button issue that has overtaken the Capitol in recent days.",
    "url": "https://thehill.com/homenews/house/5000006-speaker-johnson-transgender-bathroom-policy/"
  },
  {
    "text": "Mike Johnson Announces Transgender Bathroom Ban In Capitol  —  The speaker's announcement is aimed in particular at incoming transgender congresswoman Sarah McBride.  —  LOADING  —  WASHINGTON ― House Speaker Mike Johnson (R-La.) announced Wednesday that transgender lawmakers and staff … ",
    "url": "https://www.huffpost.com/entry/mike-johnson-trans-women-capitol-bathrooms_n_673e19fbe4b09ddca792b130"
  },
  {
    "text": "Please, Mr. President, ditch this dreadful duo — Gabbard and Gaetz  —  In January 2017, shortly after taking office for the first time, President Donald Trump had already issued 19 executive actions, and this paper dubbed him DON NONSTOP.  —  To which second-term Trump says: “Hold my Diet Coke.”",
    "url": "https://nypost.com/2024/11/19/opinion/donald-trump-please-get-rid-of-matt-gaetz-and-tulsi-gabbard-from-your-cabinet/"
  },
  {
    "text": "House Ethics panel does not agree to release the Gaetz report  —  The House Ethics Committee on Wednesday did not agree to release the long-anticipated report into Matt Gaetz.  “There was not an agreement by the committee to release the report,” Chair Michael Guest (R-Miss.) told reporters after the meeting ended.",
    "url": "https://www.politico.com/live-updates/2024/11/20/congress/ethics-panel-does-not-agree-to-release-gaetz-report-00190655"
  },
  {
    "text": "Republicans in North Carolina push sweeping changes to consolidate power  —  The last-minute inclusions in a lame-duck bill would strip the incoming Democratic governor and attorney general of significant authority before the GOP loses its legislative supermajority.",
    "url": "https://www.washingtonpost.com/politics/2024/11/20/north-carolina-legislature-governor-elections/"
  },
  {
    "text": "Morning Digest: In stunning turnaround, Democrat takes lead in North Carolina Supreme Court race  —  Leading Off  —  NC Supreme Court  —  A critical race for North Carolina's Supreme Court is headed to a recount after late-counted votes gave Democratic incumbent Allison Riggs the slimmest … ",
    "url": "https://www.the-downballot.com/p/morning-digest-in-stunning-turnaround"
  },
  {
    "text": "Gaetz sent over $10K in Venmo payments to 2 women who testified in House probe, records suggest  —  House investigators also obtained a $750 check from Gaetz, said sources.  —  Matt Gaetz talks before President-elect Donald Trump speaks during an America First Policy Institute gala at his Mar-a-Lago estate … ",
    "url": "https://abcnews.go.com/US/gaetz-10k-venmo-payments-2-women-testified-house/story?id=116019367"
  },
  {
    "text": "Ukraine Fires UK Cruise Missiles at Russia for First Time  — Comes day after Western-supplied ATACMS were used by Ukraine  — Ukraine's Zelenskiy has said weapons critical to the conflict  —  Ukrainian forces fired British cruise missiles at military targets inside Russia for the first time … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-20/ukraine-fires-uk-storm-shadow-missiles-at-russia-for-first-time"
  },
  {
    "text": "Raimondo's urgent mission: Leave no cash for Trump  —  With a massive legacy program hanging in the balance, the Commerce secretary wants to get billions in microchip money out the door in the next two months.  —  Commerce Secretary Gina Raimondo is on an urgent mission … ",
    "url": "https://www.politico.com/news/2024/11/20/raimondo-commerce-trump-legacy-00190538"
  },
  {
    "text": "Graham urges GOP senators not to join Gaetz ‘lynch mob’  —  Sen. Lindsey Graham (S.C.) urged his fellow Republican senators Wednesday not to join what he called the “lynch mob” calling for former Rep. Matt Gaetz (R-Fla.) to withdraw his nomination to serve as attorney general because of allegations … ",
    "url": "https://thehill.com/homenews/senate/4999850-gaetz-nomination-sexual-misconduct/"
  },
  {
    "text": "Harris Loss Has Democrats Fighting Over How to Talk About Transgender Rights  —  Kamala Harris left Donald J. Trump's anti-transgender attack ads largely unanswered.  Some Democrats call it political malpractice.  —  In the weeks before Election Day, aides to Kamala Harris could see in campaign polling … ",
    "url": "https://www.nytimes.com/2024/11/20/us/politics/presidential-campaign-transgender-rights.html"
  },
  {
    "text": "Luna: Johnson blocked proxy voting for new moms  —  Rep. Anna Paulina Luna (R-Fla.) said Wednesday that Speaker Mike Johnson has blocked her proposal to allow new mothers to vote by proxy for several months from being included in the rules package for the next Congress.",
    "url": "https://www.politico.com/live-updates/2024/11/20/congress/house-proxy-voting-blocked-00190692"
  },
  {
    "text": "Trump's education pick once incorrectly claimed to have education degree  —  Linda McMahon, in a questionnaire for a 2009 post on a Connecticut state education board, incorrectly said she had a bachelor's degree in education, according to news reports.  —  Linda McMahon, President-elect … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/20/mcmahon-trump-education-degree/"
  },
  {
    "text": "MSNBC Faces Potential for Big Changes in Comcast Cable Spin-Off  —  MSNBC fans who are disappointed in the progressive-leaning network after Donald Trump's victory in the 2024 election may no longer have it to kick around.  —  The cable-news outlet could have to consider changing its name … ",
    "url": "https://variety.com/2024/tv/news/msnbc-faces-big-changes-comcast-cable-spin-off-rachel-maddow-mark-lazarus-1236215502/"
  },
  {
    "text": "Mandate?  Fuller election results increasingly show GOP gains were small.  —  A holistic look — down to the state legislative level — reinforces the fact that early Trump and GOP claims to a huge “mandate” were overblown.  —  From the moment he claimed victory in the 2024 presidential election … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/20/mandate-fuller-election-results-increasingly-show-gop-gains-were-small/"
  },
  {
    "text": "Morning Joe Hemorrhaged Viewers After Announcing Meeting With Trump  —  Based on Monday morning's hour-by-hour ratings, Morning Joe viewers were not happy with Joe Scarborough and Mika Brzezinski's announcement that they met privately with President-Elect Donald Trump at Mar-a-Lago on Friday.",
    "url": "https://www.mediaite.com/tv/new-morning-joe-hemorrhaged-viewers-after-announcing-meeting-with-trump/"
  },
  {
    "text": "Behind the Scenes at a Secretive Gathering of Rising MAGA Donors  —  The Winklevoss twins, Rebekah Mercer, allies of Elon Musk, Donald Trump Jr. and top Trump campaign aides recently joined a conclave of right-wing donors who are suddenly flush with power.  —  Just four days after being named … ",
    "url": "https://www.nytimes.com/2024/11/20/us/politics/rockbridge-trump-vance-wiles.html"
  }
]