[
  {
    "text": "Harvard Is Said to Be Open to Spending Up to $500 Million to Resolve Trump Dispute  —  The sum sought by the government is more than twice as much as the $200 million fine that Columbia University said it would pay when it settled its clash with the White House last week.",
    "url": "https://www.nytimes.com/2025/07/28/us/politics/trump-harvard-payment.html?unlocked_article_code=1.Z08.Ih6h.KhLhW9cYpGYm&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Justice Department Scrutinizes George Mason Faculty's Diversity Stance  —  The Faculty Senate at George Mason University in Virginia adopted a resolution supporting the school's president and his work related to diversity.  The Justice Department says it will investigate.",
    "url": "https://www.nytimes.com/2025/07/28/us/justice-department-george-mason-faculty-senate-investigation.html?unlocked_article_code=1.Z08.l0km.qSjag1ueU-5j&smid=url-share"
  },
  {
    "text": "Dropped cases against LA protesters reveal false claims from federal agents  —  Revealed: records show border patrol gave inaccurate testimony about people it jailed.  Prosecutors now face ‘embarrassing’ dismissals  —  US immigration officers made false and misleading statements in their reports … ",
    "url": "https://www.theguardian.com/us-news/2025/jul/28/doj-la-protesters-false-claims"
  },
  {
    "text": "Whistleblower evidence suggests Trump judicial nominee Emil Bove misled Senate  —  A third whistleblower has new information about a Justice Department official the president has nominated to the U.S. Court of Appeals for the 3rd Circuit.  —  A new whistleblower has come forward to challenge … ",
    "url": "https://www.washingtonpost.com/national-security/2025/07/28/emil-bove-nomination-judge-mislead/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzNjc1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1MDU3NTk5LCJpYXQiOjE3NTM2NzUyMDAsImp0aSI6ImZiMjFiYTc0LWY2Y2ItNDRlZi1iOTgxLTkzZWQxMDc0ZWZhMCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA3LzI4L2VtaWwtYm92ZS1ub21pbmF0aW9uLWp1ZGdlLW1pc2xlYWQvIn0.j0m4aCyhog1cUDQD_8fffOneIz9nKP6GJKnPXfhHO5o&itid=gfta"
  },
  {
    "text": "Fact Sheet: The United States and European Union Reach Massive Trade Deal  —  MAKING GLOBAL HISTORY: Yesterday, President Donald J. Trump announced a trade deal with the European Union (EU), fundamentally rebalancing the economic relationship between the world's two largest economies.",
    "url": "https://www.whitehouse.gov/fact-sheets/2025/07/fact-sheet-the-united-states-and-european-union-reach-massive-trade-deal/"
  },
  {
    "text": "Ghislaine Maxwell files Supreme Court brief appealing Epstein conviction … - The Trump administration has faced weeks of bipartisan backlash after reneging on promises to release all files related to the now-deceased sex trafficker.  — MAGA activists have suggested that Maxwell … ",
    "url": "https://www.axios.com/2025/07/28/ghislaine-maxwell-supreme-court-appeal-epstein-files"
  },
  {
    "text": "2 shot, including officer, outside office building in Midtown Manhattan; suspect dead: Sources  —  The shooting occurred outside an office building, police sources said.  —  A police officer and a civilian were shot outside an office building on Park Avenue on Monday, police sources told ABC News.",
    "url": "https://abcnews.go.com/US/midtown-manhattan-shooting/story?id=124154597"
  },
  {
    "text": "Brave NYPD officer killed in Midtown shooting identified as Didarul Islam — 4-year force veteran with a family  —  The brave NYPD officer who was shot and killed by a deranged gunman inside a Midtown skyscraper Monday was identified as a dad and nearly four-year veteran of the force … ",
    "url": "https://nypost.com/2025/07/28/us-news/nypd-officer-killed-in-midtown-shooting-identified-as-didarul-islam/"
  },
  {
    "text": "Trump seeks quick Murdoch deposition in Wall Street Journal lawsuit over Epstein story  —  President Donald Trump is asking a federal court in Florida to force Rupert Murdoch to give a deposition for the president's lawsuit against The Wall Street Journal within 15 days, citing the media mogul's age and physical condition.",
    "url": "https://apnews.com/article/trump-murdoch-wall-street-journal-lawsuit-deposition-3d9dbabe52a5d54e0ab7bf57265a39f4"
  },
  {
    "text": "Trump administration urges federal employees to talk religion at work  —  The guidance from the Office of Personnel Management builds on the administration's efforts to bolster faith's presence in the federal workforce.  —  Federal employees can display religious items at work … ",
    "url": "https://www.washingtonpost.com/business/2025/07/28/federal-workers-religious-expression/"
  },
  {
    "text": "In a First, Leading Israeli Rights Groups Accuse Israel of Gaza Genocide  —  Israel says it is fighting against Hamas, not Palestinians as a group.  But two of Israel's best-known rights groups — long critical of Israeli policy — now say they disagree.  —  Two of Israel's best-known human … ",
    "url": "https://www.nytimes.com/2025/07/28/world/middleeast/israel-genocide-gaza-rights-groups.html?unlocked_article_code=1.Z08.VehI.nGHoHCmo9D1v&smid=url-share"
  },
  {
    "text": "Another Trump clash with the courts is already spinning out into criminal cases … In a nine-page filing, Mirigliano said his client is “facing an imminent criminal trial proceeding under questionable legal authority” and asked for the charges to be thrown out or that Habba and her assistants … ",
    "url": "https://www.politico.com/news/2025/07/28/alina-habbas-authority-as-new-jerseys-top-prosecutor-questioned-in-new-legal-filing-00480025"
  },
  {
    "text": "Bondi DOJ files complaint alleging misconduct by Federal Judge James Boasberg  —  Second official complaint against a federal judge since Bondi took office as Attorney General  —  The Department of Justice has filed an official complaint alleging misconduct by US District Court Chief Judge James Boasberg.",
    "url": "https://www.foxnews.com/politics/bondi-doj-files-complaint-alleging-misconduct-federal-judge-james-boasberg"
  },
  {
    "text": "Trump blasts ‘nasty’ London mayor in front of Starmer: 'He's done a terrible job'  —  President Donald Trump reignited his long-running feud with London Mayor Sadiq Khan on Monday, delivering a fresh round of criticism while seated beside U.K. Prime Minister Keir Starmer.",
    "url": "https://www.washingtonexaminer.com/news/world/3484452/trump-sadiq-khan-feud-blasts-nasty-london-mayor-in-front-of-keir-starmer/"
  },
  {
    "text": "Shooter opens fire outside Reno casino, killing 3 and injuring several others  —  Police in Nevada say a gunman opened fire just outside the Grand Sierra Resort casino in Reno and shot multiple people.  The conditions of the victims were not immediately known.",
    "url": "https://apnews.com/article/reno-nevada-grand-sierra-resort-shooting-e8892d51ec4dd2d61b507012773a8c4d"
  },
  {
    "text": "Judge orders Medicaid funding temporarily restored to all Planned Parenthood affiliates  —  A federal judge in Boston on Monday blocked the Trump administration from cutting funding to all Planned Parenthood affiliates as part of the GOP's new tax cut and health law.",
    "url": "https://thehill.com/policy/healthcare/5423680-planned-parenthood-medicaid-lawsuit-injunction/"
  },
  {
    "text": "Federal data has been disappearing under Trump … Government data is at risk.  Federal funding for the main statistical agencies — like the Bureau of Labor Statistics and the Commerce Department — has been tight for years.  —  But since the Trump administration took office in January … ",
    "url": "https://www.marketplace.org/story/2025/07/28/federal-data-has-been-disappearing-under-trump"
  },
  {
    "text": "Meet the out-of-state investors funding a Christian nationalist community in Tennessee  —  For the politically connected investors behind the project, our NewsChannel 5 investigation has now discovered, it's about business, power and creating an alternative view of America.",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/confronting-hate/meet-the-out-of-state-investors-funding-a-christian-nationalist-community-in-tennessee"
  },
  {
    "text": "Republican Nancy Mace says she likes to watch videos of Ice detaining people  —  Congresswoman says she ‘can think of nothing more American’ than Ice dragging people out of court  —  Republican congresswoman Nancy Mace has claimed she cruises the web for videos of US Immigration and Customs Enforcement … ",
    "url": "https://www.theguardian.com/us-news/2025/jul/28/nancy-mace-ice-videos"
  },
  {
    "text": "Texas Attorney General Paxton sues New York county clerk over abortion ruling  —  Texas Attorney General Ken Paxton is taking legal action against a New York county clerk for refusing to file a judgment and court summons against a doctor who allegedly prescribed and mailed abortion medication to a woman in Texas.",
    "url": "https://thehill.com/policy/healthcare/5424404-texas-ag-sues-ny-doctor/"
  },
  {
    "text": "Obama Official Files Bombshell Demand for Epstein Files and Secret Trump Messages  —  OBAMA DARE  —  Norm Eisen, the former White House ethics chief, has filed a wide-ranging Freedom of Information Act request.  —  One of President Donald Trump's most persistent legal foes is going after the Epstein files.",
    "url": "https://www.thedailybeast.com/obama-official-files-bombshell-demand-for-the-epstein-files-and-secret-trump-messages/"
  },
  {
    "text": "Judges press Trump administration on deportation quotas … “Not to my knowledge, your honor,” replied DOJ attorney Yaakov Roth, who urged the court to lift the order focused on surprise immigration enforcement at places like home improvement store parking lots and car washes.",
    "url": "https://www.politico.com/news/2025/07/28/judges-trump-administration-deportation-quotas-00480899"
  },
  {
    "text": "Apple's iOS 26 text filters could cost political campaigns millions of dollars, top GOP group warns … iOS 26 includes a new feature that allows users to filter text messages from unrecognized numbers into an “Unknown Senders” folder without sending a notification.",
    "url": "https://www.yahoo.com/news/articles/apples-ios-26-text-filters-201717304.html"
  },
  {
    "text": "Project 2025 architect Paul Dans to challenge Lindsey Graham for Senate  —  “This is ultimately a steel-cage match for the future of MAGA,” said Dans, the former director of the right-wing blueprint that has informed Trump's second term.  —  Paul Dans, a key architect of the Project 2025 … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/28/paul-dans-project-2025-lindsey-graham/"
  },
  {
    "text": "Pete Buttigieg weighs in on ‘fairness’ of transgender kids playing girls' sports  —  Former Transportation Secretary Pete Buttigieg offered one of the most carefully worded responses yet to the debate over transgender youth participation in sports on Monday morning in an NPR interview.",
    "url": "https://www.advocate.com/news/pete-buttigieg-transgender-athletes"
  },
  {
    "text": "Oklahoma authorities investigate reports of explicit images on state education chief's TV  —  An Oklahoma sheriff's office Monday opened an investigation over reports that images of nude women were displayed on the state's school superintendent office television during a meeting with education board members.",
    "url": "https://apnews.com/article/oklahoma-school-superintendent-ryan-walters-naked-tv-facef621bcc4f0958c28c6a3b6abb251"
  },
  {
    "text": "Trump blocks Taiwan's President Lai from New York stopover  —  Move comes as US and China hold trade talks and seek to stabilise relations  —  Donald Trump's administration has denied permission for Taiwan's President Lai Ching-te to stop in New York en route to Central America … ",
    "url": "https://www.ft.com/content/21575bec-5cdd-47ee-9db2-3031c4ea7ca7"
  }
]