[
  {
    "text": "Wall Street opposition to Trump collapses, as ‘pipe dream’ of primary defeat ends  — Many Wall Street executives have made a calculated decision not to speak out against Donald Trump, and in some cases they will consider supporting the Republican former president.",
    "url": "https://www.cnbc.com/2024/01/22/wall-street-opposition-to-trump-collapses-as-pipe-dream-of-primary-defeat-ends.html"
  },
  {
    "text": "Is Nikki Haley the Real Frontrunner?  —  A reader in New Hampshire emailed me Saturday and said that in that day's mail, he had received no fewer than twelve mailings asking for his vote in Tuesday's primary.  He said that wasn't unusual this close to the big day, but that what struck … ",
    "url": "https://pjmedia.com/robert-spencer/2024/01/21/is-nikki-haley-the-real-frontrunner-n4925707"
  },
  {
    "text": "The Party of Malice  —  Donald Trump has made the Republican Party cruel, xenophobic, exclusionary, and bigoted.  —  You knew it was coming.  —  As soon as former South Carolina Governor Nikki Haley emerged as the main threat to Donald Trump in the battle for the Republican nomination … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/01/haley-trump-gop/677212/"
  },
  {
    "text": "Supreme Court allows Border Patrol agents to remove razor wire installed by Texas at Mexico border  —  The court weighed in on a dispute between the Biden administration and Republican Gov. Greg Abbott, who installed the wire in an effort to prevent illegal border crossings.",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-border-patrol-agents-remove-razor-wire-installed-rcna132890"
  },
  {
    "text": "Supreme Court clears way for border agents to remove Texas wire barrier  —  The Supreme Court sided with the Biden administration on Monday and cleared the way for border patrol agents to remove razor wire Texas officials installed along a busy stretch of the southern border until the legality of the barriers is resolved in court.",
    "url": "https://www.washingtonpost.com/politics/2024/01/22/supreme-court-texas-biden-border-razor-wire/"
  },
  {
    "text": "Fake Joe Biden robocall tells New Hampshire Democrats not to vote on Tuesday  —  The call, an apparent imitation or digital manipulation of the president's voice, says, “Voting this Tuesday only enables the Republicans in their quest to elect Donald Trump again.”",
    "url": "https://www.nbcnews.com/politics/2024-election/fake-joe-biden-robocall-tells-new-hampshire-democrats-not-vote-tuesday-rcna134984"
  },
  {
    "text": "Republicans Push To Legalize ‘Property Owners’ Killing Homeless People in Kentucky  —  In Kentucky, politicians are preparing to vote on a law that would authorize the use of force against unhoused people who are found to be camping on private property.  —  Republican politicians in Kentucky … ",
    "url": "https://www.vice.com/en/article/jg54mg/republicans-push-to-legalize-property-owners-killing-homeless-people-in-kentucky"
  },
  {
    "text": "Ethics Ratings of Nearly All Professions Down in U.S.  —  WASHINGTON, D.C. — Americans' ratings of nearly all 23 professions measured in Gallup's 2023 Honesty and Ethics poll are lower than they have been in recent years.  Only one profession — labor union leaders — has not declined since 2019 … ",
    "url": "https://news.gallup.com/poll/608903/ethics-ratings-nearly-professions-down.aspx"
  },
  {
    "text": "The Supreme Court Cooked Up Another Phony Case to Tear Down Major Precedent  —  This is part of Opening Arguments, Slate's coverage of the start of the latest Supreme Court term.  We're working to change the way the media covers the Supreme Court.  Support our work when you join Slate Plus.",
    "url": "https://slate.com/news-and-politics/2024/01/supreme-court-phony-fish-case-chevron.html"
  },
  {
    "text": "'It's embarrassing': Republicans worry they have no achievements to run on in 2024  —  Rep. Chip Roy, R-Texas, has openly questioned whether the GOP deserves to keep the House majority, lamenting the lack of accomplishments this Congress.  He's not alone.  —  WASHINGTON — When Congress began … ",
    "url": "https://www.nbcnews.com/politics/2024-election/s-embarrassing-republicans-worry-no-achievements-run-2024-rcna131902"
  },
  {
    "text": "Biden campaign features OB-GYN who left Texas for abortion in new ad  —  President Biden's reelection campaign on Monday dropped an ad to mark the 51st anniversary of Roe v. Wade that features an OB-GYN who couldn't receive an abortion in Texas after the landmark law was overturned",
    "url": "https://thehill.com/homenews/campaign/4421276-biden-campaign-ob-gyn-ad-texas-abortion/"
  },
  {
    "text": "Trump campaign blocks NBC journalist from New Hampshire event  —  Vaughn Hillyard excluded a day after pressing Republican Elise Stefanik on whether Trump had sexually assaulted E Jean Carroll  —  Donald Trump's presidential campaign reportedly blocked an NBC News journalist from covering campaign events in New Hampshire on Sunday.",
    "url": "https://www.theguardian.com/us-news/2024/jan/22/trump-campaign-blocks-nbc-reporter-vaughn-hillyard"
  },
  {
    "text": "Far-right AfD leader vows to campaign for Brexit-style EU exit vote in Germany  —  Alice Weidel says UK departure is model for her country as party struggles with reaction to exposé about deportation ‘masterplan’  —  The leader of Germany's far-right Alternative für Deutschland … ",
    "url": "https://www.theguardian.com/world/2024/jan/22/germany-far-right-afd-leader-alice-weidel-eu-exit-campaign"
  },
  {
    "text": "25,000 deaths in Gaza: Why the destruction of this war exceeds that of other major conflicts  —  Eight out of every 10 victims in the Palestinian enclave since last October 7 are women or children  —  By DANIELE GRASSO YOLANDA CLEMENTE ANTONIO PITA  —  The health authorities in Gaza … ",
    "url": "https://english.elpais.com/international/2024-01-22/25000-deaths-in-gaza-why-the-destruction-of-this-war-exceeds-that-of-other-major-conflicts.html"
  },
  {
    "text": "Dexter Scott King, son of Martin Luther King Jr., dies at 62  —  The younger son of the late civil rights leader died in California after a bout with prostate cancer.  —  Dexter Scott King, the lookalike of his iconic father, the civil rights leader Dr. Martin Luther King, Jr., has died.  He was 62.",
    "url": "https://www.nbcnews.com/news/nbcblk/dexter-scott-king-son-martin-luther-king-jr-dies-62-rcna135109"
  },
  {
    "text": "Growing Oct. 7 ‘truther’ groups say Hamas massacre was a false flag  —  In city council hearings, protests and online, a growing movement with ties to Holocaust denial is effacing history in real-time  —  When she first heard about Hamas's Oct. 7 attack on Israel, Mirela Monte was “appalled.”",
    "url": "https://www.washingtonpost.com/technology/2024/01/21/hamas-attack-october-7-conspiracy-israel/"
  },
  {
    "text": "Biden expands abortion, contraception protections on Roe anniversary  —  The White House on Monday is announcing new steps intended to ensure access to contraception, abortion medication and emergency abortions at hospitals.  It represents President Biden's latest bid to contrast himself … ",
    "url": "https://www.washingtonpost.com/health/2024/01/22/biden-abortion-contraception/"
  },
  {
    "text": "Donald Trump defamation trial live updates: Judge to rule whether E. Jean Carroll's $10M case proceeds without him on NH primary day  —  Just moments after Donald Trump arrived at Manhattan federal court Monday morning to sit in on a civil defamation trial against him, Judge Lewis Kaplan canceled … ",
    "url": "https://nypost.com/2024/01/22/news/donald-trump-vs-e-jean-carroll-defamation-trial-live-updates/"
  },
  {
    "text": "Georgia Judge Unseals Trump Special Prosecutor Nathan Wade's Divorce Records  —  Nathan Wade was hired by Fulton County District Attorney Fani Willis as the special prosecutor in her sweeping election-racketeering case against former President Donald Trump and others",
    "url": "https://themessenger.com/politics/nathan-wade-divorce-proceeding-cobb-county-trump-georgia-fani-willis"
  },
  {
    "text": "‘The Right Kind of Crazy’: Matt Gaetz Makes MAGA World Swoon  —  MANCHESTER, New Hamphire — Standing inside a makeshift office, a crowd of red hat-wearing MAGA acolytes in front of him and a massive mural of piercing-eyes Donald Trump on the wall behind, Matt Gaetz comfortably took questions … ",
    "url": "https://www.politico.com/news/magazine/2024/01/22/maga-movement-heir-matt-gaetz-00136968"
  }
]