[
  {
    "text": "Trump Put Musk on Phone With Zelensky During Call  —  Elon Musk was with Donald Trump at Mar-a-Lago when the president-elect spoke with Ukraine's leader.  It is not clear if they discussed any change in U.S. policy toward Ukraine.  —  President-elect Donald J. Trump spoke on Wednesday … ",
    "url": "https://www.nytimes.com/2024/11/08/us/politics/trump-musk-zelensky.html?unlocked_article_code=1.YU4.IeTL.0A1I6CIR9Fhj&smid=url-share"
  },
  {
    "text": "Scoop: Elon Musk joined Trump's call with Zelensky … - The Biden administration is now looking for ways to get as much military assistance as possible to Ukraine ahead of Jan. 20, when Trump could turn off the spigot.  — But the private conversations Trump and his team have had with Zelensky … ",
    "url": "https://www.axios.com/2024/11/08/musk-trump-zelensky-ukraine-call"
  },
  {
    "text": "A Red-District Conqueror Wants Fellow Democrats to Look in the Mirror  —  Representative Marie Gluesenkamp Perez, who is on track to win re-election in a rural Washington district, says her party needs to stop demonizing others and change the candidates it supports.  —  It's not always fun to say I told you so.",
    "url": "https://www.nytimes.com/2024/11/08/us/politics/marie-gluesenkamp-perez-interview.html"
  },
  {
    "text": "Behind the Curtain: Deep Democratic depression … Come January, they'll have scant power in the federal government, and shriveling clout in the courts and states.  — The traditional media structure sympathetic to their views, and hostile to Trump's, was shattered.",
    "url": "https://www.axios.com/2024/11/08/harris-biden-election-democratic-party"
  },
  {
    "text": "This Democratic defeat — and the rise of Trump 2.0 — was a decade in the making  —  Analysis: Biden's age and inability to sell his record or convince that he was fighting inflation were problems.  Longer-term Democratic weaknesses also came due.  —  There's something about an election … ",
    "url": "https://www.nbcnews.com/politics/elections/chuck-todd-democratic-defeat-rise-trump-20-was-decade-making-rcna179175"
  },
  {
    "text": "America's political discordance: The Trump voters who want progressivism  —  Trump voters backed abortion, minimum wage and family leave — but don't get that Project 2025 would take it away  —  Perhaps out of fear of insulting their audiences, the pundits, journalists … ",
    "url": "https://www.salon.com/2024/11/08/americas-political-discordance-the-want-progressivism/"
  },
  {
    "text": "Why Does No One Understand the Real Reason Trump Won? … I've had a lot of conversations since Tuesday revolving around the question of why Donald Trump won.  The economy and inflation.  Kamala Harris didn't do this or that.  Sexism and racism.  The border.  That trans-inmate ad that ran a jillion times.",
    "url": "https://newrepublic.com/post/188197/trump-media-information-landscape-fox"
  },
  {
    "text": "I blame the media  —  I am horrified and I am terrified and I am angry.  —  And I blame the media.  —  Yes, I am aware that some large number of people who voted for Trump did so fully aware that he will rule as a racist, a chaos agent, and a strongman.  That's what they want.  Noted.",
    "url": "https://presswatchers.org/2024/11/i-blame-the-media/"
  },
  {
    "text": "Justice Department Announces Murder-For-Hire and Related Charges Against IRGC Asset and Two Local Operatives  —  For Immediate Release  —  Iranian Asset Farhad Shakeri Employed Multiple Associates in the New York City Area to Surveil and Murder a U.S. Citizen of Iranian Origin Who Has Publicly Opposed the Iranian Government",
    "url": "https://www.justice.gov/opa/pr/justice-department-announces-murder-hire-and-related-charges-against-irgc-asset-and-two"
  },
  {
    "text": "Biden administration to allow American military contractors to deploy to Ukraine for first time since Russia's invasion  —  The Biden administration has lifted a de facto ban on American military contractors deploying to Ukraine to help the country's military maintain and repair US-provided weapons systems … ",
    "url": "https://www.cnn.com/2024/11/08/politics/biden-administration-american-military-contractors-deploy-ukraine/"
  },
  {
    "text": "Pentagon officials anxious Trump may fire the military's top general  —  The president-elect has railed against “woke” generals and others who have pushed for diversity initiatives in the ranks.  —  Defense officials are getting anxious about the possibility of the incoming Trump administration firing … ",
    "url": "https://www.politico.com/news/2024/11/08/pentagon-trump-fire-cq-brown-00188536"
  },
  {
    "text": "Pelosi Laments Biden's Late Exit and the Lack of an ‘Open Primary’  —  “Had the president gotten out sooner, there may have been other candidates in the race,” the former House speaker said in an interview with The New York Times, suggesting she had anticipated an “open primary.”",
    "url": "https://www.nytimes.com/2024/11/08/us/politics/pelosi-harris-biden-open-primary.html"
  },
  {
    "text": "Dem Insiders Begged Team Harris Not to Campaign With Liz Cheney  —  “People don't want to be in a coalition with the devil,” says a Democratic source who was appalled by Harris' embrace of Dick Cheney … It opened with the politics of joy, and a hearty dose of mockery aimed at Donald Trump and his running mate, J.D. Vance.",
    "url": "https://www.rollingstone.com/politics/politics-features/harris-cheney-democrats-campaign-trump-election-2024-1235158805/"
  },
  {
    "text": "Wave of Racist Texts After Election Prompts F.B.I.'s Scrutiny  —  Offensive messages were reported across the South and from New York to California.  —  A wave of racist text messages summoning Black people to report for slavery showed up on phones across the United States … ",
    "url": "https://www.nytimes.com/2024/11/07/us/politics/racist-texts-election-fbi.html?unlocked_article_code=1.YU4.u4wx.TaO2iS_uL2BD&smid=url-share"
  },
  {
    "text": "Playbook: Dems agonize over Sotomayor  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  THE LATEST RACE CALLS — Republican DAVE McCORMICK defeats Democratic Sen. BOB CASEY in Pennsylvania. ...  Reps. DON DAVIS (D-N.C.), YOUNG KIM (R-Calif.), JULIA BROWNLEY … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/11/08/dems-agonize-over-sotomayor-00188412"
  },
  {
    "text": "Ted Cruz's daughter caught wincing and telling her mom 'don't clap' as senator praises Trump on stage  —  Caroline Cruz, 16, was left scowling at her mother on stage as the Texas senator prayed for a Trump win  —  Your support helps us to tell the story  —  From reproductive rights … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/ted-cruz-daughter-caroline-trump-election-b2643637.html"
  },
  {
    "text": "Dump Twitter  —  The oligarchs won.  When the markets closed November 6—the day Donald Trump was declared winner of the presidential election—the combined wealth of the world's 10 richest people, nine of whom live in the United States, had surged by a combined $63.5 billion.",
    "url": "https://newrepublic.com/article/188156/liberals-dump-musk-leave-twitter"
  },
  {
    "text": "Israeli soccer fans were attacked in Amsterdam.  The violence was condemned as antisemitic  —  Israeli fans were assaulted after a soccer game in Amsterdam by hordes of young people apparently riled up by calls on social media to target Jewish people, Dutch authorities said Friday.",
    "url": "https://apnews.com/article/maccabi-tel-aviv-amsterdam-violence-protests-palestinian-bcea212281f682098c4c77ef552af5f1"
  },
  {
    "text": "Tim Walz Says To 'Get Back In This Fight When You're Ready'  —  Walz spoke to supporters in Minnesota following Donald Trump's victory in the presidential election.  —  LOADING  —  In an emotional speech at Eagan High School in his home state of Minnesota on Friday, Gov. Tim Walz (D) … ",
    "url": "https://www.huffpost.com/entry/tim-walz-says-to-get-back-in-this-fight-when-youre-ready_n_672bdfffe4b0933e82c8cf5e"
  },
  {
    "text": "Handbook For The Politically Deceased  —  Your guide to what the hell just happened in the election and what's ahead. … But one word it should not evoke is this: surprising.  In a downwardly mobile country, Democrats' rejection of working-class politics — and the party's open hostility … ",
    "url": "https://www.levernews.com/handbook-for-the-politically-deceased/"
  },
  {
    "text": "Wind the clock  —  A message to those asking “what do I do now?”  —  1×  —  I had allowed myself to hope that American voters would choose the better of the presidential options available to us, and I was wrong.  I am disappointed.  I am sad.  I am afraid.",
    "url": "https://www.citationneeded.news/wind-the-clock/"
  },
  {
    "text": "Biden's Amazon visit comes as US climate policy to shift under Trump  —  Joe Biden will become the first sitting U.S. president to visit the Brazilian Amazon when he travels to Manaus later this month, a symbolic trip given the United States is likely to see a dramatic change in climate policy under President-elect Donald Trump.",
    "url": "https://www.reuters.com/world/bidens-amazon-visit-comes-us-climate-policy-shift-under-trump-2024-11-08/"
  },
  {
    "text": "Voters Dismiss Two of California's Leading Progressive Prosecutors  —  Los Angeles' George Gascón and Oakland's Pamela Price sought to use their offices to redress the harms and disparities of the criminal legal system.  Both suffered large defeats this week.",
    "url": "https://boltsmag.org/california-progressive-prosecutors-gascon-price-lose-elections/"
  },
  {
    "text": "We Did It!  Dems Blame Kamala's Loss on ‘Right-Wing Media Ecosystem’  —  MSNBC and CNN panelists blamed Vice President Kamala Harris's decisive loss on podcasters like Joe Rogan, claiming that a right-wing “media ecosystem” radicalized Americans into voting for President-elect Donald Trump.",
    "url": "https://freebeacon.com/elections/we-did-it-dems-blame-kamalas-loss-on-right-wing-media-ecosystem/"
  },
  {
    "text": "Donald Trump asks arch protectionist Robert Lighthizer to run US trade policy  —  Tariff hawk's potential reappointment to top economy role likely to alarm trading partners  —  Robert Lighthizer, who was US trade representative when Donald Trump launched his trade war with China … ",
    "url": "https://www.ft.com/content/5003b5b9-7d36-49a7-96cc-d5fecc7a0a96"
  }
]