[
  {
    "text": "Haley blames a ‘Democratic plant’ for Civil War question that tripped her up  —  The former South Carolina governor also said that the war was, indeed, about slavery.  —  Hours after declining to do so, Nikki Haley said on Thursday morning that she believed slavery was, indeed, the cause of the Civil War.",
    "url": "https://www.politico.com/news/2023/12/28/nikki-haley-civil-war-comments-response-00133268"
  },
  {
    "text": "Nikki Haley doesn't mention slavery when asked what caused the Civil War.  She later walks that back  —  COLUMBIA, S.C. (AP) — Republican presidential candidate Nikki Haley was asked at a New Hampshire town hall about the reason for the Civil War, and she didn't mention slavery in her response.",
    "url": "https://apnews.com/article/haley-election-civil-war-slavery-a509ff9d7cc5e271c42592276b75735c"
  },
  {
    "text": "Nikki Haley's Slavery Gaffe Shows How Scared She Is of MAGA Republicans  —  In the dumbest of enforced errors, the GOP primary challenger fumbled an easy question about the Civil War, then tried to blame it on a “Democratic plant.” … We're just over two weeks out from the first votes … ",
    "url": "https://www.thedailybeast.com/nikki-haleys-slavery-gaffe-shows-how-scared-she-is-of-maga-republicans"
  },
  {
    "text": "Bucks County mom behind conservative school movement charged with assault, giving teens alcohol  —  Chris Ullery Bethany RodgersUSA TODAY NETWORK  —  A former Pennsylvania lieutenant governor candidate and outspoken voice in the conservative “parental rights” school movement has been charged … ",
    "url": "https://www.phillyburbs.com/story/news/politics/2023/12/28/clarice-schillinger-conservative-pa-schools-activist-charged-with-assault-bucks-county-pac-lt-gov/72038859007/"
  },
  {
    "text": "Exclusive: Recordings, emails show how Trump team flew fake elector ballots to DC in final push to overturn 2020 election  —  Two days before the January 6 insurrection, the Trump campaign's plan to use fake electors to block President-elect Joe Biden from taking office faced a potentially crippling hiccup … ",
    "url": "https://www.cnn.com/2023/12/28/politics/recordings-trump-team-fake-elector-ballots/"
  },
  {
    "text": "BREAKING: Federal judge upholds Georgia's Republican redistricting plan  —  Democrats unlikely to gain a U.S. House seat under new maps  —  A federal judge upheld Georgia's new political districts that preserve Republican power, ruling Thursday that state legislators “fully complied” … ",
    "url": "https://www.ajc.com/politics/breaking-georgias-republican-redistricting-plan-upheld-by-federal-judge/5YEJGZ25HBC6NPJUOLC54MAWN4/"
  },
  {
    "text": "Ex-GOP student leader's links to Jan. 6 Capitol riot and a neo-Nazi web site  —  The young man is seen running with the crowd of Trump supporters toward the U.S. Capitol early in the afternoon of Jan. 6, 2021.  He wears a thigh-length dark blue coat, his face almost fully covered with a mask.",
    "url": "https://www.usatoday.com/story/news/investigations/2023/12/28/oliver-krvaric-jan-6-capitol-riot/71971697007/"
  },
  {
    "text": "9-year-old asks Nikki Haley if she would pardon former President Trump, ‘I would’  —  Republican presidential candidate Nikki Haley says she would pardon former President Trump, if he were found guilty, saying that it wouldn't be “in the best interest of the country” for him to be imprisoned.",
    "url": "https://www.nbcnews.com/meet-the-press/video/9-year-old-asks-nikki-haley-if-she-would-pardon-former-president-trump-i-would-201069637673"
  },
  {
    "text": "Seattle Supporters Watch Black Lives Matter Garden Leveled After It Was Overrun by Drug Users, Homeless  —  The garden was established by community organizers and demonstrators during the summer of 2020, to memorialize those individuals of color who have been killed with police bullets",
    "url": "https://themessenger.com/news/seattle-black-lives-matter-garden-leveled-homeless-drug-use"
  },
  {
    "text": "City removes Seattle's Black Lives Matter memorial garden  —  Seattle Parks and Recreation workers used construction vehicles Wednesday morning to remove a community garden that was originally planted in Cal Anderson Park spontaneously, as part of 2020's Black Lives Matter protests.",
    "url": "https://www.seattletimes.com/seattle-news/politics/city-removes-seattles-black-lives-matter-memorial-garden/"
  },
  {
    "text": "‘Screams Without Words’: How Hamas Weaponized Sexual Violence on Oct. 7  —  A Times investigation uncovered new details showing a pattern of rape, mutilation and extreme brutality against women in the attacks on Israel.  —  At first, she was known simply as “the woman in the black dress.”",
    "url": "https://www.nytimes.com/2023/12/28/world/middleeast/oct-7-attacks-hamas-israel-sexual-violence.html"
  },
  {
    "text": "The conservative pin-up calendar is harmless kitsch, not pornography  —  In the dumbest possible online nontroversy that has been branded #Calendargate, a handful of conservatives — and disproportionately, conservative women — are apoplectic over a calendar featuring photo shoots of various right-wing bloggers and “influencers.”",
    "url": "https://www.washingtonexaminer.com/opinion/the-conservative-pin-up-calendar-is-harmless-kitsch-not-porn"
  },
  {
    "text": "Colorado to include Trump on 2024 primary ballot as state GOP appeals to Supreme Court  —  The Colorado GOP appealed decision to remove Trump from ballot on Wednesday  —  The Colorado secretary of state will include former President Donald Trump on the 2024 Colorado primary ballot … ",
    "url": "https://www.foxnews.com/politics/colorado-include-trump-2024-primary-ballot-state-gop-appeals-supreme-court"
  },
  {
    "text": "India targets Apple over its phone hacking notifications  —  NEW DELHI — A day after Apple warned independent Indian journalists and opposition party politicians in October that government hackers may have tried to break into their iPhones, officials under Prime Minister Narendra Modi promptly took action — against Apple.",
    "url": "https://www.washingtonpost.com/world/2023/12/27/india-apple-iphone-hacking/"
  },
  {
    "text": "The New Republican Governors Chief Explains the Loss in Kentucky and How to Tackle Trump Tweets  —  As the new chair of the Republican Governors Association, Gov. Bill Lee has some advice for his party.  —  For many Republicans, trying to strike a balance between the party's often-warring factions has been a career-killer.",
    "url": "https://www.politico.com/news/magazine/2023/12/28/bill-lee-tennessee-q-a-00133139"
  },
  {
    "text": "Sanders tests positive for COVID-19 during Senate break as infections rise nationally  —  Sen. Bernie Sanders (I-Vt.) said on Thursday he tested positive for COVID-19, amid a nationwide spike in infections.  —  The 82-year-old Sanders, in a post on the social media platform X … ",
    "url": "https://thehill.com/homenews/senate/4380333-sanders-positive-covid-19/"
  },
  {
    "text": "Biden Knew Carter Was in Trouble in 1979.  Now He's in the Same Boat.  —  Both presidents faced inflation and foreign-policy challenges as they sought a second term  —  WASHINGTON—When an unpopular Democratic incumbent president was struggling to build support for a second term … ",
    "url": "https://www.wsj.com/politics/elections/biden-knew-carter-was-in-trouble-in-1979-now-hes-in-the-same-boat-74c96cdb?mod=followamazon"
  }
]