[
  {
    "text": "GOP congressman tempers ‘Nagasaki and Hiroshima’ comments on Gaza: ‘I used a metaphor’  —  Rep. Tim Walberg said he really wasn't advocating using nuclear weapons.  —  Rep. Tim Walberg (R-Mich.) on Sunday said that his recent comment that the war in Gaza should “be like Nagasaki and Hiroshima” was not meant to be taken literally.",
    "url": "https://www.politico.com/news/2024/03/31/gop-congressman-nagasaki-hiroshima-comments-gaza-00149862"
  },
  {
    "text": "Michigan Republican congressman suggests nuking Gaza, ending humanitarian aid  —  Michigan U.S. Rep. Tim Walberg suggested that nuclear weapons should be dropped on Gaza, which his office said was a metaphor to “support Israel's swift elimination of Hamas.”  —  “It should be like Nagasaki and Hiroshima.",
    "url": "https://www.detroitnews.com/story/news/politics/2024/03/30/michigan-congressman-tim-walberg-suggests-nuking-gaza-ending-humanitarian-aid-nagasaki-hiroshima/73156051007/"
  },
  {
    "text": "Hill GOP to Trump: Tamp down the talk of grudges and Jan. 6  —  Donald Trump's bid to oust a Florida Republican who backed Ron DeSantis over him is reviving a long-running GOP anxiety: that he can't be dissuaded from the grudges and inflammatory rhetoric that plagued his party's lawmakers during his first term.",
    "url": "https://www.politico.com/news/2024/03/31/trump-gop-jan-6-00149037"
  },
  {
    "text": "The “martyrdom” of Donald J. Trump  —  “It's all slapstick comedy: Posing as a Christ-like figure is so outlandish and absurd”  —  Donald Trump has repeatedly shown that he can reasonably be described as evil.  Yet, white “Christian” evangelicals are among his most loyal, stalwart, and enthusiastic supporters.",
    "url": "https://www.salon.com/2024/03/31/the-martyrdom-of-donald-j/"
  },
  {
    "text": "Baltimore mayor weathers racist attacks after bridge collapse  —  It was just after 1:30 Tuesday morning when Baltimore Mayor Brandon Scott (D) says he received the call from the city's fire chief.  —  “He said, 'Sir, the Key Bridge collapsed,” said Scott, who was awake with a 3-month-old child when the call came in.",
    "url": "https://www.washingtonpost.com/nation/2024/03/31/baltimore-bridge-collapse-mayor/"
  },
  {
    "text": "AT&T resets account passcodes after millions of customer records leak online  —  US telco giant takes action after 2019 data spill  —  Phone giant AT&T has reset millions of customer account passcodes after a huge cache of data containing AT&T customer records was dumped online earlier this month, TechCrunch has exclusively learned.",
    "url": "https://techcrunch.com/2024/03/30/att-reset-account-passcodes-customer-data/"
  },
  {
    "text": "Former RNC chair dissects Ronna McDaniel's NBC ouster  —  Reince Priebus says the debacle was a failure of vetting.  —  On Sunday, former Republican National Committee chair Reince Priebus — now an ABC contributor — addressed the controversy over Ronna McDaniel's rapid hiring and firing as a contributor at NBC News.",
    "url": "https://www.politico.com/news/2024/03/31/former-rnc-dnc-chairs-ronna-mcdaniels-nbc-ouster-00149867"
  },
  {
    "text": "House Intel chair says Ukraine aid will have ‘overwhelming support’ in Congress after recess  —  House Intelligence Chair Mike Turner (R-Ohio) on Sunday predicted additional funding for Ukraine will have “overwhelming support” in Congress, as sharp divisions amid lawmakers have left aid for the nation in limbo.",
    "url": "https://thehill.com/homenews/house/4566200-house-intel-chair-says-ukraine-aid-will-have-overwhelming-support-in-congress-after-recess/"
  },
  {
    "text": "Trump's VP search is starting to get serious  —  The former president is considering around a dozen contenders, though the list is in flux.  —  Donald Trump's aides are vetting potential vice presidential candidates at Mar-a-Lago as the former president floats an expansive list of names in private conversations.",
    "url": "https://www.politico.com/news/2024/03/31/inside-donald-trumps-apprentice-style-search-for-a-running-mate-00149827"
  },
  {
    "text": "Rep. Don Bacon: 'It's possible' Mike Johnson could lose speakership over Ukraine  —  Speaking to NBC News' “Meet the Press” on Sunday, Bacon said he has a “commitment from the speaker and the chair of the Foreign Affairs Committee” that a Ukraine aid bill will get a floor vote.",
    "url": "https://www.nbcnews.com/politics/politics-news/rep-don-bacon-s-possible-johnson-lose-speakership-ukraine-rcna145668"
  },
  {
    "text": "The Trump camp and the White House clash over Biden's recognition of ‘Transgender Day of Visibility’  —  President Joe Biden is facing criticism from Donald Trump's campaign and religious conservatives for proclaiming March 31 — which corresponds with Easter Sunday this year — as “Transgender Day of Visibility.”",
    "url": "https://apnews.com/article/biden-easter-transgender-trans-trump-2acc05052d01272ed21ab83f32d99a77"
  },
  {
    "text": "Transcript: Baltimore Mayor Brandon Scott on “Face the Nation,” March 31, 2024  —  The following is a transcript of an interview with Baltimore Mayor Brandon Scott that aired on March 31, 2024.  —  ED O'KEEFE: We turn now to the Mayor of Baltimore Brandon Scott.  Mr. Mayor, thank you for spending part of Easter with us.",
    "url": "https://www.cbsnews.com/news/brandon-scott-baltimore-mayor-face-the-nation-transcript-03-31-2024/"
  },
  {
    "text": "Crews carefully start removing first piece of twisted steel from collapsed Baltimore bridge  —  Crews start removing first piece of twisted steel from collapsed Baltimore bridge  —  Teams of engineers worked Saturday on the intricate process of cutting and lifting the first section … ",
    "url": "https://apnews.com/article/key-bridge-collapse-baltimore-port-maryland-3edebfb3b7fb48fd81be81cf69ebfbf5"
  },
  {
    "text": "Democrats hope Biden could get a boost from down-ballot races under Wisconsin's new legislative map  —  Wisconsin's presidential primary Tuesday clears the way for a general election campaign that Democrats see as an opportunity unlike any in recent state history.",
    "url": "https://apnews.com/article/wisconsin-biden-redistricting-legislature-democrats-general-election-3e353ff5af880721f547c9c18ee9923a"
  }
]