[
  {
    "text": "Trump Town Hall Bursts Into Laughter When He Says He Hasn't Made Any Mistakes  —  NOTHING BUT WINNING  —  The president said there's nothing he would have done differently during his first 100 days in office.  —  Donald Trump's first 100 days back in office have been marked by chaos … ",
    "url": "https://www.thedailybeast.com/trump-town-hall-audience-bursts-into-laughter-when-he-says-he-hasnt-made-any-mistakes/"
  },
  {
    "text": "There Is a Way Forward: How to Defeat Trump's Power Grab.  —  The first 100 days of President Trump's second term have done more damage to American democracy than anything else since the demise of Reconstruction.  Mr. Trump is attempting to create a presidency unconstrained by Congress or the courts … ",
    "url": "https://www.nytimes.com/2025/05/01/opinion/trump-100-days-opposition.html?unlocked_article_code=1.D08.Wnt3.Ah8QmwuoCnE2"
  },
  {
    "text": "The last boats without crippling tariffs from China are arriving.  The countdown to shortages and higher prices has begun  —  New York CNN  —  Some of the last cargo ships carrying Chinese goods without crippling tariffs are currently drifting into US ports.  Come next week, though, that will change.",
    "url": "https://cnn.com/2025/05/01/business/ports-shelves-tariffs-shipping"
  },
  {
    "text": "Chris Krebs kicked off CBP's Global Entry program  —  Chris Krebs', President Donald Trump's former director of the Cybersecurity and Infrastructure Security Agency, membership in Global Entry has been revoked.  Krebs, who has repeatedly attested to the security of the 2020 election … ",
    "url": "https://cnn.com/2025/04/30/politics/chris-krebs-cbp-global-entry-revoked"
  },
  {
    "text": "Ex-Trump Official Targeted for Investigation Loses Global Entry Status  —  Chris Krebs, a cybersecurity official in the first Trump administration, had declared that the 2020 election was conducted securely.  —  Chris Krebs, the former cybersecurity official in President Trump's first term whom … ",
    "url": "https://www.nytimes.com/2025/04/30/us/politics/chris-krebs-global-entry.html"
  },
  {
    "text": "Majority of public opposes GOP plan for Medicaid cuts: Poll  —  Large majorities of Americans, including Republicans, oppose federal funding cuts to Medicaid, according to a new poll from health policy research group KFF.  —  The results are yet another warning sign for congressional … ",
    "url": "https://thehill.com/policy/healthcare/5275399-gop-medicaid-cut-plan-opposition-kff-survey/"
  },
  {
    "text": "It's Trump's Economy Now  —  Many people have complained about New York Times headlines, with reason.  All too often an equivocating, sanewashing headline belies the excellent reporting that follows.  But yesterday the Times got it right about the first-quarter decline in GDP … ",
    "url": "https://paulkrugman.substack.com/p/its-trumps-economy-now"
  },
  {
    "text": "Haagen-Dazs and Buddha: Elon Musk waxes philosophical on his time with Trump  —  Musk reflected on what it has been like at the center of the U.S. DOGE Service.  At times, the man running the show wondered aloud how the show even started.  —  Elon Musk sat down in the Roosevelt Room late Wednesday afternoon … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/01/hagen-dazsand-buddha-elon-musk-waxes-philosophical-his-time-with-trump/"
  },
  {
    "text": "Tesla Board Opened Search for a CEO to Succeed Elon Musk  —  With profits and stock price sinking, board members told Musk he needed to spend more time at company  —  About a month ago, with Tesla's stock sinking and some investors irritated about Elon Musk's White House focus … ",
    "url": "https://www.wsj.com/business/autos/tesla-musk-ceo-search-board-0ce61af9?st=fzBa6i"
  },
  {
    "text": "RFK Jr.'s HHS Orders Lab Studying Deadly Infectious Diseases to Stop Research  —  NIAID's Integrated Research Facility is one of the few federal facilities charged with studying Ebola.  Tuesday afternoon, all of its work was put on indefinite pause by Robert F. Kennedy Jr.'s department.",
    "url": "https://www.wired.com/story/hhs-niaid-irf-ebola-disease-research-stop/"
  },
  {
    "text": "DOGE Put a College Student in Charge of Using AI to Rewrite Regulations  —  A DOGE operative has been tasked with using AI to propose rewrites to the Department of Housing and Urban Development's regulations—an effort sources are told will roll out across government.",
    "url": "https://www.wired.com/story/doge-college-student-ai-rewrite-regulations-deregulation/"
  },
  {
    "text": "RFK Jr. will require shift in how new vaccines are tested, HHS says  —  The potential change outlined in a statement would require all new vaccines to undergo placebo testing, sparking concerns among medical experts.  —  Health and Human Services Secretary Robert F. Kennedy Jr. intends … ",
    "url": "https://www.washingtonpost.com/health/2025/04/30/rfk-jr-vaccine-testing/"
  },
  {
    "text": "Trump's Quest for Crypto Riches Is a Constitutional Scandal Waiting to Happen  —  The largest investors in Donald Trump's crypto coin have been promised a private audience with the president.  The arrangement could put Trump at odds with the Constitution and add fuel to calls for his impeachment, experts say.",
    "url": "https://www.wired.com/story/trumps-quest-for-crypto-riches-is-a-constitutional-scandal-waiting-to-happen/"
  },
  {
    "text": "Trump Wants a New Air Force One So Badly He's Refurbishing a Qatari Plane  —  The luxury plane is being outfitted in Texas for Trump's use as his frustration mounts with Boeing  —  President Trump is done waiting for Boeing .  —  Frustrated by delays on Boeing's work to deliver a new Air Force One … ",
    "url": "https://www.wsj.com/business/airlines/air-force-one-trump-qatari-jet-l3harris-fc903838"
  },
  {
    "text": "New Oklahoma curriculum includes pro-Trump conspiracy theories  —  Beginning in the 2025-26 school year, thousands of high school students in Oklahoma will be required to learn about President Trump's debunked claims that the 2020 election was tainted by fraud.",
    "url": "https://popular.info/p/new-oklahoma-curriculum-includes"
  },
  {
    "text": "Trump wants voters to prove citizenship.  Arizona tried that and bungled it.  —  The state requires voters to prove their citizenship.  An error led to chaos, suspicion and confusion, signaling broader challenges for Republican-led efforts across the country.",
    "url": "https://www.washingtonpost.com/politics/2025/05/01/arizona-citizenship-proof-voter-registration-glitch/"
  },
  {
    "text": "Thousands to rally against Trump, Musk in nationwide May Day protests  —  Protests against what organizers are calling a “billionaire takeover” are planned in every U.S. state.  —  Across the U.S., thousands of people are expected to participate in protests against the Trump administration … ",
    "url": "https://www.usatoday.com/story/news/nation/2025/05/01/may-day-protests-trump-musk-billionaires/83362729007/"
  },
  {
    "text": "Exclusive: Fox & Friends Icon Steve Doocy On Why He's Moving to a New Role  —  After 6,828 days of waking up at 3:30 a.m., Fox & Friends co-host Steve Doocy decided he wanted to sleep in a bit.  —  Doocy has co-hosted Fox News' flagship morning show since its inception nearly 30 years ago.",
    "url": "https://www.mediaite.com/tv/dooc-draft-2-2/"
  },
  {
    "text": "NIH cancels participation in Safe to Sleep campaign that decreased infant deaths  —  Non-profits scramble to continue program despite ‘devastating’ loss of federal support  —  WASHINGTON — The Trump administration has cancelled federal participation in Safe to Sleep, a 30-year campaign … ",
    "url": "https://www.statnews.com/2025/04/30/nih-ends-participation-in-safe-to-sleep-campaign-to-prevent-infant-deaths/"
  },
  {
    "text": "Scoop: White House launches Drudge-style website to promote Trump  —  The White House has launched a new Drudge Report-like website devoted to promoting pro-Trump news stories.  —  Why it matters: The site, called White House Wire, represents the administration's latest effort to circumvent … ",
    "url": "https://www.axios.com/2025/04/30/trump-white-house-drudge-style-website-launch"
  },
  {
    "text": "Trump's national security adviser Mike Waltz and his deputy to leave posts in White House  —  National security adviser Mike Waltz and his deputy, Alex Wong, will be leaving their posts in the Trump White House, according to multiple sources familiar with their departure.",
    "url": "https://www.cbsnews.com/news/trump-mike-waltz-alex-wong/"
  },
  {
    "text": "Republicans wave off recession fear, just as Democrats did on inflation  —  GOP senators declare bad economic data as “short term,” echoing Democrats four years ago who called inflation “transitory”.  —  Exiting his party's Tuesday luncheon, Sen. John Neely Kennedy (R-Louisiana) … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/01/republicans-recession-tariffs-trump/"
  },
  {
    "text": "A judge just blew up Apple's control of the App Store  —  The judge in Epic v. Apple has banned Apple from charging a commission on purchases made outside the App Store because of its ongoing anticompetitive behavior. … Apple says it will appeal the order.",
    "url": "https://www.theverge.com/news/659246/apple-epic-app-store-judge-ruling-control"
  },
  {
    "text": "RFK Jr. rejects cornerstone of health science: Germ theory … With the rise of Robert F. Kennedy Jr., brain worms have gotten a bad rap.  —  A year ago, the long-time anti-vaccine advocate and current US health secretary famously told The New York Times that a parasitic worm “got into my brain and ate a portion of it and then died.”",
    "url": "https://arstechnica.com/health/2025/04/rfk-jr-s-anti-vaccine-stance-is-rooted-in-a-disbelief-in-germ-theory/"
  }
]