[
  {
    "text": "Whitmer Disavows ‘Draft Gretch’ Movement — and Delivers A Warning to Biden  —  Democrats' 2028 bench is eager to avoid appearing eager to push Biden aside.  —  When Michigan Gov. Gretchen Whitmer telephoned a senior official with President Biden's campaign on Friday night … ",
    "url": "https://www.politico.com/news/magazine/2024/07/01/whitmer-biden-democrats-2028-00165995"
  },
  {
    "text": "Why I Want an Open Convention  —  Over the past few years, many people have told me I should stop making Biden-is-old jokes because “it just helps Trump” — as if voters wouldn't have noticed his age otherwise.  I can't ignore the obvious; none of us can.  And I'm not going to mindlessly … ",
    "url": "https://www.nytimes.com/2024/07/01/opinion/bill-maher-open-convention.html"
  },
  {
    "text": "Behind the Curtain: Biden's salvation plan … - Dismiss “bedwetting.” … - Squeeze polls for juice. … - Warn of chaos. … - Limit dissent. … - Keep elected leaders close. … - Get the donor class to chill. … - Prove vitality. … - Ignore/engage the media.",
    "url": "https://www.axios.com/2024/07/01/biden-2024-election-pr-campaign-step-aside"
  },
  {
    "text": "Supreme Court says Trump has absolute immunity for core acts only  —  The U.S. Supreme Court, in a 6-3 decision along ideological lines, ruled that a former president has absolute immunity for his core constitutional powers — and is entitled to a presumption of immunity for his official acts, but lacks immunity for unofficial acts.",
    "url": "https://www.npr.org/2024/07/01/nx-s1-5002157/supreme-court-trump-immunity"
  },
  {
    "text": "4 takeaways from the Supreme Court's Trump immunity decision  —  The ruling is a win for Trump for a few reasons, and is likely to reverberate in the 2024 campaign and beyond.  Here's what it means.  —  The Supreme Court ruled Monday that former president Donald Trump and other presidents enjoy … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/01/4-takeaways-supreme-courts-trump-immunity-decision/"
  },
  {
    "text": "US Supreme Court rules Trump has immunity for official, not private acts  —  The U.S. Supreme Court found on Monday that Donald Trump cannot be prosecuted for official actions taken as president, but can for private acts, in a landmark ruling recognizing for the first time any form of presidential immunity from prosecution.",
    "url": "https://www.reuters.com/legal/us-supreme-court-due-rule-trumps-immunity-bid-blockbuster-case-2024-07-01/"
  },
  {
    "text": "Supreme Court says Trump has immunity for official acts in landmark ruling on presidential power  —  Washington — The Supreme Court on Monday ruled that former President Donald Trump is entitled to immunity from federal prosecution for official actions he took while in office … ",
    "url": "https://www.cbsnews.com/news/supreme-court-trump-immunity-decision-opinion/"
  },
  {
    "text": "Democrats vow to get “aggressive” with SCOTUS after Trump ruling … - “Everyone is making that argument with donors” after President Biden's poor debate performance last week, one House Democrat told Axios.  — “The only thing more dangerous than Trump winning is Trump with control … ",
    "url": "https://www.axios.com/2024/07/01/house-democrats-trump-immunity-ruling-response"
  },
  {
    "text": "Live updates Supreme Court to rule on Trump immunity, social media laws  —  The Supreme Court says presidents have “absolute” immunity for clearly official acts, but no immunity for unofficial acts.  Former president and presumptive Republican nominee Donald Trump faces four federal felony counts … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/01/trump-presidential-immunity-supreme-court/"
  },
  {
    "text": "BREAKING: SCOTUS Rules Presidents Have ‘Absolute Immunity’ — For ‘Core’ Official Acts  —  The last decision of the Supreme Court term may be its most impactful ... but perhaps not as impactful as some may think.  On a 6-3 decision written by Chief Justice John Roberts … ",
    "url": "https://hotair.com/ed-morrissey/2024/07/01/scotus-finale-presidents-have-absolute-immunity-for-official-acts-n3791217"
  },
  {
    "text": "Steve Bannon reports to prison for contempt of Congress sentence  —  Bannon was sentenced to four months in prison for contempt of Congress.  —  Steve Bannon, former advisor to U.S. President Donald Trump, aattends an event in Detroit, Michigan, June, 15, 2024.",
    "url": "https://abcnews.go.com/US/steve-bannon-surrenders-reports-prison/story?id=111569255"
  },
  {
    "text": "AOC to File ‘Articles of Impeachment’ Following Supreme Court Immunity Ruling: ‘Corruption Crisis Beyond Its Control’  —  Rep. Alexandria Ocasio-Cortez (D-NY) announced on Monday she intends to file articles of impeachment following the Supreme Court's ruling on presidential immunity.",
    "url": "https://www.mediaite.com/politics/aoc-to-file-articles-of-impeachment-following-supreme-court-immunity-ruling-corruption-crisis-beyond-its-control/"
  },
  {
    "text": "Five Takeaways From France's Snap Election  —  It was a big day for the far-right National Rally.  Just how big will not be clear until after a second round of voting.  —  A new week of frenetic campaigning started in France on Monday, a day after the far-right National Rally party dominated … ",
    "url": "https://www.nytimes.com/2024/07/01/world/europe/france-election-takeaways.html"
  },
  {
    "text": "Biden's Handlers Release a New Video, and It's a Five-Alarm Fire Moment  —  It's only been four days since Joe Biden's disastrous debate performance, and the White House is scrambling to find its feet.  Truly, I've never seen anything like this.  I understand that there have been past presidents … ",
    "url": "https://redstate.com/bonchie/2024/07/01/biden-releases-a-new-video-and-its-a-five-alarm-fire-moment-n2176212"
  },
  {
    "text": "Conservatives Go to War — Against Each Other — Over School Vouchers  —  School choice advocates are intent on expanding the availability of vouchers to fund private education at the expense of public schools, but rural residents of these targeted states are putting up some of the strongest resistance.",
    "url": "https://www.propublica.org/article/rural-republicans-school-vouchers-education-choice"
  }
]