[
  {
    "text": "First look: John Bolton's predictions for a second Trump term  —  John Bolton — Donald Trump's former national security adviser — is laying out his nightmare scenarios for a second Trump term in a foreword to the paperback edition of his memoir “The Room Where It Happened,” out Tuesday.",
    "url": "https://www.axios.com/2024/01/30/trump-john-bolton-second-term-2024-election"
  },
  {
    "text": "E. Jean Carroll Delivered the Sound Bite That Could Win Trump the Election  —  There's the liberal media's crusade against the former president, but then there's E. Jean Carroll's war against Trump, which is something otherworldly.  She's filed multiple lawsuits against Donald Trump.",
    "url": "https://townhall.com/tipsheet/mattvespa/2024/01/29/e-jean-carroll-delivered-a-huge-in-kind-contribution-to-trump-during-her-msnbc-interview-n2634353"
  },
  {
    "text": "It's not that MAGA doesn't believe E. Jean Carroll — they just don't care that Trump abuses women  —  Trump verdict and new Vince McMahon allegations are a dark reminder that red state America cultivates rape culture  —  Not that she'll ever bring herself to use words like “rapist” or … ",
    "url": "https://www.salon.com/2024/01/30/its-not-that-maga-doesnt-believe-e-jean-carroll--they-just-dont-care-that-abuses-women/"
  },
  {
    "text": "Joe Biden Reveals What World Leaders Are Telling Him About Donald Trump  —  Biden's counterparts all have the same message about his predecessor, the president claimed.  —  LOADING  —  President Joe Biden claimed multiple world leaders have expressed to him their fear of former President Donald Trump returning to the White House.",
    "url": "https://www.huffpost.com/entry/joe-biden-donald-trump-world-leaders_n_65b8c135e4b0102bd2d5fb23"
  },
  {
    "text": "House Republicans poised to torpedo GOP's best chance in years to pass border bill  —  House Republicans appear to be on the precipice of torpedoing their best opportunity in years of passing border legislation.  —  Republicans had long insisted on changes to border and migration policy … ",
    "url": "https://thehill.com/homenews/house/4436245-house-republicans-border-deal/"
  },
  {
    "text": "Republicans Who Screamed About A Crisis On The Border Now Oppose A Plan To Fix It  —  Many on the right claim the U.S. is being “invaded” by migrants but also want to wait until Donald Trump is elected president again to stop it.  —  LOADING  —  WASHINGTON ― For months … ",
    "url": "https://www.huffpost.com/entry/republicans-border-deal-donald-trump_n_65b80899e4b0102bd2d5c0d4"
  },
  {
    "text": "Undercover Israeli troops dressed as medical staff kill three militants in West Bank hospital raid, officials say  —  Israeli special forces, dressed as civilians and medical staff, infiltrated the Ibn Sina hospital in the occupied West Bank city of Jenin on Tuesday and killed three Palestinian men … ",
    "url": "https://www.cnn.com/2024/01/30/middleeast/israel-undercover-raid-jenin-west-bank-hamas-intl/"
  },
  {
    "text": "Israeli undercover forces dressed as women and medics storm West Bank hospital, killing 3 militants  —  Israeli forces disguised as civilian women and medical workers stormed a hospital Tuesday in the occupied West Bank, killing three Palestinian militants in a dramatic raid that underscored … ",
    "url": "https://apnews.com/article/israel-hamas-war-news-01-30-2024-b1ba33c7c0c5c62f85932a20c2a0bc92"
  },
  {
    "text": "IDF says it killed 3 terrorists planning Oct. 7-like attack hiding in Jenin hospital  —  CCTV footage shows undercover forces in fake beards or dressed as Muslim women before they killed 3 armed Hamas members in West Bank medical center, in dramatic 10-minute raid",
    "url": "https://www.timesofisrael.com/idf-says-it-killed-3-terrorists-planning-oct-7-like-attack-hiding-in-jenin-hospital/"
  },
  {
    "text": "Justice Sotomayor speaks on frustration following some Supreme Court rulings  —  Supreme Court Justice Sonia Sotomayor opened up on Monday about the “frustration” she said she experiences daily as the high court's conservative supermajority continues to move the country further to the right.",
    "url": "https://www.cnn.com/2024/01/29/politics/sotomayor-supreme-court-frustration/"
  },
  {
    "text": "Biden says he's decided how to respond to deadly attack on US forces in Jordan  —  President Biden said Tuesday he has decided how he plans to respond to an attack on U.S. forces in Jordan that killed three Americans, but stressed he was not seeking a wider war in the Middle East.",
    "url": "https://thehill.com/homenews/administration/4437420-biden-decided-response-attack-jordan/"
  },
  {
    "text": "E. Jean Carroll Lawyer Threatens to Seek Sanctions Against Trump Attorney for ‘Utterly Baseless’ Claims Judge Was Her ‘Mentor’  —  Trump's lawyer Alina Habba claimed the judge had a conflict of interest based on a tabloid rumor of an alleged 30-year-old professional tie",
    "url": "https://themessenger.com/politics/e-jean-carroll-roberta-kaplan-trump-alina-habba-judge-mentor"
  },
  {
    "text": "Exclusive: US disabled Chinese hacking network targeting critical infrastructure  —  The U.S. government in recent months launched an operation to fight a pervasive Chinese hacking operation that successfully compromised thousands of internet-connected devices, according to two Western security officials … ",
    "url": "https://www.reuters.com/world/us/us-disabled-chinese-hacking-network-targeting-critical-infrastructure-sources-2024-01-29/"
  },
  {
    "text": "‘White Lives Matter’ member gets 18 years for firebombing church that planned drag events  —  Aimenn Penny told the FBI that he would have felt better if his Molotov cocktails had burned an LGBT-friendly church to the ground.  —  WASHINGTON — A member of the pro-Nazi group White Lives Matter … ",
    "url": "https://www.nbcnews.com/politics/justice-department/white-lives-matter-member-gets-18-years-firebombing-church-planned-dra-rcna136374"
  },
  {
    "text": "Not Just Claudine Gay.  Harvard's Chief Diversity Officer Plagiarized and Claimed Credit for Husband's Work, Complaint Alleges  —  It's not just Claudine Gay.  Harvard University's chief diversity and inclusion officer, Sherri Ann Charleston, appears to have plagiarized extensively in her academic work … ",
    "url": "https://freebeacon.com/campus/not-just-claudine-gay-harvards-chief-diversity-officer-plagiarized-and-claimed-credit-for-husbands-work-complaint-alleges/"
  },
  {
    "text": "Economic Mood Improves, but Inflation Still Vexing Americans  —  WASHINGTON, D.C. — While still negative overall, Gallup's Economic Confidence Index has improved each of the past two months to its highest point in two years, reflecting improved views of both current economic conditions and the economy's direction.",
    "url": "https://news.gallup.com/poll/609221/economic-mood-improves-inflation-vexing-americans.aspx"
  },
  {
    "text": "Party feud breaks out ahead of RNC meeting in Las Vegas  —  GOP county chairs and local activists warned the party isn't doing enough to compete in November.  —  LAS VEGAS — Days before the Republican National Committee was set to convene here, hundreds of Republican officials gathered … ",
    "url": "https://www.politico.com/news/2024/01/29/republican-party-feud-turning-point-las-vegas-00138493"
  },
  {
    "text": "Biden Super PAC Plans a Historic $250 Million Ad Blitz  —  The flood of TV and digital spots in battleground states is set to be the largest single purchase of political advertising by a super PAC in U.S. history, according to the group, Future Forward.  —  The main Democratic super PAC … ",
    "url": "https://www.nytimes.com/2024/01/30/us/politics/biden-tv-ads-super-pac.html"
  },
  {
    "text": "Haley Losing by 35% in South Carolina, Attack Ads ‘Worthless’: Trump Pollster (Exclusive)  —  The former South Carolina governor does not have a clear path to victory, the former president's pollster added  —  Donald Trump is beating Nikki Haley 66-31% in her home state of South Carolina … ",
    "url": "https://themessenger.com/politics/haley-losing-by-35-in-south-carolina-attack-ads-worthless-trump-pollster-exclusive"
  },
  {
    "text": "Republicans now say it might be okay to ignore the Supreme Court  —  A consequential development of the Trump era is what increasingly looks like the Republicans' acrimonious divorce from the rule of law.  —  The party that once prided itself as the law-and-order side has leaped headlong … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/29/republicans-now-say-it-might-be-okay-ignore-supreme-court/"
  }
]