[
  {
    "text": "Ted Cruz Kept Sightseeing as Desperate Rescue Crews Searched for Missing Kids in Texas Floods  —  GREEK TRAGEDY  —  The Texas senator was visiting the Parthenon in Athens while a massive rescue mission was under way to find flood victims, our must-read newsletter, The Swamp, reveals.  —  EXCLUSIVE",
    "url": "https://www.thedailybeast.com/ted-cruz-was-vacationing-in-europe-as-emergency-crews-desperately-searched-for-texas-flood-survivors/"
  },
  {
    "text": "FEMA response to deadly Texas floods delayed & deficient with Noem in charge  —  Staffers sound the alarm. … Disaster struck in Texas on July 4th when the Guadalupe River rapidly overflowed, resulting in lethal flash floods.  As of Monday, local officials said at least 104 were confirmed dead across six counties.",
    "url": "https://www.thehandbasket.co/p/fema-response-deadly-texas-floods-delayed-deficient-noem"
  },
  {
    "text": "Texas floods live updates: At least 90 dead or missing, including Camp Mystic campers and counselors, as storms continue  —  Forecasters warn slow-moving thunderstorms could cause more flash flooding over Texas today. … Couple search for five missing family members",
    "url": "https://www.nbcnews.com/news/us-news/live-blog/texas-floods-live-updates-search-for-survivors-rcna217165"
  },
  {
    "text": "Heavily armed immigration agents descend on MacArthur Park in L.A.  —  Dozens of immigration agents, some on horseback, others carrying rifles in armored vehicles, swept through MacArthur Park on Monday in an extraordinary show of force at the heart of Los Angeles' immigrant community.",
    "url": "https://www.latimes.com/california/story/2025-07-07/immigration-agents-descend-on-macarthur-park"
  },
  {
    "text": "Exclusive: Operation Excalibur in Los Angeles Was Show of Force  —  Leaks from military's LA deployment reveal Coca Cola vs. Pepsi rivalry, sweaty guardsmen, and abject failure  —  Today's homeland security operation at the 35-acre MacArthur Park in the Westlake neighborhood of Los Angeles was a mere … ",
    "url": "https://www.kenklippenstein.com/p/exclusive-operation-excalibur-in"
  },
  {
    "text": "Humvees, Mounted ICE Officers And Soldiers Descend On LA's ‘Ellis Island,’ Face Protesters And Mayor  —  Around 100 soldiers and federal agents convened at the Los Angeles park Monday morning for an immigration enforcement operation.  —  LOS ANGELES, CA — Over 100 members … ",
    "url": "https://patch.com/california/los-angeles/humvees-mounted-ice-officers-soldiers-descend-las-ellis-island-face"
  },
  {
    "text": "I.R.S. Says Churches Can Endorse Candidates From the Pulpit  —  In a court filing, the tax agency said a decades-old ban on campaigning by tax-exempt groups should not apply to houses of worship speaking to their own members.  —  The I.R.S. said on Monday that churches and other houses … ",
    "url": "https://www.nytimes.com/2025/07/07/us/politics/irs-churches-politics-endorse-candidates.html"
  },
  {
    "text": "Here Are Trump's New Tariff Threats  —  President Trump has told 14 countries that they will face tariffs of at least 25 percent on Aug. 1 if they don't reach agreements by then.  —  President Trump informed Japan, South Korea and 12 other nations on Monday that they will face significantly … ",
    "url": "https://www.nytimes.com/2025/07/07/business/trump-tariffs-trade-deals-august-1.html"
  },
  {
    "text": "Four Fears about ICE, Trump's New Masked Monster  —  We're about to pour $200 billion into immigration enforcement—but understanding specifically why this is a bad idea is important. … There are many reasons Trump's new giant domestic agenda, the so-called one big beautiful bill … ",
    "url": "https://www.doomsdayscenario.co/p/four-fears-about-ice-trump-s-new-masked-monster-bf1f7205365d4b27"
  },
  {
    "text": "Are We About to Have Labor Camps in the United States of America? … One aspect of the Republicans' big, ugly bill that didn't get enough attention until Representative Alexandria Ocasio-Cortez elevated it over the last few days is the massive amounts of money it directs to the apprehension and detention of immigrants.",
    "url": "https://newrepublic.com/article/197619/trump-immigration-labor-camps"
  },
  {
    "text": "Musk and Yang have connected on the billionaire's third party threat … He did not respond to follow-up questions about when they spoke and what else they discussed.  Yang amped up his denunciation of America's two-party system after his failed run for New York City mayor in 2021 as a Democrat.",
    "url": "https://www.politico.com/news/2025/07/07/musk-and-yang-have-connected-on-the-billionaires-third-party-threat-00441702"
  },
  {
    "text": "As Trump Fails to Deliver, Russia Looks to Musk's America Party for Leverage  —  Elon Musk recently announced the formation of the America Party, and online commentators have been quick to share hot takes about its meaning and prospects.  Rather than join that chorus, and following … ",
    "url": "https://america2.news/as-trump-fails-to-deliver-russia-looks-to-musks-america-party-for-leverage/"
  },
  {
    "text": "Trump Administration Acknowledges Lack of Evidence From Epstein Documents  —  After Attorney General Pam Bondi promised big revelations for months, the Justice Department noted a lack of evidence for conspiracy theories, including a “client list” and a jailhouse murder.",
    "url": "https://www.nytimes.com/2025/07/07/us/politics/trump-administration-jeffrey-epstein-client-list-suicide.html"
  },
  {
    "text": "VA on track to cut nearly 30K jobs by end of fiscal 2025, eliminating need for RIF  —  The Department of Veterans Affairs says it's on track to cut nearly 30,000 positions by the end of the fiscal year — a significantly smaller workforce cut than the department's previous estimates.",
    "url": "https://federalnewsnetwork.com/workforce/2025/07/va-on-track-to-cut-nearly-30k-jobs-by-end-of-fiscal-2025-eliminating-need-for-rif/"
  },
  {
    "text": "The sad, sad state of the New York Times  —  The sad fact is that there is nothing terribly out of character about the New York Times's decision to publish a deceptive hit piece about New York mayoral candidate Zohran Mamdani, based on hacked data supplied by a noted eugenicist to whom they granted anonymity.",
    "url": "https://presswatchers.org/2025/07/the-sad-sad-state-of-the-new-york-times/"
  },
  {
    "text": "Planned Parenthood Wins a Temporary Injunction Over Medicaid Funding  —  The nonprofit is challenging a new law that bars its clinics from receiving federal money for any treatment, including birth control and checkups.  —  Planned Parenthood won a temporary injunction on Monday that allows … ",
    "url": "https://www.nytimes.com/2025/07/07/us/planned-parenthood-medicaid-funding.html"
  },
  {
    "text": "Netanyahu nominates Trump for Nobel Peace Prize  —  Israeli Prime Minister Benjamin Netanyahu on Monday told President Donald Trump he had nominated him for the Nobel Peace Prize, handing Trump a nomination letter during a meeting at the White House.  —  Speaking to reporters at the beginning … ",
    "url": "https://www.reuters.com/world/middle-east/netanyahu-nominates-trump-nobel-peace-prize-2025-07-07/"
  },
  {
    "text": "El Salvador Contradicts Trump, Says It Has No Authority Over Migrants Held in Megaprison  —  El Salvador told the United Nations that it has no legal authority over hundreds of Venezuelan men that President Donald Trump sent to a Salvadoran megaprison earlier this year.",
    "url": "https://www.democracydocket.com/news-alerts/el-salvador-contradicts-trump-no-authority-venezuelans-alien-enemies-act-cecot/"
  },
  {
    "text": "New Jersey native on first rescue mission with Coast Guard helps save 165 Texas flood victims: ‘American hero’  —  A Coast Guard rescue swimmer is already being hailed as an “American hero” after his very first mission — helping to save the lives of 165 Texas flash flood victims.",
    "url": "https://nypost.com/2025/07/06/us-news/coast-guard-american-hero-scott-ruskan-helps-save-texas-flood-victims/"
  },
  {
    "text": "Trump Told Zelensky He Wasn't Responsible for Weapons Holdup  —  The assurance in a call last week keeps open the option that Trump will continue military aid to Kyiv  —  WASHINGTON—President Trump told Ukrainian President Volodymyr Zelensky that he wasn't responsible for a halt … ",
    "url": "https://www.wsj.com/politics/national-security/trump-told-zelensky-he-wasnt-responsible-for-weapons-holdup-f684444b?st=zMtutV"
  },
  {
    "text": "Scoop: Waltz finally gets Senate hearing for UN post  —  President Trump's former national security adviser Mike Waltz is scheduled to appear before the Senate Foreign Relations Committee next Tuesday or Wednesday for his confirmation hearing to be ambassador to the UN, Axios has learned.",
    "url": "https://www.axios.com/2025/07/08/mike-waltz-un-ambassador-trump-senate-hearing"
  },
  {
    "text": "Trump Fired Them.  Now They're Plotting to Stop Him.  —  Former USAID and State Department officials worried about the future of democracy in America say they're actively organizing to resist Trump, inside and outside of government.  — Copy  —  Some of the democracy-building experts … ",
    "url": "https://www.notus.org/donald-trump/usaid-state-department-employees-fired-organize"
  },
  {
    "text": "After Mamdani's Win, Some Democrats Are Determined to Stop Him  —  Though Zohran Mamdani scored a resounding victory in New York City's Democratic primary, some in his own party are strategizing about how to defeat him in November.  —  The race for mayor in New York City took an unusual … ",
    "url": "https://www.nytimes.com/2025/07/07/nyregion/mamdani-cuomo-adams-democrats.html"
  },
  {
    "text": "RFK Jr. promoted a food company he says will make Americans healthy.  Their meals are ultraprocessed  —  Health secretary Robert F. Kennedy Jr. on Monday praised a company that makes $7-a-pop meals that are delivered directly to the homes of Medicaid and Medicare enrollees.",
    "url": "https://apnews.com/article/rfk-jr-ultraprocessed-foods-diet-maha-trump-018a808efcf059eadfab2f8fc93fad4d"
  },
  {
    "text": "Court Strikes Down ‘Unconstitutional’ Kansas Ballot Application Law  —  In a major win for voters, a federal court ruled that a Kansas law banning prefilled mail-in ballot applications is unconstitutional and violates the First Amendment.  —  The law, known as the “Personalized Application Prohibition … ",
    "url": "https://www.democracydocket.com/news-alerts/court-strikes-down-unconstitutional-kansas-ballot-application-law/"
  }
]