[
  {
    "text": "Why, as a Republican mayor, I support Kamala Harris over Trump  —  Arizona Republicans like me can emulate Sen. John McCain's motto of ‘Country First’ and beat back Trump and his threat to democracy.  —  The time has come for my fellow Arizona Republicans to return to the core foundations of the Grand Old Party.",
    "url": "https://www.azcentral.com/story/opinion/op-ed/2024/07/29/mesa-mayor-republican-vote-kamala-harris/74583703007/"
  },
  {
    "text": "Vance tells donors Harris change was a ‘sucker punch,’ at odds with campaign  —  “The bad news is that Kamala Harris does not have the same baggage as Joe Biden,” Trump's running mate acknowledged at a private event.  —  The Republican vice-presidential nominee, Sen. JD Vance (R-Ohio) … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/29/jd-vance-kamala-harris-campaign/"
  },
  {
    "text": "“Old and quite weird”: Democrats finally discover new effective attack — and Republicans hate it  —  After nearly a decade of being forced to take Trump seriously, Democrats increasingly call BS on the whole charade  —  Sure, Donald Trump is a threat to democracy — a would-be dictator … ",
    "url": "https://www.salon.com/2024/07/29/old-and-quite-weird-democrats-finally-discover-new-effective--and-hate-it/"
  },
  {
    "text": "Harris Trolls Trump: I'll Go to Debate Even If You Don't  —  DEBATE ME, BRO  —  The vice president has promised to take Biden's place at a scheduled Sept. 10 face-off.  —  Vice President Kamala Harris is committed to debating former President Donald Trump on Sept. 10—whether or not he shows up.",
    "url": "https://www.thedailybeast.com/harris-trolls-trump-ill-go-to-debate-even-if-you-dont"
  },
  {
    "text": "Roy Cooper Withdraws From Kamala Harris VP Sweepstakes  —  Mr. Cooper, the governor of North Carolina, had been seen as one of the half-dozen top candidates to join the Democratic presidential ticket.  It was not immediately clear why he withdrew.  —  Gov. Roy Cooper of North Carolina … ",
    "url": "https://www.nytimes.com/2024/07/29/us/politics/roy-cooper-kamala-harris-vp.html?unlocked_article_code=1.-00.tfSj.7gMcOUeOQAUJ&smid=url-share"
  },
  {
    "text": "Republicans Are About To Become Desperate  —  But they won't respond by listening to the public; they'll respond by ratcheting up the menace.  —  Prior to this most improbable of months, a hallmark of the Biden era had been a great forgetting of the Trump years that preceded it.",
    "url": "https://www.offmessage.net/p/republicans-are-about-to-become-desperate"
  },
  {
    "text": "Obama photographer Pete Souza deletes X account after Trump ear attacks  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/policy/technology/4798519-former-white-house-photographer-deletes-x-account/"
  },
  {
    "text": "Trump says he'll ‘probably’ debate Harris: ‘I can also make a case for not doing it’  —  commit to debating her until  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:05 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate",
    "url": "https://thehill.com/homenews/campaign/4799124-trump-says-hell-probably-debate-harris-i-can-also-make-a-case-for-not-doing-it/"
  },
  {
    "text": "Supreme Court Rocked by New Leak of Bitter Abortion Split  —  DRIP DRIP DRIP  —  A months-long internal feud among the justices over a key case about abortion access in Idaho has been leaked—the latest internal communication to escape the high court.  —  The Supreme Court has been hit … ",
    "url": "https://www.thedailybeast.com/supreme-court-rocked-by-new-leak-on-bitter-split-over-idaho-emergency-abortion-ruling"
  },
  {
    "text": "Exclusive: Inside the Supreme Court's negotiations and compromise on Idaho's abortion ban  —  The Supreme Court began the year poised to build on its 2022 decision overturning Roe v. Wade and to deliver a new blow to abortion access.  —  In January, the court took the extraordinary step … ",
    "url": "https://www.cnn.com/2024/07/29/politics/supreme-court-idaho-abortion-emtala-biskupic/"
  },
  {
    "text": "J.D. Vance May Be The Worst Politician I've Ever Seen  —  This is before even taking the couch into consideration.  —  I already have promised to stay as far away from the J.D. Vance couch story as I intend to stay away from the couch in question.  (Got a flight booked for Neptune already.)",
    "url": "https://www.esquire.com/news-politics/politics/a61719535/jd-vance-sucks/"
  },
  {
    "text": "William Calley, Army officer and face of My Lai Massacre, is dead at 80  —  He was the only person convicted in connection with the atrocity, in which American troops killed hundreds of unarmed South Vietnamese men, women and children.  —  William L. Calley Jr., a junior Army officer … ",
    "url": "https://www.washingtonpost.com/obituaries/2024/07/29/william-calley-dead-my-lai-massacre/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIyMjI1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzIzNjA3OTk5LCJpYXQiOjE3MjIyMjU2MDAsImp0aSI6IjU3YzU3Yjg0LTBlYmUtNDY0OS1hN2U2LWViMzM0ZDQ4ODI4YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vYml0dWFyaWVzLzIwMjQvMDcvMjkvd2lsbGlhbS1jYWxsZXktZGVhZC1teS1sYWktbWFzc2FjcmUvIn0.0BG4k9Xmve3VLUfJyMuTA0747JtYch7ptweUEiaw53o&itid=gfta"
  },
  {
    "text": "Video surprise - Capitol security tapes show fake GOP electors scheme  —  Tapes detail Jan. 5 effort to get bogus documents to Pence  —  The Jan. 6 security tapes being released by House Republicans have produced a surprise - video evidence of Donald Trump's fake GOP elector scheme in action … ",
    "url": "https://jamiedupree.substack.com/p/video-surprise-capitol-security-tapes"
  },
  {
    "text": "Marianne Williamson Ends Longshot 2024 Presidential Bid  —  Marianne Williamson said she failed to meet the deadline to challenge Vice President Kamala Harris for the Democratic nomination, effectively ending her longshot bid.  —  “We did everything possible to stand for a blitz primary, an open convention and so forth.",
    "url": "https://www.bloomberg.com/news/articles/2024-07-29/williamson-ends-longshot-2024-bid-as-harris-poised-to-be-nominee"
  },
  {
    "text": "Trump's reckless vaccine ultimatum  —  For all the talk of Project 2025 and the debate over whether it is or is not a roadmap for a second Trump term (it definitely is), you don't really need to delve through a 900-page document to find potentially catastrophic proposals that, in a sane world … ",
    "url": "https://radleybalko.substack.com/p/trumps-reckless-vaccine-ultimatum"
  },
  {
    "text": "Elon Musk Drew Winces From Billionaires' Gathering With Trump Pitch  —  PALM BEACH CONFAB  —  Some people in the crowd of rich donors reportedly winced and shook their heads after the world's richest man told them they should tell their friends to vote for Donald Trump.",
    "url": "https://www.thedailybeast.com/elon-musk-told-private-gathering-of-billionaire-pals-why-hes-voting-trump"
  },
  {
    "text": "Venezuelan opposition says it has proof its candidate defeated President Maduro in disputed election  —  As thousands of people demonstrated across Venezuela, opposition candidate Edmundo González on Monday announced that his campaign has the proof it needs to show he won … ",
    "url": "https://apnews.com/article/venezuela-presidential-election-maduro-machado-edmundo-results-acee6c8cd3a8fc88086c2dd71963b759"
  },
  {
    "text": "Trump's Mental State Suddenly Takes a Darker Turn: “I've Gotten Worse” … Donald Trump took his authoritarian threats in a dark new direction during two new public appearances.  He suggested our next election might be our last, reiterated in advance that the election will be rigged against him … ",
    "url": "https://newrepublic.com/article/184325/trumps-mental-state-suddenly-takes-darker-turn-ive-gotten-worse"
  },
  {
    "text": "These Swing State Election Officials Are Pro-Trump Election Deniers  —  At least 70 pro-Trump conspiracists are election officials in key battleground counties — and they are poised to make a giant mess on Election Day  —  WHEN ELECTION NIGHT comes in November, it will be up to thousands … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-swing-state-officials-election-deniers-1235069692/"
  },
  {
    "text": "GOP senator, Fox News host battle over Harris ‘ding dong’ remark  —  Sen. John Kennedy (R-La.) on Monday said Americans view Vice President Harris as “a bit of a ding dong,” a comment that was met with some pushback from Fox News host Neil Cavuto.  —  Kennedy fired off a series of attacks … ",
    "url": "https://thehill.com/homenews/campaign/4799057-gop-senator-fox-news-host-battle-over-harris-ding-dong-remark/"
  },
  {
    "text": "Elon Musk, Reid Hoffman and Other Tech Billionaires Brawl Over Politics  —  Elon Musk, Reid Hoffman and other tech billionaires, many of whom are part of the “PayPal Mafia,” are openly brawling with one another over politics as tensions rise.  —  Less than an hour after a gunman in Butler … ",
    "url": "https://www.nytimes.com/2024/07/29/technology/silicon-valley-politics-elon-musk-reid-hoffman.html?unlocked_article_code=1.-00.4Jo8.kMqZSPeuNHl7&smid=nytcore-ios-share&sgrp=c-cb"
  },
  {
    "text": "Scoop: Sen. Gary Peters emerges as VP dark horse … - Labor leaders have had discussions with the Harris campaign about including Peters in the vice presidential selection process, one senior Democratic source told Axios.  — A Michigan Democratic Party official told Axios Peters … ",
    "url": "https://www.axios.com/2024/07/29/harris-vp-pick-michigan-senator-gary-peters"
  },
  {
    "text": "Arizona GOP Congressional Candidate Said Childless Cat Ladies Are ‘Demented’ And ‘Sick’  —  Blake Masters said in 2021 that “there's something very dysfunctional” about people who decide not to get married and make babies.  —  LOADING  —  WASHINGTON ― Arizona Republican congressional … ",
    "url": "https://www.huffpost.com/entry/arizona-gop-blake-masters-childless-cat-ladies_n_66a7bbb8e4b0cb371c89630e"
  },
  {
    "text": "Foreign actors will seek to influence reshaped U.S. presidential race, says intelligence officer  —  U.S. foes targeting November's election with influence operations are expected to adapt to presidential contest developments, a U.S. intelligence official said on Monday, in an apparent reference to Joe Biden dropping his reelection bid.",
    "url": "https://www.reuters.com/world/us/foreign-influence-actors-adapt-us-presidential-race-changes-says-intelligence-2024-07-29/"
  },
  {
    "text": "U.S. National Debt Tops $35 Trillion for First Time  —  The presidential candidates have offered few ideas for reducing the debt burden as red ink continues to mount.  —  America's gross national debt topped $35 trillion for the first time on Monday, a reminder of the nation's grim fiscal predicament … ",
    "url": "https://www.nytimes.com/2024/07/29/us/politics/national-debt-35-trillion.html"
  }
]