[
  {
    "text": "Live updates: New Republican-led Congress kicks off its first day in 2025  —  The 119th Congress begins with Republican majorities in both chambers and a vote to re-elect Mike Johnson as House speaker. … Mike Johnson faces speaker test  —  By Zoë Richards and Syedah Asghar",
    "url": "https://www.nbcnews.com/politics/congress/live-blog/congress-first-day-2025-live-updates-rcna184508"
  },
  {
    "text": "Scoop: GOP moderates warn Johnson not to repeat McCarthy's deal … - Johnson said in a “Fox and Friends” interview Thursday that he has spoken with “every single one” of his detractors and that “we'll be talking about process reforms in the House.”  — GOP sources have told Axios … ",
    "url": "https://www.axios.com/2025/01/02/mike-johnson-mccarthy-moderates-speaker-deal"
  },
  {
    "text": "Net neutrality rules about corporate control over internet speeds blocked by federal appeals court  —  A federal appeals court on Thursday ruled that US regulators overstepped their authority by reinstating “net neutrality” rules governing internet service providers, dealing a blow to the Biden administration.",
    "url": "https://www.cbsnews.com/news/net-neutrality-rules-blocked-federal-appeals-court/"
  },
  {
    "text": "FBI releases new video of a suspect planting a pipe bomb near DNC offices on eve of the Capitol riot  —  A harrowing chapter in American history remains shrouded in mystery: Who planted pipe bombs outside offices of the Democratic and Republican national committees in Washington on the eve of the attack on the Capitol?",
    "url": "https://apnews.com/article/capitol-riot-pipe-bombs-fbi-washington-ea85b6fe5fe9140f1c75b7ee8c0554b2"
  },
  {
    "text": "Judicial body won't refer Clarence Thomas to Justice Department over ethics lapses  —  The head of the Judicial Conference said there is legal uncertainty over whether it has the authority to refer complaints about Supreme Court justices.  —  A judicial organization that sets national policy … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/judicial-body-will-not-refer-clarence-thomas-justice-department-ethics-rcna186059"
  },
  {
    "text": "Biden decides to block U.S. Steel sale to Japanese buyer  —  Move comes after a year of political and economic drama.  It leaves the future of the once-iconic American business in doubt.",
    "url": "https://www.washingtonpost.com/business/2025/01/02/biden-blocks-nippon-us-steel-deal/"
  },
  {
    "text": "Cybertruck blast suspect was a ‘Rambo type’ who loved Trump, family says  —  Exclusive: Matthew Livelsberger's shocked uncle told The Independent that the Green Beret was a ‘supersoldier’  —  Your support helps us to tell the story  —  From reproductive rights to climate change to Big Tech … ",
    "url": "https://www.independent.co.uk/news/world/americas/cybertruck-explosion-suspect-matthew-livelsberger-vegas-b2672940.html"
  },
  {
    "text": "Statement from President Joe Biden  —  As I have said many times, steel production—and the steel workers who produce it—are the backbone of our nation.  A strong domestically owned and operated steel industry represents an essential national security priority and is critical for resilient supply chains.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/03/statement-from-president-joe-biden-13/"
  },
  {
    "text": "South Korea's Impeached President Fends Off Arrest Attempt Over Martial-Law Decree  —  Special investigators, warrant in hand, were blocked from detaining Yoon Suk Yeol during a six-hour standoff with Secret Service personnel  —  SEOUL—South Korean investigators failed to arrest … ",
    "url": "https://www.wsj.com/world/asia/south-koreas-impeached-president-fends-off-arrest-attempt-over-martial-law-decree-89ead876?st=af8E5M&reflink=mobilewebshare_permalink"
  },
  {
    "text": "John Thune Takes Charge in the Senate, Ushering in a New Leadership Era  —  The affable traditional conservative from South Dakota is the first new chief of the Senate G.O.P. in nearly two decades.  He will confront a challenge managing President-elect Donald J. Trump's expectations.",
    "url": "https://www.nytimes.com/2025/01/03/us/politics/john-thune-senate-leadership.html"
  },
  {
    "text": "Elon Musk and the right's war on Wikipedia  —  Listen to me read this post here (not an AI-generated voice!), subscribe to the feed in your podcast app, or download the recording for later.  —  When Elon Musk launched his latest crusade against Wikipedia this Christmas Eve … ",
    "url": "https://www.citationneeded.news/elon-musk-and-the-rights-war-on-wikipedia/"
  },
  {
    "text": "Eyeing Potential Bird Flu Outbreak, Biden Administration Ramps Up Preparedness  —  The administration is committing an additional $306 million toward battling the virus, and will distribute the money before President-elect Donald J. Trump takes office.  —  The Biden administration … ",
    "url": "https://www.nytimes.com/2025/01/02/us/politics/bird-flu-biden-trump.html"
  },
  {
    "text": "Jimmy Carter's anti-corruption legacy is being desecrated  —  The contrast with Trump reflects how far our standards have fallen.  —  There are many obvious differences between the late Jimmy Carter and Donald Trump, but perhaps the most jarring is how they managed their family business when they were elected president.",
    "url": "https://www.publicnotice.co/p/jimmy-carter-trump-anti-corruption-legacy"
  },
  {
    "text": "The New Orleans attack shows that ISIS hasn't gone away.  It's changed.  —  The deadly attack in New Orleans on New Year's Eve that left 15 people dead feels like a disturbing reminder of a past era, one when the transnational terrorist organization known as the Islamic State, or ISIS, dominated the nation's attention and resources.",
    "url": "https://www.vox.com/world-politics/393110/new-orleans-isis-jabbar"
  },
  {
    "text": "Economy in Counties Trump Won Points to Governing Challenges  —  Trump won in the places that have seen the slowest growth since the pandemic, according to county-level GDP data.  —  Donald Trump's November election victory has often been explained as a reflection of anger … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-03/economy-in-counties-trump-won-points-to-governing-challenges"
  },
  {
    "text": "Musk rocks U.K. politics with attacks on PM and support for far right … - While Musk's X microphone was enough to send Westminster into a frenzy, there's been intense speculation he'll also open his checkbook for Reform and its Trump-aligned leader, Nigel Farage.",
    "url": "https://www.axios.com/2025/01/03/elon-musk-uk-tommy-robinson-starmer"
  },
  {
    "text": "Siri “unintentionally” recorded private convos; Apple agrees to pay $95M … Apple has agreed to pay $95 million to settle a lawsuit alleging that its voice assistant Siri routinely recorded private conversations that were then sold to third parties for targeted ads.",
    "url": "https://arstechnica.com/tech-policy/2025/01/apple-agrees-to-pay-95m-delete-private-conversations-siri-recorded/"
  },
  {
    "text": "Governor seeks resignation of Western New Mexico University regents after spending revelations  —  New Mexico Gov. Michelle Lujan Grisham has asked for the immediate resignation of regents at Western New Mexico State University after revelations of wasteful spending and failures in financial oversight … ",
    "url": "https://apnews.com/article/western-new-mexico-regents-resignation-553678a0735d9bfbd5c60a6fd073827e"
  },
  {
    "text": "US considers potential rules to restrict or bar Chinese drones  —  The U.S. Commerce Department said on Thursday it is considering new rules that would impose restrictions on Chinese drones that would restrict or ban them in the United States citing national security concerns.",
    "url": "https://www.reuters.com/world/us/us-considers-potential-rules-restrict-or-bar-chinese-drones-2025-01-02/"
  }
]