[
  {
    "text": "Trump Administration Live Updates: Johnson Shutting Down House Early to Block Epstein Vote  —  Where Things Stand  — Epstein case: Speaker Mike Johnson said he would shut the House down early for its summer recess to head off Democratic demands for votes on calling for the release of files … ",
    "url": "https://www.nytimes.com/live/2025/07/22/us/trump-news?unlocked_article_code=1.YU8.XvZe.Uq4wam0YefJ6&smid=url-share"
  },
  {
    "text": "Why the Epstein Coverup Matters  —  Jeffrey Epstein damage control continues at the Justice Department, with Pam Bondi announcing this morning that Deputy Attorney General Todd Blanche is seeking a prosecutorial interview with Epsitein's co-conspirator, Ghislaine Maxwell.",
    "url": "https://www.thebulwark.com/p/why-the-epstein-coverup-matters-trump-bondi-patel-justice-fbi"
  },
  {
    "text": "Trump's Defense Attorney Todd Blanche Will Meet with Sex Trafficker Ghislaine Maxwell to Make a Deal for His Client  —  Trump Defense Attorney Todd Blanche and Pam Bondi just announced that Blanche will meet with Ghislaine Maxwell and discuss potential cooperation deals with her.",
    "url": "https://www.emptywheel.net/2025/07/22/trumps-defense-attorney-todd-blanche-will-meet-with-sex-trafficker-ghislaine-maxwell-to-make-a-deal-for-his-client/"
  },
  {
    "text": "House grinds to a halt as GOP tries to shut down Epstein votes  —  House Republicans have virtually stopped work on all major legislation leading up to their six-week summer recess to avoid taking votes on forcing the release of the Jeffrey Epstein files. … - “They're certainly not making it easier for themselves. ...",
    "url": "https://www.axios.com/2025/07/22/jeffrey-epstein-house-republicans-vote-democrats"
  },
  {
    "text": "Trump Goes Full Fascist: 'Whether It's Right or Wrong, It's Time to Go After People'  —  The president is desperate to turn the nation's attention away from his ties to Jeffrey Epstein … He spent the weekend suggesting prominent Democrats should be prosecuted over bogus right-wing conspiracy theories … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-fascist-doj-go-after-obama-1235391240/"
  },
  {
    "text": "Deflecting Epstein questions, Trump urges DOJ to ‘go after’ Obama … “I don't follow it too much,” he said of the Epstein drama, urging the press to cover what he called “the other witch hunt” — an alleged plot by Obama to rig the 2016 election. … “This was treason,” Trump declared.",
    "url": "https://www.politico.com/news/2025/07/22/trump-epstein-urges-doj-obama-00467514"
  },
  {
    "text": "Bypassing Habba, Judges in New Jersey Name New Top Federal Prosecutor  —  Alina Habba's term as interim U.S. attorney was set to expire on Tuesday.  New Jersey's two Democratic senators had accused her of pursuing “frivolous and politically motivated prosecutions.”",
    "url": "https://www.nytimes.com/2025/07/22/nyregion/alina-habba-nj-us-attorney.html?unlocked_article_code=1.YU8.xiUk.VhXWrRUwYs2C&smid=url-share"
  },
  {
    "text": "Judges vote to not keep Habba as interim US attorney of New Jersey  —  A panel of judges in the U.S. District Court in New Jersey declined to permanently appoint President Donald Trump's former lawyer Alina Habba as the state's top federal prosecutor, according to an order from the court.",
    "url": "https://www.reuters.com/world/us/judges-vote-not-keep-habba-interim-us-attorney-new-jersey-2025-07-22/"
  },
  {
    "text": "Republicans propose naming Kennedy Center Opera House after Melania Trump  —  The House Appropriations committee passed an amendment that would rename the theater, months after President Donald Trump took over the performing arts center.  —  The Kennedy Center's Opera House could soon be called the … ",
    "url": "https://www.washingtonpost.com/entertainment/theater/2025/07/22/melania-trump-kennedy-center-opera-house-appropriations-bill/"
  },
  {
    "text": "NPR news chief announces she's leaving days after Congress kills federal funding  —  NPR's editor in chief and acting chief content officer Edith Chapin told colleagues Tuesday morning that she has decided to step down.  —  The veteran news leader's announcement comes just days … ",
    "url": "https://www.npr.org/2025/07/22/nx-s1-5476192/npr-news-chief-edith-chapin-to-step-down-congress-funding-trump"
  },
  {
    "text": "FEMA Urban Search and Rescue Chief Resigns, Citing Agency ‘Chaos’, Colleagues Said  —  Ken Pagurek had told colleagues the Trump administration was causing ‘chaos’ inside FEMA and creating dangerous delays in disaster response.  —  The head of the Federal Emergency Management Agency's urban search … ",
    "url": "https://www.nytimes.com/2025/07/22/climate/fema-urban-search-rescue-chief-resigns.html"
  },
  {
    "text": "FEMA search and rescue chief resigns after frustration with Texas flood response  —  The head of FEMA's Urban Search and Rescue branch, which runs a network of teams stationed across the country that can swiftly respond to natural disasters, resigned on Monday.",
    "url": "https://cnn.com/2025/07/21/politics/fema-search-and-rescue-chief-resigns"
  },
  {
    "text": "‘Those days are over’: Trump books draw lackluster sales … “Everyone is desperately looking for the next Michael Wolff or James Comey for next year, but it's not clear there could ever be one again,” said one concerned publisher, referencing two of the authors with biggest book successes of Trump's first term.",
    "url": "https://www.politico.com/news/2025/07/22/donald-trump-books-nonfiction-sales-00466907"
  },
  {
    "text": "Rent Prices Are Falling Fast in America's Most Pro-Housing Cities  —  Rental prices in some of the country's largest cities are falling—some by almost 45 percent, according to new data from Five Star Cash Offer, a real estate investment firm that operates as a direct cash homebuyer.",
    "url": "https://reason.com/2025/07/22/rent-prices-are-falling-fast-in-americas-most-pro-housing-cities/"
  },
  {
    "text": "Hunter Biden Really Needs to Shut It  —  QUIET TIME  —  Why is he talking?  Why is he still talking?  —  OPINION  —  Let's establish a few quick facts about Hunter Biden: He has never been elected to anything, ever.  His business acumen appears to amount, largely, to having the last name “Biden.”",
    "url": "https://www.thedailybeast.com/hunter-biden-really-needs-to-shut-it/"
  },
  {
    "text": "Revealed: Harvard publisher cancels entire journal issue on Palestine shortly before publication  —  As Harvard's feud with Trump escalated, so did tensions over an ‘education and Palestine’ issue of a prestigious journal.  Scholars blame the ‘Palestine exception’ to academic freedom",
    "url": "https://www.theguardian.com/education/2025/jul/22/harvard-educational-review-palestine-issue-cancelled"
  },
  {
    "text": "Self-proclaimed Catholic fascist fired after Jubilee appearance  —  The self-proclaimed Catholic fascist who recently appeared on an episode of Surrounded by the popular YouTube channel Jubilee has lost his job following the programme's release.  The debate, which first aired on Sunday … ",
    "url": "https://thecatholicherald.com/article/self-proclaimed-catholic-fascist-fired-after-jubilee-appearance"
  },
  {
    "text": "Trump's WSJ Lawsuit Raises a New Constitutional Question … The president can sue you, but you can't sue him.  —  It seems like an absurd thing to say but that's effectively the reality of our legal system today, one that has become increasingly alarming during Donald Trump's second term.",
    "url": "https://www.politico.com/news/magazine/2025/07/22/trump-lawsuit-wall-street-journal-supreme-court-ankush-khardori-column-00465728"
  },
  {
    "text": "A Manhattan Institute Manifesto Would Give this President Sweeping Power to Force University Compliance with Right-Wing Demands  —  Many persons I'd think would know better have affixed their names to a new and highly illiberal set of demands on colleges and universities.",
    "url": "https://www.theunpopulist.net/p/a-manhattan-institute-manifesto-would"
  },
  {
    "text": "Trump to pull US out of UNESCO over DEI policies, pro-Palestinian, pro-China tilt  —  WASHINGTON — President Trump is pulling the US out of the United Nations Educational, Scientific and Cultural Organization (UNESCO), citing its anti-America and anti-Israel leanings as well as its woke agenda, The Post has learned.",
    "url": "https://nypost.com/2025/07/22/us-news/trump-to-pull-us-out-of-unesco-over-dei-policies-pro-palestinian-pro-china-tilt/"
  },
  {
    "text": "Zohran's Bronx Science tales  —  MAMDANI PLAYS HOOKY: He's just like us.  He got detention.  He cut class to get lunch.  He says he's bad at math.  —  Democratic mayoral nominee Zohran Mamdani graduated from the public, test-in, competitive Bronx Science High School in 2010.",
    "url": "https://www.politico.com/newsletters/new-york-playbook-pm/2025/07/21/zohrans-bronx-science-tales-00465437"
  },
  {
    "text": "Has Brazil Invented the Future of Money?  —  And will it ever come to America?  —  Last week the House passed the GENIUS Act, which will boost the growth of stablecoins, thereby paving the way for future scams and financial crises.  On Thursday the House also passed a bill that would bar … ",
    "url": "https://paulkrugman.substack.com/p/has-brazil-invented-the-future-of"
  },
  {
    "text": "Marcos Meeting With Trump Yields 19% Tariff for Philippines  —  President Donald Trump said the US reached an agreement with the Philippines setting a 19% tariff on the country's exports, the latest pact ahead of an Aug. 1 deadline.  —  Trump initially imposed a 17% rate for the US ally in April … ",
    "url": "https://www.bloomberg.com/news/articles/2025-07-22/trump-says-very-close-to-philippine-trade-deal-on-marcos-visit"
  },
  {
    "text": "U.S. Steel Producers Raise Prices After Tariffs Stymie Imports  —  Steel producers like Cleveland Cliffs and Steel Dynamics both said this week that they raised prices after President Trump imposed a 50 percent tariff on imports.  —  American steel makers are raising prices … ",
    "url": "https://www.nytimes.com/2025/07/22/business/steel-prices-tariffs.html"
  },
  {
    "text": "Everything Is a ‘False Flag’ Now  —  Conspiracy theories about so-called false flag attacks have been around for decades.  But as trust in media and public institutions craters, every single major news event is now being labeled as fake.  —  As President Donald Trump struggles to contain … ",
    "url": "https://www.wired.com/story/false-flag-conspiracy-theory-trump/"
  },
  {
    "text": "Military Says It Will ‘Continuously’ Monitor Bathrooms to Comply With Anti-Trans Order  —  An internal memo obtained by 404 Media also shows the military ordered a review hold on “questionable content” at Stars and Stripes, the military's ‘editorially independent’ newspaper.",
    "url": "https://www.404media.co/pentagon-says-it-will-continuously-monitor-bathrooms-to-comply-with-anti-trans-order/"
  },
  {
    "text": "Bernice King's demand comes after Tulsi Gabbard announced the release of thousands of documents tied to Martin Luther King Jr.'s 1968 assassination  —  Rev. Martin Luther King Jr.'s daughter has urged Donald Trump to release the full, unredacted Jeffrey Epstein files after thousands … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/mlk-epstein-files-trump-bernice-king-b2793533.html"
  }
]