[
  {
    "text": "Playbook: Dropping the H-bomb on 2024  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  NEW NYT/SIENA POLL — Among registered voters: Trump beats Biden, 46% to 44%.  Among likely voters: Biden beats Trump, 47% to 45%.  Toplines ... Crosstabs",
    "url": "https://www.politico.com/newsletters/playbook/2023/12/19/dropping-the-h-bomb-on-2024-00132405"
  },
  {
    "text": "Poll Finds Wide Disapproval of Biden on Gaza, and Little Room to Shift Gears  —  Opinion is split between those wanting the war to end and those pressing for a definitive Israeli victory, and the divide is starkest among older and younger generations.  —  Opinion is split between those wanting … ",
    "url": "https://www.nytimes.com/2023/12/19/us/politics/biden-israel-gaza-poll.html"
  },
  {
    "text": "Why Biden's campaign keeps linking Trump to Hitler  —  The Biden campaign warns that Trump's rhetoric — from “vermin” to “poisoned” blood — could reflect history repeating.  —  Comparing your political opponent's words to Adolf Hitler's used to be controversial.",
    "url": "https://www.politico.com/news/2023/12/19/biden-trump-hitler-00132367"
  },
  {
    "text": "How Much Is Biden's Support of Israel Hurting Him With Young Voters?  —  Donald Trump leads him among those 18 to 29, a new poll shows.  —  As recently as this summer, a poll with Donald J. Trump leading among young voters would have been eye-popping.  —  Now, it's increasingly familiar … ",
    "url": "https://www.nytimes.com/2023/12/19/upshot/poll-biden-trump-israel-youth.html"
  },
  {
    "text": "Biden resists his age limitations, causing tension  —  President Biden's reluctance to acknowledge his physical limitations at age 81 is causing some tension on his team, as senior aides and First Lady Jill Biden push him to rest more and be vigilant about his health going into 2024.",
    "url": "https://www.axios.com/2023/12/19/biden-resistance-age-trump-election-2024"
  },
  {
    "text": "Fernandina Beach Man Pleads Guilty To Threatening To Kill A United States Supreme Court Justice  —  For Immediate Release  —  U.S. Attorney's Office, Middle District of Florida  —  Jacksonville, Florida - United States Attorney Roger B. Handberg announces that Neal Brij Sidhwaney (43 … ",
    "url": "https://www.justice.gov/usao-mdfl/pr/fernandina-beach-man-pleads-guilty-threatening-kill-united-states-supreme-court"
  },
  {
    "text": "Trump Is Scrambling to Block One Particular Expert Witness in His New E. Jean Carroll Case  —  Donald Trump's lawyers want to bar the same expert witness who came up with a hefty calculation in Rudy Giuliani's defamation case from testifying in a new E. Jean Carroll lawsuit.",
    "url": "https://www.thedailybeast.com/donald-trump-scrambles-to-block-expert-witness-ashlee-humphreys-in-his-new-e-jean-carroll-case"
  },
  {
    "text": "Toplines: December 2023 Times/Siena Poll of Registered Voters Nationwide  —  Donald Trump leads Joe Biden by 46 percent to 44 percent among registered voters.  —  Thinking ahead to next year's presidential general election, are you almost certain that you will vote, very likely to vote … ",
    "url": "https://www.nytimes.com/interactive/2023/12/19/us/elections/times-siena-national-poll-toplines.html"
  },
  {
    "text": "Body found in Kentucky lake by fishermen in 1999 identified as fugitive wanted by FBI  —  Nearly a quarter century after fishermen discovered a body chained to the bottom of a lake in western Kentucky, authorities say advanced forensic testing helped identify the remains as a fugitive wanted by the FBI in the late 1990s.",
    "url": "https://www.cbsnews.com/news/roger-parham-body-found-kentucky-lake-fishermen-1999-identified-fugitive-wanted-fbi/"
  },
  {
    "text": "The Senate sex tape is also textbook sexual harassment — by the participants  —  It turns out that the taxpayers aren't the only people getting screwed in the storied halls of the Senate.  In the scandal that everyone in the Beltway can't shut up about, the now-infamous Senate staffer … ",
    "url": "https://www.washingtonexaminer.com/opinion/the-senate-sex-tape-is-also-textbook-sexual-harassment-by-the-participants"
  },
  {
    "text": "Biden administration takes step toward protecting old-growth trees  —  The Biden administration on Tuesday took a step toward protecting older trees that store carbon dioxide and help to lessen climate change.  —  It issued a proposed plan with apparent limitations on cutting down old-growth trees … ",
    "url": "https://thehill.com/policy/energy-environment/4367652-biden-administration-step-towad-protecting-old-growth-trees-lessen-climate-change/"
  },
  {
    "text": "GOP Lawmaker: Congressional Colleagues ‘Compromised’ on Jeffrey Epstein Flight Logs  —  The Tennessee congressman said Marsha Blackburn was ‘snubbed’ when trying to subpoena the flight records for the infamous ‘Lolita Express’  —  Rep. Tim Burchett, R-Tenn., is accusing colleagues of being … ",
    "url": "https://themessenger.com/politics/tim-burchett-epstein-flight-logs-senate-blocked"
  },
  {
    "text": "Trump Lawyers: Jack Smith ‘Unlawfully Attempted to Advance’ D.C. Election Case Despite Court-Ordered Pause  —  The special counsel's office said it delivered the material on Monday in anticipation of the case getting put back on track toward trial  —  JWPlayer",
    "url": "https://themessenger.com/politics/trump-discovery-dc-election-case-appeal-stay-pause-chutkan-smith"
  },
  {
    "text": "Statement from Secretary of Defense Lloyd J. Austin III on Ensuring Freedom of Navigation in the Red Sea  —  The recent escalation in reckless Houthi attacks originating from Yemen threatens the free flow of commerce, endangers innocent mariners, and violates international law.",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3621110/statement-from-secretary-of-defense-lloyd-j-austin-iii-on-ensuring-freedom-of-n/"
  },
  {
    "text": "BOOM: Judge Orders Over 100 of Child Predator Jeffrey Epstein's High Profile Associates to Be Revealed in Next 14 Days - Several Names Linked to Epstein are Emerging - Will Bill Clinton and Bill Gates Be Mentioned?  —  UPDATE: The Gateway Pundit's legal counsel provided us with this statement on Monday's development in the Epstein case.",
    "url": "https://www.thegatewaypundit.com/2023/12/boom-judge-orders-100-child-predator-jeffrey-epsteins/"
  },
  {
    "text": "Florida was supposed to be the future of the GOP — now the state party is in shambles  —  Gov. Ron DeSantis grasps desperately for attention, as the state party chair is pushed out after a rape allegation  —  It may seem hard to believe right now, but this time last year … ",
    "url": "https://www.salon.com/2023/12/19/florida-was-supposed-to-be-the-future-of-the--now-the-state-party-is-in-shambles/"
  },
  {
    "text": "Gov. Greg Abbott signs bill making illegal immigration a state crime  —  The new law would authorize police to arrest people they suspect crossed the Rio Grande between ports of entry.  Abbott also signed a bill earmarking more than $1 billion for more border barriers.",
    "url": "https://www.texastribune.org/2023/12/18/texas-governor-abbott-bills-border-wall-illegal-entry-crime-sb3-sb4/"
  },
  {
    "text": "Miami GOP Strategist Barbara Balmaseda Arrested on Capitol Riot Charges  —  Barbara Balmaseda has been charged with a felony count of obstructing an official proceeding during the Capitol riot. … Authorities have unsealed an arrest warrant for Barbara Balmaseda, a former Florida International … ",
    "url": "https://www.miaminewtimes.com/news/miami-gop-strategist-barbara-balmaseda-accused-of-storming-us-capitol-18501993"
  }
]