[
  {
    "text": "Her Online Sex Life Was Exposed.  She Lost Her Election.  Now She's Speaking Out.  —  Susanna Gibson's campaign was rocked when an opponent exposed her private digital life to the public.  She won't be the last.  —  It is not often that a state legislative campaign in an off-season election seizes the national spotlight.",
    "url": "https://www.politico.com/news/magazine/2023/12/09/susanna-gibson-virginia-digital-privacy-00130883"
  },
  {
    "text": "Texas Supreme Court Temporarily Halts Court-Approved Abortion  —  The court, responding to an appeal from Attorney General Ken Paxton, put on hold a lower court order allowing an abortion for a woman whose fetus has a fatal condition.  —  The Texas Supreme Court late Friday temporarily halted … ",
    "url": "https://www.nytimes.com/2023/12/08/us/texas-abortion-court-ken-paxton.html"
  },
  {
    "text": "Texas Supreme Court temporarily blocks pregnant woman from emergency abortion  —  The Texas Supreme Court has temporarily blocked a pregnant woman from obtaining an emergency abortion in a ruling issued late Friday.  —  The court froze a lower court's ruling that would have allowed Kate Cox … ",
    "url": "https://www.cnn.com/2023/12/08/us/texas-abortion-ruling-attorney-general-petition/"
  },
  {
    "text": "Ken Paxton asks Texas Supreme Court to stop abortion for woman with lethal fetal anomaly  —  After a Travis County district judge cleared the way for Kate Cox, 31, to terminate her pregnancy, Ken Paxton petitioned the state's highest court to halt the ruling.",
    "url": "https://www.texastribune.org/2023/12/08/texas-abortion-lawsuit-ken-paxton/"
  },
  {
    "text": "Trump Takes 2024 Lead as Biden Approval Hits New Low, WSJ Poll Finds  —  Unhappiness with Biden's performance is pervasive, with economic pessimism weighing him down  —  WASHINGTON—President Biden's political standing is at its weakest point of his presidency, a new Wall Street Journal poll finds … ",
    "url": "https://www.wsj.com/politics/elections/trump-takes-2024-lead-as-biden-approval-hits-new-low-wsj-poll-finds-fb4fca0c?mod=followamazon"
  },
  {
    "text": "Trump lawyer says he will take stand in fraud trial regardless of gag order  —  Former President Trump's attorney Alina Habba claimed Friday that her client would take the stand on Monday in his civil fraud trial, despite the judge's gag order and discouragement from his legal team.",
    "url": "https://thehill.com/regulation/court-battles/4351358-alina-habba-trump-will-take-stand-fraud-trial-despite-gag-order/"
  },
  {
    "text": "Kevin McCarthy endorses Donald Trump; says he would serve in Trump cabinet if he's the ‘best person’ for the job  —  WASHINGTON - Former House Speaker Kevin McCarthy, R-Calif, said in an interview that he'd endorse former President Trump for president in 2024 and would serve in his cabinet if given the opportunity.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2023/12/09/mccarthy-endorses-trump-in-2024-says-he-would-serve-in-trump-cabinet-in-the-right-position/71862405007/"
  },
  {
    "text": "Trump hits Casey DeSantis over call for out-of-state backers to ‘be a part of the caucus’ in Iowa  —  The Florida first lady told Fox News viewers that “you do not have to be a resident of Iowa to be able to participate in the caucus.”  —  Former president Donald Trump seized on an apparent blunder … ",
    "url": "https://www.politico.com/news/2023/12/09/trump-hits-casey-desantis-over-false-iowa-caucus-claims-00130952"
  },
  {
    "text": "Transmittal No  —  The Secretary of State has approved a possible Foreign Military Sale to the Government of Israel of 120mm M830A1 High Explosive Anti-Tank Multi-Purpose with Tracer (MPAT) tank cartridges and related equipment for an estimated cost of $106.5 million.",
    "url": "https://www.dsca.mil/press-media/major-arms-sales/israel-m830a1-120mm-tank-cartridges"
  },
  {
    "text": "University of Pennsylvania president steps down amid criticism of antisemitism testimony  —  The chair of the Penn Board of Trustees announced that Liz Magill has voluntarily stepped down as president of the Ivy League school.  —  University of Pennsylvania President Liz Magill resigned … ",
    "url": "https://www.nbcnews.com/news/us-news/university-pennsylvania-president-steps-criticism-antisemitism-testimo-rcna128712"
  },
  {
    "text": "ACLU to Represent NRA in Supreme Court Free-Speech Case  —  The civil liberties group says it opposes the N.R.A. and its mission but has agreed to represent it in the Supreme Court in a free-speech case.  —  The American Civil Liberties Union and the National Rifle Association agree about very little.",
    "url": "https://www.nytimes.com/2023/12/09/us/aclu-nra-scotus-free-speech.html"
  },
  {
    "text": "Exclusive: Wharton board tries to increase pressure on Penn president Liz Magill  —  The next several days could be critical for the future of University of Pennsylvania president Elizabeth Magill, who remains under fire for her testimony at a congressional hearing on antisemitism.",
    "url": "https://www.axios.com/2023/12/09/wharton-penn-antisemitism-pressure-congress"
  },
  {
    "text": "GOP Senate candidates soften their abortion stances amid a post-Roe losing streak  —  In key 2024 battleground states, some Republican Senate hopefuls have quietly shifted elements of their abortion positions.  —  Republican candidates in states that will determine control of the U.S. Senate next year … ",
    "url": "https://www.nbcnews.com/politics/2024-election/gop-senate-candidates-soften-abortion-stances-2024-roe-losing-streak-rcna125185"
  },
  {
    "text": "Ukraine in ‘mortal danger’ without aid, Olena Zelenska warns  —  Olena Zelenska has warned that Ukrainians are in “mortal danger” of being left to die if Western countries don't continue their financial support.  —  Ukraine's first lady spoke to Sunday with Laura Kuenssberg … ",
    "url": "https://www.bbc.com/news/world-europe-67667035"
  }
]