[
  {
    "text": "Trump's social media account shares a campaign video with a headline about a ‘unified Reich’  —  A video posted to Donald Trump's account on his social media network included references to a “unified Reich” among hypothetical news headlines if he wins the election in November.",
    "url": "https://apnews.com/article/trump-election-2024-rhetoric-germany-antisemitism-31002afb91b642c0314223d19e51f427"
  },
  {
    "text": "‘Unified Reich’: Trump campaign goes full Nazi  —  In a shocking development - even by the Republican Party's low, low standards - Donald Trump has directly framed his campaign using Nazi terminology.  —  A video posted on his social media accounts yesterday promised a “unified Reich” if he wins the presidency in 2024.",
    "url": "https://www.theframelab.org/unified-reich-trump-campaign-goes-full-nazi/"
  },
  {
    "text": "Special counsel suspected additional obstruction effort by Trump in classified docs case  —  The allegations were revealed in a newly unsealed court filing Tuesday.  —  Former President Donald Trump listens during a news conference after attending the wake of New York City police officer Jonathan Diller … ",
    "url": "https://abcnews.go.com/US/special-counsel-suspected-additional-obstruction-effort-trump-classified/story?id=110438582"
  },
  {
    "text": "Lawyers found classified docs in Trump's bedroom 4 months after Mar-a-Lago search  —  The revelation was contained in a newly unsealed opinion that a federal judge issued in 2023.  —  Four months after the FBI raided his Mar-a-Lago estate, Donald Trump's attorneys discovered four documents marked “classified” in his personal bedroom.",
    "url": "https://www.politico.com/news/2024/05/21/trump-classified-documents-bedroom-00159182"
  },
  {
    "text": "Israeli officials seize AP equipment and take down live shot of northern Gaza, citing new media law  —  Israeli officials seized a camera and broadcasting equipment belonging to The Associated Press in southern Israel, accusing the news organization of violating a new media law by providing images to Al Jazeera.",
    "url": "https://apnews.com/article/live-transmission-israel-associated-press-57e8f662907334ba3599156276381190"
  },
  {
    "text": "Trump says he will ‘never advocate’ for contraception restrictions after earlier saying he's ‘looking at’ them  —  The social media post came after Trump said in a TV interview that he plans to share a policy on contraception “very shortly,” without providing details.",
    "url": "https://www.politico.com/news/2024/05/21/trump-contraception-abortion-00159118"
  },
  {
    "text": "Kremlin TV Drops ‘New’ Tucker Carlson Show  —  THEY'LL NEVER LET GO  —  The former Fox News host has responded to becoming a fixture on Russian TV.  —  The Kremlin propaganda machine has made Tucker Carlson its newest star television host, whether he likes it or not.",
    "url": "https://www.thedailybeast.com/kremlin-tv-drops-new-tucker-carlson-show"
  },
  {
    "text": "Jon Stewart Sounds Off on the ‘Real Cancel Culture’  —  ‘CONSTANT VICTIMIZATION’  —  “Jerry Seinfeld took more shit over the past two weeks promoting a Pop-Tart movie than Harrison Butker did for his entire speech,” Stewart said on Monday's “Daily Show.”  —  Chiefs kicker Harrison Butker … ",
    "url": "https://www.thedailybeast.com/jon-stewart-blasts-trump-cancel-culture-and-gop-hypocrisy-after-harrison-butker-outrage"
  },
  {
    "text": "A Hidden Variable in the Presidential Race: Fears of ‘Trump Forever’  —  Undecided voters are concerned that if Donald Trump returns to the White House, he'll never leave.  —  As the rematch between Joe Biden and Donald Trump draws nearer, political professionals are detecting … ",
    "url": "https://www.bloomberg.com/news/features/2024-05-21/voters-fear-trump-won-t-leave-if-he-wins-2024-presidential-election"
  },
  {
    "text": "Trump seems unlikely to testify.  Here's the latest.  —  The jury has been dismissed until closing arguments next Tuesday, but the court has more business to deal with this afternoon.  Lawyers for Donald J. Trump called just two witnesses before wrapping up their case.  —  The jury will begin deliberations next week.",
    "url": "https://www.nytimes.com/live/2024/05/21/nyregion/trump-trial-hush-money"
  },
  {
    "text": "Trump's Reported Fund-Raising Tops Biden's for First Time  —  The pace of giving to Donald Trump's campaign and the Republican Party picked up in April, according to his advisers.  But President Biden still has far more cash on hand.  —  Former President Donald J. Trump and the Republican Party … ",
    "url": "https://www.nytimes.com/2024/05/21/us/politics/trump-biden-fundraising.html"
  },
  {
    "text": "Trump campaign says it will sue filmmakers behind ‘The Apprentice’ movie for including ‘blatantly false assertions’  —  Former President Trump's reelection campaign plans to sue the filmmakers behind the new biopic film, “The Apprentice,” which follows the former president's early years … ",
    "url": "https://thehill.com/blogs/in-the-know/4676021-trump-campaign-lawsuit-filmmakers-the-apprentice-film-including-blatantly-false-assertions/"
  },
  {
    "text": "The U.S. Was Resettling Guantánamo Prisoners.  The Hamas Attack Halted Those Plans.  —  The White House suspended a secret mission to transfer detainees to Oman in October after Congress members expressed concerns about Middle East instability.  —  The Biden administration was poised … ",
    "url": "https://www.nytimes.com/2024/05/21/us/politics/guantanamo-hamas-israel-oman.html"
  },
  {
    "text": "Biden releasing 1 million barrels of gasoline from Northeast reserve in bid to lower prices at pump  —  The Biden administration said Tuesday that it is releasing 1 million barrels of gasoline from a Northeast reserve established after Superstorm Sandy in a bid to lower prices at the pump this summer.",
    "url": "https://apnews.com/article/gas-prices-biden-northeast-reserve-6fa669ef3c963d212852513e4b312060"
  },
  {
    "text": "Imprisoned ex-Trump aide Peter Navarro predicts Fed Chair's ouster and ‘mass deportations’ in a second presidential term  —  The Scoop  —  Federal Reserve Chair Jerome Powell would be gone in the first 100 days of a second Donald Trump term that would also include mass deportations … ",
    "url": "https://www.semafor.com/article/05/21/2024/imprisoned-ex-trump-aide-peter-navarro-predicts-ouster-of-fed-chair-jay-powell"
  },
  {
    "text": "Election deniers moving closer to GOP mainstream, report shows, as Trump allies fill Congress  —  In the hours after the attack on the U.S. Capitol on Jan. 6, 2021, Ohio's then-Republican senator, Rob Portman, voted to accept President Joe Biden's win over the defeated former president … ",
    "url": "https://apnews.com/article/congress-election-lies-2024-certification-president-460cde281d48e62e09e24c7573d6a9ff"
  },
  {
    "text": "Biden quietly advances a range of progressive policies  —  He did so just before a deadline on his rule-making authority.  —  ∙ Paid … Congress, in case you're just back from Mars, has been so mired in gridlock that its main function — passing laws — has become about as common as hens teeth.",
    "url": "https://www.publicnotice.co/p/biden-congressional-review-act-2024-deadline"
  },
  {
    "text": "Gaza aid piles up in Egypt, US pier delivery falters  —  Food and medicine for Palestinians in Gaza are piling up in Egypt because the Rafah crossing remains closed and there has been no aid delivered to a U.N. warehouse from a U.S.-built pier for two days, U.N. officials warned on Monday.",
    "url": "https://www.reuters.com/world/middle-east/no-us-pier-aid-un-gaza-two-days-after-truck-incident-2024-05-20/"
  },
  {
    "text": "How Donald Trump's Financial Future Became Tied to Trump Media  —  Mr. Trump has treated Trump Media, which runs his social network Truth Social, as a low-cost sideshow.  Now a big portion of his wealth hinges on its success.  —  At Mar-a-Lago on a Wednesday evening last month … ",
    "url": "https://www.nytimes.com/2024/05/21/business/donald-trump-wealth-trump-media.html"
  },
  {
    "text": "An Alabama Trump appointee is threatening to jail LGBTQ civil rights lawyers  —  A forum-shopping dispute that been ongoing for two years briefly reached the Eleventh Circuit on Monday.  Also: More on Alito.  And: Law Dork in the news.  —  An “unprecedented judicial investigation” … ",
    "url": "https://www.lawdork.com/p/alabama-burke-threatening-jail-lgbtq-lawyers"
  }
]