[
  {
    "text": "An Accuser's Story Suggests How Trump Might Appear in the Epstein Files … Maria Farmer in August 2019.  Ms. Farmer said in an interview with The New York Times that she twice told the F.B.I. about a troubling encounter she had with Donald J. Trump, and about how close he was with Jeffrey Epstein.Andrea Morales for The New York Times",
    "url": "https://www.nytimes.com/2025/07/20/us/politics/epstein-employee-trump-investigation.html?unlocked_article_code=1.X08.-y5C.oO6OwIDny5oX&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Epstein Accuser Twice Told FBI About His Ties to Trump  —  Maria Farmer, a former Epstein employee, said she told law enforcement about their relationship in 1996 and 2006 … Farmer, who worked for Epstein and recently spoke to The New York Times, first went to law enforcement in 1996 … ",
    "url": "https://www.rollingstone.com/politics/politics-news/maria-farmer-epstein-trump-1235389698/"
  },
  {
    "text": "Epstein Victim Twice Named Trump to Law Enforcement  —  THE NAME ON EVERYBODY'S LIPS  —  The disgraced financier's former employee recalled an alleged incident in which the president stared at her bare legs.  —  Disgraced financier Jeffrey Epstein's first accuser says she warned … ",
    "url": "https://www.thedailybeast.com/epstein-victim-twice-named-trump-to-law-enforcement/"
  },
  {
    "text": "Trump threatens Washington stadium deal unless NFL team readopts Redskins name  —  U.S. President Donald Trump threatened on Sunday to interfere with a deal to build a new football stadium in Washington, D.C., unless the local NFL team, now known as the Commanders, changes its name back to Redskins.",
    "url": "https://www.reuters.com/sports/trump-threatens-washington-stadium-deal-unless-nfl-team-readopts-redskins-name-2025-07-20/"
  },
  {
    "text": "Should ICE Agents Be Allowed to Wear Masks?  It Depends Whom You Ask.  —  Los Angeles's mayor said Sunday that masked immigration agents helped create a “reign of terror.”  ICE's director said agents could wear masks to “keep them and their families safe.”",
    "url": "https://www.nytimes.com/2025/07/20/us/politics/ice-agents-masks.html"
  },
  {
    "text": "Desperate Trump Tries to Get MAGA Not to Care About Epstein  —  HOIST BY HIS OWN PETARD  —  The MAGA figurehead took a bizarre victory lap in celebration of the six-month anniversary of his second presidential term.  —  President Donald Trump says the Epstein files drama has only made him more popular.",
    "url": "https://www.thedailybeast.com/donald-trump-hilariously-claims-epstein-drama-has-only-made-him-more-popular/"
  },
  {
    "text": "Trump, 79, Posts Deranged AI Video of Obama Being Arrested  —  SUNDAY SCARIES  —  The bizarre post came as the president seeks to move on from the Epstein controversy tearing apart his base.  —  President Donald Trump shared a bizarre fake video depicting the arrest and imprisonment … ",
    "url": "https://www.thedailybeast.com/donald-trump-79-posts-deranged-ai-video-of-barack-obama-being-arrested/"
  },
  {
    "text": "A MAGA bot network on X is divided over the Trump-Epstein backlash  —  Researchers have found hundreds of fake X accounts that support the Trump administration.  —  A previously unreported network of hundreds of accounts on X is using artificial intelligence to automatically reply … ",
    "url": "https://www.nbcnews.com/tech/internet/maga-ai-bot-network-divided-trump-epstein-backlash-rcna219167"
  },
  {
    "text": "EXCLUSIVE: Bill Clinton sent ‘warm and gushing’ letter for Jeffrey Epstein's 50th birthday - as Trump sues over claim he also wrote a ‘bawdy’ note for paedophile's half-century  —  Bill Clinton wrote a ‘warm and gushing’ letter which was included in Jeffrey Epstein's infamous 50th ‘birthday book’, The Mail on Sunday can reveal.",
    "url": "https://www.dailymail.co.uk/news/article-14921905/Donald-Trump-sues-Wall-Street-Journal-MoS-reveals-Bill-Clinton-letter-Jeffrey-Epstein-birthday.html"
  },
  {
    "text": "Dershowitz casts doubt that grand jury testimony will yield answers on Epstein … Seeking to quiet the escalating anger, the president on Thursday ordered Attorney General Pam Bondi to ask a judge to unseal the grand jury testimony from Epstein's case.  —  But, “the information … ",
    "url": "https://www.politico.com/news/2025/07/20/dershowitz-grand-jury-testimony-epstein-answers-00464976"
  },
  {
    "text": "The Epstein Cover-Up at the FBI  —  As many of you know by now, Senator Dick Durbin penned a letter to Pam Bondi two days ago asking questions about information his office received from a protected whistleblower.  The letter read, in part: … This letter was made public right after I had filed … ",
    "url": "https://www.muellershewrote.com/p/the-epstein-cover-up-at-the-fbi"
  },
  {
    "text": "Alina Habba leaving behind angry staff and portraits of herself on the walls as job ends  —  Former Donald Trump attorney Alina Habba is all but certain to be headed for the door next week leaving behind portraits of herself on the walls and disgruntled staffers after her brief stint as a U.S. attorney comes to an end.",
    "url": "https://www.rawstory.com/habba-us-attorney/"
  },
  {
    "text": "Trump's Perversion of Justice Has Reached a New Phase  —  President Trump's Justice Department is turning civil rights enforcement upside down.  —  Last week, Harmeet Dhillon, the assistant attorney general for civil rights, asked a federal judge to sentence a former Louisville police officer named Brett Hankison to one day in prison.",
    "url": "https://www.nytimes.com/2025/07/20/opinion/dillon-taylor-justice-trump.html"
  },
  {
    "text": "The Situation: The Wilde-Hiss Effect  —  Why on Earth is Trump suing the Wall Street Journal?  —  benjaminwittes.lawfaremedia.org  —  Meet The Authors … The Situation on Wednesday argued against releasing the so-called “Epstein Files”—just in time for Attorney General Pam Bondi to ask … ",
    "url": "https://www.lawfaremedia.org/article/the-situation--the-wilde-hiss-effect"
  },
  {
    "text": "This ‘Then And Now’ Picture Of The Oval Office Is Going Viral And Says So, So Much About The Trump Administration  —  “It's like the Dollar Tree version of Versailles.”  —  Matt Stopera— BuzzFeed  —  Donald Trump has completely transformed the Oval Office into his own gaudy, gold fantasy land.",
    "url": "https://www.huffpost.com/entry/picture-oval-office-trump_n_687a76a4e4b00f995df54020"
  },
  {
    "text": "Officials say 85 Palestinians seeking aid are killed in Gaza as Israel widens evacuation orders  —  At least 85 Palestinians were killed while trying to reach food at locations across Gaza on Sunday, the territory's Health Ministry said, on the deadliest day yet for aid-seekers in over 21 months of war.",
    "url": "https://apnews.com/article/israel-palestinians-hamas-war-07-20-2025-2b494af89d710793bc6933f5ae437566"
  },
  {
    "text": "Amy Klobuchar ‘feeling better and better’ about Democratic prospects in future elections  —  Sen. Amy Klobuchar (D-MN) expressed her optimism for the Democratic Party as the midterm elections draw nearer.  —  Klobuchar is fresh from a campaign trip to New Hampshire, where she sought to help … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3476674/amy-klobuchar-feeling-better-and-better-about-democratic-prospects-future-elections/"
  },
  {
    "text": "U.S. citizen who works for Commerce Dept. ensnared in Chinese exit ban  —  The development comes at a fraught time in relations between Washington and Beijing, amid an escalating trade war and persistent geopolitical tensions.  —  A Chinese American man who works for the Commerce Department … ",
    "url": "https://www.washingtonpost.com/national-security/2025/07/20/china-exit-ban-commerce-department-trump-xi/"
  },
  {
    "text": "Little Village buildings spray-painted with swastikas, pro-ICE statement  —  Swastikas were spray-painted on several buildings in Little Village over the weekend, and one building was tagged a second time with a pro-immigration enforcement statement, community members said.",
    "url": "https://www.chicagotribune.com/2025/07/20/little-village-buildings-swastikas-vandalism/"
  }
]