[
  {
    "text": "My plan to reform the Supreme Court and ensure no president is above the law  —  We can and must prevent the abuse of presidential power and restore the public's faith in our judicial system.  —  The writer is president of the United States.  —  This nation was founded on a simple yet profound principle: No one is above the law.",
    "url": "https://www.washingtonpost.com/opinions/2024/07/29/joe-biden-reform-supreme-court-presidential-immunity-plan-announcement/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIyMjI1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzIzNjA3OTk5LCJpYXQiOjE3MjIyMjU2MDAsImp0aSI6IjI5ODkwY2VjLTYwZTItNDZmZi1hOWZkLWQwOTJjZmI5MGNjMSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzA3LzI5L2pvZS1iaWRlbi1yZWZvcm0tc3VwcmVtZS1jb3VydC1wcmVzaWRlbnRpYWwtaW1tdW5pdHktcGxhbi1hbm5vdW5jZW1lbnQvIn0.ZjQ4R9u8pwlIKd0l230VD0f20mb0V140Kw3gTFopyfM&itid=gfta"
  },
  {
    "text": "FACT SHEET: President Biden Announces Bold Plan to Reform the Supreme Court and Ensure No President Is Above the Law  —  From his first day in office—and every day since then—President Biden has taken action to strengthen American democracy and protect the rule of law.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/07/29/fact-sheet-president-biden-announces-bold-plan-to-reform-the-supreme-court-and-ensure-no-president-is-above-the-law/"
  },
  {
    "text": "Trump Just Had His Worst Week—Ever  —  IT MUST BE HARD TO TRANSITION from martyr anointed by God and positioned to win in a blowout to jealous old whiner grumbling about the misunderstood relevance of Hannibal Lecter.  —  Life came at Donald Trump fast when Sleepy Joe Biden took his name off … ",
    "url": "https://www.thebulwark.com/p/trump-just-had-his-worst-week-ever-vance-harris"
  },
  {
    "text": "Harris Camp Warns Supporters: Don't Get Duped by ‘Scam PACs’  —  KAMALA HARRIS'S TEAM IS WARNING DONORS not to fall prey to “financial scams” from groups sending email and text messages that suggest they're raising money for the vice president.  —  Those messages came rapidly last week … ",
    "url": "https://www.thebulwark.com/p/harris-camp-warns-of-democratic-scam-pacs"
  },
  {
    "text": "Trump's insult trap: Republicans hunt for elusive Harris attack line … - Black voters could be sensitive to attacks on Harris' identity, including quotes from multiple Republican lawmakers last week labeling her a “DEI vice president.”  — Years-old comments from J.D. Vance calling Harris a … ",
    "url": "https://www.axios.com/2024/07/29/trump-attacks-harris-dei-gop-election"
  },
  {
    "text": "The Most Revealing Moment of a Trump Rally  —  A close reading of the prayers delivered before the former president speaks  —  A week before christmas, an evangelical minister named Paul Terry stood before thousands of Christians, their heads bowed, in Durham, New Hampshire, and pleaded with God for deliverance.",
    "url": "https://www.theatlantic.com/magazine/archive/2024/09/trump-rally-prayers/679152/?gift=ock9angvzzsfBB238buuXiJ6Z9iR5_wVRkWUrj_8f8Q&utm_source=twitter&utm_medium=social&utm_campaign=social"
  },
  {
    "text": "Elon Musk takes fire for posting fake video of Kamala Harris  —  Elon Musk is being accused of violating his own policies on X after he shared a fake video of Vice President Harris, which uses an artificial intelligence voice mimicking Harris to spew insults about her campaign and President Biden.",
    "url": "https://thehill.com/policy/technology/4797604-elon-musk-fake-ai-video-harris/"
  },
  {
    "text": "Venezuela election live updates: Opposition claims victory after Maduro was declared the winner  —  Supporters of President Nicolás Maduro gather at Miraflores Palace in Caracas as Maduro is declared the winner in Venezuela's presidential election amid opposition claims of irregularities.",
    "url": "https://apnews.com/live/venezuela-election-updates-maduro-machado-gonzalez"
  },
  {
    "text": "“My Beautiful Christians:” Trump's Pandering to Christian Nationalists  —  The other day, during an address to a Turning Point conference, Trump implored, … Video  —  Horse race journalists didn't care.  They found it more important to repeat and therefore magnify Trump's latest slur on Vice President Harris.",
    "url": "https://www.emptywheel.net/2024/07/29/my-beautiful-christians-dont-talk-about-trumps-pandering-to-christian-nationalists/"
  },
  {
    "text": "Former US ambassador says US ‘asleep’ amid Russia threat  —  The News  —  Morgan Chalfant: What did you learn about Russian President Vladimir Putin on the job that you might not have known otherwise, or that people don't understand about him and the way that he operates?",
    "url": "https://www.semafor.com/article/07/28/2024/former-us-ambassador-says-us-asleep-amid-russia-threat"
  },
  {
    "text": "A comprehensive guide to J.D. Vance's views on women and children  —  On July 25, former President Donald Trump named Senator J.D. Vance (R-OH) as his running mate.  Vance has only been a U.S. Senator since 2023, and his rapid ascension to the Republican Vice Presidential nominee … ",
    "url": "https://popular.info/p/a-comprehensive-guide-to-jd-vances"
  },
  {
    "text": "The Week Ahead  —  In good news:  —  Joe Biden nominated former Florida Congresswoman Val Demings to the U.S. Postal Service's (USPS) Board of Governors.  He also nominated Republican businessman William Zollars.  —  The USPS Board of Governors consists of eleven people … ",
    "url": "https://joycevance.substack.com/p/the-week-ahead-c60"
  },
  {
    "text": "Can tyrants be curtailed?  —  Two books examine how today's autocrats differ from those of the past, and what liberal democracies can do to counter their influence  —  Excitement, hope, fear.  These are the emotions when a dictator falls.  In Bucharest in the weeks after the fall of Nicolae Ceauș … ",
    "url": "https://www.ft.com/content/5f622c1d-f36f-478b-8c2f-60d34d3e6941"
  },
  {
    "text": "What Has Happened to My Party Haunts Me  —  With so much attention focused on the changes at the top of the Democratic ticket, we are not paying enough attention to the lack of change on the top of the Republican ticket.  This month, Donald Trump won his party's nomination for the third straight time.",
    "url": "https://www.nytimes.com/2024/07/29/opinion/trump-vance-republican-party.html"
  },
  {
    "text": "Trump agrees to give a victim interview to the FBI after assassination attempt  —  Trump's attempted assassin was a highly intelligent “loner” with few friends and a growing interest in guns, the FBI told reporters in a briefing on Monday.  —  WASHINGTON — Former President Donald … ",
    "url": "https://www.nbcnews.com/politics/justice-department/trump-agrees-give-victim-interview-fbi-assassination-attempt-rcna164006"
  },
  {
    "text": "Trump uses immunity ruling to try to blow up his conviction  —  And thanks to the Supreme Court's right-wing nihilists, it just might work. … On July 1, the last day of the Supreme Court's term, six conservative justices took a sledgehammer to democracy.",
    "url": "https://www.publicnotice.co/p/how-scotus-immunity-impacts-trump-ny-conviction"
  },
  {
    "text": "Trump's falling legal fees free up campaign cash … - Trump and the RNC had been catching up to Biden and the DNC in fundraising, but Biden's extraordinary decision to drop out gave the party a jolt of enthusiasm and an influx of donations, Axios' Erin Doherty reports.",
    "url": "https://www.axios.com/2024/07/29/trump-falling-legal-costs-fundraising"
  }
]