[
  {
    "text": "Judge severs Trump's Georgia election interference case, and 16 others, from trial starting in October  —  Kenneth Chesebro and Sidney Powell will be tried starting Oct. 23.  —  The judge overseeing the Georgia election interference case has severed the case, ordering that 17 defendants … ",
    "url": "https://abcnews.go.com/US/judge-severs-17-defendants-including-trump-oct-23/story?id=103185589"
  },
  {
    "text": "Trump Co-Defendant Just Cannot Get Unstuck From Sidney Powell  —  A Thursday ruling in Fulton County was not necessarily a win for prosecutors but it was a clear loss for Kenneth Chesebro.  —  Attorney Kenneth Chesebro, the alleged architect of the so-called fake elector scheme launched … ",
    "url": "https://www.thedailybeast.com/trump-co-defendant-kenneth-chesebro-just-cannot-get-away-from-sidney-powell"
  },
  {
    "text": "Hunter Biden indicted on federal gun charges  —  The indictment against the president's son comes after a plea agreement on tax and gun charges fell apart in July and amid a probe of his finances by House Republicans.  —  Federal prosecutors have indicted Hunter Biden, son of President Joe Biden, on gun charges, court documents show.",
    "url": "https://www.nbcnews.com/politics/politics-news/hunter-biden-indicted-federal-gun-charges-rcna39623"
  },
  {
    "text": "Hunter Biden indicted by special counsel on felony gun charges  —  U.S. Attorney David Weiss was appointed special counsel in the case last month.  —  President Joe Biden's son Hunter Biden has been indicted by special counsel David Weiss on felony gun charges.",
    "url": "https://abcnews.go.com/US/hunter-biden-indicted-special-counsel-felony-gun-charges/story?id=103168312"
  },
  {
    "text": "Hunter Biden indicted on firearms charges  — Hunter Biden, son of President Joe Biden, was indicted on three criminal counts related to his possession of a firearm, a court filing showed.  — The charges in U.S. District Court in Delaware came weeks after the unexpected collapse of a deal with federal prosecutors.",
    "url": "https://www.cnbc.com/2023/09/14/hunter-biden-indicted-on-firearms-charges.html"
  },
  {
    "text": "Behind the scenes, Ron DeSantis is making things worse for Kevin McCarthy  —  The Florida governor strategized Wednesday with leaders of the House cadre pushing Speaker Kevin McCarthy to the brink.  —  In the high-stakes fight that is threatening to shut down the federal government next month … ",
    "url": "https://www.politico.com/news/2023/09/14/desantis-leans-into-shutdown-fight-00115892"
  },
  {
    "text": "As House Republicans bicker, the government shutdown threat grows  —  Tensions among House Republicans came to a head Thursday morning, as Speaker Kevin McCarthy struggled to unite his narrow majority around a plan to avert a government shutdown at the end of the month - while protecting his job as speaker from far-right opposition.",
    "url": "https://www.npr.org/2023/09/14/1199492126/house-republicans-speaker-mccarthy-spending-shutdown"
  },
  {
    "text": "'You're screwed': Romney's exit threatens a collapse of Senate's middle  —  If Joe Manchin and Kyrsten Sinema follow the Utahn out the door, they'll leave a void in a chamber that's handed Joe Biden remarkable bipartisan deals.  —  Mitt Romney's retirement shines a glaring spotlight … ",
    "url": "https://www.politico.com/news/2023/09/14/romney-exit-senate-middle-dealmakers-00115785"
  },
  {
    "text": "White House Strategy on Impeachment: Fight Politics With Politics  —  The White House says it is battling the inquiry in the court of public opinion since House Republicans have not issued any new subpoenas or laid out any potential articles of impeachment.  —  As House Republicans kick off … ",
    "url": "https://www.nytimes.com/2023/09/14/us/politics/white-house-strategy-impeachment.html"
  },
  {
    "text": "Wisconsin Republicans vote to fire elections director, who may not leave the job  —  The vote creates a dispute over who is in charge of overseeing elections in a state that is expected to play a critical role in next year's presidential campaign  —  MADISON, Wis. — Republicans … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/14/wisconsin-republicans-fire-election-director/"
  },
  {
    "text": "A mistress almost takes the stand in Texas AG's impeachment trial  —  AUSTIN — The star witness swept into the Texas Capitol on Wednesday, red coat and flashy Balenciaga-emblazoned handbag tucked under her arms, her white sheath, red lipstick and signature platinum pixie all a dramatic contrast … ",
    "url": "https://www.washingtonpost.com/nation/2023/09/13/paxton-texas-attorney-general-mistress/"
  },
  {
    "text": "Republican Primary Divide  —  Voters split between Trump and the rest of the field on nomination, issues  —  West Long Branch, NJ - It is a tale of two electorates in the South Carolina Republican presidential primary.  The Monmouth (\"Mon-muth\") University-Washington Post Poll … ",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_sc_091423/"
  },
  {
    "text": "Kim Davis must pay $100,000 to US same-sex couple she denied marriage license  —  Jury awards damages to David Ermold and David Moore, who sued former Kentucky county clerk over 2015 incident  —  A former Kentucky county clerk is being ordered to pay $100,000 to a local couple who sued … ",
    "url": "https://www.theguardian.com/us-news/2023/sep/14/kim-davis-damages-same-sex-marriage-license-kentucky"
  },
  {
    "text": "Ibram X. Kendi's Ivory Tower Comes Crashing Down  —  A university think tank led by “antiracism” guru Ibram X. Kendi is slashing a third of its workforce, the latest in a string of layoffs to hit left-wing activist groups.  —  The Boston University Center for Antiracist Research … ",
    "url": "https://freebeacon.com/democrats/ibram-x-kendis-ivory-tower-comes-crashing-down/"
  },
  {
    "text": "Trump Turns New York AG Case Against Judge  —  Trump's lawyers are going after Judge Arthur F. Engoron, saying he's overstepped his bounds. … In a frantic last-minute attempt to derail a trial that threatens to destroy Donald Trump's corporate empire, the former president's lawyers … ",
    "url": "https://www.thedailybeast.com/trump-turns-new-york-ag-case-against-judge-arthur-f-engoron"
  },
  {
    "text": "DeSantis took undisclosed private flights and lodging through wealthy donors  —  The trips included a private flight to the prestigious home of the Masters tournament, with an overnight stay and a round of golf  —  Florida Gov. Ron DeSantis took at least six undisclosed trips on private jets … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/14/ron-desantis-private-flights/"
  },
  {
    "text": "‘It will take years to recover’ from Tuberville blockade, top Navy nominee says  —  Adm. Lisa Franchetti, the Navy's No. 2 officer, has been leading the service on an acting basis because of the impasse.  —  President Joe Biden's nominee to be the Navy's top officer, Adm. Lisa Franchetti … ",
    "url": "https://www.politico.com/news/2023/09/14/tuberville-blockade-franchetti-00115936"
  },
  {
    "text": "Planned Parenthood to resume providing abortions in Wisconsin  —  Planned Parenthood said Thursday that it will resume providing abortions in Wisconsin following a July court ruling that found a law from 1849 doesn't apply to voluntary abortions.  —  The organization said abortions … ",
    "url": "https://thehill.com/policy/healthcare/4204571-planned-parenthood-to-resume-providing-abortions-in-wisconsin/"
  },
  {
    "text": "Video appears to show Lauren Boebert giving the middle finger to an usher after being kicked out of a performance of ‘Beetlejuice’  — Rep. Lauren Boebert was escorted out of a performance of “Beetlejuice” in Denver over the weekend.  — Surveillance footage appears to show her giving … ",
    "url": "https://www.businessinsider.com/footage-shows-lauren-boebert-giving-middle-finger-beetlejuice-usher-2023-9?op=1"
  },
  {
    "text": "Biden planning speech on threats to democracy in coming weeks, sources say  —  President Joe Biden plans to deliver a speech focused on threats to democracy in the coming weeks, according to two sources familiar with the plans.  —  Democratic donors gathered in Chicago for a fundraising retreat learned … ",
    "url": "https://www.cnn.com/2023/09/14/politics/democracy-speech-joe-biden/"
  },
  {
    "text": "In New Hampshire, Chris Christie Still Sees a Path to Beat Trump  —  As he stakes his candidacy on the state, Chris Christie is promising to find new ways to confront Donald Trump.  “I'm not going to let him get away with being a coward,” he said in an interview.",
    "url": "https://www.nytimes.com/2023/09/14/us/politics/chris-christie-new-hampshire-trump.html"
  },
  {
    "text": "Brazil's Supreme Court sentences rioter who stormed capital to 17 years in prison  —  Nearly 1,500 people were arrested in January after supporters of former President Jair Bolsonaro stormed government offices in a bid to reverse his election loss.  —  SAO PAULO — Brazil's Supreme Court handed … ",
    "url": "https://www.nbcnews.com/news/latino/brazils-supreme-court-sentences-rioter-stormed-capital-17-years-prison-rcna105109"
  }
]