[
  {
    "text": "Obama plans to endorse Harris for president soon  —  The former president has had multiple conversations with Vice President Kamala Harris about her campaign this week.  —  WASHINGTON — Former President Barack Obama and Vice President Kamala Harris have been in close touch since she announced … ",
    "url": "https://www.nbcnews.com/politics/2024-election/obama-plans-endorse-harris-president-soon-rcna163279"
  },
  {
    "text": "The GOP's legal challenges to Harris's candidacy are bunk  —  They're also amazingly hypocritical. … While Democrats wasted no time this week rallying around Kamala Harris, Republicans were just as quick to start trying to sabotage her campaign with lawfare.  —  It isn't surprising that the GOP is taking this approach.",
    "url": "https://www.publicnotice.co/p/trump-legal-challenges-harris-candidacy-bunk"
  },
  {
    "text": "Beware the Mump  —  Speaking in Charlotte, North Carolina, yesterday, at his first campaign rally since President Biden dropped out of the race and Kamala Harris became the presumptive Democratic candidate, Trump deployed his usual barrage of lies and smears.",
    "url": "https://robertreich.substack.com/p/beware-the-mump-0ee"
  },
  {
    "text": "Trump and His Allies Adapt to a New Role: Fighting for Attention  —  In the days since President Biden ended his re-election bid and passed the torch to Vice President Kamala Harris, Donald Trump's campaign has been crowded out of the headlines.  —  For the first time since Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/07/25/us/politics/trump-gop-kamala-harris.html?unlocked_article_code=1.900.QYks.xXwmTfSt6Afk&smid=url-share"
  },
  {
    "text": "Exclusive poll: Harris opens up early edge with young voters  —  Vice President Kamala Harris is significantly more popular among America's youngest voters than President Biden, a new Axios/Generation Lab poll shows. … But Harris could be extending the gap once again.",
    "url": "https://www.axios.com/2024/07/25/poll-harris-biden-trump-young-voters"
  },
  {
    "text": "The Dramatic Contrast of Biden's Last Act  —  Two political myths inspired the dreams and haunted the nightmares of the Founders of the American republic.  Both these foundational myths were learned from the history and literature of the ancient Romans.  —  Cincinnatus was the name of a man who … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/joe-biden-speech-cincinnatus/679229/"
  },
  {
    "text": "As Trump unloads on Harris, even his supporters see her gaining ground  —  Trump's spokesperson says he doesn't know if attacks referencing race or gender of Harris are “off limits,” but says Trump doesn't do them.  —  CHARLOTTE, North Carolina — Even Donald Trump's supporters sense he suddenly has a tougher race on his hands.",
    "url": "https://www.politico.com/news/2024/07/24/trump-rally-harris-attacks-support-00171041"
  },
  {
    "text": "Posts spread baseless rumors about GOP vice presidential pick JD Vance having sex with a couch  —  CLAIM: Republican vice presidential nominee JD Vance wrote in his 2016 memoir about having sex with a couch.  —  AP'S ASSESSMENT: False.  Vance does not write about performing such an act in his bestselling book.",
    "url": "https://apnews.com/article/fact-check-jd-vance-sex-couch-038130326229"
  },
  {
    "text": "July 24, 2024  —  Tonight, President Joe Biden explained to the American people why he decided to refuse the 2024 Democratic presidential nomination and hand the torch to Vice President Kamala Harris.  —  Speaking from the Oval Office from his seat behind the Resolute Desk … ",
    "url": "https://heathercoxrichardson.substack.com/p/july-24-2024"
  },
  {
    "text": "Trump's Nephew Reveals Racist Comments From Former President In New Book  —  In a new memoir, Fred C. Trump III claims his uncle, Donald J. Trump, made cruel and racist comments.  —  In 2020, a few months before the last election, former President Donald J. Trump's niece, Mary Trump … ",
    "url": "https://www.nytimes.com/2024/07/24/us/politics/donald-trump-nephew-book-fred-trump.html?unlocked_article_code=1.900.4AjW.wnlHvJXTzq4g&smid=url-share"
  },
  {
    "text": "NORAD detects, tracks and intercepts Russian and PRC aircraft operating in the Alaska ADIZ  —  North American Aerospace Defense Command Public Affairs  —  COLORADO SPRINGS, Colo. - NORAD detected, tracked, and intercepted two Russian TU-95 and two PRC H-6 military aircraft operating … ",
    "url": "https://www.norad.mil/Newsroom/Press-Releases/Article/3849184/norad-detects-tracks-and-intercepts-russian-and-prc-aircraft-operating-in-the-a/"
  },
  {
    "text": "Pelosi says Netanyahu gave ‘the worst’ speech to Congress from any foreign leader  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters",
    "url": "https://thehill.com/homenews/house/4790348-pelosi-netanyahu-worst-speech-congress/"
  },
  {
    "text": "Melania Trump to tell her story in memoir, ‘Melania,’ scheduled for this fall  —  Former first lady Melania Trump has a memoir coming out this fall, “Melania,” billed by her office as “a powerful and inspiring story of a woman who has carved her own path, overcome adversity and defined personal excellence.”",
    "url": "https://apnews.com/article/melania-trump-memoir-first-lady-0461dbb098a2218d41fbe7960c05a1a5"
  },
  {
    "text": "The Murdoch Family Is Battling Over the Future of the Fox Empire  —  Rupert Murdoch, the patriarch, has moved to change the family's irrevocable trust to preserve his media businesses as a conservative force.  Several of his children are fighting back.  —  Rupert Murdoch is locked … ",
    "url": "https://www.nytimes.com/2024/07/24/business/media/rupert-murdoch-succession-fox.html?unlocked_article_code=1.9k0.TPyH.Tfa_RrPNVIas&smid=url-share"
  },
  {
    "text": "Trump allies crush misinformation research despite Supreme Court loss  —  High court ruling green-lighting contact between government and tech companies to stymie falsehoods online hasn't deterred a GOP campaign against academics, nonprofits and tech industry initiatives aimed at addressing their spread.",
    "url": "https://www.washingtonpost.com/technology/2024/07/14/trump-allies-disarm-misinformation-researchers-ahead-election/"
  },
  {
    "text": "Republicans condemn Netanyahu protesters for burning US flags — and waving Hamas ones instead  —  Republicans seized immediately on images of burning U.S. flags and vandalism at Washington, D.C.'s Union Station following Benjamin Netanyahu's speech as evidence of widespread antisemitism … ",
    "url": "https://www.politico.com/live-updates/2024/07/24/congress/republicans-flag-burning-protesters-hamas-00171030"
  },
  {
    "text": "Google Is the Only Search Engine That Works on Reddit Now Thanks to AI Deal  —  DuckDuckGo, Bing, Mojeek, and other search engines are not returning full Reddit results any more. … Google is now the only search engine that can surface results from Reddit, making one of the web's … ",
    "url": "https://www.404media.co/google-is-the-only-search-engine-that-works-on-reddit-now-thanks-to-ai-deal/"
  },
  {
    "text": "How Kamala Harris Took Command of the Democratic Party in 48 Hours  —  She worked the phones.  Her team worked the delegates.  When it was over, she had quickly locked down the nomination in a “well-orchestrated cascade,” as one party leader put it.  —  She worked the phones.  Her team worked the delegates.",
    "url": "https://www.nytimes.com/2024/07/24/us/politics/kamala-harris-democrats-nomination.html?unlocked_article_code=1.9k0.lb48.5ajwltz9N4eO&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  }
]