[
  {
    "text": "For 20 Years, I Couldn't Say What Donald Trump Did on the Set of The Apprentice.  Now I Can.  —  For 20 years, I couldn't say what I watched the former president do on the set of the show that changed everything.  Now I can.  —  On Jan. 8, 2004, just more than 20 years ago, the first episode of The Apprentice aired.",
    "url": "https://slate.com/culture/2024/05/donald-trump-news-2024-trial-verdict-apprentice.html"
  },
  {
    "text": "Trump Called ‘Apprentice’ Contestant Kwame Jackson N-Word, Producer Says  —  HIT RECORD  —  Bill Pruitt also claims there are tapes to prove it.  —  At the end of the first season of his reality TV show The Apprentice, Donald Trump's choice of a winner was a matter of black and white.",
    "url": "https://www.thedailybeast.com/trump-called-apprentice-contestant-kwame-jackson-n-word-producer"
  },
  {
    "text": "Sam Alito believes you — and, perhaps, his colleagues — are stupid  —  Alito defiantly refused to recuse himself from January 6 or Trump-related cases in a letter sent to members of Congress on Wednesday.  —  Justice Sam Alito, who is a problem, went even further on Wednesday than I thought … ",
    "url": "https://www.lawdork.com/p/sam-alito-believes-you-and-perhaps"
  },
  {
    "text": "Experts Question Alito's Failure to Recuse Himself in Flag Controversy  —  Legal ethicists welcomed the fact that the justice gave reasons for staying on two Jan. 6 cases, a break from court tradition.  But they said his rationale was open to criticism.  —  Supreme Court justices seldom give reasons … ",
    "url": "https://www.nytimes.com/2024/05/30/us/politics/alito-flags-recusal.html"
  },
  {
    "text": "Why Trump's team thinks he can survive any verdict  —  The former president's advisers and allies plan to situate any outcome within the same grievance narrative he's been cultivating for years.  —  Donald Trump's pollsters have been tracking the impact of his indictments throughout his first trial and … ",
    "url": "https://www.politico.com/news/2024/05/30/trump-verdict-campaign-spin-00160506"
  },
  {
    "text": "Supreme Court rules for NRA in New York government coercion battle  —  The National Rifle Association alleged that official's warning that companies faced “reputational risks” by working with the group violates its constitutional rights.  —  WASHINGTON — The Supreme Court on Thursday ruled … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/prewrite-supreme-court-rules-nra-coercion-parkland-shooting-rcna151093"
  },
  {
    "text": "NRA can sue ex-NY official it says tried to blacklist it after Parkland shooting, Supreme Court says  —  A unanimous Supreme Court on Thursday cleared the way for a National Rifle Association lawsuit against a former New York state official over claims she pressured companies to blacklist … ",
    "url": "https://apnews.com/article/nra-aclu-parkland-shooting-lawsuit-supreme-court-953424f3fd33f279b0cc2ce050069d48"
  },
  {
    "text": "False right-wing reports about Trump trial jury instructions fuel threats against judge  —  False reporting and social media commentary about the jury instructions in Trump's hush money trial has spurred calls for the assassination of the judge overseeing the case.",
    "url": "https://www.nbcnews.com/politics/donald-trump/false-right-wing-reports-trump-trial-jury-instructions-fuel-threats-ju-rcna154678"
  },
  {
    "text": "Two more US officials resign over Biden administration's position on Gaza war  —  The officials accuse the administration of not telling the truth about Israel's obstruction of aid to Palestinians in Gaza  —  Two more US officials have resigned over the Gaza war, saying that the Biden administration … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/30/two-more-us-officials-resign-over-biden-administrations-position-on-gaza-war"
  },
  {
    "text": "November's Presidential Election May 2024  —  NPR/PBS NewsHour/Marist National Poll  —  Biden and Trump Locked in Tight Race Nationally...West & Stein, Not RFK, Make Difference in Multi-Candidate Field  —  President Joe Biden and former President Donald Trump are closely matched … ",
    "url": "https://maristpoll.marist.edu/polls/novembers-presidential-election-may-2024/"
  },
  {
    "text": "SCOTUS's farcical endorsement of gerrymandering  —  The right-wing majority turned back the clock on efforts to address racial inequality. … Perhaps because he's been busy lying about his wife's visible support for an insurrection, Justice Samuel Alito can't seem to make time to do his job properly.",
    "url": "https://www.publicnotice.co/p/scotus-gerrymandering-south-carolina-alexander"
  },
  {
    "text": "Sen. Bob Menendez has enough signatures to run as an independent despite his bribery trial  —  The longtime New Jersey Democrat, who has been weighing an independent re-election bid, hopes to gather a large number of signatures as a “statement” of continued support.",
    "url": "https://www.nbcnews.com/politics/congress/sen-bob-menendez-signatures-run-independent-bribery-trial-rcna154656"
  },
  {
    "text": "How Ken Paxton is stretching the boundaries of consumer protection laws to pursue political targets  —  The attorney general repeatedly uses laws meant to protect against fraudulent or deceptive practices to target hospitals, pharmaceutical companies and LGBTQ+ groups.",
    "url": "https://www.texastribune.org/2024/05/30/ken-paxton-texas-ag-political-targets-health-care-lgbtq/"
  },
  {
    "text": "Minnesota GOP's endorsed Senate candidate has faced court actions over unpaid child support  —  Royce White, a former NBA player, won the state Republican Party's endorsement at its convention this month.  —  Royce White, a George Floyd protest leader and former college basketball star … ",
    "url": "https://www.nbcnews.com/politics/2024-election/minnesota-gops-endorsed-senate-candidate-faced-court-actions-unpaid-ch-rcna153100?taid=6658543de860dd0001d037a9"
  },
  {
    "text": "The 2024 Election Won't Be Up To the Same Voters Who Chose Biden  —  It may be a presidential rematch, but it's not the same electorate as in 2020  —  The 2024 presidential election will be the first rematch in decades.  But the US electorate that's going to vote in November has changed … ",
    "url": "https://www.bloomberg.com/graphics/2024-new-eligible-voters-will-decide-trump-biden-rematch/"
  },
  {
    "text": "Ron DeSantis hopes to raise up to $10M to boost Trump  —  The money will be raised during a multi-state fundraising swing starting this summer.  —  TALLAHASSEE, Fla. — Ron DeSantis hopes to raise at least $10 million as part of a multi-state fundraising swing for Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-hopes-raise-10-million-boost-trump-rcna150663"
  },
  {
    "text": "Meloni Is Bringing Together an Explosive Cast of Characters for Her G-7 Summit  — Italy is seeking to engineer first meeting of Lula and Milei  — Global South is set to have a significant voice at June summit  —  Italian Prime Minister Giorgia Meloni looks set to engineer … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-30/meloni-invites-milei-lula-erdogan-pope-to-g-7-summit"
  }
]