[
  {
    "text": "Three Reasons I'm Certain Kamala Harris Will Win  —  There is a palpable anxiety wailing on the winds of American life right now.  More than in any other election in my lifetime, I've been consistently asked by people of all stripes and creeds: “Can Kamala Harris win this thing?  Are we going to be OK?”",
    "url": "https://www.nytimes.com/2024/10/23/opinion/kamala-harris-win-election.html?unlocked_article_code=1.UU4.Dppr.wIh0xy1BzQfE&smid=nytcore-ios-share&referringSource=articleShare&tgrp=cpy"
  },
  {
    "text": "Here's What My Gut Says About the Election.  But Don't Trust Anyone's Gut, Even Mine.  —  In an election where the seven battleground states are all polling within a percentage point or two, 50-50 is the only responsible forecast.  Since the debate between Kamala Harris and Donald Trump … ",
    "url": "https://www.nytimes.com/2024/10/23/opinion/election-polls-results-trump-harris.html?unlocked_article_code=1.UU4.M0l1.AcCc5_9jpjz2&smid=url-share"
  },
  {
    "text": "“Red Wave” Redux: Are GOP Polls Rigging the Averages in Trump's Favor?  —  Last month, a GOP-friendly polling firm presented itself, and its data, in a highly unusual way.  Rather than maintain a nominally neutral public-facing profile, this pollster acted more like a cavalry brigade for Donald Trump's campaign.",
    "url": "https://newrepublic.com/article/187425/gop-polls-rigging-averages-trump"
  },
  {
    "text": "Harris to deliver closing argument speech Tuesday on the National Mall  —  The vice president is slated to present her final case to the American people in D.C. exactly one week before Election Day.  —  Vice President Kamala Harris is planning to deliver her closing argument Tuesday in a speech … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/10/23/kamala-harris-campaign-rally-dc-national-mall-election/"
  },
  {
    "text": "Donald Trump fixates on Harris aide Ian Sams, who goads him on Fox News  —  Trump and his aides have repeatedly publicly attacked Sams for his criticism of the former president during Fox interviews.  —  In the final three weeks of the presidential race, former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/23/trump-ian-sams-fox-harris/"
  },
  {
    "text": "Wrong-way driver passes Harris motorcade on Milwaukee highway  —  The driver was a 55-year-old Milwaukee man suspected of being impaired who was taken into custody, authorities said.  —  A suspected drunk driver going the wrong way on a highway in Milwaukee came close to Vice President … ",
    "url": "https://www.washingtonpost.com/elections/2024/10/23/wrong-way-drive-harris-motorcade/"
  },
  {
    "text": "Fox Host Says Maybe Trump Didn't Realize Hitler's Generals Were Nazis  —  Trump's former chief of staff said on Tuesday that the former president said he needed “the kind of generals that Hitler had” … On Tuesday, Kelly told The New  York Times that the former president meets the established definition of fascism.",
    "url": "https://www.rollingstone.com/politics/politics-news/fox-host-maybe-trump-hitler-generals-nazis-1235140921/"
  },
  {
    "text": "It's Possible to Track Someone's Personal Phone to an Abortion Clinic.  And It's Legal Too.  —  A company got access to a mobile phone-tracking tool used by law enforcement and U.S. government agencies across the country.  They found significant privacy vulnerabilities.  — Copy",
    "url": "https://www.notus.org/technology/cell-phone-tracking-law-enforcement-abortion-clinic"
  },
  {
    "text": "Justice Department warns Elon Musk that his $1 million giveaway to registered voters may be illegal  —  The Justice Department warned Elon Musk's America PAC in recent days that his $1 million sweepstakes to registered voters in swing states may violate federal law, people briefed on the matter told CNN.",
    "url": "https://www.cnn.com/2024/10/23/politics/elon-musk-justice-department-letter/"
  },
  {
    "text": "Donald Trump campaign manager shared posts in 2021 saying Trump's lies caused the violence on January 6  —  In the immediate aftermath of the January 6, 2021, attack on the US Capitol, a number of conservatives and Republicans broke ranks with then-President Donald Trump and blamed him for the violence that day.",
    "url": "https://www.cnn.com/2024/10/23/politics/trump-campaign-manager-january-6/"
  },
  {
    "text": "Georgia audit finds 20 noncitizens registered to vote  —  Secretary of State Brad Raffensperger canceled their registrations and referred cases to law enforcement  —  An audit uncovered 20 noncitizens out of 8.2 million registered voters in Georgia, according to findings announced by Secretary of State Brad Raffensperger on Wednesday.",
    "url": "https://www.ajc.com/politics/election-audit-shows-20-noncitizens-registered-to-vote-in-georgia/NRORAL7Z3RDSNMQ3QDLVEARPSY/"
  },
  {
    "text": "U.S. Study on Puberty Blockers Goes Unpublished Because of Politics, Doctor Says  —  The leader of the long-running study said that the drugs did not improve mental health in children with gender distress and that the finding might be weaponized by opponents of the care.",
    "url": "https://www.nytimes.com/2024/10/23/science/puberty-blockers-olson-kennedy.html?unlocked_article_code=1.UU4.1SEh.eaaVvaj1FXOT&smid=url-share"
  },
  {
    "text": "I'm a College President.  Universities Aren't Ready for What's Coming.  —  Universities are trying to stay out of politics.  It's coming at the worst possible time.  —  It is urgent that the leaders of colleges and universities stand up in defense of their interests and the values of higher education.",
    "url": "https://slate.com/life/2024/10/trump-college-presidents-politics-liberal-conservative.html"
  },
  {
    "text": "Claiming ‘Extreme Power’ of President, Trump Says He Will Close US Border by Fiat  —  U.S. Vice President Kamala Harris' campaign said Tuesday that her Republican opponent, former President Donald Trump, would be “unchecked” and “unhinged” in a potential second term, pointing to his comments … ",
    "url": "https://www.commondreams.org/news/trump-border"
  },
  {
    "text": "‘Bold vision’: Historic Bush Cabinet secretary makes key endorsement in 2024 presidential race  —  New endorsement by former Bush administration Agriculture secretary comes as the Harris campaign works to cut into Trump's vast lead with rural voters  —  FIRST ON FOX: A top official … ",
    "url": "https://www.foxnews.com/politics/bold-vision-historic-bush-cabinet-secretary-makes-key-endorsement-2024-presidential-race"
  },
  {
    "text": "Her billionaire marriage broke up.  Her VP campaign fizzled.  Now she's a Trump-world star.  —  With a massive divorce settlement from Google co-founder Sergey Brin, Nicole Shanahan is remaking herself as a pro-Trump wellness guru — raising alarm in Silicon Valley.",
    "url": "https://www.washingtonpost.com/technology/2024/10/23/nicole-shanahan-maga-make-america-healthy-trump-rfk-jr/"
  },
  {
    "text": "Swing State Poll 2024: Michigan, Wisconsin: Gender Divide Defines Tight Races In Rust Belt Battlegrounds, Quinnipiac University Poll Finds; U.S. Senate Races: Dem Holds Lead In MI, Very Close In WI  —  mail_outline  —  MICHIGAN: Harris 49%, Trump 46%, other candidates 2%",
    "url": "https://poll.qu.edu/poll-release?releaseid=3915"
  },
  {
    "text": "North Korean troops have been sent to Russia, U.S. confirms  —  The comments by Defense Secretary Lloyd Austin were Washington's first confirmation of a major development that has seen South Korea and Ukraine sound the alarm in recent days.  —  SEOUL, South Korea — North Korea has sent troops to Russia … ",
    "url": "https://www.nbcnews.com/news/world/north-korean-troops-sent-russia-us-confirms-war-ukraine-rcna176346"
  },
  {
    "text": "These Democratic Voters Hiding in Plain Sight Could Be Harris' Ticket to a North Carolina Win  —  Mecklenburg County has plenty of Democratic voters but getting them to the polls has been a challenge.  New party leadership has a plan to fix that.  —  Matt Taylor walked toward the first house on his list.",
    "url": "https://www.politico.com/news/magazine/2024/10/23/low-turnout-dems-north-carolina-00184841"
  },
  {
    "text": "“It doesn't cost $60,000 to bury a f—ing Mexican”: Trump was outraged at cost of soldier's funeral  —  Trump had offered to cover the cost of U.S. solider Vanessa Guillen's funeral after she was murdered in 2020  —  Former President Donald Trump called the late U.S. Army soldier Vanessa Guillen a … ",
    "url": "https://www.salon.com/2024/10/23/it-doesnt-cost-60000-to-bury-a-f---ing-mexican-was-outraged-at-cost-of-soldiers-funeral/"
  },
  {
    "text": "Key Atlantic current could collapse soon, ‘impacting the entire world for centuries to come,’ leading climate scientists warn  —  Leading climate scientists ring alarm bell on key Atlantic Ocean current collapse in open letter  —  Forty-four of the world's leading climate scientists have called … ",
    "url": "https://www.livescience.com/planet-earth/rivers-oceans/key-atlantic-current-could-collapse-soon-impacting-the-entire-world-for-centuries-to-come-leading-climate-scientists-warn"
  },
  {
    "text": "MAGA bashes “single issue” abortion voters — but Florida shows these women are the smartest citizens  —  Ron DeSantis' war on free speech demonstrates how abortion bans lead to larger authoritarian crackdowns  —  Convicted January 6 insurrectionist and professional conspiracy theorist Owen Shroyer knows … ",
    "url": "https://www.salon.com/2024/10/23/maga-bashes-single-issue-abortion--but-florida-shows-these-women-are-the-smartest-citizens/"
  },
  {
    "text": "House Democrat says Trump campaign has ‘refused to commit to a smooth transition’ by not working with administration  —  Rep. Jamie Raskin, of Maryland, the top Democrat on the House Oversight Committee, warned that Trump's failure to enter into agreements with the Biden administration … ",
    "url": "https://www.nbcnews.com/politics/2024-election/house-dem-says-trumps-campaign-refused-commit-smooth-transition-not-wo-rcna176648"
  },
  {
    "text": "Exclusive poll: How many voters are Donald Trump and Kamala Harris reaching on podcasts?  —  An exclusive USA TODAY/Suffolk University poll asked respondents whether they caught campaign appearances by Harris and Trump on podcasts.  The poll found that less than 30% of voters had been reached.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/23/election-podcasts-trump-harris-poll/75705573007/"
  },
  {
    "text": "Aileen Cannon Being Considered as Donald Trump's AG Sparks Fury: ‘Insane’  —  as a possible attorney general candidate is “insane”, a former Watergate prosecutor has said in response to reports the former president is considering the judge for the job if he wins the presidency.",
    "url": "https://www.newsweek.com/donald-trump-aileen-cannon-attorney-general-mar-lago-florida-classified-documents-1973456?10232024"
  }
]