[
  {
    "text": "Is Donald Trump About to Go Bankrupt?  —  Debt is becoming a major campaign issue in 2024.  I don't mean the national debt, which today stands at 99 percent of gross domestic product and which, the Congressional Budget Office projects, will total 116 percent of GDP 10 years from now.",
    "url": "https://newrepublic.com/article/179879/trump-legal-debts-chubb-payment"
  },
  {
    "text": "Trump Rules Out Vivek Ramaswamy as Running Mate as He Eyes New Team  — Former president eyeing loyalty, ideological agreement in pick  — Trump team aiming for smooth transition should he win election  —  Donald Trump has ruled out Vivek Ramaswamy as his running mate and is instead eyeing … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-18/trump-rules-out-ramaswamy-as-running-mate-as-he-eyes-new-team"
  },
  {
    "text": "Trump Says Jews Who Support Democrats ‘Hate Israel’ and ‘Their Religion’  —  The comments, on a conservative radio program, echo an antisemitic trope and escalate claims he made as president that were widely criticized.  —  Former president Donald J. Trump accused Jewish voters of hating … ",
    "url": "https://www.nytimes.com/2024/03/18/us/politics/trump-israel-jewish-voters.html"
  },
  {
    "text": "Context collapse  —  On Saturday, Donald Trump spoke at a rally in Ohio.  Before he began, an announcer instructed the crowd to rise in tribute to the insurrectionists who stormed the Capitol on January 6, and Trump himself stood and saluted the national anthem as recorded by the “J6 Prison Choir.”",
    "url": "https://www.cjr.org/the_media_today/trump_ohio_speech_bloodbath_media_broadcast_live.php"
  },
  {
    "text": "Behind Trump's campaign cash crunch: Small-dollar donor fatigue, major donor hesitation  — Former President Donald Trump is facing two major fundraising problems: A shortage of big money interest and a drop in small-dollar donor support.  — The drop in Trump's small-dollar contributors … ",
    "url": "https://www.cnbc.com/2024/03/18/trump-campaign-cash-crunch-small-dollar-donor-fatigue-major-donor-nerves.html"
  },
  {
    "text": "Peter Navarro Compares Prison Sentence to Dead American Soldiers  —  The day before heading to prison for contempt of Congress, the ex-Trump aide stood by his decision, describing it as a “much smaller sacrifice.”  —  On the eve of Peter Navarro's first day in prison, the former White House aide … ",
    "url": "https://www.thedailybeast.com/peter-navarro-compares-prison-sentence-to-dead-american-soldiers"
  },
  {
    "text": "Supreme Court says Trump White House official Peter Navarro must begin prison sentence  —  Navarro, who refused to cooperate with the Jan. 6 committee, wanted to remain free while he appealed his contempt of Congress conviction.  —  WASHINGTON − Former Trump adviser Peter Navarro … ",
    "url": "https://www.usatoday.com/story/news/politics/2024/03/18/supreme-court-peter-navarro-trump-prison/72999868007/"
  },
  {
    "text": "Pro-Trump lawyer arrested on bench warrant in Washington, D.C.  —  Stefanie Lambert, a Michigan lawyer who has championed dubious claims of election fraud, was arrested in Washington, D.C., Monday afternoon because of a bench warrant, according to a spokesman for the U.S. Marshals Service.",
    "url": "https://www.detroitnews.com/story/news/politics/2024/03/18/pro-trump-lawyer-stefanie-lambert-arrested-on-bench-warrant-in-washington-dominion-voting-elections/73023957007/"
  },
  {
    "text": "US Supreme Court justices, judges face new rules for disclosing free trips  —  U.S. Supreme Court justices and federal judges can no longer avoid disclosing the value of travel-related gifts they receive by classifying such free trips as “reimbursements” on their financial disclosure forms under new regulations now in effect.",
    "url": "https://www.reuters.com/world/us/us-supreme-court-justices-judges-face-new-rules-disclosing-free-trips-2024-03-18/"
  },
  {
    "text": "Tuberville says GOP leadership should have vetted claims in Katie Britt's speech  —  Sen. Tommy Tuberville (R-Ala.) said GOP leadership should have more carefully reviewed the claims in Sen. Katie Britt (R-Ala.)'s response to President Biden's State of the Union address as she faces criticism … ",
    "url": "https://thehill.com/homenews/senate/4540525-tuberville-says-gop-leadership-should-have-vetted-claims-in-katie-britts-speech/"
  },
  {
    "text": "Ohio 2024 GOP Poll: Moreno 38%, Dolan 29%, LaRose 12%  —  Home Polls Ohio 2024 GOP Poll: Moreno 38%, Dolan 29%, LaRose 12%  —  The final Emerson College Polling Ohio Republican Primary poll, fielded Sunday-Monday before the Tuesday election, finds 38% of likely voters support Bernie Moreno, 29% Matt Dolan, and 12% Frank LaRose.",
    "url": "https://emersoncollegepolling.com/ohio-2024-gop-poll-moreno-38-dolan-29-larose-12/"
  },
  {
    "text": "Hong Kong Passes Local Security Bill Cementing China's Control  — Article 23 was fastest bill passed in the city since 1997  — Critics say new law could diminish open economic discussion  —  Hong Kong has fast-tracked into law domestic security legislation that critics … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-19/hong-kong-passes-local-security-bill-cementing-china-s-control"
  },
  {
    "text": "Congress' stock trading addiction  —  On March 12, Bloomberg reported that the Department of Defense was canceling a $2.5 billion grant to chip-maker Intel.  The money was supposed to make Intel “a dedicated supplier of chips for military and intelligence needs, designating a so-called Secure Enclave within the company's factory.”",
    "url": "https://popular.info/p/congress-stock-trading-addiction"
  },
  {
    "text": "Congressional leaders strike deal on Homeland Security funding ahead of shutdown deadline  —  Congressional leaders have struck a deal to fund the Department of Homeland Security (DHS) through the remainder of fiscal year 2024, a source familiar with the matter confirmed to The Hill … ",
    "url": "https://thehill.com/business/budget/4540683-congressional-leaders-strike-deal-on-homeland-security-funding-ahead-of-shutdown-deadline/"
  },
  {
    "text": "Biden starts making his affordable housing pitch on the trail  —  A trip to Nevada will be centered around increasing housing supply.  —  Joe Biden is ramping up efforts to show he's focused on alleviating the nationwide housing crunch, amid worries that rising home prices could dent … ",
    "url": "https://www.politico.com/news/2024/03/19/biden-campaign-affordable-housing-nevada-00147691"
  },
  {
    "text": "The most important Senate primary of the year is just one of today's elections  —  The races will also test Donald Trump's hold on the GOP, and the Democratic divide over the Israel-Hamas war.  —  Donald Trump's trying to drag a few allies across the finish line on Tuesday.",
    "url": "https://www.politico.com/news/2024/03/19/ohio-primaries-what-to-watch-00147705"
  },
  {
    "text": "Arizona Lawmaker Shares On State Senate Floor Why She Plans To Get An Abortion  —  “The safest and most appropriate treatment for me — and the treatment that I choose — is abortion,” state Sen. Eva Burch (D) said on the Arizona Senate floor.  —  LOADING  —  An Arizona lawmaker shared … ",
    "url": "https://www.huffpost.com/entry/arizona-lawmaker-senate-abortion-eva-burch_n_65f8b428e4b030e8357afd5b"
  }
]