[
  {
    "text": "Iowa Poll: Kamala Harris leapfrogs Donald Trump to take lead near Election Day.  Here's how  —  The nationally recognized Iowa Poll shows Kamala Harris picking up support from women to surpass Donald Trump in a ruby-red state he has won twice … Kamala Harris now leads Donald Trump in Iowa … ",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/2024/11/02/iowa-poll-kamala-harris-leads-donald-trump-2024-presidential-race/75354033007/"
  },
  {
    "text": "Final NBC News poll: Harris-Trump race is neck and neck, with significant gender gap  —  Abortion and rising Democratic enthusiasm boost Harris, while the economy and the cost of living lift Trump ahead of an uncertain election.  —  The final national NBC News poll of the 2024 presidential campaign finds … ",
    "url": "https://www.nbcnews.com/politics/2024-election/final-nbc-news-poll-harris-trump-race-neck-neck-significant-gender-gap-rcna178361"
  },
  {
    "text": "British ‘mega poll’ leans toward Harris victory  —  Election pollsters may be ‘herding’ and giving the impression Trump is stronger than he really is, Focaldata research suggests.  —  The British are a-coming.  This time, they're wielding a new polling technique with a huge survey sample … ",
    "url": "https://www.politico.com/news/2024/11/03/swing-state-mrp-mega-poll-00186941"
  },
  {
    "text": "Some Surprises in Last Battleground Polls, but Still a Deadlock  —  A rise for Kamala Harris in the Sun Belt, and a dip in the Northern swing states.  —  Kamala Harris and Donald J. Trump stayed deadlocked to the finish in the final New York Times/Siena College polls of the 2024 presidential election … ",
    "url": "https://www.nytimes.com/2024/11/03/upshot/polls-harris-trump-battlegrounds.html?unlocked_article_code=1.XE4.1qmh.hNVT64YEm95p&smid=url-share"
  },
  {
    "text": "Harris and Trump Battle to the Wire in Swing States, Times/Siena Polls Find  —  Donald J. Trump has improved his standing in Pennsylvania even as late-deciding voters appear to be breaking for Kamala Harris.  —  The presidential race appears to be hurtling toward a photo finish … ",
    "url": "https://www.nytimes.com/2024/11/03/us/politics/harris-trump-times-siena-poll.html?unlocked_article_code=1.XE4.a3Fq.Aa23IX7kAZtp&smid=url-share"
  },
  {
    "text": "Can you wear a Trump or Harris hat to the polls?  It depends on where you live  —  Nearly half of states have laws restricting political apparel, per NCSL.  —  People wear campaign hats to a rally held by Democratic presidential nominee Vice President Kamala Harris in Washington, Oct. 29 … ",
    "url": "https://abcnews.go.com/Politics/political-clothes-hats-voting-poll-places-electionteering-laws/story?id=115239202"
  },
  {
    "text": "FCC commissioner claims Harris on ‘SNL’ violates ‘equal time’ rule  —  A Federal Communications Commission (FCC) commissioner has claimed that Vice President Harris's recent appearance on “Saturday Night Live” violates the “equal time” rule.  —  “This is a clear and blatant effort to evade … ",
    "url": "https://thehill.com/homenews/4968217-fcc-commissioner-claims-harris-on-snl-violates-equal-time-rule/"
  },
  {
    "text": "Harris appears on ‘Saturday Night Live’ as mirror image of Maya Rudolph with election looming  —  Vice President Kamala Harris made a surprise appearance on “Saturday Night Live” in the final days before the election, playing herself as the mirror-image double of Maya Rudolph's version of her in the show's cold open.",
    "url": "https://apnews.com/article/harris-unscheduled-new-york-visit-f58069ca1db9ec077b092a52bd118ac5"
  },
  {
    "text": "Kamala Harris Mocks Donald Trump on ‘SNL’ Appearance, Urges Americans to ‘Keep Kamala and Carry On-A-La’  —  Kamala Harris made a last-minute appearance on “Saturday Night Live” to inject a little humor into the last days of the presidential campaign.  —  The current Vice President … ",
    "url": "https://variety.com/2024/tv/news/kamala-harris-snl-mocks-donald-trump-1236198655/"
  },
  {
    "text": "Harris's team claims she's no longer the underdog, but Trump team scoffs  —  Harris's team has struck a more optimistic tone in public in recent days, signaling that they expect to win the race.  The Trump campaign sees things differently.  —  Vice President Kamala Harris has spent … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/03/will-kamala-harris-trump-win/"
  },
  {
    "text": "Epstein Claimed: Trump Liked to F**k His Friends' Wives  —  In recordings taken by author Michael Wolff, Epstein claimed Trump first slept with Melania on his Lolita Express and enjoyed cuckholding.  —  'Don't Do This Again': Harrison Ford Endorses Kamala Harris  —  'WE'LL MOVE FORWARD'",
    "url": "https://www.thedailybeast.com/epstein-claimed-trump-liked-to-fk-his-friends-wives/"
  },
  {
    "text": "Listen To The Jeffrey Epstein Tapes: 'I Was Donald Trump's Closest Friend'  —  THE PREDATOR AND THE PRESIDENT  —  Explosive tapes recorded by author Michael Wolff show Epstein claiming Trump liked to “f—” his friends' wives and first slept with Melania on the Lolita Express.  —  EXCLUSIVE",
    "url": "https://www.thedailybeast.com/listen-to-the-jeffrey-epstein-tapes-i-was-donald-trumps-closest-friend/"
  },
  {
    "text": "Trump Thinks America Wants His Perversions  —  Let's hope he is wrong.  —  MEASLES, MISINFORMATION, a “vigorous spanking” of misogyny—whether women like it or not—a violent nine-gun fantasy for political enemies, crudeness, petty insults, and cronyism.  —  Pick your perversion, America.",
    "url": "https://www.thebulwark.com/p/donald-trump-thinks-america-wants-his-perversions-election-2024"
  },
  {
    "text": "Trump's Health Pick RFK Jr. Touts Removing Fluoride From Water  —  “Fluoride is an industrial waste associated with arthritis, bone fractures, bone cancer, IQ loss,” the oft-health conspiracy theorist claims … “On January 20, the Trump White House will advise all U.S. water systems … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-health-pick-rfk-jr-removing-fluoride-from-water-1235151497/"
  },
  {
    "text": "Elon Musk's Mom Suggests She May Break Voting Laws  —  ILLEGAL MUCH?  —  Maye Musk also suggested that her Canadian friends were going to vote illegally.  —  Elon Musk's mom Musk stunned Fox News host Neil Cavuto when she appeared to suggest that she would visit polling stations in New York … ",
    "url": "https://www.thedailybeast.com/elon-musks-mom-suggests-she-may-break-voting-laws/"
  },
  {
    "text": "Megyn Kelly presses Sheehy on bullet wound story: “So confusing” … - Sheehy, a former Navy SEAL, claims he was shot while deployed in Afghanistan. … Sheehy said: “There isn't.”  — “There's not an extensive medical record for any of this stuff,” Sheehy said.",
    "url": "https://www.axios.com/2024/11/02/megyn-kelly-sheehy-bullet-wound-story-confusing"
  },
  {
    "text": "Texas GOP amplifies voter fraud claims amid tight Senate race  —  Texas Republicans are making a preemptive push to paint the 2024 election as illegitimate and rife with fraud, a move that comes as Sen. Ted Cruz (R) fights for his political life.  —  That rhetorical and legal campaign … ",
    "url": "https://thehill.com/homenews/state-watch/4966426-texas-republicans-election-fraud-claims/"
  }
]