[
  {
    "text": "Don't fall for Trump's new abortion position claims  —  While once again taking credit for the end of Roe v. Wade and the constitutional right to an abortion, Donald Trump nonetheless tried to distance himself on Monday from the most extreme anti-abortion positions of his party in an explicit effort to “win elections.”",
    "url": "https://www.lawdork.com/p/dont-fall-for-trumps-new-abortion-position"
  },
  {
    "text": "Evangelicals won't be bothered by Trump's abortion gambit — they know he's lying  —  Project 2025 makes it clear: The plan is a national abortion ban, even if by executive order  —  On Monday, with great fanfare, Donald Trump released his “plan” on abortion in a video posted to Truth Social.",
    "url": "https://www.salon.com/2024/04/09/evangelicals-wont-be-bothered-by-abortion-gambit--they-know-hes-lying/"
  },
  {
    "text": "Trump hush money jurors will be asked about QAnon, not political affiliation  —  Prospective jurors in former President Trump's hush money trial can expect to be asked about QAnon and Antifa — but not their political party affiliation.  —  The New York judge overseeing Trump's criminal trial … ",
    "url": "https://thehill.com/regulation/court-battles/4582457-trump-hush-money-jurors-asked-about-qanon-not-political-affiliation/"
  },
  {
    "text": "Donald Trump asks appeals court to intervene in last-minute bid to delay hush-money criminal case  —  NEW YORK (AP) — Donald Trump asked a New York appeals court on Monday to reverse his gag order and move his hush-money criminal trial out of Manhattan in an eleventh-hour bid for a delay just a week before it is scheduled to start.",
    "url": "https://apnews.com/article/donald-trump-juan-merchan-hush-money-appeal-lawsuit-6abe221a7cb2ea670eb3ed1a7a134643"
  },
  {
    "text": "European court rules human rights violated by climate inaction  —  A group of older Swiss women have won the first ever climate case victory in the European Court of Human Rights.  —  The women, mostly in their 70s, said that their age and gender made them particularly vulnerable to the effects of heatwaves linked to climate change.",
    "url": "https://www.bbc.com/news/science-environment-68768598"
  },
  {
    "text": "Elon Musk Didn't Want His Latest Deposition Released.  Here It Is.  —  Musk is being sued for falsely suggesting a 22-year-old Jewish man was part of a neo-Nazi brawl.  —  Elon Musk was deposed last month over his role in allegedly promoting a false conspiracy theory that a 22-year-old Jewish man participated in a neo-Nazi brawl.",
    "url": "https://www.huffpost.com/entry/elon-musk-didnt-want-his-latest-deposition-released-here-it-is_n_66133d2ce4b0d81853f9a766"
  },
  {
    "text": "‘Profoundly ahistorical’: 4-star generals side with Jack Smith, tell Supreme Court Trump's immunity claims are ‘assault’ on democracy  —  A distinguished group of retired four-star generals and admirals from the U.S. military have argued in a brief filed in the U.S. Supreme Court on Monday … ",
    "url": "https://lawandcrime.com/high-profile/profoundly-ahistorical-4-star-generals-side-with-jack-smith-tell-supreme-court-trumps-immunity-claims-are-assault-on-democracy/"
  },
  {
    "text": "Sonia Sotomayor's retirement is a political IQ test  —  Are you into politics to win — or to feel good about yourself?  —  Sonia Sotomayor, one of the three remaining liberal Supreme Court justices, will turn 70 years old in June, is diabetic and had one parent who died at a young age.",
    "url": "https://www.natesilver.net/p/sonia-sotomayors-retirement-is-a"
  },
  {
    "text": "Which Trump lies stick?  Republicans believe some falsehoods more than they did six years ago, our poll finds.  —  Fictions, misleading claims, wild exaggerations, lies — former president Donald Trump dispenses untruths of one variant or another relentlessly.",
    "url": "https://www.washingtonpost.com/politics/2024/04/09/some-trump-falsehoods-stick-more-than-others-fact-checker-poll-finds/"
  },
  {
    "text": "Las Vegas attorney kills 2, self in Summerlin law office shooting: sources  —  LAS VEGAS (KLAS) — Three people are dead following a shooting Monday morning in a law office in a building near the Red Rock resort in Summerlin, according to Las Vegas Metropolitan Police Department Sheriff Kevin McMahill.",
    "url": "https://www.8newsnow.com/news/local-news/shooting-at-las-vegas-office-building-in-summerlin/"
  },
  {
    "text": "EPA to crack down on toxic emissions from more than 200 chemical plants  —  The Biden administration will require more than 200 chemical plants to cut their emissions of toxic chemicals as part of a broader effort to reduce cancer cases.  —  The Environmental Protection Agency (EPA) … ",
    "url": "https://thehill.com/policy/energy-environment/4582067-epa-to-crack-down-on-toxic-emissions-from-more-than-200-chemical-plants/"
  },
  {
    "text": "As Kushner's Investment Firm Steps Out, the Potential Conflicts Are Growing  —  Jared Kushner's Affinity Partners has invested more than $1.2 billion, much of it in firms abroad, drawing new scrutiny as his father-in-law, Donald Trump, again seeks the presidency.",
    "url": "https://www.nytimes.com/2024/04/09/us/politics/jared-kushner-affinity-partners.html"
  },
  {
    "text": "“It's Been Soiled”: Trump Bizarrely Suggests Biden Has S—t on Oval Office Desk at Billionaire Fundraiser  —  He also pledged to keep attendees' taxes low and doubled down on his desire to have immigrants from “nice” countries, like Norway and Denmark, come to the US.",
    "url": "https://www.vanityfair.com/news/donald-trump-bizarrely-suggests-biden-has-s-t-on-oval-office-desk"
  },
  {
    "text": "Colorado GOP ousts reporter from event, claiming ‘unfair’ coverage  —  As a veteran journalist in Colorado, it wasn't Sandra Fish's first time reporting on the state GOP assembly.  But it was her first time getting kicked out.  —  The Colorado Republican Party expelled Fish from its event in Pueblo … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/09/colorado-gop-assembly-reporter/"
  },
  {
    "text": "Ted Cruz Is Turning an Allied Super PAC Into a Media Company  —  CRUZ CONTROL  —  Ted Cruz is once again pushing the bounds of campaign finance laws, this time with his super PAC pocketing hundreds of thousands of dollars for his podcast appearances.",
    "url": "https://www.thedailybeast.com/ted-cruz-is-turning-an-allied-super-pac-into-a-media-company"
  },
  {
    "text": "How Donald Trump's mug shot became a defiant and divisive 2024 symbol  —  CONWAY, S.C. — After Quinzell Williams stepped out of an Uber near a campaign rally featuring Donald Trump, a passing couple did a double take.  —  “Aren't you embarrassed to be wearing that?” they asked, Williams recalled.",
    "url": "https://www.washingtonpost.com/politics/interactive/2024/mugshot-trump-2024-election-campaign/"
  },
  {
    "text": "Public safety group finds FBI violent crime data is higher than initially reported  —  A new report claims violent crimes are significantly underreported, and FBI crime classification has changed  —  FIRST ON FOX: An independent group of law enforcement officials and analysts claim violent crime rates … ",
    "url": "https://www.foxnews.com/politics/fbis-data-is-faulty-as-crime-proliferates-in-big-cities-report?intcmp=tw_fnc"
  },
  {
    "text": "Biden Is Spending $1 Trillion to Fight Climate Change.  Voters Don't Care.  —  President's campaign is promoting the effort, hoping to attract young people  —  President Biden has done more to address climate change than any of his predecessors.  So far, voters don't seem to care.",
    "url": "https://www.wsj.com/politics/elections/biden-is-spending-1-trillion-to-fight-climate-change-voters-dont-care-21d8cb05"
  },
  {
    "text": "CSIS warned Prime Minister's Office in 2023 that China ‘clandestinely and deceptively’ interfered in elections  —  Top secret document claims at least 11 candidates, 13 staffers were implicated in foreign interference  —  Canada's spy agency believes the Chinese government … ",
    "url": "https://www.cbc.ca/news/politics/pmo-briefing-leaks-1.7167090"
  }
]