[
  {
    "text": "Verdict reached in E. Jean Carroll's defamation damages trial against Trump  —  The verdict comes after a dramatic day in court that included the former president storming out of the courtroom during Carroll's closing argument.  —  The jury in E. Jean Carroll's defamation damages trial … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/verdict-reached-e-jean-carrolls-defamation-damages-trial-trump-rcna135919"
  },
  {
    "text": "Trump's Court-Appointed Monitor Tells Judge Company Gave ‘Incomplete’ and ‘Inconsistent’ Disclosures with ‘Errors’  —  Court monitor Barbara Jones sent her letter to Justice Engoron, who will determine whether to ban Trump from New York real estate for life  —  JWPlayer",
    "url": "https://themessenger.com/politics/trump-barbara-jones-incomplete-inconsistent-disclosures-errors"
  },
  {
    "text": "Trump-Carroll Defamation Trial  —  Jury Orders Trump to Pay Carroll $83.3 Million for Years of Defamation  —  The jury found Donald J. Trump had acted maliciously in persistently attacking E. Jean Carroll.  He was found liable last year of sexually abusing her.  —  Jury orders Trump to pay Carroll damages for defamation.",
    "url": "https://www.nytimes.com/live/2024/01/26/nyregion/trump-carroll-defamation-trial"
  },
  {
    "text": "Trump trial live updates: Closing arguments in E. Jean Carroll case begin  —  Former President Donald Trump attended today's closing arguments briefly before storming out of court.  The judge presiding over the trial also lashed out at his lawyer for being late.",
    "url": "https://www.nbcnews.com/politics/donald-trump/live-blog/trump-e-jean-carroll-trial-live-updates-rcna135759"
  },
  {
    "text": "Biden needles Trump in hopes of pushing him off message  —  Three words from Joe Biden's somber speech about Donald Trump had one man in the back of Charleston's Mother Emanuel AME Church the most excited: “He's a loser.”  —  The man, cracking up, poked the woman next to him with a “Can you believe it?” expression on his face.",
    "url": "https://www.cnn.com/2024/01/26/politics/biden-taunts-trump-2024/"
  },
  {
    "text": "Trump Must Pay $83.3 Million to E. Jean Carroll for Defamation  —  The former president has denied the journalist's rape and sexual assault accusation, telling reporters in 2019, 'she's not my type' and sparking a federal defamation lawsuit  —  JWPlayer  —  Former President Donald Trump … ",
    "url": "https://themessenger.com/politics/trump-verdict-e-jean-carroll-defamation-trial-damages-jury"
  },
  {
    "text": "‘Oath-breaking insurrectionist’ Trump is ineligible for office, Colorado voters tell the Supreme Court  —  The justices hear arguments next month on whether Trump can be barred from office for his efforts to overturn the 2020 election results that culminated in the Jan. 6 Capitol attack.",
    "url": "https://www.nbcnews.com/politics/donald-trump/oath-breaking-insurrectionist-trump-ineligible-office-colo-voters-tell-rcna135904"
  },
  {
    "text": "Trump storms out of courtroom during closing arguments in E. Jean Carroll's defamation damages trial  —  Carroll is seeking at least $10 million in damages from the former president for repeatedly defaming her after she accused him of sexually assaulting her in the 1990s.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-e-jean-carroll-trial-closing-arguments-rcna135756"
  },
  {
    "text": "Donald Trump ordered to pay E Jean Carroll $83.3m in defamation trial  —  Ex-president vows to appeal against ruling, which comes less than a year after Carroll won $5m in sexual abuse and defamation trial  —  A New York City jury awarded $83.3m to E Jean Carroll in her defamation trial against Donald Trump on Friday.",
    "url": "https://www.theguardian.com/us-news/2024/jan/26/e-jean-carroll-damages-trump-defamation-trial"
  },
  {
    "text": "Jurors awarded ‘astronomical’ amount because they knew Trump had ‘to be thwarted’: expert  —  E. Jean Carroll's massive $83.3 million civil judgment against former President Donald Trump on Friday is a huge blow to the former president — and a real, devastating consequence … ",
    "url": "https://www.rawstory.com/trump-2667099554/"
  },
  {
    "text": "Trump Calls on ‘All Willing States’ to Send National Guard Soldiers to Texas  —  Sorry, were you expecting the former president to tell everyone to chill out?  —  Like pouring water on a grease fire, former President Donald Trump has weighed in on the escalating standoff between the federal government and Texas.",
    "url": "https://www.vice.com/en/article/epv7p7/trump-national-guard-texas-border-dispute-federal-government-standoff"
  },
  {
    "text": "Trump's border power play is a push for civil war  —  Donald Trump wants Congress to refuse to do any deal until he can win and create the “PERFECT” border  —  Donald Trump is having a rolling hissy fit that's escalating by the day.  From courtrooms to rallies to incoherent interviews … ",
    "url": "https://www.salon.com/2024/01/26/donald-border-powerplay-is-a-push-for-civil/"
  },
  {
    "text": "Statement from President Joe Biden On the Bipartisan Senate Border Security Negotiations  —  For too long, we all know the border's been broken.  —  It's long past time to fix it.  —  That's why two months ago, I instructed my team to begin negotiations with a bipartisan group of Senators to seriously … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/26/statement-from-president-joe-biden-on-the-bipartisan-senate-border-security-negotiations/"
  },
  {
    "text": "Ex-coal CEO Don Blankenship couldn't win a Senate seat with the GOP.  He's trying now as a Democrat  —  CHARLESTON, W.Va. — Former West Virginia coal executive Don Blankenship, who lost by a wide margin when he ran for a U.S. Senate seat as a Republican in 2018, filed paperwork Friday to run … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/26/west-virginia-don-blankenship-senate/b4031f80-bc97-11ee-b176-fe5fd794e716_story.html"
  },
  {
    "text": "UNRWA Is Investigating Charges of Workers' Involvement in Oct. 7 Attacks  —  The United States temporarily cut off funding to UNRWA, the agency that aids Palestinians, citing allegations that 12 of its workers were involved in the Hamas-led assault on southern Israel.",
    "url": "https://www.nytimes.com/2024/01/26/world/middleeast/un-aid-israel-oct-7-attacks.html"
  },
  {
    "text": "Trader Joe's Follows SpaceX in Arguing US Labor Board Is Unconstitutional  — Grocery chain tries new argument to fight union-busting charge  — Decision on constitutionality is unlikely before an appeal … At a Jan. 16 National Labor Relations Board hearing in Connecticut … ",
    "url": "https://www.bloomberg.com/news/articles/2024-01-26/trader-joe-s-follows-spacex-in-arguing-nlrb-is-unconstitutional"
  },
  {
    "text": "Giuliani Lists Yankees Loot, Trump Claim as Assets in Bankruptcy  —  Rudolph Giuliani's bankruptcy financial disclosures show he has assets that include New York Yankees world series rings, a signed Joe DiMaggio shirt, and potential claims against Donald Trump and President Joe Biden.",
    "url": "https://www.bloomberg.com/news/articles/2024-01-26/giuliani-lists-yankees-loot-trump-claim-as-assets-in-bankruptcy"
  },
  {
    "text": "DOJ says Andrew Cuomo sexually harassed 13 women  —  The former governor's lawyer says he was never interviewed.  —  ALBANY, New York — Former New York Gov. Andrew Cuomo sexually harassed 13 women who worked for the state over the course of an eight-year period, the Department … ",
    "url": "https://www.politico.com/news/2024/01/26/cuomo-sexual-harassment-doj-00138140"
  },
  {
    "text": "Covid killed 170,000 in nursing homes.  Most residents still haven't gotten the latest shot.  —  The Biden administration says the facilities need to do more.  Home executives say vaccine hesitancy requires a new government message.  —  Fewer than 4 in 10 nursing home residents have received … ",
    "url": "https://www.politico.com/news/2024/01/26/nursing-homes-residents-covid-shot-00137665"
  }
]