[
  {
    "text": "RFK Jr. candidacy hurts Trump more than Biden, NBC News poll finds  —  The finding contrasts with a number of other national polls, and it comes amid concerted Democratic efforts to prevent Kennedy from harming Biden's campaign.  —  The latest national NBC News poll shows the third-party vote … ",
    "url": "https://www.nbcnews.com/politics/2024-election/rfk-jr-candidacy-hurts-trump-biden-nbc-news-poll-finds-rcna148536"
  },
  {
    "text": "Playbook: The Biden polling bump persists  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  TOP-ED — Former VP MIKE PENCE in the NYT: “Donald Trump Has Betrayed the Pro-Life Movement”  —  NEW POLL — Encouraging signs for President JOE BIDEN in a new NBC News poll:",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/21/the-biden-polling-bump-persists-00153528"
  },
  {
    "text": "Poll: Election interest hits new low in tight Biden-Trump race  —  NBC News' latest national poll shows Biden's numbers inching up as Robert F. Kennedy Jr., inflation and abortion all scramble the 2024 contest.  —  The share of voters who say they have high interest in the 2024 election … ",
    "url": "https://www.nbcnews.com/politics/2024-election/poll-biden-trump-tight-race-election-interest-low-rcna148170"
  },
  {
    "text": "Trump's Trial Challenge: Being Stripped of Control  —  The mundanity of the courtroom has all but swallowed Donald Trump, who for decades has sought to project an image of bigness and a sense of power.  —  “Sir, can you please have a seat.”  —  Donald J. Trump had stood up to leave … ",
    "url": "https://www.nytimes.com/2024/04/21/us/politics/trump-trial-analysis.html"
  },
  {
    "text": "What happens if Trump gets convicted ahead of November?  —  The first-ever criminal trial of a current or former American president is underway in Manhattan, renewing questions over what a potential conviction would mean for former President Trump as he campaigns for the White House.",
    "url": "https://thehill.com/homenews/campaign/4606107-donald-trump-hush-money-trial-stormy-daniels-conviction-election/"
  },
  {
    "text": "Will a Mountain of Evidence Be Enough to Convict Trump?  —  Monday will see opening statements in the People of the State of New York v. Donald J. Trump.  The state's case seems strong, but a conviction is far from assured.  —  In the official record, the case is known as the People … ",
    "url": "https://www.nytimes.com/2024/04/21/nyregion/trump-trial-hush-money-evidence.html"
  },
  {
    "text": "Hakeem Jeffries emerges as Congress' shadow speaker … - Former House Speaker Nancy Pelosi (D-Calif.), a master legislative tactician, heaped praise on her successor: “He is fabulous. … - One senior House Democrat told Axios: “It easily could have fallen apart ... He played the cards the way you'd want to play them.”",
    "url": "https://www.axios.com/2024/04/21/hakeem-jeffries-speaker-mike-johnson-israel-ukraine"
  },
  {
    "text": "Jayapal says Trump wouldn't be on trial if Senate had ‘gone through with the impeachment’  —  Rep. Pramila Jayapal (D-WA) lamented the fact that the then Republican-controlled Senate did not impeach Donald Trump when it had the chance.  —  Jayapal appeared on The Weekend on Saturday to express … ",
    "url": "https://www.washingtonexaminer.com/news/house/2973353/jayapal-says-trump-wouldnt-be-on-trial-if-senate-had-gone-through-with-the-impeachment/"
  },
  {
    "text": "This is what that terrifies Republicans most  —  The UAW's historic win in Chattanooga shows the power of the sort of multi-racial coalition of workers that has terrified Southern aristocracy for centuries.  —  You probably know by now that workers at the Volkswagen plant in Chattanooga … ",
    "url": "https://www.patreon.com/posts/102758094"
  },
  {
    "text": "A crush of lawsuits over voting in multiple states is creating a shadow war for the 2024 election  —  As President Joe Biden and Donald Trump step up their campaigning in swing states, a quieter battle is taking place in the shadows of their White House rematch.",
    "url": "https://apnews.com/article/rnc-trump-lawsuits-2024-election-voter-rolls-c7d8943dcac776103d948532f62f2a5c"
  },
  {
    "text": "On a panel with CNN senior political commentator Scott Jennings and CNN political commentators Jamal Simmons and Kate Bedingfield, Rep. Tony Gonzales (R-TX) tells CNN's Dana Bash: “The house is a rough and rowdy place,” but Speaker Mike Johnson won't be ousted.",
    "url": "https://www.cnn.com/videos/politics/2024/04/21/sotu-gonzalez-during-panel.cnn"
  },
  {
    "text": "US poised to impose sanctions on IDF unit accused of violations in West Bank  —  Israeli leaders vow to oppose expected measures under Leahy law against the Netzah Yehuda battalion  —  A unit of the Israel Defense Forces is facing US sanctions over its treatment of Palestinians in the occupied West Bank … ",
    "url": "https://www.theguardian.com/world/2024/apr/21/us-poised-impose-sanctions-israel-defense-force-netzah-yehuda-battalion"
  },
  {
    "text": "Trump's super PAC has helped foot his legal bills.  That might end soon.  —  Save America has now spent about $60 million on legal consulting since the beginning of 2023.  —  A PAC controlled by former President Donald Trump that has devoted tens of millions of dollars to his and his allies' legal bills … ",
    "url": "https://www.politico.com/news/2024/04/20/trump-legal-fees-spending-00153508"
  },
  {
    "text": "Evangelicals with ties to “The Family” met Mike Johnson and Zelenskyy ahead of Ukraine vote  —  We're getting nearly a real-time look at The Family's anti-LGBTQ+ religious diplomacy in action  —  If you see evangelical House Republicans softening their opposition to military aid for Ukraine, don't assume it's divine intervention.",
    "url": "https://www.salon.com/2024/04/19/evangelicals-with-ties-to-the-family-met-mike-johnson-and-zelenskyy-ahead-of-ukraine-vote_partner/"
  },
  {
    "text": "Legal fees pile up for embattled Squad member Cori Bush … - From January through March, Bush paid law firms approximately $86,000, according to recently released campaign finance records.  — In the final months before the August primary election, Bush's campaign has $528,000 with $91,000 … ",
    "url": "https://www.axios.com/2024/04/21/cori-bush-legal-fees-primary-congress"
  },
  {
    "text": "A prehistory of MAGA: “Mainstream” conservatives never really purged the fascists  —  Author David Austin Walsh says “respectable” conservatives have tolerated racists and neo-Nazis all along  —  David Austin Walsh's new book, “Taking America Back: The Conservative Movement and the Far Right … ",
    "url": "https://www.salon.com/2024/04/20/a-prehistory-of-maga-mainstream-conservatives-never-really-purged-the-fascists/"
  },
  {
    "text": "Zelenskyy: ‘We will have a chance at victory’ thanks to weapons provided to Ukraine in new US aid package  —  Ukrainian President Volodymyr Zelenskyy thanked U.S. leaders for passing a $60.8 billion aid package through the House earlier in the weekend.  —  Ukrainian President Volodymyr Zelenskyy … ",
    "url": "https://www.nbcnews.com/politics/congress/ukrainian-president-volodymyr-zelenskyy-will-chance-victory-thaks-weap-rcna148684"
  },
  {
    "text": "Proud Boys appear at Trump rally, drawing condemnation from Biden  —  Members of the violent extremist group were calling for the release of everyone charged in the Jan. 6, 2021, attack on the Capitol.  Trump has pledged to pardon rioters.  —  WILMINGTON, N.C. — At least 10 men wearing … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/20/trump-rally-proud-boys-north-carolina/"
  }
]