[
  {
    "text": "RFK Jr. forces out Peter Marks, FDA's top vaccine scientist  —  Marks, an architect of Operation Warp Speed, warned that a recent measles outbreak shows how confidence in science and public health is being “undermined.”  —  The Trump administration on Friday pushed out Peter Marks … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/28/rfk-jr-fda-vaccine-scientist-peter-marks/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzMTM0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0NTE2Nzk5LCJpYXQiOjE3NDMxMzQ0MDAsImp0aSI6ImY4NTk0MjBkLTkyYzUtNDYzZS1hOWNkLTAxZGZiOTIxNDM5NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzI4L3Jmay1qci1mZGEtdmFjY2luZS1zY2llbnRpc3QtcGV0ZXItbWFya3MvIn0.ceXoDFKEOs6cJhrid_4Dpqcn5gKkKhuy7uuMw7TuBRU&itid=gfta"
  },
  {
    "text": "Top F.D.A. Vaccine Official Resigns, Citing Kennedy's ‘Misinformation and Lies’  —  Dr. Peter Marks, a veteran of the agency, wrote that undermining confidence in vaccines is irresponsible and a danger to public health.  —  The Food and Drug Administration's top vaccine official … ",
    "url": "https://www.nytimes.com/2025/03/28/health/fda-vaccines-rfk-jr-peter-marks.html?unlocked_article_code=1.7k4.68LK.jmdwzhmyp8uv&smid=url-share"
  },
  {
    "text": "Top Vaccine Official Out at FDA  —  In his resignation letter, Dr. Peter Marks cited ‘misinformation and lies’ from Health and Human Services Secretary RFK Jr.  —  The Food and Drug Administration's top vaccine official has been pushed out, according to people familiar with the matter.",
    "url": "https://www.wsj.com/politics/top-vaccine-official-out-at-fda-f39a5a16?st=KWBQgQ"
  },
  {
    "text": "Hegseth Brought His Wife to Sensitive Meetings With Foreign Military Officials  —  Defense secretary's wife is a former Fox News executive.  His handling of sensitive information is under fire after he shared details about a strike on Houthi militants in a group chat on a commercial messaging platform.",
    "url": "https://www.wsj.com/politics/national-security/hegseth-brought-his-wife-to-sensitive-meetings-with-foreign-military-officials-c16db0ea?st=a9QEVq&reflink=share_mobilewebshare"
  },
  {
    "text": "The Imperialism Has no Clothes  —  “No one would allow that he could not see these much-admired clothes; because, in doing so, he would have declared himself either a simpleton or unfit of his office.”  Hans Christian Andersen, “The Emperor's New Clothes”  —  Musk-Trump inherited a state … ",
    "url": "https://snyder.substack.com/p/vance-in-greenland"
  },
  {
    "text": "Judges partially block two executive orders targeting major law firms  —  Two federal judges partially blocked Trump's executive orders targeting law firms Jenner & Block and WilmerHale.  —  Federal judges have partially blocked President Donald Trump's executive orders targeting two major law firms … ",
    "url": "https://www.politico.com/news/2025/03/28/jenner-wilmerhale-executive-order-blocked-trump-028507"
  },
  {
    "text": "Columbia University's President, Katrina Armstrong, Resigns  —  Katrina Armstrong is leaving the post a week after the university agreed to a list of demands from the White House.  —  Columbia University changed its president on Friday evening, one week after the university bowed to a series … ",
    "url": "https://www.nytimes.com/2025/03/28/us/columbia-universitys-president-resigns.html"
  },
  {
    "text": "Hegseth's younger brother is serving in a key role inside the Pentagon  —  Defense Secretary Pete Hegseth's younger brother is serving in a key position inside the Pentagon as a Department of Homeland Security liaison and senior adviser, Hegseth's office confirmed.",
    "url": "https://www.defensenews.com/pentagon/2025/03/28/hegseths-younger-brother-is-serving-in-a-key-role-inside-the-pentagon/"
  },
  {
    "text": "Trump officials, allies grow anxious about April 2 tariffs  —  The president continues to throw curveballs at businesses — and even his own team.  —  Top White House and administration officials have been promising businesses, consumers and fellow Republicans more “certainty” … ",
    "url": "https://www.politico.com/news/2025/03/29/trump-aides-tariffs-liberation-day-fears-00259081"
  },
  {
    "text": "Naval Academy Takes Steps to End Diversity Policies in Books and Admissions  —  The defense secretary's office has ordered that some books be removed from circulation in its library, and the academy has ended the use of affirmative action in admissions.  —  The Pentagon and U.S. Naval Academy … ",
    "url": "https://www.nytimes.com/2025/03/28/us/politics/naval-academy-diversity-affirmative-action.html"
  },
  {
    "text": "The Democrats Are in Denial About 2024  —  Last year's election was close, despite President Trump's hyperbolic claims about his margin of victory.  Still, the Democratic Party clearly lost — and not only the presidential race.  It also lost control of the Senate and failed to recapture the House of Representatives.",
    "url": "https://www.nytimes.com/2025/03/29/opinion/democrats-strategy-2024.html"
  },
  {
    "text": "Trump Commutes Ozy Media Founder's Sentence Just Before His Surrender  —  Carlos Watson, who started the now-defunct digital media company, had been sentenced to almost 10 years in prison for trying to defraud investors and lenders.  —  President Trump on Friday commuted the sentence of Carlos Watson … ",
    "url": "https://www.nytimes.com/2025/03/28/business/carlos-watson-ozy-media-trump.html?unlocked_article_code=1.7k4.es5N.DjBJhOK1VMNd&smid=url-share"
  },
  {
    "text": "Taxpayers' Tab For Trump's Second-Term Golf Excursions Crosses $26 Million Mark  —  He has now traveled to one of his golf resorts on nine of the ten weekends since taking office in January.  It is his seventh trip to his Palm Beach, Florida, country club.  —  WASHINGTON — American taxpayers … ",
    "url": "https://www.huffpost.com/entry/trump-golf-again-26-million_n_67e6c885e4b0f69ef1d3886c"
  },
  {
    "text": "Collision warning sounds in cockpit of Delta plane due to close call with Air Force jet near Reagan National Airport  —  A close call between a Delta Air Lines Airbus A319 taking off from Ronald Reagan Washington National Airport and a US Air Force T-38 jet, often used by the military for training … ",
    "url": "https://cnn.com/2025/03/28/us/delta-military-jet-close-call-dca"
  },
  {
    "text": "Judicial rulings block Kari Lake's drive to shutter Voice of America  —  Trump adviser Kari Lake and the U.S. Agency for Global Media aren't just defendants in five federal court battles.  —  They're on the defensive.  —  In two temporary - but consequential - decisions this week … ",
    "url": "https://www.npr.org/2025/03/29/nx-s1-5343953/voice-of-america-trump-judge-lawsuit"
  },
  {
    "text": "In Cities' Rush to Clear Homeless Camps, People Have Been Crushed to Death  —  Atlanta's mayor began a drive to clear homeless encampments.  But when heavy equipment came to raze one, nobody noticed that Cornelius Taylor was still inside his tent.  —  Atlanta's mayor began a drive to clear homeless encampments.",
    "url": "https://www.nytimes.com/2025/03/29/us/politics/in-cities-rush-to-clear-homeless-camps-people-have-been-crushed-to-death.html"
  },
  {
    "text": "U.S. Institute of Peace staff receive termination notices, sources say  —  Staff members at the U.S. Institute of Peace were informed they were terminated effective immediately on Friday, three sources familiar with the situation told CBS News.  —  It was not immediately clear … ",
    "url": "https://www.cbsnews.com/news/us-institute-of-peace-staff-termination-notices/"
  },
  {
    "text": "Trump Accidentally Wrecks His Own Tariff Spin in Leaked Call Stunner … Faced with expert opinion predicting that his tariffs will jack up prices for American consumers, President Trump has carefully considered a wealth of evidence surrounding this complex matter, and after extensive consultation … ",
    "url": "https://newrepublic.com/article/193352/trump-car-tariffs-vehicle-auto-ceo-wrecks-spin"
  },
  {
    "text": "Musk's xAI buys Musk's X social media platform for $33 billion  —  Elon Musk's xAI artificial intelligence firm has acquired Musk's X, the social media outfit formerly known as Twitter for $33 billion.  —  The all-stock deal announced on Friday consolidates two of Musk's multiple portfolio companies … ",
    "url": "https://www.reuters.com/markets/deals/musks-xai-buys-social-media-platform-x-45-billion-2025-03-28/"
  },
  {
    "text": "Journey From Biden Loyalist to ‘Full MAGA’ Ends in a Trump Pardon  —  Devon Archer used his knowledge about Hunter Biden's foreign business dealings to gain favor from Republicans and appeal for clemency.  —  In the weeks before the 2020 election, Devon Archer was on the precipice … ",
    "url": "https://www.nytimes.com/2025/03/29/us/politics/journey-from-biden-loyalist-to-full-maga-ends-in-a-trump-pardon.html"
  },
  {
    "text": "Trump Admin Spies on Social Media of Student Visa Holders  —  Ideological purge of foreign students revealed in new leaked directive  —  The Trump administration is requiring that foreign students studying in, or seeking to study in the United States, pass an ideological test in order to obtain a visa … ",
    "url": "https://www.kenklippenstein.com/p/exclusive-trump-admin-spies-on-social"
  },
  {
    "text": "US tells European companies to comply with Donald Trump's anti-diversity order  —  Move signals push by American president to widen his ideological campaign abroad  —  The Trump administration has sent a letter to some large companies in the EU warning them to comply with an executive order … ",
    "url": "https://www.ft.com/content/02ed56af-7595-4cb3-a138-f1b703ffde84"
  },
  {
    "text": "RFK Jr. to gut vaccine promotion and HIV prevention office, sources say  —  The entire staff of the federal government's Office of Infectious Disease and HIV/AIDS Policy is expected to be laid off, multiple federal health officials told CBS News Friday.  The moves are part of a broader … ",
    "url": "https://www.cbsnews.com/news/rfk-jr-to-gut-vaccine-promotion-and-hiv-prevention-office-sources-say/"
  },
  {
    "text": "Elon Musk stepping down from DOGE in May. Here's what he said  —  Elon Musk may be getting out of DOGE.  —  On Thursday, Musk said he plans to step down from his role in Donald Trump's administration this spring.  —  The head of Tesla and X owner said he plans on stepping down in May during … ",
    "url": "https://www.yahoo.com/news/elon-musk-stepping-down-doge-155302029.html"
  },
  {
    "text": "Kristi Noem refused to say who financed some of her travel.  It was taxpayers who were on the hook  —  As then-Gov. Kristi Noem crisscrossed the country — stumping for President Donald Trump and boosting her political profile beyond her home state — she refused to reveal what her extensive travel was costing taxpayers.",
    "url": "https://apnews.com/article/noem-travel-taxpayers-south-dakota-homeland-security-c2655e00a16d44bba46c60a14a638f5d"
  },
  {
    "text": "Satanist leader's attempt to hold Black Mass in Kansas Statehouse sparks chaos and 4 arrests  —  The leader of a small group of self-described satanists and three other people were arrested Friday following a scuffle inside the Kansas Statehouse arising from an effort by the group's leader to start a Black Mass in the rotunda.",
    "url": "https://apnews.com/article/satanic-grotto-kansas-rally-protesters-detained-1c699af8b373f35df7cfef4556dea3b4"
  },
  {
    "text": "Quakers condemn police raid on Westminster Meeting House  —  Police broke into a Quaker Meeting House last night (27 March) and arrested six young people holding a meeting over concerns for the climate and Gaza.  —  Quakers in Britain strongly condemned the violation of their place of worship … ",
    "url": "https://www.quaker.org.uk/news-and-events/news/quakers-condemn-police-raid-on-westminster-meeting-house"
  }
]