[
  {
    "text": "Comptroller Brad Lander arrested at ICE court hearing  —  City Comptroller Brad Lander was arrested and accosted by masked federal agents at immigration court in Lower Manhattan.  —  The city's elected financial watchdog, and a Democratic candidate for mayor, appeared at 26 Federal Plaza … ",
    "url": "https://www.amny.com/news/brad-lander-arrested-ice-court-hearing-06172025/"
  },
  {
    "text": "Brad Lander Is Arrested by ICE Agents at Immigration Courthouse  —  Mr. Lander, the New York City comptroller and a candidate for mayor, was handcuffed as he tried to steer a man past Immigration and Customs Enforcement officers.  —  Brad Lander, the New York City comptroller who is running for mayor … ",
    "url": "https://www.nytimes.com/2025/06/17/nyregion/brad-lander-immigration-ice.html"
  },
  {
    "text": "Trump officials reverse guidance exempting farms, hotels from immigration raids  —  ICE agents have been advised to continue conducting workforce enforcement operations on agricultural businesses despite concerns the raids will negatively affect the food industry.  —  Summary21",
    "url": "https://www.washingtonpost.com/immigration/2025/06/16/trump-farms-hotels-immigration-raids/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwMDQ2NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUxNDI4Nzk5LCJpYXQiOjE3NTAwNDY0MDAsImp0aSI6IjYwNmMxMGFkLTVlYjQtNDVjNi1hYzcyLWNmZjkzMDdiYjU0NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzA2LzE2L3RydW1wLWZhcm1zLWhvdGVscy1pbW1pZ3JhdGlvbi1yYWlkcy8ifQ.Ud1j0dRlcVjt3OzkLR8XjCdxD1Z9lIPe3jjA1qpoGF4&itid=gfta"
  },
  {
    "text": "Brad Lander Detained by Masked Federal Agents Inside Immigration Court  —  New York City Comptroller Brad Lander was detained inside a Lower Manhattan immigration court building Tuesday morning by masked federal agents as he attempted to escort a man from his court appearance there.",
    "url": "https://www.thecity.nyc/2025/06/17/brad-lander-arrest-ice-immigration-court/"
  },
  {
    "text": "Brad Lander, NYC comptroller and mayoral candidate, is arrested outside immigration court  —  New York City comptroller and Democratic mayoral candidate Brad Lander was arrested by federal agents at an immigration court Tuesday as he was trying to accompany a person out of a courtroom.",
    "url": "https://apnews.com/article/brad-lander-nyc-immigration-court-arrest-6ed341297efab31a08a14421674d8ed8"
  },
  {
    "text": "How Trump Shifted on Iran Under Pressure From Israel  —  President Trump spent the first months of his term holding back Israel's push for an assault on Iran's nuclear program.  With the war underway, his posture has gyrated as he weighs sending in the U.S. military.",
    "url": "https://www.nytimes.com/2025/06/17/us/politics/trump-iran-israel-nuclear-talks.html?unlocked_article_code=1.Pk8.yX3k.QsVcm1X7gVTt&smid=url-share"
  },
  {
    "text": "Trump considers strike on Iran ahead of crucial Situation Room meeting  —  President Trump will meet with his national security team in the White House Situation Room at 1pm on Tuesday to make decisions about U.S. policy towards the war between Israel and Iran, three U.S. officials tell Axios.",
    "url": "https://www.axios.com/2025/06/17/trump-situation-room-meeting-iran-israel-war"
  },
  {
    "text": "Thoughts on Israel's Iran Campaign and Donald Trump … I haven't had a lot to say about Israel and Iran because I haven't had a lot to add.  But I want to suggest something about the possible entry of the United States into the war.  These aren't conclusions, more questions I've had and questions … ",
    "url": "https://talkingpointsmemo.com/edblog/thoughts-on-israels-iran-campaign-and-donald-trump/sharetoken/242a4259-3434-4ba9-9820-5cc31b27d92b"
  },
  {
    "text": "Trump dismisses Gabbard's testimony on Iran nukes: “I don't care what she said”  —  President Trump on Tuesday said Iran was “very close” to having a nuclear weapon, despite March testimony from Director of National Intelligence Tulsi Gabbard that Tehran was not building one.",
    "url": "https://www.axios.com/2025/06/17/trump-gabbard-iran-nuclear-weapon-testimony"
  },
  {
    "text": "Israel Built Its Case for War With Iran on New Intelligence.  The U.S. Didn't Buy It.  —  American spy agencies stand by their assessment that Iran hasn't decided to build a nuclear weapon, but Trump now says Tehran is ‘very close.’  —  WASHINGTON—Before launching its attack on Iran last week … ",
    "url": "https://www.wsj.com/world/middle-east/israel-built-its-case-for-war-with-iran-on-new-intelligence-the-u-s-didnt-buy-it-55592e81?st=n5AWnj&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump threatens Iran's supreme leader, escalating his rhetoric about the conflict  —  President Trump escalated his rhetoric against Iran on Tuesday, issuing a threat on social media against its Supreme Leader Ayatollah Ali Khamenei and taking credit for having “complete and total control of the skies over Iran.”",
    "url": "https://www.npr.org/2025/06/17/nx-s1-5436819/trump-iran-israel"
  },
  {
    "text": "Tucker Carlson and Trump are falling out over the Iran war  —  Tucker Carlson has been one of the right's loudest voices urging the United States to stay out of Israel's war with Iran — part of a broader effort to overturn the GOP's hawkish consensus.  —  But now, as tensions rise amid Israeli strikes … ",
    "url": "https://www.vox.com/politics/417085/trump-kooky-tucker-carlson-iran-israel"
  },
  {
    "text": "Senate overhauls Trump's tax bill, setting up brawl with the House  —  The chamber suggests cuts to the child tax credit and SALT and is more heavy-handed on cuts to Medicaid than the legislation the House passed in May.  —  Summary489  —  Senate Republicans on Monday suggested massive changes … ",
    "url": "https://www.washingtonpost.com/business/2025/06/16/trump-tax-bill-senate-republicans-child-tax-credit/"
  },
  {
    "text": "‘Have you no decency?’  Read the scathing letter a Minnesota US Senate staffer sent to Mike Lee  —  The deputy chief of staff for Sen. Tina Smith questioned if joking about the death of Melissa Hortman is a “successful day for Team Lee.”  —  After Utah Sen. Mike Lee promoted right-wing conspiracy theories … ",
    "url": "https://www.sltrib.com/news/politics/2025/06/16/minnesota-us-senate-staffer-sends/"
  },
  {
    "text": "Poll: GOP budget bill faces nearly 2-to-1 opposition, with many unaware  —  A plurality of voters oppose the tax-and-spending legislation, with mixed opinions on specific provisions, according to a Washington Post-Ipsos poll this month.  —  As Senate Republicans race to pass President Donald Trump's … ",
    "url": "https://www.washingtonpost.com/politics/2025/06/17/budget-bill-poll/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwMTMyODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUxNTE1MTk5LCJpYXQiOjE3NTAxMzI4MDAsImp0aSI6ImMyZjcxMGU0LTcyODItNGYzNS05ZjUyLTdlMWM4OTNlNmZjMSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA2LzE3L2J1ZGdldC1iaWxsLXBvbGwvIn0.DNW3wwZNxl6pEQNIsjcqfm0w6zwjtKZIdh3Gtx1TLiE"
  },
  {
    "text": "Trump ‘Reamed Out’ Hegseth for Flop Birthday Parade: Author  —  P***ED OFF  —  The president wanted a “menacing” military parade but got the opposite instead, Michael Wolff tells The Daily Beast Podcast.  —  President Donald Trump was unhappy with his sparsely attended military parade … ",
    "url": "https://www.thedailybeast.com/trump-reamed-out-hegseth-for-flop-birthday-parade-author/"
  },
  {
    "text": "Trump Says He Has No Plans to Call Walz After Shootings in Minnesota  —  “I think the governor of Minnesota is so whacked out, I'm not calling him,” the president told reporters.  —  President Trump said that he had no plans to call Gov. Tim Walz of Minnesota after a man assassinated … ",
    "url": "https://www.nytimes.com/2025/06/17/us/trump-walz-minnesota-shootings.html?unlocked_article_code=1.Pk8.psFO.Mf0s-9-hH66i&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump's pardons cost victims and taxpayers $1.3 billion, House Judiciary Committee Democrats' review says  —  President Trump's flurry of recent presidential pardons has cost crime victims and taxpayers approximately $1.3 billion in restitution and payments, according to a review by House Judiciary Democrats.",
    "url": "https://www.cbsnews.com/news/trumps-pardons-cost-victims-and-taxpayers-1-3-billion-house-judiciary-committee-democrats-review/"
  },
  {
    "text": "White House Eyes Rarely Used Power to Override Congress on Spending  —  The president's top aides have signaled they may seize on a timing quirk in law to cancel enacted funds, setting up a clash over the power of the purse.  —  The White House is signaling it may soon invoke a little-known … ",
    "url": "https://www.nytimes.com/2025/06/17/us/politics/trump-vought-congress-spending-rescission.html"
  },
  {
    "text": "How Ivermectin Became Right-Wing Aspirin  —  Once a suspect COVID treatment, now a cure for everything  —  Remember ivermectin?  The animal-deworming medication was used so avidly as an off-label COVID treatment during the pandemic that some feed stores ended up going out of stock.",
    "url": "https://www.theatlantic.com/health/archive/2025/06/ivermectin-miracle-drug-right-wing-aspirin/683197/?gift=201cWZnM2XBz2eP81zy0pHfe2zxXYHjzs1sF1yrfNwk&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Sarah McBride on Why the Left Lost on Trans Rights  —  This is an edited transcript of an episode of “The Ezra Klein Show.”  You can listen to the conversation by following or subscribing to the show on the NYT Audio App, Apple, Spotify, Amazon Music, YouTube, iHeartRadio or wherever you get your podcasts.",
    "url": "https://www.nytimes.com/2025/06/17/opinion/ezra-klein-podcast-sarah-mcbride.html?unlocked_article_code=1.Pk8.rwM3.0r-7xSoNnCpD&smid=url-share"
  },
  {
    "text": "FBI gives Congress intel on alleged Chinese plot to create fake mail-in ballots in 2020  —  Newly declassified intelligence report partially corroborated but was recalled before it could be fully investigated, officials say.  — Article  — Dig Deeper",
    "url": "https://justthenews.com/accountability/political-ethics/fbi-gives-congress-intel-alleged-chinese-plot-create-fake-mail"
  },
  {
    "text": "The White House Wants to Numb Voters to This  —  Trump portrays Democratic-led states and cities as un-American, aiming to normalize treating them like the enemy.  —  One major American city in turmoil was apparently insufficient for President Donald Trump.",
    "url": "https://www.bloomberg.com/opinion/articles/2025-06-17/the-white-house-wants-to-numb-voters-to-ice-chaos"
  },
  {
    "text": "H.R. 1, One Big Beautiful Bill Act (Dynamic Estimate)  —  As passed by the House of Representatives on May 22, 2025 … 383.21 KB  —  On This Page  —  H.R. 1, One Big Beautiful Bill Act  —  As passed by the House of Representatives on May 22, 2025  —  By Fiscal Year, Billions of Dollars",
    "url": "https://www.cbo.gov/publication/61486"
  },
  {
    "text": "Return of the American assassin  —  The right has no monopoly on violent fantasy, but liberals are far less likely to own guns  —  People are not always what they seem.  Vance Luther Boelter is a Christian preacher with a residential security company.  Last weekend he is suspected of killing … ",
    "url": "https://www.ft.com/content/e1720df9-1568-4623-a2b9-f4819a507218"
  },
  {
    "text": "Companies ask Supreme Court to quickly hear Trump tariffs challenge  —  Two toy companies are urging the justices to intervene so that they can hear oral arguments in the fall.  —  WASHINGTON — Two educational toy companies on Tuesday asked the Supreme Court to quickly take up their challenge … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/companies-ask-supreme-court-quickly-hear-trump-tariffs-challenge-rcna213530"
  },
  {
    "text": "Armed man arrested at Nashville's ‘No Kings’ protest had long fascination with Nazis, mass murder  —  Police visited Elijah Millar's home in April following tip from FBI's Joint Terrorism Task Force about his online activities, Murfreesboro police spokesperson says",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/confronting-hate/armed-man-arrested-at-nashvilles-no-kings-protest-had-long-fascination-with-nazis-mass-murder"
  },
  {
    "text": "California Cops Investigate ‘Immigration Protest’ With AI-Camera System  —  This article was primarily reported using public records requests.  We are making it available to all readers as a public service.  FOIA reporting can be expensive, please consider subscribing to 404 Media to support this work.",
    "url": "https://www.404media.co/california-cops-investigate-immigration-protest-with-ai-camera-system/"
  },
  {
    "text": "Centrist Identity Politics Is out of Control  —  Andrew Cuomo?  That guy again? … June 17, 2025  —  5:45 AM  —  The New York Times has sort of endorsed Andrew Cuomo in the race for New York City mayor, and you should consider this bad news—even if you don't live in New York City … ",
    "url": "https://slate.com/news-and-politics/2025/06/andrew-cuomo-new-york-times-new-york-mayoral-race-centrist-democrats.html"
  },
  {
    "text": "Family says baby delivered through C-section from Georgia mom who was declared brain dead  —  Family members said Adriana Smith will be taken off life support this week. … ATLANTA — The family of Adriana Smith, a metro Atlanta nurse who was declared brain dead in February while pregnant, said her baby boy has arrived.",
    "url": "https://www.11alive.com/article/news/health/adriana-smith-baby-born-life-support-update-brain-dead-nicu/85-1fb6595c-3966-4a50-993d-0e36e05cb256"
  }
]