[
  {
    "text": "Trump Has a Master Plan for Destroying the ‘Deep State’  —  I study government bureaucracies.  This is not normally a key political issue.  Right now, it is, and everyone should be paying attention.  —  Donald Trump, the former president and current candidate, puts it in apocalyptic terms … ",
    "url": "https://www.nytimes.com/2023/11/27/opinion/trump-deep-state-schedule-f.html"
  },
  {
    "text": "Trump Doesn't Want to Name His Experts in the Hush Money Case  —  Trump's lawyers and prosecutors at the Manhattan DA's office are battling over Trump's team naming who they plan to call to the stand in the upcoming hush money trial. … As the Manhattan District Attorney gears … ",
    "url": "https://www.thedailybeast.com/trump-doesnt-want-to-name-his-experts-in-the-stormy-daniels-hush-money-case"
  },
  {
    "text": "Trump is fighting an uphill battle in his fraud trial.  But it could be years before penalties kick in.  —  A verdict is expected in December.  Here's how the case is going — and what comes next.  —  NEW YORK — Two months into Donald Trump's civil fraud trial, the case does not seem to be going well for him.",
    "url": "https://www.politico.com/news/2023/11/27/trump-civil-fraud-trial-penalties-00128639"
  },
  {
    "text": "Scoop: Haberman, Swan sign deal for Trump book … Simon and Schuster won a furious competition for the deeply reported book by the two New York Times political correspondents.  — The publication date depends on what happens in 2024 — it'll be 2025 at the earliest.",
    "url": "https://www.axios.com/2023/11/27/scoop-haberman-swan-sign-deal-trump-book"
  },
  {
    "text": "Kushner's Mexican connection  —  Why do you think voters are responding to your message?  —  More and more Latinos are identifying themselves as conservatives.  Why do you think that is?  —  What do you think the current state of the economy is?  And are Americans better off today than they were three years ago?",
    "url": "https://popular.info/p/kushners-mexican-connection"
  },
  {
    "text": "Trump, Who Destroyed Roe, Thinks He Can Run As an Abortion ‘Moderate’ in 2024  —  The former president is privately declaring victory over his party's “extreme” anti-abortion crusaders, while publicly touting his record of stripping women's rights away  —  THE MAN WHO essentially ended … ",
    "url": "https://www.rollingstone.com/politics/politics-features/donald-trump-abortion-moderate-run-2024-election-1234893936/"
  },
  {
    "text": "Trump hints at expanded role for the military within the US.  A legacy law gives him few guardrails  —  WASHINGTON (AP) — Campaigning in Iowa this year, Donald Trump said he was prevented during his presidency from using the military to quell violence in primarily Democratic cities and states.",
    "url": "https://apnews.com/article/trump-military-insurrection-act-2024-election-03858b6291e4721991b5a18c2dfb3c36"
  },
  {
    "text": "Donations to GOP drop as worries mount about the party's finances  —  Donors have not cut as many large checks to the RNC in recent years, and the party's small-dollar program has also suffered  —  The Republican Party's finances are increasingly worrisome to party members … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/27/republican-party-finances-election/"
  },
  {
    "text": "Biden to Skip U.N. Climate Summit, White House Official Says  —  He has attended the past two summits and calls climate change “the ultimate threat” but will miss the talks that are set to begin in Dubai on Thursday.  —  President Biden will not attend a major United Nations climate summit … ",
    "url": "https://www.nytimes.com/2023/11/26/climate/biden-climate-cop28-dubai.html"
  },
  {
    "text": "From Niagara Falls to Texas to Gaza, a horrifying look into the abyss of a post-truth future  —  “There was truth and there was untruth, and if you clung to the truth even against the whole world, you were not mad.”  — George Orwell, 1984In the ever-shrinking world of a free and fair media … ",
    "url": "https://www.inquirer.com/opinion/commentary/free-press-right-wing-authoritarianism-20231126.html"
  },
  {
    "text": "Matt Gaetz Is Miraculously More Hated Than Ever in Congress  —  And that's saying something for a man who was under FBI investigation for allegedly sex-trafficking a minor. … In this unsettled moment on Capitol Hill, truth is relative, chaos reigns, and virtually nothing is for certain.",
    "url": "https://www.thedailybeast.com/matt-gaetz-is-miraculously-more-hated-than-ever-in-congress"
  },
  {
    "text": "COP28: UAE planned to use climate talks to make oil deals  —  The United Arab Emirates planned to use its role as the host of UN climate talks as an opportunity to strike oil and gas deals, the BBC has learned.  —  Leaked briefing documents reveal plans to discuss fossil fuel deals with 15 nations.",
    "url": "https://www.bbc.com/news/science-environment-67508331"
  },
  {
    "text": "‘This guy is a charlatan’: University of Florida turns against Joe Ladapo  —  Colleagues say the state surgeon general rarely is on campus and has “sullied” the reputation of the flagship school.  —  TALLAHASSEE, Fla. — Professors at the University of Florida had high hopes for Joseph Ladapo.",
    "url": "https://www.politico.com/news/2023/11/27/joe-ladapo-university-of-florida-00128541"
  },
  {
    "text": "When Peter Antonacci was stricken in governor's office he lay in hallway 24 minutes before anyone noticed  —  Peter Antonacci, Gov. Ron DeSantis's handpicked choice last year to lead the state's controversial new elections fraud office, collapsed and died in a hallway in the governor's office moments after … ",
    "url": "https://www.floridabulldog.org/2023/11/peter-antonacci-stricken-governors-office-lay-hallway-24-minutes-before-noticed/"
  },
  {
    "text": "Christie says he plans to stay in GOP race through convention  —  Former New Jersey Gov. Chris Christie said he plans to stay in the Republican primary race through next summer's nominating convention, dismissing a recent CNN poll that shows him trailing former President Donald Trump … ",
    "url": "https://www.cnn.com/2023/11/26/politics/chris-christie-republican-2024-haley-trump-cnntv/"
  }
]