[
  {
    "text": "Trump team seeks to delay federal election interference trial until 2026  —  Former President Donald Trump wants a federal judge to reject special counsel Jack Smith's request to get the trial underway in early January of next year.  —  WASHINGTON — Former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-lawyers-seeks-delay-federal-election-trial-2026-rcna100062"
  },
  {
    "text": "The many reasons prominent Democrats won't primary Biden  —  Sorry, Dean Phillips — squandering the incumbency advantage and dividing the party with a bruising primary is a terrible idea.  —  ∙ Paid … Over the past few weeks, Dean Phillips, a congressman from a purple-ish district … ",
    "url": "https://www.publicnotice.co/p/joe-biden-dean-phillips-2024-democratic-primary"
  },
  {
    "text": "‘Pathetic’: Voters of color slam Biden's performance on the economy  —  “Our economy is the lowest it's been.”  —  In a focus group last week, eight men of color who voted for President Joe Biden in 2020 were asked to describe their feelings about the economy.  —  The answers were bleak.",
    "url": "https://www.politico.com/news/2023/08/18/bidens-reelection-economy-voters-of-color-00111730"
  },
  {
    "text": "Pro-DeSantis super PAC debate memo stirs anger and confusion from fundraisers and donors  —  The apparent attempt by a super PAC supporting Florida Gov. Ron DeSantis to float potential debate talking points to the Republican's presidential campaign has stirred confusion and anger from fundraisers and donors, multiple sources told CNN.",
    "url": "https://www.cnn.com/2023/08/17/politics/desantis-super-pac-debate-memo/"
  },
  {
    "text": "Insight: Conservative think tank emerges as force behind DeSantis campaign  —  In mid-March, Florida Governor Ron DeSantis described the Ukraine war as a “territorial dispute” that was not of vital strategic interest to the United States, in a written reply to a questionnaire from Fox News host Tucker Carlson.",
    "url": "https://www.reuters.com/world/us/conservative-think-tank-emerges-force-behind-desantis-campaign-2023-08-18/"
  },
  {
    "text": "U.S. intelligence says Ukraine will fail to meet offensive's key goal  —  Thwarted by minefields, Ukrainian forces won't reach the southeastern city of Melitopol, a vital Russian transit hub, according to a U.S. intelligence assessment  —  The U.S. intelligence community assesses … ",
    "url": "https://www.washingtonpost.com/national-security/2023/08/17/ukraine-counteroffensive-melitopol/"
  },
  {
    "text": "Officials Investigate Threats Against Trump Grand Jurors in Georgia  —  Some of the jurors' identities have been shared on social media, with suggestions that they be harassed or made “infamous.”  —  Anna Betts and Nicholas Bogel-Burroughs reported from Atlanta.",
    "url": "https://www.nytimes.com/2023/08/17/us/trump-georgia-grand-jurors.html"
  },
  {
    "text": "Prosecutors seek 27 to 33 years in prison for Proud Boys guilty of seditious conspiracy  —  Enrique Tarrio, Joseph Biggs, Ethan Nordean and Zachary Rehl were all convicted of seditious conspiracy in May following a months-long trial that began in January.  —  WASHINGTON — Federal prosecutors … ",
    "url": "https://www.nbcnews.com/politics/justice-department/prosecutors-seek-30-years-prison-proud-boys-seditious-conspiracy-case-rcna100277"
  },
  {
    "text": "Rudy Giuliani Was Never 'America's Mayor'  —  On Monday, Rudy Giuliani was indicted in Georgia for his role in what prosecutors called a conspiracy to overturn the results of the 2020 presidential election in that state.  —  The district attorney for Fulton County, Fani Willis … ",
    "url": "https://www.nytimes.com/2023/08/18/opinion/rudy-giuliani-trump-authoritarianism.html"
  },
  {
    "text": "Kenneth Chesebro, alleged architect of fake electors' plot, followed Alex Jones around Capitol grounds on January 6th  —  When conspiracy theorist Alex Jones marched his way to the US Capitol on January 6, 2021, riling up his legion of supporters, an unassuming middle-aged man in a red “Trump 2020” hat conspicuously tagged along.",
    "url": "https://www.cnn.com/2023/08/18/politics/kfile-kenneth-chesebro-followed-alex-jones-capitol-riot-jan-6/"
  },
  {
    "text": "American democracy is cracking.  These forces help explain why.  —  Behind the sense that the political system is broken lies a collision between forces both old and new  —  In a country where the search for common ground is increasingly elusive, many Americans can agree on this … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/18/american-democracy-political-system-failures/"
  },
  {
    "text": "Ukraine's top Freedom Caucus ally gets cold feet  —  AN APPROPRIATOR LEANS OUT ON UKRAINE  —  ABINGDON, Md. — Standing in front of a PowerPoint presentation on the national debt, Rep. Andy Harris told his constituents it's about time to wind down direct U.S. aid to Ukraine.  —  “Is this more a stalemate?",
    "url": "https://www.politico.com/newsletters/huddle/2023/08/17/ukraines-top-freedom-caucus-ally-gets-cold-feet-00111608"
  },
  {
    "text": "Why San Francisco is make or break for Gavin Newsom  —  Newsom has increasingly been moonlighting as a quasi-city executive of his hometown and approaching its woes as a litmus test for his success in Sacramento.  —  SAN FRANCISCO — Gavin Newsom hasn't been mayor of San Francisco for more than a decade … ",
    "url": "https://www.politico.com/news/2023/08/18/san-francisco-gavin-newsom-homeless-00111777"
  },
  {
    "text": "Foreign National Sentenced to Over 21 Years for Mailing Ricin to President of the United States in 2020  —  For Immediate Release  —  Defendant Also Mailed Threatening Ricin Letters to Texas Law Enforcement Officials  —  Pascale Cecile Veronique Ferrier, 55, a dual citizen of Canada and France … ",
    "url": "https://www.justice.gov/opa/pr/foreign-national-sentenced-over-21-years-mailing-ricin-president-united-states-2020"
  },
  {
    "text": "Historic meeting of US, Japan and South Korea's leaders poised to usher in ‘new era’  —  The first of its kind summit will take place at Camp David.  —  The White House will bring together Japan and South Korea, two critical allies in the Pacific, on Friday for an unprecedented summit … ",
    "url": "https://abcnews.go.com/Politics/historic-meeting-us-japan-south-koreas-leaders-poised/story?id=102289964"
  },
  {
    "text": "GOP Georgia State Lawmaker Calls for Investigation Into Fani Willis  —  State Sen. Colton Moore quickly got the support of fellow Trump supporter Rep. Marjorie Taylor Greene  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/gop-georgia-state-lawmaker-calls-for-investigation-into-fani-willis"
  },
  {
    "text": "US approves sending F-16s to Ukraine from Denmark and Netherlands  —  The United States has approved sending F-16 fighter jets to Ukraine from Denmark and the Netherlands to defend against Russian invaders as soon as pilot training is completed, a U.S. official said on Thursday.",
    "url": "https://www.reuters.com/world/us-approves-sending-f-16s-ukraine-denmark-netherlands-2023-08-17/"
  },
  {
    "text": "CNN Pushes Kamala's False Claim About Florida Curriculum, Immediately Issues ‘Clarification’  —  CNN issued a clarification after pushing Vice President Kamala Harris' false claim about Florida's curriculum on black history.  —  Harris falsely accused the African American history curriculum of teaching how … ",
    "url": "https://dailycaller.com/2023/08/17/cnn-kamala-harris-florida-curriculum-black-history/"
  },
  {
    "text": "Electric cars face ‘punitive’ fees, new restrictions in many states  —  A growing number of conservative states are imposing new taxes on drivers using electric vehicle charging stations and trying to limit EV sales.  —  Electric vehicle drivers in Texas have started to get some bad news in the mail.",
    "url": "https://www.politico.com/news/2023/08/17/punitive-texas-other-states-roadblocks-ev-transition-00110125"
  },
  {
    "text": "Austrian Ex-Chancellor Kurz Indicted for False Testimony  — Kurz says he's ready to prove charges are false in court  — Former politician currently works as Thiel Capital strategist  —  Former Austrian Chancellor Sebastian Kurz was formally charged with providing false testimony … ",
    "url": "https://www.bloomberg.com/news/articles/2023-08-18/austrian-ex-chancellor-kurz-indicted-for-false-testimony"
  },
  {
    "text": "Hunter Biden stays close to father at White House amid criminal probe  —  A day after he reached a tentative plea deal with Justice Department, Hunter Biden began two-week stay at the White House, underscoring President Biden's fatherly attachment despite his son's troubles",
    "url": "https://www.washingtonpost.com/politics/2023/08/17/hunter-biden-investigation-white-house/"
  },
  {
    "text": "‘Tanning Mom’ Patricia Krentcil Announces Run For Florida Senate Seat  —  Krentcil attained internet infamy in 2012 after she was arrested for allegedly putting her 5-year-old daughter in a tanning booth.  —  LOADING  —  If a former reality show host like Donald Trump can be elected president … ",
    "url": "https://www.huffpost.com/entry/tanning-mom-patricia-krentcil-florida-senate_n_64de8aede4b0f4cf3ed72ed2"
  }
]