[
  {
    "text": "Federal appeals court denies Trump's presidential immunity defense in E. Jean Carroll case  —  The 2nd U.S. Circuit Court of Appeals found Trump's lawyers waited too long - three years - to try to use the defense for his upcoming civil trial.  —  A federal appeals court on Wednesday shot … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/federal-appeals-court-denies-trumps-presidential-immunity-defense-e-je-rcna129521"
  },
  {
    "text": "Trump Tries to Slow Down Appeals Court Review on ‘Presidential Immunity’  —  The former president's lawyers cited ‘How the Grinch Stole Christmas’ in a court filing on Wednesday arguing against a speedy briefing schedule … “The prosecution has one goal in this case: To unlawfully attempt to try … ",
    "url": "https://themessenger.com/politics/trump-appeals-court-review-presidential-immunity"
  },
  {
    "text": "Supreme Court will review scope of obstruction law that Trump is charged with breaking  —  The case calls into question prosecutors' handling of an Enron-era obstruction law to punish those who stormed Congress.  —  The Supreme Court has agreed to take up a case that could derail hundreds … ",
    "url": "https://www.politico.com/news/2023/12/13/supreme-court-will-review-scope-of-obstruction-law-that-trump-is-charging-with-breaking-00131514"
  },
  {
    "text": "House Set to Approve Biden Impeachment Inquiry as It Hunts for an Offense  —  Republicans are pushing forward with a formal investigation even though their yearlong scrutiny of the president and his family has turned up no proof of high crimes or misdemeanors.",
    "url": "https://www.nytimes.com/2023/12/13/us/politics/biden-impeachment-inquiry-house-vote.html"
  },
  {
    "text": "Hunter Biden, Defying Deposition Subpoena, Again Offers Public Testimony  —  The president's son appeared at a news conference at the Capitol as House investigators awaited him at a private session he declined to attend.  —  Hunter Biden, the president's son, appeared on Capitol Hill … ",
    "url": "https://www.nytimes.com/2023/12/13/us/politics/hunter-biden-impeachment-testimony.html"
  },
  {
    "text": "Supreme Court will decide access to key abortion drug mifepristone  —  The Supreme Court announced Wednesday that it will decide this term whether to limit access to a key abortion drug, returning the polarizing issue of reproductive rights to the high court for the first time since … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/13/abortion-drug-supreme-court-mifepristone-fda/"
  },
  {
    "text": "Supreme Court agrees to hear showdown over abortion pill access  —  In a high-stakes legal battle, the Biden administration is defending federal approval of the abortion pill mifepristone, including a recent move to make it available by mail.  —  WASHINGTON — The Supreme Court on Wednesday took … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-agrees-hear-showdown-abortion-pill-access-rcna128185"
  },
  {
    "text": "Tesla to Recall More Than Two Million Vehicles Over Autopilot Safety Concerns  —  Move follows two-year investigation by the National Highway Traffic Safety Administration  —  Tesla will recall more than two million vehicles over concerns over its Autopilot system, following a two-year probe … ",
    "url": "https://www.wsj.com/business/autos/tesla-recalls-more-than-two-million-vehicles-over-autopilot-safety-concerns-274eb6e6?mod=followamazon"
  },
  {
    "text": "US targets Hamas finances with new sanctions  —  The Treasury Department has imposed an additional round of sanctions aimed at Hamas.  —  Treasury's Office of Foreign Assets Control (OFAC) said the latest rounds of sanctions will target eight Hamas officials and facilitators who have … ",
    "url": "https://thehill.com/policy/international/4358235-us-targets-hamas-finances-new-sanctions/"
  },
  {
    "text": "André Braugher Dies: Star Of ‘Homicide: Life On The Street’, ‘Brooklyn Nine-Nine’ & Other Series And Films Was 61  —  Co-Editor-in-Chief, Film  — VIBE Editor-In-Chief Datwon Thomas Takes Executive Producer, Talent Post At Dick Clark Productions  — Mort Engelberg Dies … ",
    "url": "https://deadline.com/2023/12/andre-braugher-dead-homicide-life-on-the-street-brooklyn-nine-nine-actor-1235665513/"
  },
  {
    "text": "Contraception is a winning issue, conservative strategists tell GOP  —  Former Trump confidante Kellyanne Conway and other strategists are citing poll data showing strong demand among GOP voters for birth control after the fall of Roe.  —  Kellyanne Conway is going to Capitol Hill on Wednesday … ",
    "url": "https://www.politico.com/news/2023/12/13/kellyanne-conway-contraception-republicans-2024-00131410"
  },
  {
    "text": "Fani Willis Responds to GOP Backlash to Trump Case: ‘They Want to Come Up With This Foolishness’  —  ‘They worry the hero is treated the same as everybody else,’ the Fulton County, Georgia district attorney said  —  Fulton County, Ga., District Attorney Fani Willis is speaking up amid pushback … ",
    "url": "https://themessenger.com/politics/fani-willis-georgia-republican-senators-trump-case"
  },
  {
    "text": "We Were Told Biden Is Secretly Running the DOJ.  Why Is His Son Being Charged? … It has long been an article of faith on the right that Attorney General Merrick Garland is prosecuting Donald Trump because President Biden wants him to.  Even the Trump-skeptical corners … ",
    "url": "https://nymag.com/intelligencer/2023/12/bidens-justice-department-merrick-garland-independent-hunter-trump.html"
  },
  {
    "text": "Playbook: A protest that should worry Biden and Harris  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  IT'S A WRAP — “Climate summit makes ‘historic progress’ — but the world still can't quit oil,” by Karl Mathiesen, Zia Weise, Zack Colman … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/12/13/a-protest-that-should-worry-biden-and-harris-00131484"
  },
  {
    "text": "NASA rover unravels history of lake on Mars that grew up to 22 miles wide, 100 feet deep  —  NASA's Perseverance rover has learned new data about a major crater on Mars, teaching researchers and astronomers about how the structure was formed and when water was present on the planet.",
    "url": "https://www.cbsnews.com/news/nasa-rover-history-lake-mars-water-jezero-crater/"
  },
  {
    "text": "Inside the Troll Army Waging Trump's Online Campaign  —  A team of meme-makers has been flooding social media with pro-Trump posts riddled with sexist and racist tropes.  Donald Trump is cheering them on.  —  The video, called “Let's Get Ready to Bumble,” is a slick mash … ",
    "url": "https://www.nytimes.com/2023/12/13/us/politics/trump-meme-trolls-2024.html"
  },
  {
    "text": "Takeaways from CNN's Iowa town hall with Ron DeSantis  —  Florida Gov. Ron DeSantis on Tuesday showed new urgency in taking on Donald Trump, attacking the former president at every turn at a CNN town hall in Iowa with the state's caucuses less than five weeks away.",
    "url": "https://www.cnn.com/2023/12/12/politics/takeaways-desantis-town-hall/"
  },
  {
    "text": "‘Thank God they walked out’: Oregon's partisan divide highlights heightened animosity in statehouses  —  Republicans lawmakers in Oregon are banned from running for reelection after staging a six-week protest over guns, abortion and transgender issues.  —  Ten Oregon Republican senators … ",
    "url": "https://www.politico.com/news/2023/12/13/partisan-politics-oregon-walkout-00131348"
  },
  {
    "text": "Biden plans swing through South Carolina, in early glimpse at 2024 campaign  —  The state has been elevated to first in the Democratic primary.  —  In this Feb. 11, 2020 photo, Democratic presidential candidate, former Vice President Joe Biden, greets supporters after speaking at a campaign event in Columbia, S.C.",
    "url": "https://abcnews.go.com/Politics/biden-plans-swing-south-carolina-early-glimpse-2024/story?id=105625552"
  },
  {
    "text": "Ten soldiers, including two senior officers, killed in Gaza fighting and deadly ambush  —  9 troops of Golani Brigade, Air Force's Unit 669, killed in one of the deadliest incidents of ground offensive so far, taking toll to 115; combat engineer killed in separate clash",
    "url": "https://www.timesofisrael.com/ten-soldiers-including-two-senior-officers-killed-in-gaza-fighting-and-deadly-ambush/"
  }
]