[
  {
    "text": "The Washington Post's New Mission: Reach ‘All of America’  —  This week, The Post began trying out a new mission statement: “Riveting Storytelling for All of America.”  —  After Donald J. Trump entered the White House in 2017, The Washington Post adopted a slogan that underscored … ",
    "url": "https://www.nytimes.com/2025/01/16/business/media/the-washington-post-new-mission.html?unlocked_article_code=1.pk4.Ab-S.xYMT0tmhkUl8&smid=url-share"
  },
  {
    "text": "Pelosi not attending Trump inauguration  —  Former Speaker Nancy Pelosi (D-Calif.) will not be attending President-elect Trump's inauguration on Monday, her spokesperson confirmed to The Hill.  —  Pelosi returned to Washington earlier this month for the entrance of the new class of lawmakers … ",
    "url": "https://thehill.com/homenews/house/5089322-nancy-pelosi-trump-inauguration/"
  },
  {
    "text": "'Everyone's trying to kiss the ring': Trump's inauguration devours corporate cash, smashing records  —  Donations are flying in from some of the world's biggest companies — and though many have contributed before, the checks this year are bigger.  —  Donald Trump's first White House victory caught corporate America flat-footed.",
    "url": "https://www.politico.com/news/2025/01/16/trump-inauguration-corporate-donors-004242"
  },
  {
    "text": "A Euphoric Tech Industry Is Ready to Celebrate Trump and Itself  —  The elite of Silicon Valley are set to revel in their new clout during a long weekend of inaugural parties as President-elect Donald J. Trump is set to resume power.  —  A party at the Beaux-Arts mansion of the venture capitalist Peter Thiel.",
    "url": "https://www.nytimes.com/2025/01/16/us/politics/trump-tech-inauguration-parties.html?unlocked_article_code=1.pk4.RBH5.Oa0m4DY7KFu3&smid=url-share"
  },
  {
    "text": "Giuliani Keeps His Home in Settlement of Defamation Case  —  The former mayor of New York City was at risk of forfeiting his sole remaining home, a Palm Beach apartment, to election workers he defamed after the 2020 vote.  —  Rudolph W. Giuliani has reached a settlement with two Georgia election workers … ",
    "url": "https://www.nytimes.com/2025/01/16/nyregion/rudy-giuliani-defamation-damages-condo-rings.html?unlocked_article_code=1.pk4.0Bq1.gHNdRkKx3_CW&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Giuliani reaches tentative settlement with Georgia election workers  —  Attorneys for Rudy Giuliani and two former Georgia election workers said Thursday they have reached a tentative settlement, a remarkable twist that would end the workers' extensive litigation to collect their $146 million defamation judgment.",
    "url": "https://thehill.com/regulation/court-battles/5089853-giuliani-settlement-georgia-election-workers/"
  },
  {
    "text": "The Purge Has Begun  —  Your regular newsletter-er, Andrew Egger, is taking some much-deserved time off as he welcomes a new member of his family into the world.  Congrats, Egger!  But the news doesn't stop, even if Andrew has.  And, so, neither shall we.",
    "url": "https://www.thebulwark.com/p/the-purge-has-begun"
  },
  {
    "text": "Rep. Rick Crawford expected to serve as House Intelligence chair  —  Speaker Mike Johnson is expected to choose Rep. Rick Crawford (R-Ark.) as the next chair of the House Intelligence Committee, two people familiar with Johnson's intentions said.  Johnson on Wednesday removed former Chair Mike Turner … ",
    "url": "https://www.politico.com/live-updates/2025/01/16/congress/crawford-to-be-named-house-intel-chair-00198644"
  },
  {
    "text": "I knew one day I'd have to watch powerful men burn the world down - I just didn't expect them to be such losers  —  Elon Musk and Mark Zuckerberg's desperation to be cool as they suck up to Donald Trump is so cringe it makes my skin crawl  —  I don't know if anyone else has noticed … ",
    "url": "https://www.theguardian.com/commentisfree/2025/jan/16/i-knew-one-day-id-have-to-watch-powerful-men-burn-the-world-down-i-just-didnt-expect-them-to-be-such-losers"
  },
  {
    "text": "State senator arrested at Georgia Capitol while trying to enter House chamber  — A Georgia state senator has been arrested after trying to defy an order banning him from the House chambers.  — Sen. Colton Moore was banned from setting foot in the chamber after he made disparaging comments about late House Speaker David Ralston.",
    "url": "https://www.fox5atlanta.com/news/state-senator-colton-moore-arrest-house-chamber-ban"
  },
  {
    "text": "Far-right state senator arrested for trying to enter the Georgia House  —  State Sen. Colton Moore last year was banned from House chambers by the speaker.  —  A northwest Georgia senator was arrested Thursday after he refused to abide by a ban on entering the House chamber made by the speaker last year … ",
    "url": "https://www.ajc.com/politics/far-right-state-senator-detained-for-trying-to-enter-the-georgia-house/XPUPERQTCNANTI474T5P52CRSY/"
  },
  {
    "text": "Famed cartoonist with Bay Area ties arrested on child porn charges  —  Darrin Bell, 49, who got his start at UC Berkeley, was arrested in Sacramento County  —  A Pulitzer Prize-winning cartoonist with Bay Area ties has been arrested in Sacramento County on suspicion of child pornography.",
    "url": "https://www.nbcbayarea.com/news/california/cartoonist-arrested-child-porn/3762634/"
  },
  {
    "text": "You Blamed DEI for Hurting Your Career.  Now What?  —  For people who pin their failures on diversity, corporate America's DEI retreat removes a barrier—or maybe an excuse  —  I hear from them all the time.  —  “Add one more to your list of aggrieved white males,” a reader wrote to me recently.",
    "url": "https://www.wsj.com/lifestyle/careers/you-blamed-dei-for-hurting-your-career-now-what-6150c575"
  },
  {
    "text": "Biden or Trump - who should claim credit for the Gaza ceasefire deal?  —  Joe Biden says his team negotiated deal but Donald Trump claims it was agreed now only because he is about to become president  —  The question yelled at Joe Biden by a reporter was unapologetically blunt … ",
    "url": "https://www.theguardian.com/us-news/2025/jan/16/gaza-ceasefire-deal-hamas-israel-biden-trump-credit-press-conference"
  },
  {
    "text": "Treasury pick Scott Bessent and Trump transition team deny allegations that he avoided taxes  —  In a new memo obtained by NBC News, Senate Finance Democratic tax staff found that Scott Bessent avoided over $950,000 of self-employment taxes.  —  In a review of the Treasury Secretary nominee's tax returns … ",
    "url": "https://www.nbcnews.com/politics/congress/live-blog/senate-confirmation-hearings-trump-transition-live-updates-rcna186869/rcrd68705"
  },
  {
    "text": "Trump Taps Voight, Gibson, Stallone as Special Ambassadors to ‘Bring Back’ Hollywood  —  Trump claims Hollywood has fallen into disarray over the past four years because of “foreign countries,” so he's tapped the three actors as “special envoys” to revive “the Golden Age of Hollywood”",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-hollywood-special-ambassadors-voight-gibson-stallone-1235238089/"
  },
  {
    "text": "Meta Is Laying the Narrative Groundwork for Trump's Mass Deportations  —  With Meta's recent speech policy changes regarding immigration, in which the company will allow people to call immigrants pieces of trash, Mark Zuckerberg is laying the narrative groundwork for President-elect Trump's … ",
    "url": "https://www.404media.co/meta-is-laying-the-narrative-groundwork-for-trumps-mass-deportations-2/"
  },
  {
    "text": "Stephen Miller, Channeling Trump, Has Built More Power Than Ever … In less than a decade, Stephen Miller has risen from an anti-immigrant agitator on Capitol Hill to one of the most powerful unelected people in America.Doug Mills/The New York Times  —  When Stephen Miller met with Mark Zuckerberg … ",
    "url": "https://www.nytimes.com/2025/01/16/us/politics/stephen-miller-trump.html?unlocked_article_code=1.pk4.bIb0.BWyB-KWYxZ6u&smid=url-share"
  },
  {
    "text": "DeSantis picks Florida attorney general to replace Marco Rubio in Senate  —  Florida Gov. Ron DeSantis on Thursday said he would appoint Ashley Moody, his state's attorney general, to replace Marco Rubio in the Senate.  —  Florida Gov. Ron DeSantis on Thursday said he would appoint Ashley Moody … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/16/desantis-ashley-moody-senate-rubio/"
  },
  {
    "text": "Karine Jean-Pierre leaves reporters fuming as she blocks hostage-deal expert from final White House briefing for her ‘goodbye party’  —  WASHINGTON — Journalists and aides to President Biden are seething over White House press secretary Karine Jean-Pierre's refusal to let a national security expert discuss … ",
    "url": "https://nypost.com/2025/01/16/us-news/karine-jean-pierre-blocked-hostage-deal-expert-from-her-goodbye-party-white-house-briefing/"
  },
  {
    "text": "MAGA “populism” was always an inch deep — Trump's billionaire-palooza proves it  —  The entirety of Donald Trump's con artist schtick to bamboozle his followers was perfectly illustrated in one recent photograph.  In it, the president-elect sits grinning maniacally next to fellow rich white guy James Quincey, CEO of Coca-Cola.",
    "url": "https://www.salon.com/2025/01/16/tech-billionaires-expose-magas-populism-con-job/"
  },
  {
    "text": "Progressive Hill staff group pitches lighter workweek  —  As the second Donald Trump presidential term dawns, some progressive Capitol Hill staffers are floating a bold new proposal: working less.  The Congressional Progressive Staff Association proposed establishing a rotating 32-hour workweek … ",
    "url": "https://www.politico.com/live-updates/2025/01/16/congress/32-hour-capitol-hill-workweek-00198640"
  },
  {
    "text": "Judgment in Trump's New York fraud case stands at $502 million ahead of inauguration  —  Quietly, just before the calendar turned for the new year, an already whopping debt tentatively owed by President-elect Donald Trump and co-defendants in his New York civil fraud case hit an eye-popping … ",
    "url": "https://www.cbsnews.com/news/trump-new-york-fraud-case-502-million-inauguration/"
  },
  {
    "text": "The GOP Rivalry That Could Spell Big Trouble for Trump  —  With Donald Trump's agenda at stake, the top Republican leaders are divided on fundamental questions of strategy.  —  Ask Congress' top two leaders about each other, and you'll hear all the expected pleasantries — on the surface.",
    "url": "https://www.politico.com/news/magazine/2025/01/16/mike-johnson-john-thune-trump-agenda-rachael-bade-column-00198505"
  }
]