[
  {
    "text": "Scoop: Biden rebels in Congress see their revolt crumbling … - One shell-shocked lawmaker who was present at the meeting would offer only one word to characterize it: “Intense.”  — Another described the mood as “pretty much unanimous” that Biden has “got to step down,” adding … ",
    "url": "https://www.axios.com/2024/07/09/biden-house-democrats-withdraw-nominee"
  },
  {
    "text": "What happened the last time Democrats swapped out nominees in high-profile races  —  Analysis: Two Senate contests from two decades ago shed some light on the weighty decisions confronting Democrats amid their doubts about President Joe Biden.  —  Gauging the fallout from a potential Joe Biden withdrawal … ",
    "url": "https://www.nbcnews.com/politics/2024-election/steve-kornacki-democrats-swapped-nominees-senate-biden-rcna160855"
  },
  {
    "text": "Scoop: Senate GOP sees deep blue Maryland seat within reach … One survey from last month had Alsobrooks up 8% over Hogan.  — Maryland remains a deeply blue state that hasn't elected a Republican senator since 1980 so Hogan — despite his popularity and name ID— has an uphill battle to win the seat.",
    "url": "https://www.axios.com/2024/07/09/senate-republicans-maryland-larry-hogan"
  },
  {
    "text": "Senate Democrats stuck at Biden impasse … - Behind closed doors. … - Others who are skeptical that Biden can defeat Trump said the conversation was “constructive” but many remain unmoved. … - Sens. Bernie Sanders (I-Vt.) and Michael Bennet (D-Colo.) raised broad concerns … ",
    "url": "https://www.axios.com/2024/07/09/senate-democrats-stuck-at-biden-impasse"
  },
  {
    "text": "Poll finds Biden damaged by debate; with Harris and Clinton best positioned to win  —  Vice President Kamala Harris is now running ahead of Trump, 42 percent to 41 percent, the survey found.  —  A top Democratic pollster has a new survey showing President Joe Biden still in contention against Donald Trump … ",
    "url": "https://www.politico.com/news/2024/07/09/biden-clinton-harris-democrat-poll-00166937"
  },
  {
    "text": "July 2024 National Poll: Trump 46%, Biden 43%  —  Home Polls July 2024 National Poll: Trump 46%, Biden 43%  —  The latest Emerson College Polling survey finds former President Donald Trump leading President Joe Biden in a national matchup, 46% to 43%; 11% are undecided.",
    "url": "https://emersoncollegepolling.com/july-2024-national-poll-trump-46-biden-43/"
  },
  {
    "text": "How Biden's Inner Circle Worked to Keep Signs of Aging Under Wraps  —  Aides kept a tight rein on the president's travel plans, news conferences, public appearances and meetings with donors while Biden's stumbles became increasingly obvious",
    "url": "https://www.wsj.com/politics/policy/joe-biden-age-public-election-campaign-343a47bf"
  },
  {
    "text": "The Biden-Parkinson's mini-controversy, explained  —  One effect of Biden's poor debate performance?  New eagerness to uncover evidence of Biden's physical failings.  —  For some time, there had been little question that the White House was taking steps to protect President Biden from scrutiny.",
    "url": "https://www.washingtonpost.com/politics/2024/07/09/biden-debate-physical-issues/"
  },
  {
    "text": "Navy sailor tried to access Biden's medical records multiple times  —  A junior Navy sailor attempted to access the medical records of President Biden from a military medical database three times in February but was unable to do so, the U.S. Navy confirms to CBS News.",
    "url": "https://www.cbsnews.com/news/navy-sailor-tries-to-access-biden-medical-records/"
  },
  {
    "text": "The media has been breathlessly attacking Biden.  What about Trump?  —  The bigger story is Donald Trump's appalling unfitness for office.  He tried to overturn a legitimate election and is a felon  —  It's possible for two conflicting ideas to be true at once.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/09/biden-media-attacks-trump-felon"
  },
  {
    "text": "The Double Standard in Trump-Biden Coverage  —  It's real, and it's not going anywhere.  —  After President Joe Biden's disastrous recent public appearances, he and his supporters are attacking media outlets for a double standard in coverage of him and his opponent.",
    "url": "https://www.theatlantic.com/newsletters/archive/2024/07/the-double-standard-in-trump-biden-coverage/678943/"
  },
  {
    "text": "Trump rips Fox News over ‘fake’ polls: ‘I do better with CNN’  —  Former President Trump tore into Fox News on Tuesday over its coverage of a poll showing him beating President Biden in a head-to-head match-up but losing to Vice President Harris.  “FoxNews will put up Fake Confidential Democrat Polls … ",
    "url": "https://thehill.com/homenews/media/4762384-trump-rips-fox-news-polls-cnn/"
  },
  {
    "text": "Sonia Sotomayor saved from danger: Supreme Court Justice's bodyguard shoots gun-wielding suspect who tried to steal his car outside her DC home  — Kentrell Flowers, 18, of DC, was arrested and charged in the July 5 incident  — Attempted carjacking took place outside Justice Sonia Sotomayor's condo",
    "url": "https://www.dailymail.co.uk/news/article-13613159/Supreme-Court-Justice-Sonia-Sotomayors-bodyguards-shot-suspected-carjacker-DC.html"
  },
  {
    "text": "Former US Sen. Jim Inhofe, defense hawk who called human-caused climate change a ‘hoax,’ dies at 89  —  OKLAHOMA CITY (AP) — Former Sen. Jim Inhofe, a conservative firebrand known for his strong support of defense spending and his denial that human activity is responsible for the bulk of climate change, has died.",
    "url": "https://apnews.com/article/republican-senator-jim-inhofe-obit-2a3ac758737845c0aa2e05ae2036005b"
  },
  {
    "text": "Josh Hawley: 'I'm advocating Christian nationalism'  —  U.S. Senator Josh Hawley (R-MO) declared Monday he is advocating for Christian nationalism, a far-right ideology that claims there is no separation of church and state in the Constitution, and promotes as a national religion Christian fundamentalism … ",
    "url": "https://www.rawstory.com/josh-hawley-im-advocating-christian-nationalism/"
  },
  {
    "text": "House Freedom Caucus braces for an internal brawl  —  The leadership-bucking House Freedom Caucus is facing a watershed moment, as several internal clashes risk ripping the group apart.  The intense flare-up centers around the Monday night ouster of Rep. Warren Davidson (R-Ohio) … ",
    "url": "https://www.politico.com/live-updates/2024/07/09/congress/inside-the-freedom-caucus-blow-up-00167077"
  },
  {
    "text": "The alarming new power Trump will claim in a second term  —  Donald Trump says that if he returns to the White House in 2025, he will have the power to effectively cancel any federal program — or even an entire agency — by refusing to spend money appropriated by Congress.",
    "url": "https://popular.info/p/the-alarming-new-power-trump-will"
  }
]