[
  {
    "text": "Ronna McDaniel, R.N.C. Chairwoman, Plans to Step Down  —  Donald Trump is likely to back an election denier, Michael Whatley, the head of the North Carolina G.O.P., to replace her.  —  The chairwoman of the Republican National Committee, Ronna McDaniel, has told former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/02/06/us/politics/ronna-mcdaniel-rnc-trump.html"
  },
  {
    "text": "Trump has no immunity from Jan. 6 prosecution, appeals court rules  —  A federal appeals court has unanimously ruled that Donald Trump can be put on trial for trying to stay in power after losing the 2020 election, rejecting Trump's sweeping claim of presidential immunity and moving the case one step closer to a jury.",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/02/06/trump-jan-6-immunity-appeal-denied/"
  },
  {
    "text": "Trump is not immune from prosecution in his 2020 election interference case, US appeals court says  —  WASHINGTON (AP) — A federal appeals panel ruled Tuesday that Donald Trump can face trial on charges that he plotted to overturn the results of the 2020 election, rejecting the former president's claims … ",
    "url": "https://apnews.com/article/trump-capitol-riot-presidential-immunity-appeal-46c2d7fc7807cd3262764d35e47f390e"
  },
  {
    "text": "Accountant's Apparent Lies Further Dooms Trump's Bank Fraud Defense  —  Trump accountant Allen Weisselberg is apparently working out a deal addressing lies he told on the stand in the New York bank fraud trial.  Now Trump is in even more trouble.  —  Donald Trump's expected massive loss … ",
    "url": "https://www.thedailybeast.com/judge-demands-trump-explain-his-accountant-allen-weisselbergs-apparent-lies"
  },
  {
    "text": "D.C. Circuit panel unanimously rejects Trump's criminal immunity claim  —  On Tuesday morning, a three-judge panel of the U.S. Court of Appeals for the D.C. Circuit unanimously rejected Donald Trump's claims that he is immune from criminal prosecution for life for acts he took while president.",
    "url": "https://www.lawdork.com/p/dc-circuit-immunity-ruling-trump"
  },
  {
    "text": "In stunner, House GOP bid to impeach Mayorkas fails  —  A House GOP effort to impeach Homeland Security Secretary Alejandro Mayorkas failed in embarrassing fashion Tuesday as three Republicans joined Democrats in voting against what would have been the second-ever impeachment of a Cabinet official.",
    "url": "https://thehill.com/homenews/house/4452038-in-stunner-house-gop-bid-to-impeach-mayorkas-fails/"
  },
  {
    "text": "Mayorkas Impeachment Vote  —  House to Vote on Impeaching Mayorkas Over Border Crisis  —  Republicans in the slim majority say the homeland security secretary has willfully refused to enforce border laws and breached the public trust.  —  Here's the latest on the impeachment vote.",
    "url": "https://www.nytimes.com/live/2024/02/06/us/mayorkas-impeachment"
  },
  {
    "text": "GOP-led standalone Israel aid bill fails in the House  —  The House on Tuesday failed to pass a standalone package for $17.6 billion in Israel aid amid opposition from both Republicans and Democratic leaders.  —  Because of resistance among members of the conservative House Freedom Caucus … ",
    "url": "https://www.cnn.com/2024/02/06/politics/house-vote-israel-aid-package/"
  },
  {
    "text": "N.H. attorney general says he found source of fake Biden robocalls  —  New Hampshire's top law enforcement official said, “We have never seen...such a blatant attempt to mislead voters.”  —  New Hampshire's Attorney General on Tuesday named a Texas telecom company as the source … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nh-attorney-general-says-found-source-fake-biden-robocalls-rcna137499"
  },
  {
    "text": "A 7,000-Pound Car Smashed Through a Guardrail.  That's Bad News for All of Us.  —  It's a nightmare situation on a highway: Your car hits a patch of ice and starts to skid.  Unable to regain control, you panic as you veer toward the roadway's edge.  —  In emergencies like this, guardrails provide a failsafe.",
    "url": "https://slate.com/business/2024/02/car-safety-guardrails-bloat-electric-vehicles.html"
  },
  {
    "text": "JPL Workforce Update  —  Workforce statement and memo to employees. … - I am directing most employees to work from home tomorrow, Wednesday, February 7, so everyone can be in a safe, comfortable environment on a stressful day. … - Tomorrow, leadership (mostly at the Division and Directorate level) … ",
    "url": "https://www.jpl.nasa.gov/news/jpl-workforce-update"
  },
  {
    "text": "Former State Department security officer arrested on Jan. 6 charges  —  A former U.S. State Department security officer was arrested Tuesday after being identified as having been at the Capitol during the Jan. 6, 2021, insurrection. … - Investigators identified him using Google location data … ",
    "url": "https://www.axios.com/2024/02/07/state-department-security-officer-arrested-jan-6"
  },
  {
    "text": "DOJ report on Biden classified documents coming soon; no criminal charges  —  The special counsel report criticizes how Biden and aides handled sensitive material after his vice presidency but says those actions don't amount to crimes  —  The Justice Department is preparing to release … ",
    "url": "https://www.washingtonpost.com/national-security/2024/02/06/biden-classified-documents-probe/"
  },
  {
    "text": "Not wearing a mask during COVID-19 health emergency isn't a free speech right, appeals court says  —  A federal appeals court has shot down claims that there's a First Amendment right not to wear face masks during the COVID-19 outbreak  —  TRENTON, N.J. — A federal appeals court shot … ",
    "url": "https://abcnews.go.com/Health/wireStory/wearing-mask-covid-19-health-emergency-isnt-free-106996447"
  },
  {
    "text": "Project Veritas, James O'Keefe settle suit over false claims of 2020 voter fraud in Pennsylvania  —  Project Veritas and conservative activist James O'Keefe have settled a lawsuit in Pennsylvania over false claims about voter fraud in the 2020 presidential election that were initially … ",
    "url": "https://thehill.com/regulation/court-battles/4451745-project-veritas-james-okeefe-settle-suit-over-false-claims-of-2020-voter-fraud-in-pennsylvania/"
  },
  {
    "text": "Taylor Swift threatens legal action against student who tracks her jet  —  The superstar's effort to keep the tracker accounts from posting her plane's takeoffs and landings recalls Elon Musk's banning of a similar account.  —  Taylor Swift's attorneys have threatened legal action … ",
    "url": "https://www.washingtonpost.com/technology/2024/02/06/taylor-swift-jet-tracking-legal-threat/"
  },
  {
    "text": "Rigger falls to death during production of Marvel's ‘Wonder Man’  —  The incident occurred Tuesday at the Radford Studio Center in Studio City, California.  —  LOS ANGELES — A rigger died after falling from rafters Tuesday during the production of Marvel Studios' “Wonder Man” in California, an official confirmed.",
    "url": "https://www.nbcnews.com/news/us-news/rigger-falls-death-production-marvels-wonder-man-rcna137598"
  },
  {
    "text": "Donald Trump paid more than $2.3 million in donor money to law firms helping Ivanka Trump with her legal problems last year  — A PAC controlled by Donald Trump paid millions of dollars to a law firm representing Ivanka Trump.  — Firms representing Ivanka in the NY Attorney General's lawsuit … ",
    "url": "https://www.businessinsider.com/donald-trump-pac-gave-millions-donor-money-lawyer-ivanka-2024-2"
  }
]