[
  {
    "text": "Senate Confirms Emil Bove, Trump's ‘Enforcer,’ To A Lifetime Federal Judgeship  —  Bove faced credible allegations of telling DOJ attorneys to defy court orders.  Republicans confirmed him to a seat on a U.S. appeals court anyway.  —  WASHINGTON — Senate Republicans on Tuesday confirmed Emil Bove … ",
    "url": "https://www.huffpost.com/entry/senate-confirms-emil-bove-trump-judge_n_6883c652e4b09c928ae1cea0"
  },
  {
    "text": "Senate confirms Trump lawyer Emil Bove for appeals court, pushing past whistleblower claims  —  The Senate confirmed former Trump lawyer Emil Bove 50-49 for a lifetime appointment as a federal appeals court judge Tuesday as Republicans dismissed whistleblower complaints about his conduct at the Justice Department.",
    "url": "https://apnews.com/article/emil-bove-confirmation-whistleblowers-trump-republicans-democrats-71f92822cb2e8d57387748c2451fa724"
  },
  {
    "text": "Republicans confirm former Trump lawyer Emil Bove to lifetime appeals court perch  —  Senate Republicans backed Bove despite allegations from three whistleblowers about his conduct as an official at the Justice Department.  —  WASHINGTON — The Republican-led Senate voted Tuesday … ",
    "url": "https://www.nbcnews.com/politics/congress/senate-confirms-trump-nominee-emil-bove-appeals-court-whistleblowers-rcna221781"
  },
  {
    "text": "Emil Bove Confirmed: How Senate Democrats' Cowardice Made It Possible  —  On Tuesday evening, the Senate voted to confirm Emil Bove, President Donald Trump's criminal defense attorney-turned-Justice Department hatchetman, to a life-tenured judgeship on the U.S. Court of Appeals for the Third Circuit.",
    "url": "https://ballsandstrikes.org/nominations/emil-bove-confirmed-adeel-mangi-senate-democrats/"
  },
  {
    "text": "Bove misled lawmakers about his actions in NYC mayor case, evidence suggests  —  The details from a whistleblower complaint emerged hours before a final vote on Bove's nomination to a federal judgeship.  —  Emil Bove misled lawmakers in his confirmation hearings for a federal judgeship … ",
    "url": "https://www.washingtonpost.com/investigations/2025/07/29/emil-bove-nyc-mayor-adams-whistleblower/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzNzYxNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1MTQzOTk5LCJpYXQiOjE3NTM3NjE2MDAsImp0aSI6IjJlNWQwZjE4LWE0ZDgtNDA5NS1iYmVjLTJhMGY3ZDJhZmIxYSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbnZlc3RpZ2F0aW9ucy8yMDI1LzA3LzI5L2VtaWwtYm92ZS1ueWMtbWF5b3ItYWRhbXMtd2hpc3RsZWJsb3dlci8ifQ.PecXEmIMjaxNIRReLVRJffccKQAzWD9Sfz5M0LqverE&itid=gfta"
  },
  {
    "text": "Trump says Epstein ‘stole’ underage victim Virginia Giuffre from his Mar-a-Lago spa leading to feud  —  President tells reporters he cut off contact with Epstein because he was poaching employees from his club … President Donald Trump on Tuesday said he ended his friendship … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-epstein-virginia-giuffre-mar-a-lago-b2798336.html"
  },
  {
    "text": "Trump says Epstein ‘stole’ Virginia Giuffre, a heartless and revealing admission  —  Virginia Giuffre died by suicide only three months ago, having lived much of her life as an advocate for survivors of sex trafficking.  Now the president is speaking about her like she's property.",
    "url": "https://www.usatoday.com/story/opinion/columnist/2025/07/29/trump-virginia-giuffre-epstein-mar-a-lago/85431490007/"
  },
  {
    "text": "Did Trump Just Confess He Learned about Virginia Giuffre before Jeffrey Epstein Recruited Someone Else at Mar-a-Lago?  —  Update: In a Gaggle today, Trump did just confess this is about Giuffre and others. … Video  —  Yesterday, Donald Trump offered an entirely new explanation for his falling … ",
    "url": "https://www.emptywheel.net/2025/07/29/did-trump-just-confess-he-learned-about-virginia-giuffre-before-jeffrey-epstein-recruited-someone-else-at-mar-a-lago/"
  },
  {
    "text": "Trump Administration Puts New Chokehold on Billions in Health-Research Funding  —  The National Institutes of Health can't award grants to outside researchers under new White House restriction  —  The Trump administration is blocking all funding that flows to outside health researchers … ",
    "url": "https://www.wsj.com/politics/policy/trump-administration-puts-new-chokehold-on-billions-in-health-research-funding-19660215?st=YWVyJH&reflink=desktopwebshare_permalink"
  },
  {
    "text": "170. DOJ's (Ridiculous) Misconduct Complaint Against Chief Judge Boasberg  —  DOJ's complaint that Chief Judge Boasberg engaged in “misconduct” would be laughably stupid if it didn't reflect such a transparently obvious and dangerous attempt to delegitimize the federal courts.",
    "url": "https://www.stevevladeck.com/p/170-dojs-ridiculous-misconduct-complaint"
  },
  {
    "text": "CBS News investigation of Jeffrey Epstein jail video reveals new discrepancies  —  In the weeks after Jeffrey Epstein died at the Metropolitan Correctional Center in lower Manhattan, in August 2019, then-Attorney General William Barr said his “personal review” of surveillance footage clearly showed … ",
    "url": "https://www.cbsnews.com/news/jeffrey-epstein-jail-video-investigation/"
  },
  {
    "text": "Pete Hegseth has discussed running for political office in Tennessee, sources say  —  The defense secretary has talked privately about running a campaign in Tennessee, sources told NBC News.  The Pentagon said Hegseth's “focus remains solely on serving under” Trump.",
    "url": "https://www.nbcnews.com/politics/trump-administration/pete-hegseth-discussed-running-political-office-tennessee-rcna221681"
  },
  {
    "text": "In Game-Changing Climate Rollback, E.P.A. Aims to Kill a Bedrock Scientific Finding  —  The proposal is President Trump's most consequential step yet to derail federal climate efforts and appears to represent a shift toward outright denial of the scientific consensus.",
    "url": "https://www.nytimes.com/2025/07/29/climate/epa-endangerment-finding-repeal-proposal.html?unlocked_article_code=1.aE8.j8uO.USy71N3ICS_J&smid=url-share"
  },
  {
    "text": "Top F.D.A. Official Resigns Under Pressure  —  After turning down several new drugs and restricting use of another, Dr. Vinay Prasad drew the ire of the right-wing influencer Laura Loomer and others.  —  The Food and Drug Administration's top vaccine and gene therapy official resigned … ",
    "url": "https://www.nytimes.com/2025/07/29/health/vinay-prasad-fda-resigns-loomer.html"
  },
  {
    "text": "Sydney Sweeney, American Eagle and the Evolution of Language  —  Have you heard the rumor that the clothing company American Eagle is using racist propaganda to sell clothing?  That's the allegation that bubbled up on social media in response to the company's new ad campaign featuring the actress Sydney Sweeney and a pun.",
    "url": "https://www.nytimes.com/2025/07/29/opinion/sydney-sweeney-american-eagle-ad.html"
  },
  {
    "text": "Maxwell offers to testify before Congress but with major conditions, including immunity  —  Jeffrey Epstein accomplice Ghislaine Maxwell has offered to testify before Congress, but with major conditions, including immunity, according to a list of her demands sent to the House Oversight Committee by her attorneys.",
    "url": "https://cnn.com/2025/07/29/politics/maxwell-conditions-congressional-testimony"
  },
  {
    "text": "8.8-magnitude earthquake in Russia's Far East sets off tsunami warnings in Japan, Alaska and Hawaii  —  One of the world's strongest earthquakes struck Russia's Far East early Wednesday, an 8.8-magnitude temblor that set off a tsunami in the northern Pacific region and prompted warnings for Alaska, Hawaii and south toward New Zealand.",
    "url": "https://apnews.com/article/japan-russia-kamchatka-earthquake-tsunami-warning-a88cbe8a1e985cff54dc0ad849ea5ddb"
  },
  {
    "text": "Top Generals Nominated for New Positions Must Now Meet With Trump  —  The move is a departure from past practice and has raised worries that it could lead to the politicization of the military's top ranks.  —  Defense Secretary Pete Hegseth has begun requiring that nominees … ",
    "url": "https://www.nytimes.com/2025/07/29/us/politics/generals-trump.html"
  },
  {
    "text": "Trump's Trade Deals Come With Few Details to Flesh Out Big Numbers  —  President Donald Trump's flurry of trade deal announcements are so far proving light on detail — with key aspects still under negotiation, partners giving mixed signals about what they signed up for, and big numbers shrinking under scrutiny.",
    "url": "https://www.bloomberg.com/news/articles/2025-07-29/trump-trade-deals-come-with-few-details-to-flesh-out-big-numbers"
  },
  {
    "text": "Justice Department Finds the University of California-Los Angeles in Violation of Federal Civil Rights Law  —  For Immediate Release  —  Today, the U.S. Department of Justice's Civil Rights Division announced that the University of California, Los Angeles (UCLA) violated the Equal Protection Clause … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-finds-university-california-los-angeles-violation-federal-civil-rights"
  },
  {
    "text": "Joe Rogan's friends followed him to Texas.  They all seem to hate it.  —  From the heat to the state's power grid, Joe Rogan's friends are learning that Texas isn't what they were promised.  —  In 2020, Joe Rogan moved from Los Angeles to Austin after visiting and realizing he didn't have to wear a mask at a restaurant.",
    "url": "https://www.chron.com/culture/celebrities/article/joe-rogan-friends-austin-texas-20790258.php"
  },
  {
    "text": "Portrait of a Young DOGE Coder Dismantling America's Institutions",
    "url": "https://www.bloomberg.com/features/2025-luke-farritor-doge/"
  },
  {
    "text": "Zohran Mamdani's Campaign Is ‘Taking Steps’ in Case He Gets Hassled Reentering U.S.  —  Zohran Mamdani is set to return from his post-primary vacation in Uganda on Wednesday, and his campaign is bracing for a possible confrontation at John F. Kennedy airport upon his arrival.",
    "url": "https://nymag.com/intelligencer/article/zohran-mamdani-customs-jfk-trump.html"
  }
]