[
  {
    "text": "Muslims who voted for Trump upset by his pro-Israel cabinet picks  —  U.S. Muslim leaders who supported Republican Donald Trump to protest against the Biden administration's support for Israel's war on Gaza and attacks on Lebanon have been deeply disappointed by his Cabinet picks, they tell Reuters.",
    "url": "https://www.reuters.com/world/us/muslims-who-voted-trump-upset-by-his-pro-israel-cabinet-picks-2024-11-15/"
  },
  {
    "text": "Trump Pentagon pick had been flagged by fellow service member as possible ‘Insider Threat’  —  Pete Hegseth, the Army National Guard veteran and Fox News host nominated by Donald Trump to lead the Department of Defense, was flagged as a possible “Insider Threat” by a fellow service member due … ",
    "url": "https://apnews.com/article/trump-defense-department-pentagon-hegseth-fox-news-8cd9f065e54a7cbbaceeec8bae9261a6"
  },
  {
    "text": "The Memo: Trump spoils for a fight with controversial Cabinet picks  —  President-elect Trump is spoiling for a fight as he chooses the members of his incoming administration.  —  Provocative picks from Trump keep coming.  —  The four most prominent so far are former Rep. Matt Gaetz … ",
    "url": "https://thehill.com/homenews/campaign/4993842-trump-admin-nominees-controversial/"
  },
  {
    "text": "Under the Chandelier at Mar-a-Lago, Trump Makes Picks at Breakneck Speed  —  President-elect Donald J. Trump is more contemptuous than ever of Washington expertise and determined to hire people based on loyalty.  —  President-elect Donald J. Trump chose his attorney general almost on a whim … ",
    "url": "https://www.nytimes.com/2024/11/16/us/politics/trump-transition-picks.html"
  },
  {
    "text": "Washington's lobbyists are stunned Trump chose RFK Jr.  —  They're holding their fire and hoping Senate allies will block his confirmation as HHS secretary.  —  Lobbyists expecting a more conventional pick to lead the government's $3 trillion health agency than Robert F. Kennedy Jr. … ",
    "url": "https://www.politico.com/news/2024/11/15/industry-rfk-donald-trump-hhs-00189674"
  },
  {
    "text": "The boys in our liberal school are different now that Trump has won  —  Anonymous  —  Subtle high-fives were exchanged and remarks about the impending success of the next four years were whispered around  —  When we walked into school on the morning of 6 November, we exchanged quick glances … ",
    "url": "https://www.theguardian.com/commentisfree/2024/nov/15/the-boys-in-our-liberal-school-are-different-now-that-trump-has-won"
  },
  {
    "text": "Trump picks Karoline Leavitt to be youngest White House press secretary in history  —  President-elect Donald Trump has selected longtime aide and media personality Karoline Leavitt to be his White House press secretary and carry the message of his administration publicly as he returns to the Oval Office.",
    "url": "https://www.npr.org/2024/11/15/g-s1-34514/trump-karoline-leavitt-press-secretary-white-house-spokesperson"
  },
  {
    "text": "Trump Names Karoline Leavitt as His White House Press Secretary  —  Ms. Leavitt, 27, who served as his campaign's press secretary and worked in the White House during his first administration, will be the youngest person ever to assume the role.  —  President-elect Donald J. Trump announced … ",
    "url": "https://www.nytimes.com/2024/11/15/us/politics/karoline-leavitt-trump-white-house-press-secretary.html"
  },
  {
    "text": "Scoop: House Dems sick of Pelosi … - “She needs to take a seat,” said one senior Democratic lawmaker.  — “Making scattershot comments is not just unhelpful, it's damaging,” said the lawmaker. … - Both lawmakers insisted on anonymity.  — Pelosi still instills fear in the members she led for two decades.",
    "url": "https://www.axios.com/2024/11/15/pelosi-democrats-jeffries-2024-election-congress"
  },
  {
    "text": "Exclusive: Woman told House Ethics panel she witnessed Gaetz having sex with minor, lawyer says  —  Matt Gaetz resigned from Congress Wednesday after Trump picked him for AG.  —  Representative from Florida Matt Gaetz speaks during the third day of the 2024 Republican National Convention … ",
    "url": "https://abcnews.go.com/US/exclusive-woman-told-house-ethics-panel-witnessed-gaetz/story?id=115897603"
  },
  {
    "text": "Issue 70 - The Cryptocurrency States of America  —  Crypto's efforts to buy the 2024 elections paid off, and we're in for a bumpy ride.  —  1×  —  As you might have already heard, Donald Trump was recently elected to be the next president of the United States.",
    "url": "https://www.citationneeded.news/issue-70/"
  },
  {
    "text": "What to Do Before the Trump Administration Takes Office in January  —  Nearly four years after he left office amid a violent burst, Donald Trump has been reelected and will become the next president of the United States.  For many marginalized people, a second Trump administration, which begins in January, is a looming threat.",
    "url": "https://www.teenvogue.com/story/what-to-do-before-the-trump-administration-takes-office-in-january"
  },
  {
    "text": "Speaker Johnson urges Ethics panel not to release Gaetz report  —  Speaker Mike Johnson (R-La.) is urging the House Ethics Committee to not release its investigation of former Rep. Matt Gaetz (R-Fla.), as pressure mounts on the panel to publish its findings about the Florida Republican … ",
    "url": "https://thehill.com/homenews/house/4992964-house-ethics-report-gaetz/"
  },
  {
    "text": "FBI Statement Regarding Offensive Text Messages  —  The FBI is aware of the offensive and racist text messages sent to African American and Black communities around the country and is in contact with the Justice Department and other federal authorities on the matter.",
    "url": "https://www.fbi.gov/news/press-releases/fbi-statement-regarding-offensive-text-messages"
  },
  {
    "text": "John Fetterman says Democrats need to stop ‘freaking out’ over everything Trump does  —  The Pennsylvania senator spoke to NBC News about what went wrong for his party in 2024 and how it should approach the future Trump administration.  —  In the closing weeks of the presidential campaign … ",
    "url": "https://www.nbcnews.com/politics/2024-election/john-fetterman-says-democrats-need-stop-freaking-everything-trump-rcna180270"
  },
  {
    "text": "Right-wing provocateur uses racist language testifying against gun legislation  —  A right-wing provocateur testifying against legislation expanding a firearms ban to lawmakers' offices used a racial slur during a Senate committee hearing Thursday as he falsely accused lawmakers of attacking … ",
    "url": "https://www.freep.com/story/news/politics/2024/11/14/right-wing-provocateur-used-racial-slur-at-gun-hearing/76300868007/"
  },
  {
    "text": "Announcing social.freedom.press: Our new home on the fediverse  —  Freedom of the Press Foundation (FPF) has launched its own dedicated Mastodon server, social.freedom.press.  This move consolidates our presence across the fediverse, uniting various existing FPF accounts under one umbrella.",
    "url": "https://freedom.press/about/announcements/our-new-home-on-the-fediverse/"
  },
  {
    "text": "Rudy Giuliani makes a down payment on $148M judgment  —  He turns over his car but wants to keep DiMaggio jersey.  —  NEW YORK — Rudy Giuliani surrendered a Mercedes-Benz, watches and a ring on Friday to two Georgia election workers who successfully sued him for defamation … ",
    "url": "https://www.politico.com/news/2024/11/15/rudy-giuliani-down-payment-00189990"
  },
  {
    "text": "Malcolm X estate alleges DOJ, FBI, CIA, NYPD played role in events leading to assassination  —  The estate of Malcolm X is suing the federal government, accusing it of playing a role in the 1965 assassination of the civil rights leader.  —  In a lawsuit filed against the Department of Justice … ",
    "url": "https://thehill.com/homenews/race-politics/4992858-malcom-x-assassination-doj-fbi-cia-nypd/"
  },
  {
    "text": "Scoop: McCaul's exit from Foreign Affairs leadership sets up succession race … - “Out of respect for [conference] rules and a desire to see future leaders rise from our conference, I have decided not to pursue another term as chairman,” McCaul told Axios in a statement.",
    "url": "https://www.axios.com/2024/11/15/mccaul-foreign-affairs-leadership-as-succession-race"
  },
  {
    "text": "T-Mobile Hacked in Massive Chinese Breach of Telecom Networks  —  Carrier joins growing list of known victims, including AT&T and Verizon, of the major Chinese spying operation  —  T-Mobile's network was among the systems hacked in a damaging Chinese cyber-espionage operation … ",
    "url": "https://www.wsj.com/politics/national-security/t-mobile-hacked-in-massive-chinese-breach-of-telecom-networks-4b2d7f92?st=qsuuML&reflink=article_copyURL_share"
  },
  {
    "text": "Pentagon fails 7th audit in a row but says progress made  —  The Pentagon on Friday failed its seventh audit in a row, with the nation's largest government agency still unable to fully account for its more than $824 billion budget, though officials stress they are making good progress toward a clean audit in 2028.",
    "url": "https://thehill.com/policy/defense/4992913-pentagon-fails-7th-audit-in-a-row-but-says-progress-made/"
  },
  {
    "text": "Trump Considers Fox Business Host Larry Kudlow for Top Economic Jobs  —  Former National Economic Council director had met with Trump at Mar-a-Lago this week  —  Donald Trump appeared to be nearing a decision on his nominee to lead the Treasury Department, as he was meeting Friday … ",
    "url": "https://www.wsj.com/politics/larry-kudlow-economic-role-trump-cabinet-3af2a446"
  },
  {
    "text": "Trump allies lobby him to fire FBI director early and install loyalist Kash Patel  —  Donald Trump is weighing a push from right-wing allies to nominate Kash Patel to lead the FBI, one of the clearest indications the president-elect plans to stick by his vow to fire Director Christopher Wray … ",
    "url": "https://www.cnn.com/2024/11/15/politics/kash-patel-donald-trump-fbi-director-christopher-wray/"
  },
  {
    "text": "Musk's X Sues to Block California's Deepfake Deception Act  —  Elon Musk's social media platform X sued to block a California law aimed at curbing AI-generated deceptive election content on social media, claiming the measure is an unconstitutional affront to free speech.",
    "url": "https://www.bloomberg.com/news/articles/2024-11-15/musk-s-x-sues-to-block-california-s-deepfake-deception-act"
  }
]