[
  {
    "text": "Tom Emmer endorses Trump in unified show of support from top four House Republicans  —  EXCLUSIVE — House Majority Whip Tom Emmer (R-MN) endorsed former President Donald Trump in the 2024 Republican primary, giving him the endorsement of the top four House Republicans going into the Iowa caucus later this month.",
    "url": "https://www.washingtonexaminer.com/news/house/tom-emmer-endorses-donald-trump"
  },
  {
    "text": "Biden campaign amps up focus on reelection with speech on Jan. 6 anniversary  —  “We are running a campaign like the fate of our democracy depends on it.  Because it does,” Biden campaign manager Julie Chavez Rodriguez told reporters  —  President Biden is scheduled to travel to Valley Forge … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/03/biden-jan-6-trump-election-2024/"
  },
  {
    "text": "Trouble with tha God  —  The influential radio host of “The Breakfast Club” is a thorn in the side of Democrats — but he's also representative of one of their biggest problems.  —  Charlamagne tha God sits in his throne in the recording studio for “The Breakfast Club” on iHeart Radio in New York on October 2023.",
    "url": "https://www.politico.com/news/2024/01/02/biden-charlamagne-tha-god-00132784"
  },
  {
    "text": "Biden to travel to Mother Emanuel AME in South Carolina  —  The president's visit to the historic Black church, coming two days after Harris' visit to the state, underscores the campaign's effort to bolster support among Black voters.  —  President Joe Biden is headed to Charleston … ",
    "url": "https://www.politico.com/news/2024/01/03/biden-south-carolina-mother-emanuel-00133574"
  },
  {
    "text": "Harvard President Resigns After Mounting Plagiarism Accusations  —  Claudine Gay faced backlash over the university's response to antisemitism on campus, which led to increased scrutiny of her academic record.  —  Harvard's president, Claudine Gay, announced her resignation on Tuesday … ",
    "url": "https://www.nytimes.com/2024/01/02/us/harvard-claudine-gay-resigns.html"
  },
  {
    "text": "At least 20 killed in ‘terrorist attacks’ near Iranian Guards commander Soleimani's tomb during ceremony  —  Two explosions caused by ‘terrorist attacks’ killed at least 20 people and wounded dozens near a cemetery in Iran where a ceremony was being held to mark the 2020 death … ",
    "url": "https://www.reuters.com/world/middle-east/iran-media-report-explosion-near-guards-commander-soleimanis-tomb-anniversary-2024-01-03/"
  },
  {
    "text": "More than 100 killed in blasts at memorial for top Iranian general Soleimani  —  Gen. Qassem Soleimani was killed by a U.S. drone strike in January 2020, sparking angry protests in Iran and across the region.  —  Two explosions rocked a memorial event for Iranian Gen. Qassem Soleimani … ",
    "url": "https://www.nbcnews.com/news/world/iran-explosions-qassem-soleimani-memorial-quds-force-us-drone-strike-rcna132039"
  },
  {
    "text": "Sen. Bob Menendez facing even more charges in new superseding indictment  —  The Democrat is now accused of making positive comments about Qatar for gifts.  —  Sen. Bob Menendez, D-N.J., departs the Senate floor in the Capitol, Sept. 28, 2023, in Washington.",
    "url": "https://abcnews.go.com/Politics/sen-bob-menendez-facing-charges-new-superseding-indictment/story?id=106056419"
  },
  {
    "text": "Haley campaign says it hauled in $24M in fourth-quarter fundraising  —  Nikki Haley's presidential campaign announced Wednesday that the former United Nations ambassador and GOP rival to former President Trump hauled in $24 million in the most recent fundraising quarter.",
    "url": "https://thehill.com/homenews/campaign/4386590-haley-campaign-24m-fourth-quarter-fundraising/"
  },
  {
    "text": "First on Fox: Haley more than doubles her fundraising with a $24 million haul the past three months  —  Haley's fundraising haul the past three months appears to be the latest sign of her recent momentum in the race for the Republican presidential nomination",
    "url": "https://www.foxnews.com/politics/first-on-fox-haley-more-than-doubles-her-fundraising-with-24-million-haul-past-three-months.amp"
  },
  {
    "text": "Playbook: The House GOP's big border play  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  FIRST IN PLAYBOOK — Tell It Like It Is, the pro-CHRIS CHRISTIE super PAC, is launching new TV and radio spots in New Hampshire today.",
    "url": "https://www.politico.com/newsletters/playbook/2024/01/03/the-house-gops-big-border-play-00133593"
  },
  {
    "text": "Rep. John Curtis officially running for Romney's Senate seat  —  SALT LAKE CITY — Utah's 3rd District Rep. John Curtis is officially running for U.S. Senate, hoping to fill the upcoming empty seat that Sen. Mitt Romney is leaving.  —  On Tuesday, Curtis told KSL TV that one of the reasons … ",
    "url": "https://ksltv.com/611775/rep-john-curtis-officially-running-for-romneys-senate-seat/"
  },
  {
    "text": "Bill Johnson to resign Jan. 21 from Congress, start as YSU president the next day  —  YOUNGSTOWN - Bill Johnson submitted his letter of resignation today to the U.S. House of Representatives, effective Jan. 21, and will start the next day as Youngstown State University president.",
    "url": "https://www.vindy.com/news/latest-news/2024/01/bill-johnson-to-resign-jan-21-from-congress-start-as-ysu-president-the-next-day"
  },
  {
    "text": "Disgraced former Iowa Rep. Steve King endorses Ramaswamy  —  Former Iowa Rep. Steve King endorsed GOP presidential candidate Vivek Ramaswamy on Tuesday.  —  King lost his House seat in the 2020 primary after he was stripped of his committee assignments after questioning why the terms … ",
    "url": "https://thehill.com/homenews/campaign/4385999-former-iowa-rep-endorses-ramaswamy/"
  },
  {
    "text": "Israeli drone strike kills senior Hamas official in Beirut, sources say  —  Saleh al-Arouri, the deputy chairman of Hamas' political bureau and the commander of the group's military wing in the occupied West Bank, was killed in a drone attack in a Beirut suburb on Tuesday, Hamas has confirmed.",
    "url": "https://www.axios.com/2024/01/02/hamas-saleh-arouri-killed-beirut-hezbollah-israel-gaza"
  },
  {
    "text": "Why Democrats can't rely on abortion ballot initiatives to help them win  —  Voters decisively upheld abortion rights in every single case.  But those margins were largely driven by Republican voters who also voted for GOP candidates.  —  Democrats are scrambling to put state abortion-rights initiatives … ",
    "url": "https://www.politico.com/news/2024/01/03/abortion-democrats-2024-election-00133506"
  },
  {
    "text": "Paying workers like it's 2009  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  In 2009, Sony was still selling millions of floppy disks, Instagram did not exist, and Barack Obama was sworn in as president for the first time.  A lot has changed in the last 15 years.",
    "url": "https://popular.info/p/paying-workers-like-its-2009"
  }
]