[
  {
    "text": "Why Trumpers are losing it over Taylor Swift  —  Swift goes to football games to support her boyfriend, shattering MAGA brains. … MAGA this week at last found its true, final, most hated enemy.  Not Barack Obama.  Not Hilary Clinton.  Not Joe Biden.  Not even Hunter Biden.",
    "url": "https://www.publicnotice.co/p/taylor-swift-causes-trumpers-to-lose-it-kelce"
  },
  {
    "text": "Hannity Urges Taylor Swift To ‘Think Twice’ Before Endorsing Biden, Months After Railing Against Conservatives for ‘Hating on Her’  —  Fox News host Sean Hannity urged pop star Taylor Swift to “think twice” before endorsing President Joe Biden's reelection campaign, Tuesday … ",
    "url": "https://www.mediaite.com/tv/hannity-urges-taylor-swift-to-think-twice-before-endorsing-biden-months-after-railing-against-conservatives-for-hating-on-her/"
  },
  {
    "text": "Republicans are weaponizing a boring House tradition.  The result is more paralysis.  —  GOP rebels are tanking “rules” to push their demands, raising the threshold to pass legislation to a supermajority and making the House look more like the Senate.  —  WASHINGTON — When Speaker Mike Johnson … ",
    "url": "https://www.nbcnews.com/politics/congress/republicans-are-weaponizing-boring-house-tradition-result-paralysis-rcna136436"
  },
  {
    "text": "New York GOP moderates, leaders get SALT agreement after floor protest  —  New York Republican moderates and House GOP leaders reached an agreement to consider a bill addressing the state and local tax deduction (SALT) within the next week after a group of Empire State lawmakers threatened … ",
    "url": "https://thehill.com/homenews/house/4439592-new-york-gop-moderates-leaders-get-salt-agreement-after-floor-protest/"
  },
  {
    "text": "Pennsylvania man arrested after allegedly decapitating his father and displaying his head on YouTube  —  In the video, which has since been removed, Justin Mohn says his father was a federal employee and refers to him as a traitor while voicing right-wing conspiracy theories.",
    "url": "https://www.nbcnews.com/news/us-news/pa-man-arrested-decapitating-father-youtube-video-rcna136509"
  },
  {
    "text": "Judge orders Tesla to undo Elon Musk's $56 billion pay package  —  The ruling by a Delaware court stems from a Tesla shareholder lawsuit over the tech billionaire's 2018 compensation package  —  A Delaware judge on Tuesday ruled that Elon Musk's generous 2018 compensation package … ",
    "url": "https://www.washingtonpost.com/technology/2024/01/30/elon-musk-pay-package/"
  },
  {
    "text": "Elon Musk cannot keep Tesla pay package worth more than $55 billion, judge rules  —  Elon Musk is not entitled to landmark compensation package awarded by Tesla's board of directors that is potentially worth more than $55 billion, a Delaware judge ruled Tuesday.",
    "url": "https://apnews.com/article/elon-musk-tesla-compensation-pay-shareholders-e75687178d1175fba36ca55bd9c4c805"
  },
  {
    "text": "Trump Risks Losing More Than Half of Swing-State Voters If Found Guilty  —  Even more voters say they won't support him if he's sent to prison.  —  More than half of swing-state voters wouldn't vote for Donald Trump if he were convicted of a crime, according to a new Bloomberg News/Morning Consult poll … ",
    "url": "https://www.bloomberg.com/news/articles/2024-01-31/trump-guilty-verdict-loses-half-of-key-state-voters-in-election-2024"
  },
  {
    "text": "A State Supreme Court Just Issued the Most Devastating Rebuke of Dobbs Yet  —  The Supreme Court's eradication of the constitutional right to abortion in 2022's Dobbs v. Jackson Women's Health Organization had an immediate and devastating impact on gender equality in the United States.",
    "url": "https://slate.com/news-and-politics/2024/01/pennsylvania-supreme-court-dobbs-sam-alito-abortion.html"
  },
  {
    "text": "Impeaching Mayorkas Achieves Nothing  —  A policy dispute doesn't qualify as a high crime and misdemeanor.  —  House Republicans are marking up articles of impeachment against Homeland Security Secretary Alejandro Mayorkas, and the question is why?  As much as we share the frustration … ",
    "url": "https://www.wsj.com/articles/alejandro-mayorkas-impeachment-house-republicans-border-immigration-homeland-security-1a431a5d?mod=followamazon"
  },
  {
    "text": "U.S. winning world economic war  —  The United States economy grew faster than any other large advanced economy last year — by a wide margin — and is on track to do so again in 2024.  —  Why it matters: America's outperformance is rooted in its distinctive structural strengths, policy choices, and some luck.",
    "url": "https://www.axios.com/2024/01/31/us-economy-2024-gdp-g7-nations"
  },
  {
    "text": "The ‘Profound Influence’ of Christian Extremists on Mike Johnson  —  Speaker Mike Johnson's spiritual journey reveals ties to Christian fundamentalists who support slavery.  Johnson's office won't say where he stands on that issue. … If you want to know where Republican House Speaker Mike Johnson stands … ",
    "url": "https://www.thedailybeast.com/the-profound-influence-of-christian-extremists-on-mike-johnson"
  },
  {
    "text": "Activist who led ouster of Harvard president linked to ‘scientific racism’ journal  —  Christopher Rufo recommends a newsletter to his readers that has published several supporters of discredited genetics theory  —  Rightwing activist Christopher Rufo has links to a self-styled … ",
    "url": "https://www.theguardian.com/world/2024/jan/31/rightwing-activist-christopher-rufo-ties-scientific-racism-journal"
  },
  {
    "text": "US veteran accused of tearing down Satanic Temple idol in Iowa Capitol charged with hate crime  —  A U.S. Navy veteran who is accused of tearing down a Satanic Temple statue within the Iowa state Capitol has been charged with a hate crime.  —  Michael Cassidy, a conservative Christian veteran … ",
    "url": "https://www.washingtonexaminer.com/news/2828416/news-veteran-tore-down-idol-iowa-capital-charged-hate-crime/"
  },
  {
    "text": "As judges mull presidential immunity, Trump reaps the benefits of delay  —  For over three weeks, the D.C. Circuit has been sitting on a potentially decisive question.  —  Whether Donald Trump faces a potential prison sentence in 2024 is at the mercy of a federal appeals court that's operating … ",
    "url": "https://www.politico.com/news/2024/01/31/trump-trial-immunity-delay-00138688"
  },
  {
    "text": "India deploys unprecedented naval might near Red Sea to rein in piracy  —  India has deployed at least a dozen warships east of the Red Sea to provide security against pirates and has investigated more than 250 vessels as Western powers focus on attacks by Yemen's Iran-backed Houthis, Indian officials said.",
    "url": "https://www.reuters.com/world/india-deploys-unprecedented-naval-might-near-red-sea-rein-piracy-2024-01-31/"
  },
  {
    "text": "Michigan's Arabs and Muslims push to defeat Biden in critical state  —  As the war in Gaza leads to the deaths of friends and relatives, anger at Biden's refusal to call for a cease-fire has turned into political organizing  —  DEARBORN, Mich. — Mohammad Enayah relied on a cousin in Gaza … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/31/arab-muslim-voters-work-to-defeat-biden/"
  },
  {
    "text": "Congressman urging Texas to ignore the Supreme Court is backed by major law firms  —  Congressman Chip Roy (R-TX) is publicly urging Texas to ignore the Supreme Court.  In previously unreported comments, Roy explained that he feared his position would push the country into “a post-constitutional world.”",
    "url": "https://popular.info/p/congressman-urging-texas-to-ignore"
  },
  {
    "text": "South Carolina Moves to Boot Racist Couple by Deeming Them a ‘Public Nuisance’  —  The pair burned a cross near their Black neighbors' home.  Now local authorities are getting creative in removing them from the area.  —  Authorities in South Carolina have petitioned to boot a couple … ",
    "url": "https://www.thedailybeast.com/south-carolina-moves-to-boot-racist-couple-by-deeming-them-a-public-nuisance"
  },
  {
    "text": "We have the tools to prevent nearly all HPV-related cancers.  We need the will.  —  Let's start with the bad news: Cervical cancer is the fourth most common cancer in women worldwide, with nearly 14,000 new cases and 4,300 deaths in 2023.  This is particularly tragic since it's … ",
    "url": "https://thehill.com/opinion/healthcare/4437991-we-have-the-tools-to-prevent-nearly-all-hpv-related-cancers-we-need-the-will/"
  },
  {
    "text": "Fulton County cyberattack investigated for possible connection to Trump election case  —  The hack hasn't affected material related to the case against Trump and more than a dozen co-defendants, a district attorney's spokesperson says.  —  ATLANTA — Officials investigating the recent cyberattack … ",
    "url": "https://www.nbcnews.com/politics/politics-news/fulton-county-cyberattack-investigated-possible-connection-trump-elect-rcna136464"
  },
  {
    "text": "Exclusive: Hotelier Robert Bigelow gives Trump $1 million for legal fees  —  Hotelier Robert Bigelow told Reuters on Tuesday he gave Republican presidential candidate Donald Trump $1 million for his legal fees and agreed to donate another $20 million to a pro-Trump outside group for campaign purposes.",
    "url": "https://www.reuters.com/world/us/donor-bigelow-gave-trump-1-mln-legal-fees-donate-20-million-more-2024-01-30/"
  },
  {
    "text": "An Israeli charity that helps Palestinians grapples with the Oct. 7 attacks. … Iran is ‘not looking for war,’ the head of the Revolutionary Guards says.  —  The head of Iran's Revolutionary Guards said on Wednesday that Tehran was “not looking for war,” appearing to signal that it would not escalate tensions with the United States.",
    "url": "https://www.nytimes.com/live/2024/01/31/world/israel-hamas-war-gaza-news"
  },
  {
    "text": "Sinema's fundraising plummets as reelection decision deadline nears  —  The Arizona independent is raising less and less each quarter.  —  Sen. Kyrsten Sinema's (I-Ariz.) fundraising cratered to her lowest quarterly total yet this cycle as she stares down an April deadline to file for reelection.",
    "url": "https://www.politico.com/news/2024/01/30/kyrsten-sinema-donations-00138738"
  },
  {
    "text": "Housing Policy Council executive in critical condition after being shot in DC crime spree  —  WASHINGTON - Mike Gill, a married father of three, is in critical condition in the hospital after his family says he was shot during Monday night's wild crime spree.",
    "url": "https://www.fox5dc.com/news/housing-policy-council-executive-in-critical-condition-after-being-shot-in-dc-crime-spree"
  },
  {
    "text": "Syphilis Is Soaring in the U.S.  —  Cases have risen by 80 percent since 2018, the C.D.C. reported.  But chlamydia remains by far the most common sexually transmitted infection.  —  Syphilis, once nearly eliminated in the United States, continues to resurge, reaching the highest rate … ",
    "url": "https://www.nytimes.com/2024/01/30/health/syphilis-cdc.html"
  },
  {
    "text": "Senators Tell Meta, TikTok CEOs Their Platforms Hurt Children  —  Meta internal documents show top officials asked Mark Zuckerberg to invest in protections for children  —  WASHINGTON—Meta Platforms' Mark Zuckerberg, TikTok's Shou Zi Chew and other tech CEOs faced tough criticism on Wednesday … ",
    "url": "https://www.wsj.com/tech/meta-tiktok-ceos-to-defend-against-claims-their-platforms-hurt-children-2c966c2b?mod=followamazon"
  }
]