[
  {
    "text": "Trump Rebuffed After Asking a Judge to Delay His $454 Million Penalty  —  The former president, who is appealing the penalty in his civil fraud case, offered a bond of only $100 million to pause the judgment.  —  Donald J. Trump on Wednesday lost his initial bid for a New York appeals court … ",
    "url": "https://www.nytimes.com/2024/02/28/nyregion/trump-bond-civil-fraud.html"
  },
  {
    "text": "Trump must come up with the full bond amount to cover the $454 million civil fraud trial judgment, appeals court judge rules  —  Former President Donald Trump must come up with the full bond amount to cover the $454 million verdict in the civil fraud trial, an appeals court judge ruled Wednesday.",
    "url": "https://www.cnn.com/2024/02/28/politics/donald-trump-appeals-court-new-york/"
  },
  {
    "text": "Supreme Court Agrees to Hear Trump's Immunity Claim, Setting Arguments for April  —  The former president's trial on charges of plotting to subvert the 2020 election will remain on hold while the justices consider the matter.  —  The Supreme Court on Wednesday agreed to decide whether former … ",
    "url": "https://www.nytimes.com/2024/02/28/us/supreme-court-trump-immunity-trial.html"
  },
  {
    "text": "The Supreme Court just handed Trump a win  —  Even if the Court ultimately rules against Trump, by delaying his prosecution they've already helped him avoid accountability  —  Although I think the direction the Supreme Court will take America on any number of matters is extremely predictable … ",
    "url": "https://takebackthecourt.substack.com/p/the-supreme-court-just-handed-trump"
  },
  {
    "text": "Supreme Court will hear Donald Trump immunity arguments in April  —  The Supreme Court on Wednesday agreed to decide whether former President Donald Trump can be prosecuted on charges he interfered with the 2020 election, calling into question whether his case could go to trial before the November election.",
    "url": "https://apnews.com/article/supreme-court-trump-immunity-election-interference-trial-ff4b251967b4f1ae85bd01a0db24931f"
  },
  {
    "text": "Illinois judge removes Trump from ballot because of ‘insurrectionist ban’  —  In a surprise move, an Illinois judge has removed former President Donald Trump from the state's ballot based on the 14th Amendment's so-called “insurrectionist ban.”  —  The decision is paused, giving Trump a short period of time to appeal.",
    "url": "https://www.cnn.com/2024/02/28/politics/illinois-trump-removed-ballot-insurrectionist-ban"
  },
  {
    "text": "The Supreme Court Just Gave Trump Exactly What He Wanted  —  The Supreme Court has all but guaranteed that Donald Trump will not face trial for his efforts to subvert the 2020 election before this November's presidential election.  On Wednesday, after more than two weeks' delay … ",
    "url": "https://slate.com/news-and-politics/2024/02/supreme-court-donald-trump-trial-january-6.html"
  },
  {
    "text": "Trump Wants a Break on $464 Million Judgment.  The AG Says Trump Is Sneaking Assets to Florida.  —  Donald Trump was ordered to pay $464 million for bank fraud, but he only wants to front $100 million.  Now the AG says investigators have caught him moving his business assets.",
    "url": "https://www.thedailybeast.com/trump-wants-a-break-on-dollar464-million-judgment-the-ag-says-trump-is-sneaking-assets-to-florida"
  },
  {
    "text": "Supreme Court to decide Trump's immunity claim in election interference case  —  Even if the justices ultimately rule against Trump, the court's intervention adds a further delay, meaning his trial will not start for weeks, if not months.  —  WASHINGTON — The Supreme Court on Wednesday agreed … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-decide-trumps-immunity-claim-election-interference-case-rcna139026"
  },
  {
    "text": "Alina Habba's ‘billionaire’ boast bites her as she admits Trump can't pay cash bond  —  Donald Trump's attorney Alina Habba had to eat her words Wednesday after admitting that the former president did not have the cash bond required to appeal his fraud trial ruling in New York.",
    "url": "https://www.rawstory.com/alina-habba-s-billionaire-boast-bites-her-as-she-admits-trump-can-t-pay-cash-bond/"
  },
  {
    "text": "Judge declines to pause Trump's $454 million fraud penalty, but halts some sanctions  —  A New York appellate judge on Wednesday refused to halt collection of Donald Trump's $454 million civil fraud penalty while he appeals, rejecting the former president's request that he be allowed to post … ",
    "url": "https://www.cbsnews.com/news/trump-fraud-appeal-bond-new-york/"
  },
  {
    "text": "Trump Taken Off Illinois Ballot by Judge Over Insurrection  — Illinois becomes third state to block Trump from ballot  — Trump called the move ‘unconstitutional’ and plans to appeal  —  An Illinois judge barred Donald Trump from appearing on the Republican presidential primary ballot … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-29/illinois-judge-removes-trump-from-state-ballot-cnn-reports"
  },
  {
    "text": "Mitch McConnell to step down from Republican Senate leadership  —  Mitch McConnell's legacy as the longest-serving leader of Senate Republicans  —  Mitch McConnell, the longest-serving Senate leader in history who maintained his power in the face of dramatic convulsions in the Republican Party … ",
    "url": "https://apnews.com/article/mitch-mcconnell-senate-republican-leader-stepping-down-ba478d570a4561aa7baf91a204d7e366"
  },
  {
    "text": "Hackers threaten to release Trump documents from Georgia case if they don't get a ransom by Thursday  — Hackers set a ransom deadline of Thursday morning to release Fulton County court documents.  — They claim the documents include files related to the criminal case against Donald Trump.",
    "url": "https://www.businessinsider.com/trump-georgia-documents-ransom-threat-fulton-county-hack-lockbit-2024-2"
  },
  {
    "text": "Congressional leaders reach a deal to avoid a government shutdown  —  Congressional leaders say they have reached a deal to extend the current funding deadlines to avoid a partial government shutdown at midnight on Friday.  Congress will need to pass a short-term continuing resolution to extend … ",
    "url": "https://npr.org/2024/02/28/1234679367/congress-spending-deal-government-shutdown"
  },
  {
    "text": "US Rep. Lauren Boebert's son facing possible felony charges in string of vehicle break-ins  —  A magistrate ruled Wednesday that the oldest son of U.S. Rep. Lauren Boebert could be released from jail a day after the 18-year-old was arrested in connection with a recent string of vehicle break-ins and property thefts.",
    "url": "https://apnews.com/article/lauren-boebert-son-arrested-905ba3bc63d00c8ff7d6504608bb91f3"
  },
  {
    "text": "Hunter Biden asks GOP: What about Jared Kushner?  —  As Republicans grilled Hunter Biden about his business deals overseas, the president's son turned the question back on his interrogators.  —  He asked GOP lawmakers about foreign investments secured by Jared Kushner … ",
    "url": "https://thehill.com/homenews/house/4495124-hunter-biden-asks-gop-what-about-jared-kushner/"
  },
  {
    "text": "CDC advisory panel says people 65 and older should get a Covid spring booster shot  —  An expert panel advising the Centers for Disease Control and Prevention on vaccines on Wednesday recommended that people 65 and older should get an additional Covid-19 vaccine shot this spring.",
    "url": "https://www.statnews.com/2024/02/28/covid-spring-booster-recommendation/"
  },
  {
    "text": "Biden ‘fit for duty,’ doctor writes after latest physical exam  —  President Biden is “fit for duty” and does not have any new health concerns, his doctor wrote after a physical exam conducted Wednesday that was closely watched amid voter concerns about Biden's age while seeking reelection.",
    "url": "https://thehill.com/regulation/court-battles/4495504-biden-fit-for-duty-doctor-writes-after-latest-physical-exam/"
  },
  {
    "text": "How Panera Bread ducked California's new $20 minimum wage law  —  Billionaire Greg Flynn, who made his fortune running one of the world's largest restaurant franchise operations, is getting a new boost from sourdough loaves and brioche buns.  —  That's because a California law that's … ",
    "url": "https://www.mercurynews.com/2024/02/28/how-panera-bread-ducked-californias-new-20-minimum-wage-law/"
  },
  {
    "text": "Republicans block bill to protect access to IVF  —  Senate Republicans blocked an effort Wednesday to pass legislation that would federally protect access to in vitro fertilization (IVF).  —  Sen. Tammy Duckworth (D-Ill.) sought to pass the bill by unanimous consent, which meant … ",
    "url": "https://thehill.com/policy/healthcare/4494243-republicans-block-bill-to-protect-access-to-ivf/"
  },
  {
    "text": "SCOTUS Justice Jackson Just Said the Dumbest Thing About Guns and I Can't Stop Laughing  —  Supreme Court Justice Ketanji Brown Jackson must have fallen asleep last night watching a vintage '80s Chuck Norris movie as part of her preparation to hear oral arguments today in the Garland v. Cargill … ",
    "url": "https://pjmedia.com/vodkapundit/2024/02/28/scotus-justice-jackson-just-said-the-dumbest-thing-about-guns-and-i-cant-stop-laughing-n4926851"
  }
]