[
  {
    "text": "A Second Trump Term Poses a Crucial Test of the Senate's Independence  —  President-elect Donald J. Trump is threatening to challenge the institution's historic role, and the Constitution, with his prospective nominees and threats to push the boundaries of executive authority.",
    "url": "https://www.nytimes.com/2024/12/01/us/politics/trump-senate-independence.html"
  },
  {
    "text": "The Kash Patel Principle  —  Donald Trump has been releasing names of his nominees for the Cabinet and other senior posts in waves.  He began with some relatively conventional choices, and then unloaded one bombshell after another, perhaps in an attempt to paralyze opposition in the Senate … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/kash-patel-principle/680838/?gift=_IXYI0Wrwnxuvm7JZ0fMfLyMalbJhTJ1f4imheld7FU&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Behind the Curtain: Trump's shock and awe … - Trump named real estate developer Charles Kushner — father of Trump's son-in-law, Jared — as ambassador to France. … - Less than six hours later, Trump announced he picked Kash Patel, one of the hardest of his first-term hardliners, as FBI director.",
    "url": "https://www.axios.com/2024/12/01/trump-cabinet-kash-patel-fbi"
  },
  {
    "text": "Trump Says He Will Nominate Kash Patel to Run F.B.I.  —  President-elect Donald J. Trump turned to a firebrand loyalist to become director of the bureau, which he sees as part of a ‘deep state’ conspiracy against him.  —  President-elect Donald J. Trump said on Saturday that he wants … ",
    "url": "https://www.nytimes.com/2024/11/30/us/politics/trump-replace-christopher-wray.html?unlocked_article_code=1.eE4.w9RE.n67AAUSC95x0&smid=url-share"
  },
  {
    "text": "Trump taps Kash Patel for FBI director, an ally who would aid in his effort to upend law enforcement  —  President-elect Donald Trump says he will nominate Kash Patel to serve as FBI director, turning to a fierce ally to upend America's premier law enforcement agency and rid the government of perceived “conspirators.”",
    "url": "https://apnews.com/article/trump-fbi-patel-wray-879dc7629905946cc242e90f6ab98739"
  },
  {
    "text": "Social democrats gain and incumbents are punished in Iceland's election  —  Voters in Iceland appeared to have rejected incumbent parties in a parliamentary election, partial results showed Sunday, with a center-left party leading the contest in the North Atlantic island nation.",
    "url": "https://apnews.com/article/iceland-election-results-social-democrats-989773ec8a24cddef7ba78d5aa933df2"
  },
  {
    "text": "Wisconsin Democratic Chair Says He Is the One to Revive a Distressed Party  —  Ben Wikler, who has led the Wisconsin Democratic Party since 2019, announced a bid to be national party chair with a platform to “unite, fight, win.”  —  Ben Wikler, the Wisconsin Democratic chairman … ",
    "url": "https://www.nytimes.com/2024/12/01/us/politics/ben-wikler-democratic-national-committee-wisconsin.html?unlocked_article_code=1.eE4.gNV6.LMZEyttmVIQL&smid=url-share"
  },
  {
    "text": "Putin approves new budget with record defense spending  —  Russian President Vladimir Putin signed off the country's new budget on Sunday, which includes record spending on military needs amid Moscow's ongoing assault against Ukraine.  —  Around 32.5 percent of the 2025 budget … ",
    "url": "https://www.politico.eu/article/putin-russia-budget-moscow-record-defense-spending-kremlin-war-ukraine/"
  },
  {
    "text": "Putin signs off record Russian defense spending as top EU officials visit Kyiv  —  Russian President Vladimir Putin approved budget plans, raising 2025 military spending to record levels as Moscow seeks to prevail in the war in Ukraine.  Around 32.5% of the budget posted on a government website Sunday … ",
    "url": "https://apnews.com/article/russia-ukraine-budget-defense-spending-putin-drone-3a1a73c559b250ec26190edd9332100c"
  },
  {
    "text": "Trump threatens 100% tariff on the BRIC bloc of nations if they act to undermine US dollar  —  President-elect Donald Trump on Saturday threatened 100% tariffs against a bloc of nine nations if they act to undermine the U.S. dollar.  His threat was directed at countries in the so-called BRIC alliance … ",
    "url": "https://apnews.com/article/trump-dollar-dominance-brics-treasury-8572985f41754fe008b98f38180945c3"
  },
  {
    "text": "Trump nominates Charles Kushner, father of Jared Kushner, as US Ambassador to France  —  WASHINGTON - President-elect Donald Trump selected Charles Kushner, father of Jared Kushner, to serve as U.S. Ambassador to France on Saturday.  —  “I am pleased to nominate Charles Kusher, of New Jersey … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/11/30/trump-charles-kushner-france-ambassador/76677177007/"
  },
  {
    "text": "Democrats Face an Existential Crisis on X  —  Conversations with a dozen insiders point to a party that is unsure about whether to leave or engage with the increasingly MAGA platform.  —  Two days after the election, Patrick Dillon, a longtime Democratic strategist and current Biden administration official … ",
    "url": "https://www.politico.com/news/magazine/2024/11/30/dems-leave-twitter-musk-00191755"
  },
  {
    "text": "Former House Democrat lays into ‘toxic’ party, calls for ‘rebrand’ after election blowout  —  As assessments of what went wrong for Democrats in the 2024 election have poured in over the past few weeks and the party searches for its next leader, one former House member is calling for a “complete rebranding.”",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3246295/former-house-democrat-lays-into-toxic-party/"
  },
  {
    "text": "Trump's Next Term Could See America's First True Oligarchs, Warns Democracy Activist Garry Kasparov  —  Elon Musk's DOGE plan could mix public and private interests in a way previously not seen in American politics, the former world chess champion said.  —  LOADING",
    "url": "https://www.huffpost.com/entry/trump-musk-america-oligarchs_n_6746b6efe4b0800c73f710a5"
  },
  {
    "text": "Misogyny and Antisemitism Are a Toxic Brew  —  “Zio bitch!” a young man in a kaffiyeh and Black Lives Matter T-shirt barked at one of us, his ire apparently provoked by a yellow ribbon pin, a symbol of the Israeli hostages held by Hamas.  The exchange was unsettling but not surprising.",
    "url": "https://www.nytimes.com/2024/12/01/opinion/jewish-women-misogyny-antisemitism.html"
  },
  {
    "text": "Trump's health team: RFK Jr. and 5 doctors tapped to lead ‘MAHA’  —  President-elect Trump has finished making selections for the top public health roles in his incoming administration after he issued a flurry of nominations late Friday and tapped a leader for the National Institutes of Health (NIH) on Wednesday.",
    "url": "https://thehill.com/policy/healthcare/5012348-trump-health-care-picks/"
  },
  {
    "text": "What to know about sudden rebel gains in Syria's 13-year war and why it matters  —  The 13-year civil war in Syria has roared back into prominence with a surprise rebel offensive on Aleppo, one of Syria's largest cities and an ancient business hub.  The push is among the rebels' strongest … ",
    "url": "https://apnews.com/article/syria-hts-assad-aleppo-fighting-2be43ee530b7932b123a0f26b158ac22"
  }
]