[
  {
    "text": "Person of interest in fatal shooting of UnitedHealthcare CEO Brian Thompson ID'd as Luigi Mangione, an ex-Ivy League student  —  The person of interest identified in the killing of UnitedHealthcare CEO Brian Thompson is an anti-capitalist former Ivy League student — who liked online quotes from … ",
    "url": "https://nypost.com/2024/12/09/us-news/person-of-interest-in-fatal-shooting-of-unitedhealthcare-boss-brian-thompson-idd-as-luigi-mangione-an-ex-ivy-league-student/"
  },
  {
    "text": "Here's what to know about the manhunt.  —  A man is being held for questioning in connection with last week's killing of a health insurance executive in Midtown Manhattan, according to three law enforcement officials briefed on the investigation.  —  The man was identified based on a tip … ",
    "url": "https://www.nytimes.com/live/2024/12/09/nyregion/uhc-ceo-murder-suspect"
  },
  {
    "text": "Live updates: Suspect in CEO shooting reportedly wrote ‘parasites had it coming’  —  Luigi Mangione, 26, has been arrested in connection to the shooting of UnitedHealthcare CEO Brian Thompson in New York City.  He was taken into custody in Pennsylvania.  —  Mangione was arrested at around 9 … ",
    "url": "https://thehill.com/homenews/5030579-live-updates-26-year-old-suspect-named-in-unitedhealthcare-ceo-brian-thompsons-shooting/"
  },
  {
    "text": "Person of interest in fatal shooting of UnitedHealthcare CEO Brian Thompson caught with manifesto, gun and fake ID at McDonald's  —  A person of interest was nabbed Monday in the fatal shooting of UnitedHealthcare CEO Brian Thompson — busted possibly trying to use a fake ID in a McDonald's, law enforcement sources said.",
    "url": "https://nypost.com/2024/12/09/us-news/person-of-interest-nabbed-in-fatal-shooting-of-unitedhealthcare-ceo-brian-thompson-outside-nyc-hotel/"
  },
  {
    "text": "Rupert Murdoch Fails in Bid to Change Family Trust  —  A Nevada commissioner ruled resoundingly against Mr. Murdoch, who was trying to give full control of his empire to his son Lachlan and lock in Fox News's right-wing editorial slant.  —  A Nevada commissioner ruled resoundingly … ",
    "url": "https://www.nytimes.com/2024/12/09/business/media/rupert-lachlan-murdoch-family-trust.html?unlocked_article_code=1.gE4.iOYP.Rq-9tE_M2nfz&smid=url-share"
  },
  {
    "text": "Daniel Penny acquitted in subway chokehold death of Jordan Neely  —  A Manhattan jury has cleared Daniel Penny of criminal wrongdoing in the chokehold death of Jordan Neely on a crowded subway — a caught-on-video killing that sparked fierce debate over the city's mental health system and crime underground.",
    "url": "https://nypost.com/2024/12/09/us-news/daniel-penny-cleared-of-all-charges-in-jordan-neelys-death/"
  },
  {
    "text": "Nobel Laureates Urge Senate to Turn Down Kennedy's Nomination  —  Elevating Mr. Kennedy to secretary of H.H.S. “would put the public's health in jeopardy,” more than 75 laureates wrote.  —  More than 75 Nobel Prize winners have signed a letter urging senators not to confirm Robert F. Kennedy Jr. … ",
    "url": "https://www.nytimes.com/2024/12/09/health/kennedy-hhs-nobel-laureates.html?unlocked_article_code=1.gE4.oGBh.LR5JFpV5S1fn&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Jason Miller says Trump's suggestion to jail Jan. 6 committee members was taken out of context  —  Jason Miller, a senior adviser to Donald Trump, on Monday sought to walk back the president-elect's recent statement that he believes the members of the House's Jan. 6 committee who investigated him should be jailed.",
    "url": "https://www.politico.com/live-updates/2024/12/09/congress/trump-jan-6-00193315"
  },
  {
    "text": "Biden shrinks from view ahead of Trump's return to Washington  —  With 42 days left in office, Biden avoids unscripted moments or press questions.  —  Joe Biden is president of the United States for 42 more days.  But within the Democratic Party, on Capitol Hill — and even within his own administration … ",
    "url": "https://www.politico.com/news/2024/12/09/biden-absent-washington-00192575"
  },
  {
    "text": "GOP Congresswoman Nancy Mace is caught on video in gross act with two women and a man  —  Her crusade against transgender bathroom access has cemented her role as a hardline culture warrior and MAGA favorite.  —  But an eye-popping video unearthed exclusively by DailyMail.com suggests … ",
    "url": "https://www.dailymail.co.uk/news/article-14152809/Nancy-Mace-caught-gross-video-two-women-man.html"
  },
  {
    "text": "Shouting match breaks out on ‘The View’ as hosts clash over Trump threat  —  Co-hosts at “The View” got into a heated debate Monday as they talked about threats from Donald Trump against his perceived foes.  —  During an interview with “Meet the Press” Sunday, Trump had argued that the members … ",
    "url": "https://www.rawstory.com/trump-revenge-2670395985/"
  },
  {
    "text": "GOP Rep. Eyes Medicare, Social Security For DOGE Cuts: ‘We Can Move The Retirement Age Back’  —  Republican Rep. Mark Alford (R-MO) suggested Monday that Medicare and Social Security are on the table when it comes to accomplishing the Department of Government Efficienty's goal of cutting $2 trillion from the federal budget.",
    "url": "https://www.mediaite.com/tv/gop-rep-eyes-medicare-social-security-for-doge-cuts-we-can-move-the-retirement-age-back/"
  },
  {
    "text": "Kari Lake a top contender to become Trump's ambassador to Mexico  —  THE SCOOP  —  Kari Lake is a leading contender for the nomination as Donald Trump's ambassador to Mexico, two people familiar with the situation told Semafor.  —  Lake won Trump's endorsement in both her unsuccessful bids for statewide office in Arizona.",
    "url": "https://www.semafor.com/article/12/09/2024/kari-lake-a-top-contender-to-become-trumps-ambassador-to-mexico"
  },
  {
    "text": "US woman caught with golden gun in luggage at Sydney airport jailed for a year  —  Liliana Goodson travelled to Australia in 2023 to attend clown school with the gold-plated pistol, worth about $3,000, in her luggage  — Get our breaking news email, free app or daily news podcast",
    "url": "https://www.theguardian.com/australia-news/2024/dec/09/us-woman-caught-with-golden-gun-in-luggage-at-sydney-airport-jailed-for-a-year-ntwnfb"
  },
  {
    "text": "Joni Ernst signals openness after “encouraging” talk with Pete Hegseth … - “As I support Pete through this process, I look forward to a fair hearing based on truth, not anonymous sources,” Ernst said in a statement after meeting with Hegseth again on Monday for what she called “encouraging conversations.”",
    "url": "https://www.axios.com/2024/12/09/joni-ernst-hegseth-senate-defense"
  },
  {
    "text": "404 Media Objects to Texas Attorney General Ken Paxton's Subpoena to Access Our Reporting  —  In October, Texas Attorney General Ken Paxton subpoenaed 404 Media, demanding that we hand over confidential information about our reporting and an anonymous source to help the state of Texas … ",
    "url": "https://www.404media.co/404-media-objects-to-texas-attorney-general-ken-paxtons-subpoena-to-access-our-reporting/"
  },
  {
    "text": "Elon Musk's Stunning $250 Million Favor to Trump Should Wake Up Dems  —  We have now learned, belatedly, that billionaire Elon Musk spent at least $250 million to help billionaire Donald Trump win the White House.  One key part of that spending came in the form of the $20 million Musk dumped into a brazen pro-Trump propaganda campaign.",
    "url": "https://newrepublic.com/article/189147/musk-250-million-campaign-finance"
  },
  {
    "text": "More Americans say health care is government responsibility: Gallup  —  Sixty-two percent of Americans say it's the federal government's responsibility to ensure everyone has health care coverage, a new survey from Gallup found.  —  The figure is the highest it's been in more than a decade … ",
    "url": "https://thehill.com/policy/healthcare/5029971-health-care-government-gallup/"
  },
  {
    "text": "Clyburn urges Biden to pardon Trump ‘so we can clean the slate’  —  After convincing President Biden to pardon his son Hunter, South Carolina Rep. Jim Clyburn is now calling for clemency for Donald Trump.  “If we keep digging at things in the past, I'm not too sure the country will not lose its way … ",
    "url": "https://www.yahoo.com/news/clyburn-urges-biden-pardon-trump-022235193.html"
  },
  {
    "text": "Trump's NIH pick wants you to believe he's a victim of government censorship  —  Dr. Jay Bhattacharya made his name by claiming he was censored during the Covid pandemic.  But it never happened.  —  President-elect Donald Trump has nominated Dr. Jay Bhattacharya, a Stanford professor … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/jay-bhattacharya-censored-government-nih-trump-covid-rcna183120"
  },
  {
    "text": "Tariffs Are Trump's Tool to Consolidate His Hold on Power  —  They won't only be injurious to the U.S. economy but also to its liberal democracy because he will use them to reward friends and punish enemies  —  Donald Trump has precious few rigidly held political beliefs … ",
    "url": "https://www.theunpopulist.net/p/tariffs-are-trumps-tool-to-consolidate"
  },
  {
    "text": "Even the Koch Brothers Weren't This Brazen  —  Tech billionaires such as Jeff Bezos and Marc Andreessen aren't even trying to mask their politics anymore.  —  Marc Andreessen has been feeling pretty good since Election Day, and at the end of November, he went on The Joe Rogan Experience to say as much.",
    "url": "https://www.theatlantic.com/technology/archive/2024/12/tech-billionaires-trump-administration/680930/?gift=iWa_iB9lkw4UuiWbIbrWGeBaLMJojcj3uZMqwFT-HHY&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Joe and Jill Biden awkwardly ignore a beaming Kamala Harris at the Kennedy Center Honors  —  Lame duck President Biden and first lady Jill Biden ignored a beaming Vice President Kamala Harris — who was applauding enthusiastically for the couple — as they entered the Kennedy Center Honors to a standing ovation, awkward video shows.",
    "url": "https://nypost.com/2024/12/09/us-news/joe-jill-biden-ignore-kamala-harris-at-kennedy-center-honors/"
  },
  {
    "text": "A California labor union helped oust a Democrat from the state Capitol.  His replacement wants to curb union power.  —  A University of California workers union was successful in its fight to oust an Orange County Democrat from the state Senate after he did not support a bill it backed in the Legislature.",
    "url": "https://www.latimes.com/california/story/2024-12-09/a-california-union-helped-oust-an-oc-democrat-from-the-senate-an-anti-labor-conservative-took-his-place"
  },
  {
    "text": "‘Defund the police’ activist goes viral after begging for help when everything she owned was stolen in San Francisco: 'The cops didn't do s—!'  —  When thieves made off with Darcie Bell's rented U-Haul truck, the San Francisco woman put out a call for help on X: “If you see a 26 foot uhaul truck … ",
    "url": "https://nypost.com/2024/12/08/us-news/anti-cop-activist-begs-cops-for-help-when-everything-she-owned-was-stolen-in-san-francisco/"
  },
  {
    "text": "Trump suggests Kennedy will research debunked vaccines-autism link  —  President-elect Trump suggested in an interview Sunday that Robert F. Kennedy Jr., his pick to lead the Department of Health and Human Services, would investigate a debunked link between vaccines and autism.",
    "url": "https://thehill.com/policy/healthcare/5030325-trump-rfk-jr-debunked-vaccine-autism-link-conspiracy-theory-hhs-cdc/"
  },
  {
    "text": "The World Is on Fire.  And Trump's About to Be President.  Feel Better? … It's a fortunate thing that Bashar Al Assad's regime collapsed before Tulsi Gabbard became our country's director of national intelligence.  A well-known Assad suck-up, Gabbard might have been able to feed this bloodthirsty tyrant … ",
    "url": "https://newrepublic.com/article/189136/trump-assad-syria-second-term"
  }
]