[
  {
    "text": "Trailing Trump in Polls, Biden Can Be More Bullish in One Battleground  —  The president faces lagging energy in many key states.  But in Wisconsin, which he will visit on Wednesday, rolling clashes over abortion rights and democracy have kept Democratic voters fired up.",
    "url": "https://www.nytimes.com/2024/03/13/us/politics/biden-wisconsin-trump.html"
  },
  {
    "text": "Cheney fuels speculation about her next move  —  Speculation is growing about the role former Rep. Liz Cheney (R-Wyo.) will play in the 2024 election as President Biden and former President Trump barrel toward a rematch.  —  Cheney has vowed that she'll do whatever it takes to keep Trump from returning to the White House.",
    "url": "https://thehill.com/homenews/campaign/4526744-cheney-fuels-speculation-about-her-next-move/"
  },
  {
    "text": "Biden and Trump secure their parties' presidential nominations  —  The incumbent clinched the delegates needed for the Democratic nod hours before Donald Trump did the same on the Republican side  —  President Biden and Donald Trump on Tuesday both secured their parties' nominations for the presidency … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/12/biden-trump-win-presidential-nomination/"
  },
  {
    "text": "Trump takes control of the RNC with mass layoffs, restructuring  —  The move has raised fears among some former officials about the party's future support for down-ballot candidates  —  Former president Donald Trump took charge of the Republican National Committee this week with the political equivalent … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/12/rnc-trump-firings-takeover/"
  },
  {
    "text": "Robert Hur Admits Telling Biden He Seemed To Have ‘Photographic Recall’  —  The special counsel admitted his comment wasn't in the final report, in which he described the president's memory as “faulty,” “hazy” and “poor.”  —  LOADING  —  Although special counsel Robert Hur impugned Joe Biden's memory … ",
    "url": "https://www.huffpost.com/entry/robert-hur-biden-photographic-recall-eric-swalwell_n_65f0920ae4b01707c6d1f807"
  },
  {
    "text": "Today, Democratic voters in Georgia gave President Joe Biden enough delegates to win the Democratic nomination for president when the Democratic National Convention is held in August.  Republican voters in Georgia, Hawaii, Mississippi, and Washington gave Trump enough delegates to win … ",
    "url": "https://heathercoxrichardson.substack.com/p/march-12-2024-tuesday"
  },
  {
    "text": "‘Make the RNC White Again’: GOP Ends Minority Outreach Program  —  With Trump allies taking over the RNC and cleaning house, one of the casualties was a minority outreach program that seemed to be working for Republicans. … After years of accusations of financial mismanagement … ",
    "url": "https://www.thedailybeast.com/make-the-rnc-white-again-gop-ends-minority-outreach-program"
  },
  {
    "text": "RNC slashes budget for minority outreach after MAGA takeover  —  Following the Republican National Committee's takeover by Trump loyalists, the party will be shuttering a heavily-touted program designed to boost minority engagement.  —  In the wake of some modest gains with Hispanic voters in 2020 … ",
    "url": "https://www.rawstory.com/rnc-2667501622/"
  },
  {
    "text": "Criminal referrals emerge as possible ‘exit strategy’ of struggling Biden impeachment inquiry, sources say  —  Sources say James Comer met with Donald Trump last month.  —  House Oversight and Accountability Committee Chairman James Comer arrives to speak to reporters prior to a closed-door deposition … ",
    "url": "https://abcnews.go.com/US/criminal-referrals-emerge-exit-strategy-struggling-biden-impeachment/story?id=108023312"
  },
  {
    "text": "House GOP panics as another Republican sprints for the exits … - “I was surprised by Ken's announcement — I look forward to talking with him about that,” House Speaker Mike Johnson (R-La.) told reporters.  — House Majority Leader Steve Scalise (R-La.) said: “I haven't gotten to talk to him.",
    "url": "https://www.axios.com/2024/03/12/republican-retire-house-gop"
  },
  {
    "text": "Aaron Rodgers and Jesse Ventura Top R.F.K. Jr.'s List for Running Mate  —  Mr. Kennedy said he had been speaking with the Jets quarterback “pretty continuously” for the past month.  —  Robert F. Kennedy Jr. has recently approached the N.F.L. quarterback Aaron Rodgers and the former Minnesota governor … ",
    "url": "https://www.nytimes.com/2024/03/12/us/politics/rfk-jr-aaron-rodgers-jesse-ventura.html"
  },
  {
    "text": "Wisconsin Republicans fire 8 more Evers appointees, including regents and judicial watchdogs  —  Republicans who control the state Senate fired eight more of Democratic Gov. Tony Evers' appointees Tuesday, including two Universities of Wisconsin regents who voted against a deal … ",
    "url": "https://apnews.com/article/senate-republicans-reject-governor-appointees-wisconsin-9041cc81dabcdd0851e8064e31ed7d54"
  },
  {
    "text": "Conference Acts to Promote Random Case Assignment  —  The Judicial Conference of the United States has strengthened the policy governing random case assignment, limiting the ability of litigants to effectively choose judges in certain cases by where they file a lawsuit.",
    "url": "https://www.uscourts.gov/news/2024/03/12/conference-acts-promote-random-case-assignment"
  },
  {
    "text": "NAACP asks Black student-athletes to reconsider Florida colleges  —  The NAACP asked Black student-athletes to reconsider their decisions to attend public colleges and universities in the state of Florida, in response to the University of Florida and other state schools recently eliminating their diversity … ",
    "url": "https://www.espn.com/college-sports/story/_/id/39710283/naacp-asks-black-student-athletes-reconsider-florida-colleges"
  },
  {
    "text": "Arkansas stops offering ‘X’ as an alternative to male and female on driver's licenses and IDs  —  Arkansas will no longer allow residents to use “X” instead of male or female on state-issued driver's licenses or identification cards, officials announced under new rules Tuesday … ",
    "url": "https://apnews.com/article/arkansas-licenses-gender-nonbinary-intersex-huckabee-sanders-61ca930c323cb36844ab304dfde5dd61"
  },
  {
    "text": "Brett Kavanaugh knows truth of alleged sexual assault, Christine Blasey Ford says in book  —  In memoir, professor whose accusation rocked 2018 supreme court hearings says rightwing justice not ‘consummately honest person’  —  The US supreme court justice Brett Kavanaugh is not a … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/13/christine-blasey-ford-book-supreme-court-brett-kavanaugh-sexual-assault"
  },
  {
    "text": "“Trump Employee 5” details Trump's mob-like management style  —  Brian Butler dishes to CNN and reminds us why his former boss should be nowhere near the presidency. … CNN dropped an interview on Monday night that, in normal times, would spell a death knell for a presidential bid … ",
    "url": "https://www.publicnotice.co/p/trump-employee-5-brian-butler-cnn-interview"
  }
]