[
  {
    "text": "Did Trump or Biden deliver more for farmers?  The answer may surprise you.  —  The former president is using his ag record to appeal to Iowa voters.  Farm income, however, rose under Biden.  —  To hear former President Donald Trump tell it, America's farmers never had it so good as during his four years in the White House.",
    "url": "https://www.politico.com/news/2024/01/14/trump-biden-farmers-00135396"
  },
  {
    "text": "Poll: Nearly half of Haley's Iowa backers say they'll vote for Biden over Trump  —  The Iowa poll finds most likely GOP caucusgoers will vote for Trump in the 2024 general election — but not Haley's supporters.  —  DES MOINES, Iowa — Most likely Republican Iowa caucusgoers say they'll vote … ",
    "url": "https://www.nbcnews.com/politics/2024-election/poll-nearly-half-haleys-iowa-backers-say-ll-vote-biden-trump-rcna133821"
  },
  {
    "text": "Iowa Poll shows Nikki Haley leads Ron DeSantis in Iowa Caucuses.  Donald Trump far ahead  —  Although Nikki Haley has pulled ahead of Ron DeSantis, the Iowa Poll shows clear dangers lurk for her going into a caucus night that could be decided by Iowans' willingness to brave the bitter cold",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/caucus/2024/01/13/iowa-poll-nikki-haley-leads-ron-desantis-ahead-of-republican-caucus-night-big-lead-for-donald-trump/72216523007/"
  },
  {
    "text": "Trump tops his opponents while Biden hits a new low in approval ahead of Iowa caucus: POLL  —  72% of Republican-aligned adults would be satisfied with Trump as the nominee.  —  The 2024 primary season begins with Donald Trump well ahead of his Republican opponents on key measures of popularity … ",
    "url": "https://abcnews.go.com/Politics/trump-tops-opponents-biden-hits-new-low-approval/story?id=106335244"
  },
  {
    "text": "CBS News poll finds Trump's national lead grows as GOP nominating contests kick off  —  Donald Trump's support among national Republican primary voters has now risen to its highest level yet.  —  His legal issues obviously haven't hurt his standing with primary voters and some of his recent … ",
    "url": "https://www.cbsnews.com/news/trump-national-lead-grows-opinion-poll-republican-primary/"
  },
  {
    "text": "How College-Educated Republicans Learned to Love Trump Again  —  Blue-collar white voters make up Donald Trump's base.  But his political resurgence has been fueled largely by Republicans from the other end of the socioeconomic scale.  —  Working-class voters delivered the Republican Party to Donald J. Trump.",
    "url": "https://www.nytimes.com/2024/01/14/us/politics/trump-college-educated-voters.html"
  },
  {
    "text": "Three migrants drown in Rio Grande after Texas blocks Border Patrol from rescue  —  A woman and two children drowned in the Rio Grande near Eagle Pass on Friday night as they were attempting to cross the U.S. southern border.  —  U.S. Customs and Border Protection told TPR that Border Patrol … ",
    "url": "https://www.tpr.org/border-immigration/2024-01-13/three-drown-in-rio-grande-after-texas-blocks-border-patrol-from-rescue"
  },
  {
    "text": "Biden “running out” of patience with Bibi as Gaza war hits 100 days  —  President Biden and other senior U.S. officials are becoming increasingly frustrated with Israeli Prime Minister Benjamin Netanyahu and his rejection of most of the administration's recent requests related to the war in Gaza … ",
    "url": "https://www.axios.com/2024/01/14/biden-netanyahu-israel-gaza-war-tensions"
  },
  {
    "text": "Fears grow that Trump will use the military in ‘dictatorial ways’ if he returns to the White House  —  Among those being mentioned for Trump's secretary of defense are Christopher Miller, who served temporarily during his administration, Michael Flynn and Mike Pompeo.",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-military-fears-rcna129159"
  },
  {
    "text": "Lawyer for E. Jean Carroll suggests Trump misrepresented need to adjourn trial  —  The attorney for writer E. Jean Carroll suggested that the lawyer for former President Trump misrepresented the former president's need to delay the trial in connection to $10 million in defamation damages that the writer is seeking.",
    "url": "https://thehill.com/regulation/court-battles/4408002-lawyer-for-e-jean-carroll-suggests-trump-misrepresented-need-to-adjourn-trial/"
  },
  {
    "text": "The Vivek Ramaswamy Show Approaches its Finale  —  The 38-year-old entrepreneur's campaign has been filled with outrages and provocations.  Are the Iowa caucuses his last stand?  —  There is little question that Vivek Ramaswamy's campaign has made him more widely known throughout the country … ",
    "url": "https://www.politico.com/news/magazine/2024/01/14/vivek-ramaswamy-last-stand-iowa-00135400"
  },
  {
    "text": "House GOP targets federal workers who walk out over Gaza … - The protest, led by a group of dozens of federal employees calling itself Feds United For Peace, is reportedly to observe a “Day of Mourning” on the 100th day since Israel began military operations in Gaza last October.",
    "url": "https://www.axios.com/2024/01/14/mike-johnson-gop-federal-workers-gaza"
  },
  {
    "text": "The Political Education of Christina Pushaw, Ron DeSantis' Enforcer on X  —  Ron DeSantis' enforcer on X has said she spent a few years living abroad in Georgia, traveling and enjoying life.  It's actually where she learned an especially ruthless kind of politics.",
    "url": "https://www.politico.com/news/magazine/2024/01/14/christina-pushaw-ron-desantis-georgia-00118242"
  },
  {
    "text": "Scientist cited in push to oust Harvard's Claudine Gay has links to eugenicists  —  Christopher Rufo, credited with helping oust school's first Black president, touted critic associated with ‘scientific racists’  —  A data scientist promoted by the rightwing activist Christopher Rufo … ",
    "url": "https://www.theguardian.com/world/2024/jan/14/christopher-rufo-jonatan-pallesen-eugenics-racism-claudine-gay-harvard"
  },
  {
    "text": "Pro-Palestinian protesters chant ‘f-k Joe Biden,’ damage fence outside White House  —  A swarm of Pro-Palestinian supporters shouted “f-k Joe Biden” slogans as they nearly ripped down a reinforced fence outside the White House during a charged protest Saturday night.",
    "url": "https://nypost.com/2024/01/13/news/pro-palestinian-protesters-chant-anti-biden-slogans-outside-white-house/"
  }
]