[
  {
    "text": "The Constitutional Crisis Is Here  —  Between the path of outright defiance of the Supreme Court and following its order to “facilitate” the return of Kilmar Abrego Garcia from El Salvador's infamous Centro de Confinamiento del Terrorismo (CECOT), the Trump administration has chosen a third way … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/04/bukele-trump-court-order/682432/?gift=Je3D9AQS-C17lUTOnl2W8FIcAJ_15fkw4XWpbB8kiu0&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump told us the horrifying reason why Kilmar Abrego Garcia is not back in the U.S.  —  We are approaching one month since the United States illegally sent Kilmar Abrego Garcia to the CECOT “terrorism” prison in El Salvador on the third March 15 flight that took people to the prison.",
    "url": "https://www.lawdork.com/p/trump-told-us-the-horrifying-reason"
  },
  {
    "text": "Bukele's Offense Against the American People  —  Here's how I look at today's White House spectacle.  —  I don't really care what these two men say.  The only next step I'm focused on is the one that now faces the Supreme Court.  The White House is now brazenly ignoring the crystal clear import … ",
    "url": "https://talkingpointsmemo.com/edblog/bukeles-offense-against-the-american-people"
  },
  {
    "text": "Maryland senator requests meeting with Salvadoran president to discuss deported Maryland man  —  Maryland Sen. Chris Van Hollen requested a meeting with El Salvador President Nayib Bukele during his visit to the United States to discuss the return of Kilmar Abrego Garcia, a Maryland man who was wrongly deported.",
    "url": "https://www.cbsnews.com/baltimore/news/van-hollen-el-salvador-abrego-garcia-deportation/"
  },
  {
    "text": "Trump & Bukele Plot US Citizen Detention In Salvadoran Torture Camps, While Defying Supreme Court Via Gibberish Responses To Reporters  —  In a stunning White House appearance that should alarm anyone who cares about constitutional rights, democracy, the rule of law or anything of the sort … ",
    "url": "https://www.techdirt.com/2025/04/14/trump-bukele-plot-us-citizen-detention-in-salvadoran-torture-camps-while-defying-supreme-court-via-gibberish-responses-to-reporters/"
  },
  {
    "text": "Trump Administration Will Freeze $2 Billion After Harvard Refuses Demands  —  Federal officials said they would freeze the money after Harvard said it would not submit to requests to overhaul hiring and report international students who break rules.  —  The Trump administration acted quickly … ",
    "url": "https://www.nytimes.com/2025/04/14/us/harvard-trump-reject-demands.html"
  },
  {
    "text": "The Promise of American Higher Education  —  For three-quarters of a century, the federal government has awarded grants and contracts to Harvard and other universities to help pay for work that, along with investments by the universities themselves, has led to groundbreaking innovations across … ",
    "url": "https://www.harvard.edu/president/news/2025/the-promise-of-american-higher-education/"
  },
  {
    "text": "Trump administration freezes $2.2 billion in grants to Harvard over campus activism  —  The federal government says it's freezing more than $2.2 billion in grants and $60 million in contracts to Harvard University, after the institution said it would defy the Trump administration's demands to limit activism on campus.",
    "url": "https://apnews.com/article/harvard-trump-administration-federal-cuts-antisemitism-0a1fb70a2c1055bda7c4c5a5c476e18d"
  },
  {
    "text": "Harvard Will Fight Trump's Demands  —  Harvard will not comply with the Trump administration's demands to dismantle its diversity programming and limit student protests in exchange for its federal funding, University President Alan M. Garber '76 announced in a message to affiliates Monday afternoon.",
    "url": "https://www.thecrimson.com/article/2025/4/15/harvard-denies-trump-demands/"
  },
  {
    "text": "Columbia Activist Arrested by ICE at His Appointment for Citizenship  —  Mohsen Mahdawi, a legal permanent resident, has lived in the United States for 10 years and was arrested in Vermont.  He has not been charged with a crime.  —  Mohsen Mahdawi, an organizer of pro-Palestinian demonstrations … ",
    "url": "https://www.nytimes.com/2025/04/14/nyregion/columbia-student-palestinian-arrested-ice.html?unlocked_article_code=1._k4.8_ZE.-FIbFnHAlLiG&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Palestinian Student Leader Was Called In for Citizenship Interview — Then Arrested by ICE  —  Mohsen K. Mahdawi arrived at the U.S. Citizenship and Immigration Services office in Colchester, Vermont, on Monday.  A Palestinian student at Columbia University, he hoped that, after 10 years in the U.S. … ",
    "url": "https://theintercept.com/2025/04/14/ice-columbia-student-mohsen-mahdawi-citizenship-interview/"
  },
  {
    "text": "Despite a court order, White House bars AP from Oval Office event  —  Despite a court order, a reporter and photographer from The Associated Press were barred from an Oval Office news conference on Monday with President Donald Trump and his counterpart from El Salvador, Nayib Bukele.",
    "url": "https://apnews.com/article/trump-ap-press-freedom-court-gulf-caffd32aa8ec6b04a50b8c5277d7c9cb"
  },
  {
    "text": "White House to Ask Congress to Claw Back Funding From NPR and PBS  —  Trump administration officials want legislators to rescind $1.1 billion for the Corporation for Public Broadcasting, which provides some support for public media.  —  The White House is planning to ask Congress to claw … ",
    "url": "https://www.nytimes.com/2025/04/14/business/media/trump-npr-pbs-funding.html"
  },
  {
    "text": "Trump Moves to Put New Tariffs on Computer Chips and Drugs  —  Citing a national security statute, the administration has begun a process to investigate the impact of imported semiconductors and pharmaceuticals.  —  The Trump administration took steps on Monday that appear likely to result … ",
    "url": "https://www.nytimes.com/2025/04/14/business/economy/trump-semiconductor-tariffs-china.html"
  },
  {
    "text": "The Situation: Court Orders, Kidnapping, and Smuggling  —  Meet The Authors  —  Published by The Lawfare Institute in Cooperation With  —  The Situation on Friday asserted that “it's going to take a lot of work” for U.S. District Judge Paula Xinis and her colleagues on the federal bench … ",
    "url": "https://www.lawfaremedia.org/article/the-situation--court-orders--kidnapping--and-smuggling"
  },
  {
    "text": "China Orders Boeing Jet Delivery Halt as Trade War Expands … Beijing has also asked that Chinese carriers halt any purchases of aircraft-related equipment and parts from US companies, the people said, asking not to be identified discussing matters that are private.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-15/china-tells-airlines-stop-taking-boeing-jets-as-trump-tariffs-expand-trade-war"
  },
  {
    "text": "Greene Bought Market Dip Before Trump Paused Tariffs, Profiting From the Rally  —  The Georgia congresswoman purchased at least tens of thousands of dollars in stock the day before and the day of President Trump's pause of a sweeping set of tariffs that sent the market soaring.",
    "url": "https://www.nytimes.com/2025/04/14/us/politics/marjorie-taylor-greene-bought-stock-trump-tariffs-pause.html"
  },
  {
    "text": "JD Vance: My message to Europe America doesn't want a vassal continent  —  “It's not good for Europe to be the permanent security vassal of the United States.”  So says JD Vance during a phone conversation with UnHerd on Monday, his first major interview with a European outlet since taking office as Vice President.",
    "url": "https://unherd.com/2025/04/jd-vance-my-message-to-europe/"
  },
  {
    "text": "JD Vance drops Ohio State's national championship trophy at White House celebration  —  WASHINGTON ― It was nearly a disastrous late-game turnover.  —  JD Vance fumbled the college football National Championship Trophy as he tried to hoist it up during a White House celebration … ",
    "url": "https://www.usatoday.com/story/news/politics/2025/04/14/jd-vance-trophy-ohio-state-national-championship/83087486007/"
  },
  {
    "text": "NVIDIA to Manufacture American-Made AI Supercomputers in US for First Time  —  NVIDIA is working with its manufacturing partners to design and build factories that, for the first time, will produce NVIDIA AI supercomputers entirely in the U.S.  —  Together with leading manufacturing partners … ",
    "url": "https://blogs.nvidia.com/blog/nvidia-manufacture-american-made-ai-supercomputers-us/"
  }
]