[
  {
    "text": "U.S. intelligence, law enforcement candidates face Trump loyalty test  —  Candidates for top intelligence and law enforcement jobs were asked to give “yes” or “no” responses to questions such as: Was Jan. 6 “an inside job?”  —  Candidates for top national security positions in the Trump administration … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/08/trump-administration-job-candidates-loyalty-screening/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4OTkwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwMzczMTk5LCJpYXQiOjE3Mzg5OTA4MDAsImp0aSI6ImJhY2ZmMzQ4LTUyNjQtNDFiZS1iOWNkLWQ0Mzk5MjJmZGRjNCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAyLzA4L3RydW1wLWFkbWluaXN0cmF0aW9uLWpvYi1jYW5kaWRhdGVzLWxveWFsdHktc2NyZWVuaW5nLyJ9.yxvFgWdeOV9RrerwIJTWnzd_J5k4UIFHbwb3lUoMHcM&itid=gfta"
  },
  {
    "text": "As the Trump upheaval continues, are there restraints that could slow him down?  —  Questions remain on what constitutional or other checks can be put on the president and his wide-ranging actions.  —  Rare is the president who doesn't overinterpret his mandate.  President Donald Trump is no exception.",
    "url": "https://www.washingtonpost.com/politics/2025/02/09/trump-constitution-checks-balances/"
  },
  {
    "text": "Federal Financial Watchdog Ordered to Cease Activity  —  In an email to staff of the Consumer Financial Protection Bureau, the agency's acting director ordered workers to cease “all supervision and examination activity.”  —  Employees of the Consumer Financial Protection Bureau were instructed to cease … ",
    "url": "https://www.nytimes.com/2025/02/08/us/politics/cfpb-vought-staff-finance-watchdog.html?unlocked_article_code=1.vk4.tkNM.755KLwhrxD95"
  },
  {
    "text": "Russell Vought, CFPB's new acting head, issues directives to halt portions of bureau activity  —  The Senate confirmed Vought as director of the Office of Management and Budget on Thursday.  —  Office of Management and Budget Director Russell Vought issued a series of directives … ",
    "url": "https://www.nbcnews.com/politics/doge/russell-vought-consumer-financial-protection-bureau-trump-rcna191356"
  },
  {
    "text": "CBS News poll — Trump has positive approval amid “energetic” opening weeks; seen as doing what he promised  —  With most describing him as “tough,” “energetic,” “focused” and “effective” — and as doing what he'd promised during his campaign — President Trump has started his term with net positive marks from Americans overall.",
    "url": "https://www.cbsnews.com/news/trump-approval-opinion-poll-2025-2-9/"
  },
  {
    "text": "Katie Britt vows to work with RFK Jr. after NIH funding cuts cause concern in Alabama  —  Alabama's junior U.S. senator said she will work with President Donald Trump's health secretary nominee Robert F. Kennedy, Jr. to “ensure our nation remains at the forefront” of innovation … ",
    "url": "https://www.al.com/news/2025/02/katie-britt-vows-to-work-with-rfk-jr-after-nih-funding-cuts-cause-concern-in-alabama.html"
  },
  {
    "text": "Trump stripping the security clearances of numerous antagonists — including NY AG Letitia James, DA Alvin Bragg  —  President Trump has ordered security clearances stripped from a new hit list of antagonists.  —  Just days after revoking Joe Biden's access to classified information … ",
    "url": "https://nypost.com/2025/02/08/us-news/trump-stripping-the-security-clearances-from-a-new-hit-list-of-antagonists-including-ny-ag-letitia-james-da-alvin-bragg/"
  },
  {
    "text": "As Trump steamrolls Washington, courts flex their power to slow him down  —  Numerous federal district judges around the country have blocked major portions of Trump's early agenda — but Supreme Court showdowns loom.  —  President Donald Trump's “shock and awe” assertion of executive power … ",
    "url": "https://www.politico.com/news/2025/02/09/trump-courts-block-early-agenda-00203230"
  },
  {
    "text": "In chaotic Washington blitz, Elon Musk's ultimate goal becomes clear  —  Shrink government, control data and — according to one official closely watching the billionaire's DOGE — replace “the human workforce with machines.”  —  Billionaire Elon Musk's blitzkrieg on Washington has brought … ",
    "url": "https://www.washingtonpost.com/business/2025/02/08/doge-musk-goals/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4OTkwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwMzczMTk5LCJpYXQiOjE3Mzg5OTA4MDAsImp0aSI6Ijg1Y2M3ODM1LTEzODgtNDdiMS05YzA5LTAxNmE5MDMwYmI2NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAyLzA4L2RvZ2UtbXVzay1nb2Fscy8ifQ.R0LGPHHjFHSZMic-TXDTaBm8cNZweQrcDobIjt_lVHM&itid=gfta"
  },
  {
    "text": "Trump reveals he's spoken with Putin by phone, says Russian president ‘wants to see people stop dying’ in Ukraine war  —  President Trump has spoken to Russian leader Vladimir Putin on the phone to try to negotiate an end to the Ukraine war, he told The Post in an exclusive interview aboard Air Force One Friday.",
    "url": "https://nypost.com/2025/02/08/us-news/trump-and-putin-in-talks-to-end-the-russia-ukraine-war/"
  },
  {
    "text": "Early Crypto Traders Had Speedy Profit on Trump Coin as Others Suffered Losses  —  Some traders made tens of millions off a new cryptocurrency launched by President Trump and his sons.  Many others lost out.  —  The curious trade came a little past 9 p.m. on Jan. 17 … ",
    "url": "https://www.nytimes.com/2025/02/09/us/politics/trump-crypto-memecoin.html"
  },
  {
    "text": "A Tent City Is Rising at Guantánamo Bay  —  These are the first independent images to emerge from the migrant operation that the Trump administration has begun at the Navy base.  —  The Trump administration has moved more than 30 people described as Venezuelan gang members … ",
    "url": "https://www.nytimes.com/2025/02/08/us/politics/guantanamo-bay-migrants.html?unlocked_article_code=1.vU4.Li_i.pz26KdUtcHGJ&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "‘The feel of a coup’: Elon Musk said to be poised to ‘defy’ major judicial order  —  Elon Musk appears poised to defy a judicial order, according to observers.  —  Musk, the richest man in the world and an appointee of Donald Trump, was dealt a blow over the weekend when a judge reportedly … ",
    "url": "https://www.rawstory.com/trump-elon-coup-defy-order/"
  },
  {
    "text": "House Republicans mull taxes on scholarships and changes to student loan programs  —  As Republicans in Congress look for ways to slash spending, some legislators are floating new taxes on college scholarships, an end to student loan repayment plans and a big hike in taxes on university endowments.",
    "url": "https://apnews.com/article/trump-administration-education-college-loans-532d52c2ccac8b4be459f7797fb63a73"
  },
  {
    "text": "Musk Team's Treasury Access Raises Security Fears, Despite Judge's Ordered Halt  —  A judge ruled Saturday that the activities of Elon Musk's government cost-cutting effort risk “the disclosure of sensitive and confidential information” and render them “more vulnerable than before to hacking.”",
    "url": "https://www.nytimes.com/2025/02/08/us/politics/treasury-systems-raised-security-concerns.html"
  },
  {
    "text": "Exclusive: Inside Trump's Iran fear … - Iran clearly is still on Trump's mind: Last week, he said he'd given his team instructions to “obliterate” Iran if its operatives were to kill him.  — He later tempered that remark by saying he wanted a “verified nuclear peace agreement” with Iran … ",
    "url": "https://www.axios.com/2025/02/09/inside-trump-fear-iran-book"
  },
  {
    "text": "Trump rules out deporting Prince Harry: 'He's got enough problems with his wife'  —  Prince Harry can breathe freely in Montecito, because President Donald Trump has ruled out deporting the self-exiled British royal.  —  Harry's immigration status is the subject of litigation in Washington DC … ",
    "url": "https://nypost.com/2025/02/08/us-news/trump-rules-out-deporting-prince-harry-takes-jab-at-meghan-markle/"
  },
  {
    "text": "GOP laws aimed at very rare noncitizen voting could hit eligible voters  —  Republicans in Congress and state legislatures are charging forward with plans to require Americans to prove they are citizens.  —  In the months before last year's election, Alabama removed valid voters from the rolls … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/09/noncitizen-voter-trump-republicans-democrats/"
  },
  {
    "text": "Springfield, Ohio, Sues Neo-Nazi Group, Saying It Intimidated Haitians  —  In the lawsuit, the city states that people associated with the group made death threats last year against those who expressed support for Haitian residents.  —  The city of Springfield, Ohio, which was singled … ",
    "url": "https://www.nytimes.com/2025/02/08/us/springfield-ohio-lawsuit-haitians-neo-nazis.html"
  }
]