[
  {
    "text": "Netanyahu warns of long war with Hamas; Hezbollah and Israel trade fire  —  The Israel Defense Forces launched fresh strikes on Gaza early Sunday local time as violence in the region continued overnight, with Prime Minister Benjamin Netanyahu warning of a long and difficult war ahead.",
    "url": "https://www.washingtonpost.com/world/2023/10/08/israel-gaza-strikes-hamas-netanyahu/"
  },
  {
    "text": "Iran Helped Plot Attack on Israel Over Several Weeks  —  The Islamic Revolutionary Guard Corps gave the final go-ahead last Monday in Beirut  —  DUBAI—Iranian security officials helped plan Hamas's Saturday surprise attack on Israel and gave the green light for the assault at a meeting … ",
    "url": "https://www.wsj.com/world/middle-east/iran-israel-hamas-strike-planning-bbe07b25?mod=followamazon"
  },
  {
    "text": "US strengthens ‘defense posture’ in Middle East amid war in Israel  —  The United States is strengthening its presence in the Middle East following the deadly Hamas attacks on Israel this weekend by moving planes and ships closer to the conflict.  —  Defense Secretary Lloyd Austin … ",
    "url": "https://www.washingtonexaminer.com/policy/defense-national-security/us-strengthens-defense-for-war-in-israel"
  },
  {
    "text": "Tuberville won't bend on military blockade amid Israel crisis  —  After Hamas attacked Israel, Senate Democrats said it was past time for several top-level military nominees to be approved.  —  Sen. Tommy Tuberville is not relenting from his monthslong blockade of military nominations … ",
    "url": "https://www.politico.com/news/2023/10/08/tuberville-blockade-israel-military-00120525"
  },
  {
    "text": "Sen. Tommy Tuberville won't lift his military blockade amid Israel-Hamas conflict  —  For months, the Alabama Republican has held up more than 300 military nominees, including top officers who would command forces in the Middle East.  —  WASHINGTON — The office of Sen. Tommy Tuberville … ",
    "url": "https://www.nbcnews.com/politics/congress/sen-tommy-tuberville-wont-lift-military-blockade-israel-hamas-conflict-rcna119401"
  },
  {
    "text": "Verified accounts spread fake news release about a Biden $8 billion aid package to Israel  —  The edited White House press release has sparked false headlines that rose to the top of Google search results.  —  A doctored White House press release posted online falsely claimed … ",
    "url": "https://www.nbcnews.com/tech/internet/verified-accounts-spread-fake-news-release-biden-8-billion-aid-package-rcna119372"
  },
  {
    "text": "With contempt sentencing looming, ex-Trump trade adviser Peter Navarro demands new trial plus time out of U.S. for medical procedure  —  Ex-Trump White House trade adviser Peter Navarro wants a new trial after being convicted of contempt of Congress for bucking the House Select Committee Investigating … ",
    "url": "https://lawandcrime.com/high-profile/with-contempt-sentencing-looming-ex-trump-trade-adviser-peter-navarro-demands-new-trial-plus-time-out-of-u-s-for-medical-procedure/"
  },
  {
    "text": "How Not to Respond to a Terrorist Attack  —  The things I least want to hear on a day when Hamas terrorists kill hundreds of Israeli civilians.  —  I'm afraid it's not a good evening, but I wish you one anyway.  —  I seldom write about Israeli-Palestinian matters, but it's not because I don't think about them.",
    "url": "https://www.dogshirtdaily.com/p/how-not-to-respond-to-a-terrorist"
  },
  {
    "text": "‘They were going tree by tree and shooting’ - Israeli partygoer describes festival attack  —  Gili Yoskovich was among hundreds of young people at a dance music festival in southern Israel, near the Gaza Strip, when gunmen opened fire in the early hours of Saturday morning … ",
    "url": "https://www.bbc.com/news/world-middle-east-67044787"
  },
  {
    "text": "Netanyahu Bears Responsibility for This Israel-Gaza War  —  The disaster that befell Israel on the holiday of Simchat Torah is the clear responsibility of one person: Benjamin Netanyahu.  The prime minister, who has prided himself on his vast political experience and irreplaceable wisdom in security matters … ",
    "url": "https://www.haaretz.com/opinion/editorial/2023-10-08/ty-article-opinion/netanyahu-bears-responsibility/0000018b-0b9d-d8fc-adff-6bfd1c880000"
  },
  {
    "text": "At least three Americans killed in attacks in Israel near Gaza border, according to memo  —  At least three Americans have been killed in the attacks in Israel close to the Gaza border, according to an internal US government memo reviewed by CNN.  —  Earlier Sunday, Secretary of State Antony Blinken … ",
    "url": "https://www.cnn.com/2023/10/08/politics/blinken-israel-war-cnntv/"
  },
  {
    "text": "'I'd still vote for' Biden if he was ‘dead’: Pa. voters react to Trump-Biden 2024 rematch  —  Some Pennsylvania voters would rather cast an unenthusiastic ballot for Biden than a vote for Trump.",
    "url": "https://www.nbcnews.com/meet-the-press/video/-i-d-still-vote-for-biden-if-he-was-dead-pa-voters-react-to-trump-biden-2024-rematch-194683973849"
  },
  {
    "text": "IDF troops battle gunmen in Kfar Aza, Magen; 2 Israeli tourists killed in Egypt  —  IDF hits Hamas targets, says more than 400 terrorists killed; rocket hits Ashkelon hospital; more than 500 Israelis dead, 2,048 wounded, dozens taken hostage in Gaza  —  Security cabinet confirms Israel at war … ",
    "url": "https://www.timesofisrael.com/liveblog-october-8-2023/"
  },
  {
    "text": "Byron Donalds says he supports Jim Jordan for Speaker  —  Rep. Byron Donalds (R-Fla.) said Sunday he plans to support Rep. Jim Jordan (R-Ohio) to be the next Speaker of the House.  —  “I'm supporting Jim Jordan,” Donalds said in an interview on Fox News's “Sunday Morning Futures.”",
    "url": "https://thehill.com/homenews/house/4244635-byron-donalds-says-he-supports-jim-jordan-for-speaker/"
  }
]