[
  {
    "text": "Republicans baffled by Katie Britt's State of the Union response: ‘One of our biggest disasters’  —  The 42-year-old Alabama senator is a rising Republican star but her kitchen table speech did not land well even in her own party  —  Katie Britt's Republican response to Joe Biden's State … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/08/katie-britt-sotu-reaction"
  },
  {
    "text": "President Biden Upends the GOP Narrative  —  How he got the job done  —  It's difficult to tell who was more surprised by President Biden's State of the Union performance Thursday night: Democrats in the chamber, whose emotions ranged from relieved to almost giddy.",
    "url": "https://steady.substack.com/p/president-biden-upends-the-gop-narrative"
  },
  {
    "text": "Biden Shrugs Off ‘Illegal’ Remark That Drew Democrats' Ire  — Unscripted exchange with Marjorie Taylor Greene led to remark  — ‘Let me be clear: No human being is illegal,’ Omar responds  —  President Joe Biden brushed off criticism after referring to the alleged killer of a Georgia woman as an … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-08/biden-shrugs-off-illegal-remark-that-drew-democrats-ire"
  },
  {
    "text": "Biden says debating Trump ‘depends on his behavior’  —  Trump challenged Biden to a debate ‘anytime, anywhere, anyplace’  —  President Biden on Friday said his decision on whether to debate President Trump ahead of Election Day is dependent on his opponent's “behavior.”",
    "url": "https://www.foxnews.com/politics/biden-says-debating-trump-depends-his-behavior"
  },
  {
    "text": "Biden.  Can.  Win.  —  Believe.  —  ∙ Paid  —  Before we get started: Sarah and I taped a banger of a Secret Podcast this morning and I pushed it out early.  You can catch it here.  Trigger warning: Johnny from Jersey is insufferable.  —  Join  —  1. Brandon  —  Were you surprised?",
    "url": "https://plus.thebulwark.com/p/biden-can-win"
  },
  {
    "text": "Trump Posts $91.6 Million Bond for Defamation Judgment in Carroll Case  —  Donald J. Trump is contending with civil penalties that are together worth more than half a billion dollars.  —  Donald J. Trump on Friday posted a $91.6 million bond in a defamation case he recently lost … ",
    "url": "https://www.nytimes.com/2024/03/08/nyregion/trump-carroll-bond-defamation.html"
  },
  {
    "text": "Trump hosts hard-line Hungarian leader Viktor Orbán at Mar-a-Lago  —  It is highly unusual for a visiting head of state to travel to the U.S. and meet with a political opponent of the president without also meeting top officials at the White House.  —  Former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-hosts-hard-line-hungarian-leader-viktor-orban-mar-lago-rcna142581"
  },
  {
    "text": "Immigrants are less likely to commit crimes than U.S.-born Americans, studies find  —  The murder of Laken Riley took center stage during Thursday night's State of The Union.  Riley was a 22-year-old student who was killed last month at the University of Georgia.",
    "url": "https://npr.org/2024/03/08/1237103158/immigrants-are-less-likely-to-commit-crimes-than-us-born-americans-studies-find"
  },
  {
    "text": "Leaked Audio Shows No Labels Has Zero Idea If It'll Find a Candidate  —  The centrist group No Labels held a vote of delegates Friday and announced plans to move forward in seeking candidates for a third-party presidential run.  Multiple news organizations have treated this as a significant event … ",
    "url": "https://newrepublic.com/article/179706/leaked-audio-no-labels-zero-idea-candidate"
  },
  {
    "text": "Exclusive: Liz Cheney, January 6 Committee Suppressed Exonerating Evidence Of Trump's Push For National Guard  —  Cheney and her committee falsely claimed they had ‘no evidence’ to support Trump officials' claims the White House had asked for 10,000 National Guard troops.",
    "url": "https://thefederalist.com/2024/03/08/exclusive-liz-cheney-january-6-committee-suppressed-exonerating-evidence-of-trumps-push-for-national-guard/"
  },
  {
    "text": "Yet another Republican senator says he won't endorse Trump in 2024  —  There are now three sitting Republican U.S. senators — and counting — who are not publicly backing Donald Trump's 2024 candidacy.  The list might yet grow.  —  During the Republican Party's presidential nominating process … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/yet-another-republican-senator-says-wont-endorse-trump-2024-rcna142498"
  },
  {
    "text": "Don't go in the kitchen.  I'm delivering a State of the Union response.  —  SWEETIE, please DON'T go in the KITCHEN.  I am delivering my State of the Union response!  —  Fellow MOMS, if you are like me, you lie awake at 2 a.m., wondering how you can BE in three places at once: this KITCHEN … ",
    "url": "https://www.washingtonpost.com/opinions/2024/03/08/katie-britt-state-of-the-union-response/"
  },
  {
    "text": "538 drops Rasmussen Reports from its analysis  —  The poll aggregation and evaluation site 538, part of ABC News, dropped the right-wing polling firm Rasmussen Reports from inclusion in its polling averages and forecasts.  —  The decision comes after months of consideration that broke into public view in June.",
    "url": "https://www.washingtonpost.com/politics/2024/03/08/rasmussen-538-polling/"
  },
  {
    "text": "USCP Officers Stop Man with Hammer during Capitol Screening  —  A team of United States Capitol Police (USCP) officers quickly arrested a man with a hammer who was trying to get into the U.S. Capitol.  —  At approximately 3:40 p.m., a man was being screened at the Capitol Visitor Center.",
    "url": "https://www.uscp.gov/media-center/press-releases/uscp-officers-stop-man-hammer-during-capitol-screening"
  },
  {
    "text": "Trump Getting DESTROYED on Truth Social Over His Vaccine Post  —  His cultists are irate.  —  Donald Trump posted a response last night on Truth Social to Joe Biden's remarks about the pandemic, and he is getting absolutely destroyed in the replies by his own MAGA supporters.  —  MAGA is almost 100% anti-vax.",
    "url": "https://www.meidastouch.com/news/trump-getting-destroyed-on-truth-social-over-his-vaccine-post"
  },
  {
    "text": "National Guard helicopter crashes near border, killing three  —  (Nexstar) — A National Guard helicopter crashed near Rio Grande City on Friday afternoon, leaving three people dead, according to multiple reports.  —  The helicopter went down in La Grulla, a small town in east Starr County … ",
    "url": "https://www.kxan.com/news/texas/sources-national-guard-helicopter-crashes-near-border-killing-two/"
  },
  {
    "text": "Congressional probe finds communications gear in Chinese cranes, raising spying concerns  —  Some Chinese-made cranes used at US ports contain communications equipment with no clear purpose or record of their installation, according to a new congressional investigation that will heighten US concerns … ",
    "url": "https://www.cnn.com/2024/03/07/politics/congressional-probe-communications-gear-chinese-cranes/"
  }
]