[
  {
    "text": "White House lawyers who advised Reagan, Bush endorse Harris over Trump in 2024 showdown  —  FIRST ON FOX: A dozen Republican White House lawyers who served in the administrations of then-Presidents Ronald Reagan, George H.W. Bush and George W. Bush are endorsing Vice President Kamala Harris … ",
    "url": "https://www.foxnews.com/politics/white-house-lawyers-who-advised-reagan-bush-endorse-harris-over-trump-2024-showdown"
  },
  {
    "text": "Disaffected Republicans and former Trump officials spoke at the DNC.  Fox News didn't air a second of any of their speeches.  —  Fox News did not air a second of the speeches from alienated GOP leaders and former Trump officials who endorsed Vice President Kamala Harris at this week's Democratic National Convention.",
    "url": "https://www.mediamatters.org/fox-news/disaffected-republicans-and-former-trump-officials-spoke-dnc-fox-news-didnt-air-second-any"
  },
  {
    "text": "Harris Crushes Trump by 22% in Convention Speech Ratings  —  MUCH BIGGER  —  The former president—who angrily posted throughout Harris' Thursday night speech—lost badly in the ratings contest that matters so much to him.  —  Newly-released TV ratings for Kamala Harris' speech at the DNC will likely have Donald Trump seething.",
    "url": "https://www.thedailybeast.com/kamala-harris-dnc-speech-crushed-ratings-for-donald-trumps-acceptance-address"
  },
  {
    "text": "Trump Is Going to Lose.  (Probably.)  —  No Secret pod today.  Sorry.  People are in transit.  Next week the world goes back to normal.  —  1. Strategery  —  This convention attempted to establish the following strategic positions:  — The Democratic party as a broad and diverse, but wholly unified, front.",
    "url": "https://www.thebulwark.com/p/trump-is-going-to-lose-probably"
  },
  {
    "text": "Is That—Is That—Optimism We Feel?  —  What a week, huh?  Thanks for staying with us through it.  Happy Friday.  —  She Nailed It  —William Kristol  —  Success.  —  Kamala Harris's acceptance speech last night was a success.  It capped a Democratic convention that was a success.",
    "url": "https://www.thebulwark.com/p/is-thatis-thatoptimism-we-feel"
  },
  {
    "text": "There's a reason Adam Kinzinger defended Democrats' patriotism  —  Republicans are 25 times more likely to describe the Democratic Party as “anti-American” than to use the term “patriotic.”  —  Recognizing that the audience for Vice President Kamala Harris's acceptance speech would probably draw … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/23/theres-reason-adam-kinzinger-defended-democrats-patriotism/"
  },
  {
    "text": "Democrats Find Confidence Without Complacency  —  It's a balance they didn't strike well in 2016, with tragic consequences  —  The lead Kamala Harris built over Donald Trump through the first month of her campaign was palpable in the thematic content of the Democratic national convention.",
    "url": "https://www.offmessage.net/p/democrats-show-confidence-without-complacency"
  },
  {
    "text": "Ahead of speech, Robert F. Kennedy Jr. says in a Pennsylvania court filing that he's endorsing Trump  —  Ahead of a planned speech, Robert F. Kennedy Jr.'s campaign said in a Pennsylvania court filing Friday that he is endorsing Donald Trump for president.  Kennedy's independent campaign … ",
    "url": "https://apnews.com/article/rfk-jr-trump-speech-arizona-a2638f89ddcb5de03edbe4574ca17d45"
  },
  {
    "text": "Robert F. Kennedy suspends his independent presidential campaign and backs Trump  —  Robert F. Kennedy Jr. is suspending his long-shot independent presidential candidacy.  He announced Friday that he is seeking to remove his name from ballots in battleground states, and is instead asking supporters … ",
    "url": "https://www.npr.org/2024/08/23/nx-s1-5086838/robert-kennedy-future-plans-trump"
  },
  {
    "text": "Elon Musk's Lawyers Quietly Subpoena Public Interest Groups  —  The billionaire's legal war over lost X advertisers takes a “really cynical” turn.  —  Lawyers representing Elon Musk and X, previously known as Twitter, have quietly begun sending subpoenas to a host of public interest groups, Mother Jones has learned.",
    "url": "https://www.motherjones.com/politics/2024/08/twitter-x-subpoenas-elon-musk/"
  },
  {
    "text": "Texas, other GOP-led states sue over program to give immigrant spouses of US citizens legal status  —  Sixteen Republican-led states are suing to end a federal program that could potentially give nearly half a million immigrants without legal status who are married to U.S. citizens a path to citizenship.",
    "url": "https://apnews.com/article/immigration-citizen-spouse-biden-d02243b21b8490c912008b896a83bcd2"
  },
  {
    "text": "Kennedy siblings rip RFK Jr. for endorsing Trump: ‘A betrayal’ of family values  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/homenews/campaign/4844836-rfk-jr-family-trump-endorsement/"
  },
  {
    "text": "Ann Coulter Roast Goes Viral as Internet Gets Revenge for Gus Walz  —  BLOWING UP  —  The conservative firebrand told the Daily Beast that Democrats were actually to blame for her mocking Tim Walz's son.  —  Conservative political commentator Ann Coulter was hit by a blizzard of criticism … ",
    "url": "https://www.thedailybeast.com/ann-coulter-roast-goes-viral-as-internet-gets-revenge-for-gus-walz"
  },
  {
    "text": "Alaska Republican drops out of three-way House race, dealing surprise blow to Democrats nationally  —  In what may be a surprise blow to Democrats' chances of holding a key red state seat in the U.S. House, Alaska Lt. Gov. Nancy Dahlstrom announced Friday she is suspending her campaign for Congress.",
    "url": "https://www.foxnews.com/politics/alaska-republican-drops-out-multi-way-house-race-dealing-surprise-blow-democrats-nationally"
  },
  {
    "text": "U.S. will again offer free at-home Covid tests starting in late September … The Biden administration on Friday said it will resume offering free at-home Covid-19 tests to American households in late September as the virus has gained a stronger foothold in the U.S. this summer.",
    "url": "https://www.cnbc.com/2024/08/23/covid-tests-us-will-offer-free-at-home-kits-starting-late-september.html"
  },
  {
    "text": "Trump Special Counsel Opts Against Mini-Trial Before Election  — Jack Smith focused on revising indictment in Jan. 6 case  — Judge Chutkan has set Sept. 5 hearing to review next steps",
    "url": "https://www.bloomberg.com/news/articles/2024-08-23/trump-special-counsel-opts-against-mini-trial-before-election"
  },
  {
    "text": "DOJ sues software firm, alleging pricing algorithm enables landlords to raise rents  —  The Department of Justice (DOJ) sued the property management software company RealPage on Friday, alleging that its pricing algorithm enables landlords to share sensitive pricing information and raise rental prices.",
    "url": "https://thehill.com/policy/technology/4844069-realpage-sued-for-rental-price-manipulation/"
  },
  {
    "text": "Doug Emhoff, modern-day sex symbol  —  Emhoff is secure enough with his own masculinity to sometimes prioritize his wife's ambitions over his own.  What.  A. Hunk.  —  Doug Emhoff has been called many things in recent years: Second Gentleman.  “Goofy dad.”  “Crappy Jew.”",
    "url": "https://www.washingtonpost.com/opinions/2024/08/23/emhoff-harris-sex-symbol/"
  }
]