[
  {
    "text": "Maine secretary of state targeted with ‘swatting call’ after ruling Trump ineligible for ballot  —  The incident happened just a day after Bellows, a Democrat, ruled former President Donald Trump is constitutionally ineligible to appear on the state's primary ballot next year.",
    "url": "https://www.nbcnews.com/politics/2024-election/maine-secretary-state-targeted-swatting-call-ruling-trump-ineligible-b-rcna131711"
  },
  {
    "text": "Trump's GOP Delegate Hunt Doubles as Legal Strategy in Jan. 6 Case.  And Beyond.  —  In the mind of Donald Trump's presidential campaign, the primary polls and history don't lie: he'll be the Republican nominee, and all his major primary rivals will likely drop out after he wins all four early states.",
    "url": "https://themessenger.com/news/what-jan-6-and-trumps-convention-delegate-strategy-have-in-common"
  },
  {
    "text": "Led by Trump, GOP candidates take polarizing stances on race and history  —  The party's three leading candidates are speaking about history and race in polarizing and provocative ways that sometimes diverge from or distort the facts, some political strategists, experts and civil rights leaders said",
    "url": "https://www.washingtonpost.com/elections/2023/12/30/trump-desantis-haley-race-slavery/"
  },
  {
    "text": "Nikki Haley says pardoning Trump is in the country's ‘best interest’  —  Haley has often been accused of flip-flopping when it comes to Trump.  Her comments about pardoning him have opened her up to further criticism.  —  On the heels of a very bad week for Nikki Haley … ",
    "url": "https://www.msnbc.com/top-stories/latest/nikki-haley-trump-pardon-rcna131580"
  },
  {
    "text": "Bankrupt ex-Mayor Rudy Giuliani regrets not having a NYC pension  —  Former Mayor Rudy Giuliani, who filed for bankruptcy in the wake of a $148 million civil court ruling and faces a mountain of unpaid legal bills, said he now regrets not having the safety net of a government pension.",
    "url": "https://nypost.com/2023/12/30/metro/bankrupt-rudy-giuliani-regrets-not-having-nyc-pension/"
  },
  {
    "text": "Controversial Middle Tennessee Lewis Country Store set for January sale, official confirms  —  Nashville's notorious Lewis Country Store — known for its southern hospitality and controversial political ties — will soon change owners.  —  The North Nashville gas station and marketplace … ",
    "url": "https://www.tennessean.com/story/news/2023/12/29/nashville-notorious-lewis-country-store-set-for-january-sale/72061325007/"
  },
  {
    "text": "Tom Wilkinson: The Full Monty actor dies at 75  —  British actor Tom Wilkinson, known for films like The Full Monty, Shakespeare In Love and The Best Exotic Marigold Hotel, has died aged 75.  —  Wilkinson won a Bafta for 1997's The Full Monty, and reprised the role of Gerald … ",
    "url": "https://www.bbc.com/news/entertainment-arts-65823240"
  },
  {
    "text": "Paula Abdul accuses ‘American Idol’ executive producer Nigel Lythgoe of sexual assault in new lawsuit  —  The Grammy-winning singer said the assaults happened in the early 2000s and around 2015 while she was a judge on the television competition shows.  —  Paula Abdul accused “American Idol” … ",
    "url": "https://www.nbcnews.com/news/us-news/paula-abdul-accuses-american-idol-executive-producer-nigel-lythgoe-sex-rcna131677"
  },
  {
    "text": "DOJ declines to prosecute additional charges against Sam Bankman-Fried, instead focusing on sentencing in first trial  —  said Friday that they will not pursue a second trial against disgraced FTX founder Sam Bankman-Fried.  —  In November, a jury found Bankman-Fried guilty of seven criminal counts … ",
    "url": "https://www.washingtonexaminer.com/news/doj-declines-prosecute-sbf-additional-charges"
  },
  {
    "text": "Where Was the Israeli Military?  —  A Times investigation found that troops were disorganized, out of position and relied on social media to choose targets.  Behind the failure: Israel had no battle plan for a massive Hamas invasion.  —  Far beneath the Israeli military headquarters in Tel Aviv … ",
    "url": "https://www.nytimes.com/2023/12/30/world/middleeast/israeli-military-hamas-failures.html"
  },
  {
    "text": "Jack Smith: Trump Immunity Bid a ‘License’ to Commit Crimes  —  He warns in a new filing that Trump's bid to shield himself from criminal liability “threatens the democratic and constitutional foundation of our Republic.”  —  Special counsel Jack Smith warned in a new filing Saturday … ",
    "url": "https://www.thedailybeast.com/jack-smith-warns-donald-trumps-immunity-claim-could-license-presidents-to-commit-crimes"
  },
  {
    "text": "Presidential candidate Haley cheers on Iowa hoops star Caitlin Clark in between campaign stops  —  IOWA CITY, Iowa (AP) — Republican presidential candidate Nikki Haley finally got her wish to see Iowa basketball star Caitlin Clark, catching the fourth-ranked Hawkeyes in between campaign stops Saturday.",
    "url": "https://apnews.com/article/nikki-haley-iowa-basketball-caitlin-clark-c0f81f8c65b911f59080f57a436f33bd"
  },
  {
    "text": "USA Boxing to allow transgender women to compete against female boxers under certain conditions from 2024 after introducing new policy  — USA Boxing has introduced a ‘Transgender Policy’ to its rule book for 2024  — Transgender boxers will be permitted to fight in the category of their choice",
    "url": "https://www.dailymail.co.uk/sport/boxing/article-12912389/USA-Boxing-transgender-women-compete-female-boxers-2024-policy.html"
  },
  {
    "text": "Biden's Crime Problem: Violent Crime is Down, but Voters Don't Believe it  —  Americans perceive crime as a major problem, even as data shows crime falling in most cities nationwide  —  Violent crime is dropping in most major American cities, but voters nationwide still think crime is on the rise.",
    "url": "https://themessenger.com/politics/bidens-crime-problem-violent-crime-is-down-but-voters-dont-believe-it"
  }
]