[
  {
    "text": "‘Gas Hat’ Jan. 6 rioter who first breached Capitol tunnel entrance arrested by FBI  —  Gregory Mijares, who federal authorities say set off a battle between law enforcement at the lower west tunnel, was identified with the help of online sleuths.  —  WASHINGTON — The man who federal authorities … ",
    "url": "https://www.nbcnews.com/politics/justice-department/gas-hat-jan-6-rioter-first-breached-capitol-tunnel-entrance-arrested-f-rcna102361"
  },
  {
    "text": "Powerful quake in Morocco kills more than 2,000 people and damages historic buildings in Marrakech  —  A rare, powerful earthquake struck Morocco, sending people racing from their beds into the streets and toppling buildings in mountainous villages and ancient cities not built to withstand such force.",
    "url": "https://apnews.com/article/morocco-earthquake-marraskesh-7f4a503009dede0dec0208c08d6b100b"
  },
  {
    "text": "New Mexico governor issues order suspending the right to carry firearms in public across Albuquerque  —  New Mexico Gov. Michelle Lujan Grisham on Friday issued an emergency order suspending the right to carry firearms in public across Albuquerque and the surrounding county for at least 30 days in response to a spate of gun violence.",
    "url": "https://apnews.com/article/albuquerque-guns-governor-concealed-carry-fc5b4b79bf411b8022c3ad58975724d7"
  },
  {
    "text": "Colorado secretary of state calls Trump a ‘liar,’ vows to see ballot lawsuit through  —  Colorado Secretary of State Jena Griswold (D) called former President Trump a “liar,” after he suggested a recent push to use the 14th Amendment to keep him off the ballot in the state was “election interference.”",
    "url": "https://thehill.com/regulation/court-battles/4196268-colorado-official-on-trump-ballot-lawsuit/"
  },
  {
    "text": "Whom Does a Mother's Body Belong To?  —  When my first child was a few months old, a man shouted at me while I stood in the snow with my sleeping baby slung over my shoulder, partially covered by a worn blanket.  We lived in upstate New York, it was winter, and she had fallen asleep on me during a rare outing.",
    "url": "https://www.nytimes.com/2023/09/10/opinion/motherhood-bodily-autonomy.html"
  },
  {
    "text": "US seizes nearly 1 million barrels of Iranian oil allegedly bound for China  —  The US government seized nearly 1 million barrels of Iranian crude oil allegedly bound for China, according to newly unsealed court documents and a statement released by the Department of Justice on Friday.",
    "url": "https://www.cnn.com/2023/09/09/politics/us-oil-iran-china-doj/"
  },
  {
    "text": "Ignore Jack Smith's Critics  —  The prosecutions of Donald Trump are something to celebrate, not lament.  —  Several distinguished individuals have recently expressed grave reservations about the prosecutions of former President Donald Trump.  Notably, they appear to have no dispute about the seriousness of his wrongdoing.",
    "url": "https://www.theatlantic.com/ideas/archive/2023/09/trump-prosecutions-american-democracy/675262/"
  },
  {
    "text": "Pastor Says It Was a Mistake to Let DeSantis Speak at Shooting Vigil  —  Ron DeSantis was booed as he took the mic at a vigil for the victims of the racially motivated Dollar Store attack in Jacksonville.  —  A pastor who emceed Florida Gov. Ron DeSantis at a vigil following the racist massacre … ",
    "url": "https://www.thedailybeast.com/pastor-john-allen-newman-regrets-inviting-ron-desantis-to-shooting-vigil"
  },
  {
    "text": "Trump in South Dakota: Decision to overturn Roe v. Wade ‘probably cost’ GOP politically  —  Former President Trump told a crowd in South Dakota on Friday that the Supreme Court's decision to remove federal abortion rights protections “probably cost” the Republican Party politically, but was still the right decision.",
    "url": "https://thehill.com/homenews/campaign/4195974-trump-roe-v-wade-overturn-cost-gop-politically/"
  },
  {
    "text": "Colombian President proposes Latin American alliance to transform ‘war on drugs’  —  Colombian President Gustavo Petro proposed on Saturday an alliance between Latin American countries to bring a unified voice to the fight against drug trafficking, by recognizing drug consumption … ",
    "url": "https://www.reuters.com/world/americas/colombian-president-proposes-latin-american-alliance-transform-war-drugs-2023-09-09/"
  },
  {
    "text": "He Was Just the I.T. Guy.  Then He Got Caught in the Trump Documents Case.  —  Yuscil Taveras is among the little-known people with links to Donald Trump to have come under scrutiny.  So far, he's the only Trump employee known to have agreed to cooperate with prosecutors after facing charges.",
    "url": "https://www.nytimes.com/2023/09/09/us/politics/yuscil-taveras-trump-documents-case.html"
  },
  {
    "text": "Wisconsin GOP's impeachment plan: Another MAGA coup against democracy  —  Republicans in the Badger State hatch an ingenious plot to thwart voters — but ultimately, they will pay the price  —  MAGA Republicans in Wisconsin are gearing up to impeach newly elected state Supreme Court Justice … ",
    "url": "https://www.salon.com/2023/09/08/wisconsin-gops-impeachment-plan-another-maga-coup-against-democracy/"
  },
  {
    "text": "5th Circuit finds Biden White House, CDC likely violated First Amendment  —  The three judge panel found that contacts with tech companies by officials from the White House, the surgeon general's office, the CDC and the FBI likely amounted to coercion  —  The U.S. Court of Appeals … ",
    "url": "https://www.washingtonpost.com/technology/2023/09/08/5th-circuit-ruling-covid-content-moderation/"
  },
  {
    "text": "Ag is essential for America's revival.  I will stand with our farmers.  —  America must take a page from Iowa's farmers to better harvest our resources, accommodate nature's challenges, and cultivate a culture resilient to history's seasons.  —  America is in a state of decline.",
    "url": "https://www.desmoinesregister.com/story/opinion/columnists/2023/09/09/ron-desantis-agriculture-essential-america-revival-farmers/70800100007/"
  },
  {
    "text": "What an unprecedented Biden ad blitz says about his reelection fight  —  A super PAC affiliate is spending $13 million far ahead of the normal advertising timeline.  —  The cavalry is arriving extraordinarily early for President Joe Biden.  —  With poll after brutal poll showing the president … ",
    "url": "https://www.politico.com/news/2023/09/09/what-an-unprecedented-biden-ad-blitz-says-about-his-reelection-fight-00114838"
  }
]