[
  {
    "text": "Exclusive: Apple to pause advertising on X after Musk backs antisemitic post … - The left-leaning nonprofit Media Matters for America published a report Thursday that highlighted Apple, IBM, Amazon and Oracle as among those whose ads were shown next to far-right posts.",
    "url": "https://www.axios.com/2023/11/17/apple-twitter-x-advertising-elon-musk-antisemitism-ads"
  },
  {
    "text": "Lionsgate Has Suspended All Advertising on X, Spokesman Says  —  Lions Gate Entertainment Corp. has suspended all advertising on X, effective immediately, a company spokesman said by email.  —  Lionsgate's decision to pull advertising from the social-media platform formerly known as Twitter comes … ",
    "url": "https://www.bloomberg.com/news/articles/2023-11-17/lionsgate-has-suspended-all-advertising-on-x-spokesman-says"
  },
  {
    "text": "Apple and Disney Halt Ads on X After Musk Endorses Antisemitic Post  —  Disney, Apple and Lionsgate halted marketing on X, formerly Twitter, as Elon Musk faced a furor over antisemitic abuse on his social media platform.  —  The blowback over Elon Musk's endorsement of an antisemitic conspiracy theory … ",
    "url": "https://www.nytimes.com/2023/11/17/technology/elon-musk-twitter-x-advertisers.html"
  },
  {
    "text": "Colorado Judge Keeps Trump on Ballot, Rejecting 14th Amendment Argument  —  A district court judge rejected a request to declare former President Donald J. Trump ineligible to hold office, ruling that he did “engage in insurrection” but that a constitutional prohibition did not apply to him.",
    "url": "https://www.nytimes.com/2023/11/17/us/politics/colorado-trump-14th-amendment.html"
  },
  {
    "text": "Donald Trump poses the biggest danger to the world in 2024  —  What his victory in America's election would mean  —  Enjoy more audio and podcasts on iOS or Android.  —  A shadow looms over the world.  In this week's edition we publish The World Ahead 2024, our 38th annual predictive guide … ",
    "url": "https://www.economist.com/leaders/2023/11/16/donald-trump-poses-the-biggest-danger-to-the-world-in-2024"
  },
  {
    "text": "Mike Johnson to release 40,000 hours of Jan. 6 footage … - Johnson said the decision will “provide millions of Americans, criminal defendants, public interest organizations, and the media an ability to see for themselves what happened that day, rather than having to rely upon the interpretation … ",
    "url": "https://www.axios.com/2023/11/17/mike-johnson-capitol-jan-6-security-footage"
  },
  {
    "text": "‘No Labels’ Tax Forms Reveal Execs Cashing In on 2024 Hype  —  According to tax documents obtained by The Daily Beast, the centrist group plotting a 2024 challenge is raising lots of dough, padding its leaders' paychecks. … No Labels, No Worries  —  As the centrist group No Labels gears … ",
    "url": "https://www.thedailybeast.com/no-labels-tax-forms-reveal-execs-cashing-in-on-centrist-2024-third-party-campaign-hype"
  },
  {
    "text": "OpenAI announces leadership transition … The board of directors of OpenAI, Inc., the 501(c)(3) that acts as the overall governing body for all OpenAI activities, today announced that Sam Altman will depart as CEO and leave the board of directors.  Mira Murati, the company's chief technology officer … ",
    "url": "https://openai.com/blog/openai-announces-leadership-transition"
  },
  {
    "text": "Statement on the Health of Rosalynn Carter  —  ATLANTA (Nov. 17, 2023) — On behalf of Jason Carter, grandson of President and Mrs. Carter:  —  Former First Lady Rosalynn Carter has entered hospice care at home.  She and President Carter are spending time with each other and their family.",
    "url": "https://www.cartercenter.org/news/pr/2023/statement-on-rosalynn-carter-entering-hospice.html"
  },
  {
    "text": "White House challenges legitimacy of impeachment inquiry in letter to chairmen  —  White House special counsel is demanding withdrawal of subpoenas and requests to Biden family members and aides  —  White House special counsel Dick Sauber questioned the validity of the GOP-led impeachment inquiry … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/17/biden-impeachment-subpoena-white-house/"
  },
  {
    "text": "'It feels like I'm not crazy.' Gardeners aren't surprised as USDA updates key map  —  Loading...  A newly updated government map has many of the nation's gardeners rushing online, Googling what new plants they can grow in their mostly warming regions.  —  It's called the U.S. Department … ",
    "url": "https://www.npr.org/2023/11/17/1213600629/-it-feels-like-im-not-crazy-gardeners-arent-surprised-as-usda-updates-key-map"
  },
  {
    "text": "Washington Post lawsuit challenges Florida law shielding DeSantis travel records  —  The governor's travels have come under scrutiny, especially after he jumped into the race for president.  —  TALLAHASSEE, Fla. — A Florida law blocking Gov. Ron DeSantis' publicly funded travel records … ",
    "url": "https://www.politico.com/news/2023/11/17/washington-post-lawsuit-challenges-florida-law-shielding-desantis-travel-records-00127875"
  },
  {
    "text": "Trump Adviser Stephen Miller's Legal Group Rakes in $44 Million  — America First Legal's revenue jumped 600%, tax filings show  — Group is part of a nonprofit network tied to Donald Trump … The increase came as the group, America First Legal, expanded its work filing lawsuits … ",
    "url": "https://www.bloomberg.com/news/articles/2023-11-17/stephen-miller-s-america-first-legal-group-raises-44-million"
  },
  {
    "text": "Damning Ethics Report Solves the Big George Santos Question: Where the Money Came From  —  Tucked into a footnote and two appendixes in the Ethics Committee's damning report on George Santos is the answer to one of the most puzzling and persistent questions about Santos.",
    "url": "https://www.thedailybeast.com/damning-ethics-report-solves-the-big-george-santos-question-where-the-money-came-from"
  },
  {
    "text": "Did Ohio Republicans see the election results?  Or do they just not care?  —  Ohio's Republican lawmakers and governor are pushing back against 57% blowout wins for abortion rights and marijuana legalization at the ballot box.  —  Ohio Republicans are behaving badly … ",
    "url": "https://www.lawdork.com/p/did-ohio-republicans-see-the-election-results"
  },
  {
    "text": "Fairfax County Public Schools suspends student for allegedly blowing whistle on swastika flag  —  Last week, Jewish students at Langley High School were stunned to see the image of a U.S. flag that a classmate had drawn in Room 1406 during a meeting of the Muslim Students Association … ",
    "url": "https://www.fairfaxtimes.com/articles/fairfax_county/fairfax-county-public-schools-suspends-student-for-allegedly-blowing-whistle-on-swastika-flag/article_26c795f4-84a9-11ee-8c2e-d709babe6b5d.html"
  },
  {
    "text": "CNN Poll: New Hampshire Democrats see Biden as party's best shot to hold White House  —  New Hampshire's likely Democratic primary voters still mostly plan to vote for President Joe Biden, even though his name won't appear on their primary ballots in January, according to a new CNN Poll conducted by the University of New Hampshire.",
    "url": "https://www.cnn.com/2023/11/17/politics/cnn-poll-new-hampshire-democrats-biden/"
  },
  {
    "text": "Israel's Ludicrous Propaganda Wins Over the Only Audience That Counts  —  Why make an effort to be credible if you're going to be uncritically echoed by White House and the Western press?  —  Pocket  —  On November 11, an Arabic-language Twitter account maintained by Israel's Ministry … ",
    "url": "https://www.thenation.com/article/world/israel-gaza-propaganda-biden/"
  }
]