[
  {
    "text": "First on CNN: Burgum suffered high-grade Achilles tear playing basketball, throwing debate participation into question  —  North Dakota governor and Republican presidential candidate Doug Burgum suffered a high-grade tear of his Achilles tendon while playing a game of pick-up basketball … ",
    "url": "https://www.cnn.com/2023/08/23/politics/doug-burgum-injured/"
  },
  {
    "text": "North Dakota Gov. Doug Burgum suffers injury ahead of Republican presidential debate  —  Injury brings Burgum's debate status for tonight in question, campaign tells Fox News  —  North Dakota Gov. Doug Burgum suffered a leg injury in Milwaukee, Wisconsin last night while playing a game … ",
    "url": "https://www.foxnews.com/politics/north-dakota-gov-doug-burgum-suffers-injury-republican-presidential-debate"
  },
  {
    "text": "The GOP debate shows that Trump's hostile takeover is complete  —  He's thoroughly humiliated everyone involved, including Fox News and the RNC. … The first Republican presidential primary debate of 2024 is tonight.  Usually the events are chances to shape the future of a party by introducing voters to new ideas and faces.",
    "url": "https://www.publicnotice.co/p/fox-news-gop-debate-trump-2024"
  },
  {
    "text": "Tucker Carlson and Donald Trump reunite to try to upstage Fox News  —  The on-again, off-again partnership found mutual benefit in a pre-recorded interview to air during the first Republican presidential debate  —  Last Wednesday, Donald Trump welcomed Tucker Carlson and his small team … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/22/tucker-carlson-donald-trump-reunite-try-upstage-fox-news/"
  },
  {
    "text": "Poll: DeSantis's support collapses ahead of 1st GOP debate  —  Last month, Florida Gov. Ron DeSantis launched a heavily hyped campaign “reboot,” in hopes of saving his struggling bid for the 2024 Republican presidential nomination.  —  It hasn't worked, according to a new Yahoo News/YouGov poll.",
    "url": "https://news.yahoo.com/poll-desantiss-support-collapses-ahead-of-1st-gop-debate-214353402.html"
  },
  {
    "text": "Prosecutors: Trump Mar-a-Lago security aide flipped after changing lawyers  —  Special counsel Jack Smith's team revealed the details of the employee's about-face in a new filing.  —  A Trump employee who monitored security cameras at Donald Trump's Mar-a-Lago estate abruptly retracted … ",
    "url": "https://www.politico.com/news/2023/08/22/trump-witness-reversal-testimony-jack-smith-00112355"
  },
  {
    "text": "Recent obstruction charges against Trump, others followed cooperation from Mar-a-Lago IT worker: Sources  —  The IT staffer is set to be a central witness in the case against Trump.  —  A Mar-a-Lago Information Technology worker's decision to cooperate with special counsel Jack Smith … ",
    "url": "https://abcnews.go.com/US/recent-obstruction-charges-trump-cooperation-mar-lago-worker/story?id=102431568"
  },
  {
    "text": "Rudy Giuliani Set to Meet With Fani Willis in Georgia: Report  —  SO IT BEGINS...  Rudy Giuliani is expected to travel to Georgia on Wednesday to meet with Fulton County prosecutors—including District Attorney Fani Willis—according to CNN.  Giuliani, a former federal prosecutor himself … ",
    "url": "https://www.thedailybeast.com/rudy-giuliani-set-to-meet-with-fani-willis-in-georgia-report-says"
  },
  {
    "text": "‘Dark Brandon’ Appears on Fox News' Homepage on Day of Republican Debates: 'I'm Bringing Roe Back' (Exclusive)  —  President Joe Biden's 2024 reelection campaign is sending Milwaukee — and Fox News readers — a pro-choice message from the president's satirical alter-ego",
    "url": "https://people.com/dark-brandon-fox-news-homepage-ads-gop-debate-exclusive-7734825"
  },
  {
    "text": "Trump gravitates to fringe figures despite efforts to limit their influence  —  The former president has resumed consulting with and embracing supporters whom other Republicans shun  —  On Aug. 13, former president Donald Trump spent the day at his New Jersey golf club with former congressional … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/23/trump-fringe-advisers-campaign/"
  },
  {
    "text": "Man flees China by riding jet ski hundreds of miles to South Korea  —  The man, who has been detained since washing up in the port city of Incheon last week, is believed to be a dissident who was previously jailed for criticizing President Xi Jinping.  —  Video shows jet ski ‘Chinese man used to travel to South Korea’",
    "url": "https://www.nbcnews.com/news/world/china-dissident-jet-ski-south-korea-xi-jinping-rcna101343"
  },
  {
    "text": "Fake electors, Trump attorneys surrender in Trump Georgia case  —  More defendants charged alongside former President Trump in Georgia are surrendering, including two of the three indicted fake electors and two Trump attorneys.  —  David Shafer and Cathy Latham, both of whom signed documents purporting … ",
    "url": "https://thehill.com/regulation/court-battles/4166131-two-accused-fake-electors-surrender-in-trump-georgia-case/"
  },
  {
    "text": "The Secret Weapon Hackers Can Use to Dox Nearly Anyone in America for $15  —  It took only a few seconds to uncover the target's entire life.  —  On the messaging app Telegram, I entered a tiny amount of information about my target into the dark blue text box—their name and the state I believed they lived in—and pressed enter.",
    "url": "https://www.404media.co/the-secret-weapon-hackers-can-use-to-dox-nearly-anyone-in-america-for-15-tlo-usinfosearch-transunion/"
  },
  {
    "text": "How Oklahoma's schools superintendent became the state's top culture warrior  —  Ryan Walters, who called a teachers union a “terrorist organization” and pushed for prayer in public schools, offers a preview of what could be coming in other Republican-led states.",
    "url": "https://www.nbcnews.com/news/us-news/ryan-walters-oklahoma-schools-superintendent-tulsa-rcna101235"
  },
  {
    "text": "All male South Carolina Supreme Court upholds ‘fetal heartbeat’ abortion ban  —  South Carolina's law banning abortion after detection of a “fetal heartbeat” is legal, and there is no constitutional right to an abortion, the state Supreme Court ruled Wednesday.",
    "url": "https://thehill.com/policy/healthcare/4166484-south-carolinas-fetal-heartbeat-abortion-ban-upheld-as-constitutional/"
  },
  {
    "text": "Ramaswamy faces scrutiny over suggesting government involvement in 9/11  —  The GOP presidential candidate claimed that an Atlantic article misquoted him.  But then the publication released the interview audio.  —  Republican presidential candidate Vivek Ramaswamy was caught in a blunder … ",
    "url": "https://www.politico.com/news/2023/08/22/ramaswamy-scrutiny-9-11-00112302"
  }
]