[
  {
    "text": "House Republicans eye scaled back tax cut amid fights over spending  —  House GOP tax writers are eyeing a scaled-back $4 trillion tax cut amid concerns their colleagues will not be able to come up with the full slate of spending cuts required under their budget plan, people familiar with their internal deliberations say.",
    "url": "https://www.politico.com/live-updates/2025/05/07/congress/house-republicans-eye-scaled-back-tax-cut-amid-fights-over-spending-00333270"
  },
  {
    "text": "CBO: Millions could lose coverage if GOP pulls back on Medicaid expansion  —  Congress' nonpartisan scorekeeper projects that millions of Americans would lose health coverage under options currently being considered by Republicans to help pay for President Donald Trump's “big, beautiful bill.”",
    "url": "https://www.politico.com/live-updates/2025/05/07/congress/cbo-millions-could-lose-coverage-from-pulling-back-on-medicaid-expansion-00332758"
  },
  {
    "text": "Laura Loomer Just Called the GOP's Bluff on Medicaid Cuts  —  THE INTERNAL REPUBLICAN FIGHT over potential Medicaid cuts has gotten so intense that even Laura Loomer is getting involved.  —  On Monday night, the MAGA influencer known for white nationalist rhetoric and conspiracy theories posted … ",
    "url": "https://www.thebulwark.com/p/laura-loomer-just-called-the-gop-bluff-on-medicaid-cuts-maga"
  },
  {
    "text": "America Needs More Judges Like Judge Myers  —  When judges act as partisan hacks, it is important to condemn their conduct.  Last month, four Republican justices on the North Carolina Supreme Court blessed the antidemocratic attempt by the fellow Republican judge Jefferson Griffin to subvert … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/05/north-carolina-supreme-court/682731/"
  },
  {
    "text": "Griffin concedes NC Supreme Court race, ending unprecedented effort to overturn election  —  After spending over six months vigorously contesting his narrow loss in the 2024 North Carolina Supreme Court election, Jefferson Griffin conceded the race on Wednesday following a federal judge's ruling against him.",
    "url": "https://www.newsobserver.com/news/politics-government/article305898251.html"
  },
  {
    "text": "Republican Jefferson Griffin concedes N.C. Supreme Court race after months of legal battles  —  The announcement, which comes six months after the final votes were cast, brings an end to the final unresolved contest from the 2024 election.  —  Republican Jefferson Griffin conceded … ",
    "url": "https://www.nbcnews.com/politics/elections/republican-jefferson-griffin-concedes-nc-supreme-court-race-rcna205358"
  },
  {
    "text": "Jefferson Griffin Concedes Defeat in N.C. Supreme Court Race  —  Three counts showed that the incumbent, a Democrat, won the State Supreme Court election last fall.  But Judge Jefferson Griffin tried for months to reverse his loss through the courts.  —  A six-month battle … ",
    "url": "https://www.nytimes.com/2025/05/07/us/politics/north-carolina-supreme-court-gop-concession.html?unlocked_article_code=1.FU8.sKCj.uIcBrMHYkZpR"
  },
  {
    "text": "Trump Taps a ‘MAHA’ Movement Leader for Surgeon General  —  Casey Means will work closely with RFK Jr. on health policy, president says  —  WASHINGTON—President Trump said he would nominate Dr. Casey Means, a California doctor and wellness influencer, to be the next surgeon general.",
    "url": "https://www.wsj.com/politics/policy/trump-taps-a-maha-movement-leader-for-surgeon-general-81756dfa?st=g8DcpA&reflink=article_copyURL_share"
  },
  {
    "text": "Trump pulls surgeon general nominee  —  President Trump has pulled his nomination of Janette Nesheiwat to be U.S. surgeon general and has instead chosen chronic disease entrepreneur Casey Means, a physician with close ties to the “Make American Healthy Again,” or MAHA, movement, as his new pick to fill the role.",
    "url": "https://thehill.com/policy/healthcare/5288601-trump-nominee-casey-means-surgeon-general/"
  },
  {
    "text": "Libya's Leaders Say They Haven't Agreed to Accept Deported Migrants From the U.S.  —  Court says Trump administration can't deport people to Libya without giving them proper notice  —  Libya's two rival governments on Wednesday said they had not agreed to accept migrants from the U.S. … ",
    "url": "https://www.wsj.com/politics/policy/libyas-leaders-say-they-havent-agreed-to-accept-deported-migrants-from-the-u-s-c28ffd05"
  },
  {
    "text": "Everyone Is Cheating Their Way Through College  —  ChatGPT has unraveled the entire academic project.  —  Chungin “Roy” Lee stepped onto Columbia University's campus this past fall and, by his own admission, proceeded to use generative artificial intelligence to cheat on nearly every assignment.",
    "url": "https://nymag.com/intelligencer/article/openai-chatgpt-ai-cheating-education-college-students-school.html"
  },
  {
    "text": "U.S. pushes nations facing tariffs to approve Musk's Starlink, cables show  —  Some countries have turned to the satellite internet firm in conjunction with trade talks, State Department staffers wrote.  The U.S. has a strategic interest in countering Chinese internet providers, but Musk's role complicates the picture.",
    "url": "https://www.washingtonpost.com/business/2025/05/07/elon-musk-starlink-trump-tariffs/"
  },
  {
    "text": "Kari Lake says OAN's far-right coverage will fuel Voice of America  —  Senior presidential adviser Kari Lake appears to have resolved any doubts about what she wants to do with the Voice of America.  —  Lake seeks for it to look and sound a lot like the far-right One America News Network … ",
    "url": "https://www.npr.org/2025/05/07/nx-s1-5389453/kari-lake-says-oans-far-right-coverage-will-fuel-voice-of-america"
  },
  {
    "text": "Trump's NIH Axed Research Grants Even After a Judge Blocked the Cuts, Internal Records Show  —  A lawsuit led by the Washington state attorney general offers an unprecedented view of the termination of more than 600 NIH grants, including transgender research grants threatened by Trump's executive orders.",
    "url": "https://www.propublica.org/article/trump-nih-cuts-transgender-research-grants"
  },
  {
    "text": "DOGE Aide Who Helped Gut CFPB Was Warned About Potential Conflicts of Interest  —  Before he helped fire most Consumer Financial Protection Bureau staffers, DOGE's Gavin Kliger was warned about his investments and advised to not take any actions that could benefit him personally, according to a person familiar with the situation.",
    "url": "https://www.propublica.org/article/cfpb-gavin-kliger-doge-conflict-of-interest-consumer-financial-protection-bureau"
  },
  {
    "text": "The long-shot African cardinals who could make papal history  —  While an African pope would be a historically stunning development, just one of the drawbacks is that no African cardinal holds a major office in the Vatican.  —  As the Catholic Church's College of Cardinals enters the conclave … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/will-become-pope-african-cardinals-are-running-rcna205289"
  },
  {
    "text": "Disney to build its 7th theme park, this one in the United Arab Emirates  —  Disney will build its seventh theme park, this one in the United Arab Emirates, the entertainment company said Wednesday.  —  The waterfront resort will be built on Yas Island on the outskirts of Abu Dhabi … ",
    "url": "https://apnews.com/article/disney-abu-dhabi-miral-yas-uae-trump-831fe2e23068b5d487765c53a7d52e63"
  },
  {
    "text": "Chief Justice John Roberts defends independent judiciary as Trump officials criticize courts  —  Speaking in Buffalo, the Supreme Court justice said judges sometimes have to “check the excesses” of the president and Congress.  —  Chief Justice John Roberts on Wednesday stressed the importance … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-john-roberts-independent-judiciary-trump-officials-rcna205461"
  },
  {
    "text": "Live Updates: No Pope Elected on Cardinals' First Vote  —  The Vatican conclave will continue on Thursday with more voting.  A two-thirds majority of the 133 cardinals is required to select a new leader for the world's 1.4 billion Roman Catholics.  —  Vatican Media, via Associated Press",
    "url": "https://www.nytimes.com/live/2025/05/07/world/pope-conclave-updates"
  },
  {
    "text": "Exclusive: Some ‘Les Mis’ cast members plan to boycott Trump's attendance at Kennedy Center performance next month  —  When President Donald Trump descends on the Kennedy Performing Arts Center next month for a high-dollar fundraiser and a performance of “Les Misérables,” … ",
    "url": "https://cnn.com/2025/05/07/politics/kennedy-center-les-mis-cast-boycott-trump"
  },
  {
    "text": "Exclusive: U.S., Israel discuss possible U.S.-led administration for Gaza, sources say  —  The United States and Israel have discussed the possibility of Washington leading a temporary post-war administration of Gaza, according to five people familiar with the matter.",
    "url": "https://www.reuters.com/world/middle-east/us-israel-discuss-possible-us-led-administration-gaza-sources-say-2025-05-07/"
  },
  {
    "text": "Biden's Gaza pier injured far more troops than previously known  —  More than 60 service members were injured as a part of former President Joe Biden's floating aid pier in Gaza, a Pentagon Inspector General report published on Tuesday said, a number significantly higher than had been previously disclosed.",
    "url": "https://www.reuters.com/world/bidens-gaza-pier-injured-far-more-troops-than-previously-known-2025-05-07/"
  },
  {
    "text": "US Health department will analyze data from autistic Medicare, Medicaid enrollees, RFK Jr. says  —  Health Secretary Robert F. Kennedy Jr. announced a plan Wednesday to use medical data and records from people on Medicaid and Medicare to help study autism although experts say it's unlikely to help reveal the condition's root causes.",
    "url": "https://apnews.com/article/kennedy-autism-medicare-medicaid-0507cd8117f299a50bc20b9ea8569048"
  },
  {
    "text": "Exclusive: Ford hikes prices on Mexico-produced models, citing tariffs  —  Ford Motor (F.N) is hiking prices on three of its Mexico-produced models effective May 2, becoming one of the first major automakers to adjust sticker prices following U.S. President Donald Trump's tariffs.",
    "url": "https://www.reuters.com/business/autos-transportation/ford-hikes-prices-mexico-produced-models-citing-tariffs-2025-05-07/"
  },
  {
    "text": "Democrats Cave, Prepare to Rubber-Stamp Trump Crypto Corruption  —  Pro-crypto senators are poised to pass a stablecoin bill, while failing to crack down on the Trump organization issuing one to collect payments from foreign governments.  —  Despite the twists and turns and drama-creation … ",
    "url": "https://prospect.org/politics/2025-05-08-democrats-cave-prepare-rubber-stamp-trump-crypto-corruption/"
  },
  {
    "text": "China says U.S. asked for trade meeting in Switzerland … The upcoming meeting in Switzerland between U.S. Treasury Secretary Scott Bessent and his Chinese counterpart was requested by the Trump administration, Chinese officials said Wednesday.  —  China will be entering the talks “firmly” … ",
    "url": "https://www.cnbc.com/2025/05/07/china-trump-tariffs-bessent-switzerland.html"
  },
  {
    "text": "Donald Trump's Information Warfare Against America  —  I AM SUCH A GEEK that I remember when Barack Obama made a splash by liberating reams of government data so Americans could use it to do things like compare colleges and start businesses.  —  It was 2013 and talk of a catchy “abundance agenda” … ",
    "url": "https://www.thebulwark.com/p/donald-trump-information-warfare-privacy-federal-data"
  }
]