[
  {
    "text": "Georgia Gov. Brian Kemp passes on running for Senate  —  The popular governor looked like a prime recruit against Sen. Jon Osoff.  —  Georgia Gov. Brian Kemp will not run for Senate in 2026, according to three people familiar with his decision.  —  Kemp, a popular Republican … ",
    "url": "https://www.politico.com/news/2025/05/05/georgia-gov-brian-kemp-passes-on-running-for-senate-00327843"
  },
  {
    "text": "GOP may be closer than ever to enacting a massive rule-busting bill  —  “For those who say it would make a radical change ... I'd say, ‘Thank heaven above for that,’” says Utah Republican Sen. Mike Lee.  —  Conservative Republicans have spent more than a decade working toward a wholesale rollback … ",
    "url": "https://www.politico.com/news/2025/05/05/conservative-republicans-reins-act-budget-reconciliation-00319030"
  },
  {
    "text": "TeleMessage suspends services after hackers claim to have stolen files  —  The app was seemingly used by Mike Waltz in last week's Cabinet meeting, according to a photograph published by Reuters.  —  TeleMessage, the app that President Donald Trump's former national security adviser … ",
    "url": "https://www.nbcnews.com/tech/security/telemessage-suspends-services-hackers-say-breached-app-rcna204925"
  },
  {
    "text": "GlobalX, Airline for Trump's Deportations, Hacked  —  Hackers have targeted GlobalX Air, one of the main airlines the Trump administration is using as part of its deportation efforts, and stolen what they say are flight records and passenger manifests of all of its flights, including those for deportation, 404 Media has learned.",
    "url": "https://www.404media.co/globalx-airline-for-trumps-deportations-hacked/"
  },
  {
    "text": "DHS Announces Historic Travel Assistance and Stipend for Voluntary Self-Deportation  —  The First Illegal Alien to Utilize Travel Assistance has Already Returned to Honduras  —  WASHINGTON, D.C.—Today, the Department of Homeland Security (DHS) announced a historic opportunity for illegal aliens … ",
    "url": "https://www.dhs.gov/news/2025/05/05/dhs-announces-historic-travel-assistance-and-stipend-voluntary-self-deportation"
  },
  {
    "text": "Trump administration says it will pay immigrants in the US illegally $1,000 to leave the country  —  Pushing forward with its mass deportation agenda, President Donald Trump's administration said Monday that it would pay $1,000 to immigrants who are in the United States illegally and return to their home country voluntarily.",
    "url": "https://apnews.com/article/trump-immigration-mass-deportation-payment-border-illegal-c459325c4a73dba0d5a89fa19dbee334"
  },
  {
    "text": "‘60 Minutes’ Thumbs Its Nose at Trump With Scathing Segment  —  NOT SCARED OF YOU  —  The show brought on lawyers and firms targeted by President Donald Trump's sweeping executive orders.  —  60 Minutes examined Donald Trump's revenge tour against Big Law in a scathing episode on Sunday … ",
    "url": "https://www.thedailybeast.com/60-minutes-thumbs-its-nose-at-trump-with-scathing-segment-on-his-threats-to-law-firms/"
  },
  {
    "text": "A GOP congressman is peppered with questions about Trump during raucous town hall  —  Voters in U.S. Rep. Mike Lawler's suburban New York swing district heaped criticism on the Republican during a raucous town hall Sunday night, peppering him with questions around President Donald Trump's aggressive agenda … ",
    "url": "https://apnews.com/article/new-york-congress-lawler-trump-dc074f165919c3d5305b3fa0e382c2b0"
  },
  {
    "text": "Donald Jr. and Eric Trump Pursue New Deals That Would Enrich President Trump  —  The president's older sons, Donald Trump Jr. and Eric Trump, spent the past two weeks traveling the world and announcing deals, many of which will financially benefit their father.",
    "url": "https://www.nytimes.com/2025/05/05/us/politics/eric-donald-jr-trump-family-deals.html?unlocked_article_code=1.E08.nanv.Y5MXMEQ7STnr&smid=url-share"
  },
  {
    "text": "A.I. Is Getting More Powerful, but Its Hallucinations Are Getting Worse … Last month, an A.I. bot that handles tech support for Cursor, an up-and-coming tool for computer programmers, alerted several customers about a change in company policy.  It said they were no longer allowed to use Cursor on more than just one computer.",
    "url": "https://www.nytimes.com/2025/05/05/technology/ai-hallucinations-chatgpt-google.html"
  },
  {
    "text": "Trump Tells Hate Leader And J6 Seditionist ‘I Love You Guys’ At Mar-A-Lago: Report  —  The president chatted with the former extremist group boss as he was dining at Trump's country club.  —  Enrique Tarrio, the former leader of the far-right Proud Boys and convicted seditionist in the Jan. 6 … ",
    "url": "https://www.huffpost.com/entry/donald-trump-enrique-tarrio-proud-boys-mar-a-lago_n_6818a2f6e4b064ed9fd4de80"
  },
  {
    "text": "Israel plans to capture all of Gaza under new plan, officials say  —  Israel approved plans on Monday to capture the entire Gaza Strip and remain in the territory for an unspecified amount of time, two Israeli officials said, in a move that if implemented would vastly expand Israel's operations … ",
    "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-05-05-2025-d22caabfd2cf89e83fe06e649e6438ba"
  },
  {
    "text": "Trump ally Laura Loomer uses Nazi slogan to call for replacing Indian American congressperson  —  Loomer: “It'd be nice to have an American there, like a real blood and soil American”  —  Loomer's use of “blood and soil” is notable because the phrase is identified as a “Nazi rallying cry.”",
    "url": "https://www.mediamatters.org/laura-loomer/trump-ally-laura-loomer-uses-nazi-slogan-call-replacing-indian-american-congressperson"
  },
  {
    "text": "Transcript: Fox News Visibly Rattled as Trump's Slide in Polls Worsens  —  The following is a lightly edited transcript of the May 5 episode of the Daily Blast podcast.  Listen to it here.  —  Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network.",
    "url": "https://newrepublic.com/article/194822/transcript-fox-news-visibly-rattled-trump-slide-polls-worsens"
  },
  {
    "text": "We need a way to aggregate what Donald Trump is doing to this country  —  News organizations, along with good-government groups and other interested parties, are doing a commendable job of chronicling the damage the Trump regime is doing to the government, the country, and the world.",
    "url": "https://presswatchers.org/2025/05/we-need-a-way-to-aggregate-what-donald-trump-is-doing-to-this-country/"
  },
  {
    "text": "First to NBC News: Trump to meet with Russian-American ballerina  —  Trump is scheduled to meet at the White House today with Russian-American ballerina Ksenia Karelina, a White House official tells NBC News.  —  Karelina was released from a Russian prison last month after spending … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/live-blog/trump-administration-nfl-draft-tariffs-immigration-doge-live-updates-rcna204587/rcrd78383?canonicalCard=true"
  },
  {
    "text": "Texas bill would monitor wastewater for the abortion medication mifepristone  —  Under a bill filed in the Legislature, Texas could begin monitoring wastewater for substances including the abortion drug mifepristone.The legislation is part of a broader push spearheaded by anti-abortion advocates … ",
    "url": "https://www.dallasnews.com/news/texas/2025/05/05/texas-bill-would-monitor-wastewater-for-the-abortion-medication-mifepristone/"
  },
  {
    "text": "Europe Makes a Pitch to Attract Scientists Shunned by the U.S.  —  The continent's leaders are hoping to benefit as the Trump administration cuts support for research and threatens universities such as Harvard and Columbia with the freezing of federal funds.",
    "url": "https://www.nytimes.com/2025/05/05/world/europe/eu-us-scientists-trump.html"
  },
  {
    "text": "Newark Airport Radar Loss Left Controllers Blind for 90 Seconds  —  Air traffic controllers guiding planes bound for Newark Liberty International Airport lost radar and radio communication for more than a minute early last week before flights at the key hub were snarled for days, according to people familiar with the matter.",
    "url": "https://www.bloomberg.com/news/articles/2025-05-05/newark-radar-loss-left-controllers-guiding-blind-for-90-seconds?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0NjQ2NzkzMSwiZXhwIjoxNzQ3MDcyNzMxLCJhcnRpY2xlSWQiOiJTVlNONlJEV0xVNjgwMCIsImJjb25uZWN0SWQiOiJCNDAwNTQzMUFBMDI0OTA2OTU1NUVFRDI4MkVBNzg3NCJ9._LB5QofGo4z5HTe1qMb_5xEWqkbGn7JrU-zVEe3ROZI"
  },
  {
    "text": "Industry Reacts To Trump's “Insane” Movie Tariff Threat: “This Would Destroy The Independent Film Sector”  —  The U.S. and international film sectors are reeling after Donald Trump's announcement last night that he is “authorizing” the Department of Commerce and the United States Trade Representative … ",
    "url": "https://deadline.com/2025/05/trump-movie-tariffs-hollywood-independent-film-destroy-1236385169/"
  },
  {
    "text": "This Is Fascism: MAGA, Ashli Babbitt, and Derek Chauvin  —  The Trump cult loves police violence—except for when it doesn't.  —  1. Back the Blue  —  You may remember Ashli Babbitt as the only insurrectionist killed by law enforcement during the January 6th attack on the U.S. Capitol.1",
    "url": "https://www.thebulwark.com/p/deadly-force-maga-ashli-babbitt-and-derek-chauvin-police-and-fascism"
  },
  {
    "text": "Portnoy says antisemitic message found in Barstool bar: 'I've been shaking'  —  Barstool Sports founder Dave Portnoy said on Sunday he was “shaking” after discovering an antisemitic sign on display at his bar in Philadelphia this weekend and vowed to hold the individuals involved accountable.",
    "url": "https://thehill.com/homenews/state-watch/5283081-barstool-founder-antisemitic-sign/"
  },
  {
    "text": "As Backlash to Trump's Tariffs Grows, Europe Boycotts American Brands  —  A shifting perception of the United States amid President Trump's trade war is prompting Europeans to pivot decisively away from U.S. goods and services.  —  For motorcycle lovers in Sweden, Harley-Davidson is the hottest brand on the road.",
    "url": "https://www.nytimes.com/2025/05/05/business/tariffs-europe-boycott-american-goods.html"
  },
  {
    "text": "Trump Throws a Tantrum After Getting Roasted by Karl Rove  —  LATE-NIGHT RANT  —  The president was stung after the Republican strategist ripped into him on tariffs, communications, and the AI image of Trump as the pope.  —  President Donald Trump ripped into Republican strategist Karl Rove … ",
    "url": "https://www.thedailybeast.com/donald-trump-throws-a-tantrum-after-getting-roasted-by-karl-rove/"
  },
  {
    "text": "Trump's Three Steps to Economic Growth  —  His tariffs, tax cuts and deregulation efforts make up a coherent strategy to benefit Main Street.  —  Readers of this paper know better than anyone: Wall Street has experienced historic success over the last four decades.  Since 1980, the S&P 500 has increased more than 5,500%.",
    "url": "https://www.wsj.com/opinion/trumps-three-steps-to-economic-growth-tariffs-trade-tax-cuts-deregulation-7804053a?st=hx9dZw"
  },
  {
    "text": "‘A slippery slope to eugenics’: advocates reject RFK Jr's national autism database  —  US health secretary claims data will be used for research but has not addressed privacy concerns and potential misuse  —  Autism researchers and advocates are pushing back against the creation of an autism database … ",
    "url": "https://www.theguardian.com/us-news/2025/may/05/autism-national-database-rfk-jr"
  },
  {
    "text": "The New Yorker Wins Three 2025 Pulitzer Prizes  —  The awards honor Mosab Abu Toha's commentary on the devastation in Gaza, Moises Saman's photographs of Syria after Assad, and the third season of the investigative podcast In the Dark.  —  The New Yorker was named the winner of three Pulitzer Prizes … ",
    "url": "https://www.newyorker.com/news/press-room/the-new-yorker-wins-three-2025-pulitzer-prizes"
  },
  {
    "text": "Rwanda in Early Talks With U.S. to Take Expelled Migrants  —  Discussions with the Central African country come as the Trump administration looks for more countries willing to accept deportees as part of a sweeping crackdown.  —  Rwanda is in talks with the Trump administration … ",
    "url": "https://www.nytimes.com/2025/05/05/world/africa/rwanda-trump-deportees.html?unlocked_article_code=1.E08.209D.V_THLTkIUruF&smid=url-share"
  },
  {
    "text": "People Are Losing Loved Ones to AI-Fueled Spiritual Fantasies  —  Self-styled prophets are claiming they have ‘awakened’ chatbots and accessed the secrets of the universe through ChatGPT … It was the second marriage for both after marriages of 15-plus years and having kids … ",
    "url": "https://www.rollingstone.com/culture/culture-features/ai-spiritual-delusions-destroying-human-relationships-1235330175/"
  },
  {
    "text": "Big hurdles for the Antisemitism Awareness Act  —  After a messy Senate markup last week, Hill Republicans are facing a real struggle to pass the Antisemitism Awareness Act.  —  The bipartisan bill made it through the House during the 118th Congress, passing by a 320-91 margin.",
    "url": "https://punchbowl.news/article/policy/hurdles-for-antisemitism-awareness-act/"
  },
  {
    "text": "House Republicans set flurry of meetings on GOP megabill  —  House Republicans have planned a slew of meetings this week that they hope will resolve huge political battles over their massive domestic policy bill as they race the clock on a Memorial Day deadline.",
    "url": "https://www.politico.com/live-updates/2025/05/05/congress/house-republicans-set-flurry-of-meetings-on-gop-megabill-00327169"
  }
]