[
  {
    "text": "Musk calls MAGA element “contemptible fools” as virtual civil war brews … - The schism may force Trump to ultimately take sides between the largely white, working-class supporters who first made MAGA succeed, and the techno-libertarian billionaires like Musk who are at the center of his new administration.",
    "url": "https://www.axios.com/2024/12/27/elon-musk-contemptible-fools-maga-doge"
  },
  {
    "text": "Elon Musk accused of censoring conservatives on X who disagree with him about immigration  —  The claims came after Elon Musk was involved in a public feud with some Republicans over immigration.  —  Tech billionaire Elon Musk faced accusations of censorship Friday from fellow conservatives … ",
    "url": "https://www.nbcnews.com/tech/social-media/elon-musk-accused-censoring-laura-loomer-maga-republicans-x-rcna185569"
  },
  {
    "text": "Steve Bannon Joins War Against Elon Musk as MAGA Implodes  —  Steve Bannon has joined the MAGA war between hard-line immigration opponents and tech executives like Elon Musk, taking the side of xenophobia on his War Room show Friday.  —  “H-1B visas?  That's not what it's about.",
    "url": "https://newrepublic.com/post/189694/steve-bannon-maga-war-elon-musk-immigration"
  },
  {
    "text": "Trump base splits over Musk and Ramaswamy's support for foreign worker visas  —  Elon Musk and Vivek Ramaswamy began a battle among supporters of President-elect Donald Trump over skilled immigration, sparking questions about how the technology executives would fit into a populist new administration.",
    "url": "https://www.washingtonexaminer.com/news/white-house/3271227/trump-base-splits-musk-ramaswamy-support-foreign-worker-visas/"
  },
  {
    "text": "Janet Yellen tells Congress US could hit debt limit in mid-January  —  Treasury Secretary Janet Yellen said her agency will need to start taking “extraordinary measures,” or special accounting maneuvers intended to prevent the nation from hitting the debt ceiling, as early as January 14 … ",
    "url": "https://apnews.com/article/treasury-debt-limit-yellen-trump-elections-republicans-9c5d27c08feb744f5ee59dc2c87a06d5"
  },
  {
    "text": "Yellen: US will hit debt ceiling in mid- or late-January  —  Treasury Secretary Janet Yellen said Friday she expects the U.S. will officially run up against its borrowing limit in mid- to late-January, starting the clock on a major fiscal challenge facing President-elect Donald Trump in his first months in office.",
    "url": "https://www.politico.com/live-updates/2024/12/27/congress/yellen-sees-u-s-hitting-debt-ceiling-in-early-2025-00196091"
  },
  {
    "text": "US homelessness up 18% as affordable housing remains out of reach for many people  —  The United States saw an 18.1% increase in homelessness this year, a dramatic rise driven mostly by a lack of affordable housing as well as devastating natural disasters and a surge of migrants in several parts … ",
    "url": "https://apnews.com/article/homelessness-population-count-2024-hud-migrants-2e0e2b4503b754612a1d0b3b73abf75f"
  },
  {
    "text": "Acute respiratory infections complicated by malaria (previously undiagnosed disease) - Democratic Republic of the Congo  —  Situation at a glance  —  This is an update to the Disease Outbreak News on Undiagnosed disease in the Democratic Republic of the Congo published on 8 December 2024 … ",
    "url": "https://www.who.int/emergencies/disease-outbreak-news/item/2024-DON547"
  },
  {
    "text": "Statement from President Joe Biden on the Passing of Former Prime Minister Manmohan Singh of India  —  Jill and I join the people of India in grieving the loss of former Indian Prime Minister Manmohan Singh.  —  The unprecedented level of cooperation between the United States and India today … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/27/statement-from-president-joe-biden-on-the-passing-of-former-prime-minister-manmohan-singh-of-india/"
  },
  {
    "text": "Maggie Shannon for The New York Times  —  Visuals by Maggie Shannon Text by Isabelle Taft  —  A Baptist minister, a Presbyterian pastor and a Jewish cantor held burning incense as they walked quietly through the empty, white-walled clinic.  They blessed the exam tables and their stirrups … ",
    "url": "https://www.nytimes.com/card/2024/12/27/us/abortion-clinics-religion-blessing"
  },
  {
    "text": "America Needs a National Healthcare System  —  The for-profit health insurance industry has attached itself to us like a giant, bloodsucking tick and “Scientific Racism” is part of the reason why  —  There's only one person in this photograph/video of a recent G7 meeting who represents … ",
    "url": "https://hartmannreport.com/p/america-needs-a-national-healthcare"
  },
  {
    "text": "Judge signals that contempt hearing for Rudy Giuliani over his assets might not go well for him  —  A federal judge is signaling that Rudy Giuliani's contempt hearing next Friday might not end so well for the former New York City mayor and onetime personal lawyer for President-elect Donald Trump … ",
    "url": "https://apnews.com/article/rudy-giuliani-defamation-georgia-election-workers-4bd622388a8ef296f6a8ead1bff59462"
  },
  {
    "text": "Trump urges Supreme Court to hit pause on a law that could ban TikTok in the U.S. next month  —  The Supreme Court is scheduled to hear arguments in the case on Jan. 10.  The law is set to take effect on Jan. 19, one day before President-elect Donald Trump is sworn in.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-urges-supreme-court-hit-pause-law-ban-tiktok-us-month-rcna185606"
  },
  {
    "text": "US to send $1.25 billion in weapons to Ukraine, pushing to get aid out before Biden leaves office  —  The United States is expected to announce that it will send $1.25 billion in military assistance to Ukraine, U.S. officials said Friday, as the Biden administration pushes to get as much aid … ",
    "url": "https://apnews.com/article/russia-ukraine-military-aid-kyiv-biden-9b926a275c235c59d591a649e2450746"
  },
  {
    "text": "‘We are screwed’: Virologists warn about disease they say could become the next pandemic  —  A new report from PBS highlights the potential danger of bird flu turning into a full-blown pandemic in the United States.  —  In particular, PBS spoke with several experts who said the United States … ",
    "url": "https://www.rawstory.com/bird-flu-2670690445/"
  }
]