[
  {
    "text": "Former President Donald Trump On President Biden, Support for Israel, The War In Ukraine, Campaign 2024, and What a Second Trump Term Would Look Like  —  Former President Trump Donald Trump joined me this morning:  —  Audio:  —  12-22hhs-trump  —  Transcript:",
    "url": "https://hughhewitt.com/former-president-donald-trump-on-president-biden-support-for-israel-the-war-in-ukraine-campaign-2024-and-what-a-second-trump-term-would-look-like"
  },
  {
    "text": "'He's the only one that's speaking the truth': Trump's fans trust nothing — except him  —  CORALVILLE, Iowa — Joannie Firkins, 63, does not trust the COVID vaccine.  She does not trust the Internal Revenue Service.  She does not trust the results of the 2020 election and she certainly does not trust President Biden.",
    "url": "https://www.bostonglobe.com/2023/12/22/nation/trump-supporters/"
  },
  {
    "text": "Trump vows a peaceful transfer of power if reelected  —  Trump insisted that he peacefully turned over power to Biden in 2021, though he's been indicted for his role in trying to overturn the results of the 2020 election.  —  If reelected president in 2024, Donald Trump vowed Friday … ",
    "url": "https://www.politico.com/news/2023/12/22/trump-biden-reelection-2020-00133089"
  },
  {
    "text": "Supreme Court Won't Hear Case on Trump's Immunity Defense for Now  —  Jack Smith, the special counsel prosecuting former President Donald J. Trump, had urged the justices to move with extraordinary speed, bypassing a federal appeals court.  —  The Supreme Court declined on Friday to decide … ",
    "url": "https://www.nytimes.com/2023/12/22/us/politics/trump-supreme-court-immunity.html"
  },
  {
    "text": "Supreme Court sidesteps decision on Trump presidential immunity claim in federal election interference case  —  Trump is claiming broad immunity for actions he took in office, including efforts to overturn the 2020 presidential election results for which he faces criminal prosecution.",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-sidesteps-decision-trump-presidential-immunity-claim-fed-rcna130769"
  },
  {
    "text": "A Proclamation on Granting Pardon for the Offense of Simple Possession of Marijuana, Attempted Simple Possession of Marijuana, or Use of Marijuana  —       In Proclamation 10467 of October 6, 2022 (Granting Pardon for the Offense of Simple Possession of Marijuana), I exercised my authority under … ",
    "url": "https://www.whitehouse.gov/briefing-room/presidential-actions/2023/12/22/a-proclamation-on-granting-pardon-for-the-offense-of-simple-possession-of-marijuana-attempted-simple-possession-of-marijuana-or-use-of-marijuana/"
  },
  {
    "text": "Trump recorded pressuring Wayne County canvassers not to certify 2020 vote  —  Then-President Donald Trump personally pressured two Republican members of the Wayne County Board of Canvassers not to sign the certification of the 2020 presidential election, according to recordings reviewed … ",
    "url": "https://www.detroitnews.com/story/news/politics/2023/12/21/donald-trump-recorded-pressuring-wayne-canvassers-not-to-certify-2020-vote-michigan/72004514007/"
  },
  {
    "text": "Police have recovered second Ziegler sex video, sources say  —  A  sex video involving Sarasota School Board member Bridget Ziegler and an unidentified woman has been recovered by police as part of the ongoing criminal investigation of a rape allegation made against Bridget's husband … ",
    "url": "https://flcga.org/police-have-recovered-second-ziegler-sex-video-sources-say/"
  },
  {
    "text": "Ron DeSantis' super PAC cancels remaining ad reservations as another group aims to fills the void  —  Never Back Down, which has been the main outside group backing DeSantis, will focus on its field operation, while Fight Right will handle TV ad spending.  —  Never Back Down … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-super-pac-cancels-remaining-2024-ad-reservations-rcna130941"
  },
  {
    "text": "Joe Rogan Corrected On-Air for Blaming Trump Gaffe on Biden  —  The podcaster was caught off guard by a live fact-check from his own team that revealed it was Trump—not Biden—who made the gaffe in question.  —  Joe Rogan has done it again.  But this time, even his own producers couldn't help … ",
    "url": "https://www.thedailybeast.com/joe-rogan-corrected-on-air-for-blaming-trump-gaffe-on-biden"
  },
  {
    "text": "California town proposes ban on Pride, Black and women's history celebrations  —  Far-right council members in Huntington Beach introduce agenda item to switch focus to US wars and America's independence  —  The southern California city of Huntington Beach, a bastion of conservative voters … ",
    "url": "https://www.theguardian.com/us-news/2023/dec/22/california-huntington-beach-ban-diverse-celebrations"
  },
  {
    "text": "Democrats sue New Hampshire over GOP-backed election law  —  President Joe Biden's campaign is supporting the legal challenge, which was first shared with POLITICO.  —  The Democratic National Committee is suing New Hampshire officials over a Republican-backed election law that it claims … ",
    "url": "https://www.politico.com/news/2023/12/22/democrats-sue-new-hampshire-over-gop-backed-election-law-00133018"
  },
  {
    "text": "New COVID variant JN.1 surges to 44% of cases, CDC estimates — even higher in New York, New Jersey  —  The new COVID-19 variant that scientists call JN.1 now makes up about 44.1% of COVID-19 cases across the country, the Centers for Disease Control and Prevention estimated Friday … ",
    "url": "https://www.cbsnews.com/news/new-covid-variant-jn-1-cases-cdc-new-york-new-jersey/"
  },
  {
    "text": "When her family needed money, Nikki Haley found a lucrative path  —  The candidate's public policy positions — hawkish and pro-business — created well-paid private opportunities when she abruptly resigned from government in 2018  —  Nikki Haley was representing the United States on the world stage … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/22/nikki-haley-wealth/"
  },
  {
    "text": "Raunchy celebrity party in Russia draws outrage over ‘nude illusion’ theme  —  RIGA, Latvia — A raunchy celebrity-filled party in Moscow has drawn the ire of Russian politicians and fervent Christian Orthodox activists who are urging law enforcement to punish the event's guests and organizers … ",
    "url": "https://www.washingtonpost.com/world/2023/12/21/russia-celebrity-party-nude-putin/"
  },
  {
    "text": "Trump allies and MAGA luminaries move to kill off the Haley-for-VP buzz  —  Haley's rise has prompted speculation she'd be a logical running mate for Trump.  —  Donald Trump's allies, MAGA media influencers and even his son are sending the Republican frontrunner a message as he begins … ",
    "url": "https://www.politico.com/news/2023/12/22/trump-allies-haley-vp-00133104"
  },
  {
    "text": "Jan. 6 rioters the far right claimed were antifa keep getting unmasked as Trump supporters  —  Misinformation about the Capitol attack continues to go viral on the right, but the claims are slowly getting debunked, federal case by federal case.  —  WASHINGTON — In nearly three years since … ",
    "url": "https://www.nbcnews.com/politics/justice-department/antifa-january-6-capitol-riot-conspiracy-theory-social-media-rcna125369"
  },
  {
    "text": "The US may be flouting its own laws by sending unrestricted aid to Israel  —  US law limits aid to countries that violate human rights.  Here's why it isn't applied to Israel.  —  The recent high-profile killings of three Israeli hostages, two women in a Gaza church, and 11 unarmed Palestinian men … ",
    "url": "https://www.vox.com/world-politics/24011316/us-aid-israel-biden-human-rights-leahy-law"
  },
  {
    "text": "WaPo Finally Reaches New Deal With Union After 18 Months  —  The contract negotiations have been a protracted source of tensions within the esteemed newsroom.  —  After about 18 months, two publishers, three rounds of job cuts, and a daylong walkout, The Washington Post and its union … ",
    "url": "https://www.thedailybeast.com/the-washington-post-finally-reaches-agreement-with-union-after-18-months"
  }
]