[
  {
    "text": "FDA making plans to end its routine food safety inspections, sources say  —  The Food and Drug Administration is drawing up plans that would end most of its routine food safety inspections work, multiple federal health officials tell CBS News, and effectively outsource this oversight to state and local authorities.",
    "url": "https://www.cbsnews.com/news/fda-food-safety-inspections-plans/"
  },
  {
    "text": "A deadly E. coli outbreak hit 15 states, but the FDA chose not to publicize it  —  The outbreak linked to romaine lettuce killed one person and sickened at least 88 more, including a 9-year-old boy who nearly died of kidney failure.  —  An E. coli outbreak linked to romaine lettuce ripped across 15 states … ",
    "url": "https://www.nbcnews.com/news/us-news/ecoli-bacteria-lettuce-outbreak-rcna200236"
  },
  {
    "text": "Appeals court won't lift order to ‘facilitate’ Abrego Garcia's return in blistering opinion  —  The 4th U.S. Circuit Court of Appeals on Thursday declined to lift a judge's order that the Trump administration “facilitate” the return of Kilmar Abrego Garcia, admonishing the Justice Department in the ruling.",
    "url": "https://thehill.com/homenews/5254406-abrego-garcia-appeals-court-order/"
  },
  {
    "text": "Kilmar Abrego Garcia meets with Maryland senator in El Salvador, weeks after mistaken deportation  —  Maryland Sen. Chris Van Hollen says he has met with Kilmar Abrego Garcia, who immigration officials say was deported by error, in El Salvador on Thursday, Van Hollen's spokesperson confirmed to CBS News.",
    "url": "https://www.cbsnews.com/amp/baltimore/news/maryland-sen-van-hollen-meets-with-mistakenly-deported-kilmar-abrego-garcia-in-el-salvador/"
  },
  {
    "text": "Sen. Chris Van Hollen meets with Kilmar Abrego Garcia in El Salvador  —  The Maryland Democrat flew to the Central American country this week with the goal of meeting with Abrego Garcia, who the Trump administration says was mistakenly deported.  —  Sen. Chris Van Hollen confirmed Thursday night … ",
    "url": "https://www.nbcnews.com/politics/immigration/chris-van-hollen-meets-kilmar-abrego-garcia-el-salvador-rcna201830"
  },
  {
    "text": "U.S.-born American citizen under ICE hold in Florida after driving from Georgia  —  Juan Carlos Gomez-Lopez is being held even though a county judge found his birth certificate “authentic” and said there wasn't reason to consider him an “illegal alien.”  —  A U.S.-born American citizen … ",
    "url": "https://www.nbcnews.com/news/latino/us-born-citizen-detained-ice-immigration-florida-rcna201800"
  },
  {
    "text": "U.S.-Born Citizen Arrested As ‘Unauthorized Alien’  —  Twenty-year-old Juan Carlos Lopez-Gomez was detained in a Florida jail even after his mother presented his birth certificate in court.  —  A U.S.-born citizen was arrested in Florida on Wednesday and charged with illegally entering the state as an “unauthorized alien.”",
    "url": "https://www.huffpost.com/entry/us-born-citizen-arrested-charged-unauthorized-alien_n_6801918be4b01dc12d4b8234"
  },
  {
    "text": "Live Updates: Active shooter reported at Florida State University; multiple patients hospitalized  —  The university sent out an alert urging students to seek shelter as a shooter was reported in the area of the student union. … FSU was site of shooting in 2014",
    "url": "https://www.nbcnews.com/news/us-news/live-blog/florida-state-university-active-shooter-rcna201756"
  },
  {
    "text": "The CFPB Has Been Gutted  —  The Consumer Financial Protection Bureau terminated the positions of 1,400 of the agency's 1,700 employees; medical debt and student loans will now be deprioritized.  —  More than 1,400 Consumer Financial Protection Bureau (CFPB) workers were terminated … ",
    "url": "https://www.wired.com/story/cfpb-has-been-gutted/"
  },
  {
    "text": "What's Happening Is Not Normal.  America Needs an Uprising That Is Not Normal.  —  In the beginning there was agony.  Under the empires of old, the strong did what they willed and the weak suffered what they must.  —  But over the centuries, people built the sinews of civilization … ",
    "url": "https://www.nytimes.com/2025/04/17/opinion/trump-harvard-law-firms.html?unlocked_article_code=1.AU8.K4jq.TyX5a_Zlsepx&smid=re-nytopinion"
  },
  {
    "text": "Supreme Court to Hear Arguments on Trump Plan to End Birthright Citizenship  —  The Trump administration had asked the justices to lift a nationwide pause on the policy as lower court challenges continue.  —  The Supreme Court announced on Thursday that it would hear arguments in a few weeks … ",
    "url": "https://www.nytimes.com/2025/04/17/us/politics/supreme-court-birthright-citizenship.html?unlocked_article_code=1.AU8.Rvsq.2g79_uV43kv-&smid=bs-share"
  },
  {
    "text": "Trump Has for Months Privately Discussed Firing Fed Chair Powell  —  The president hasn't made a decision on whether to try to oust Powell, and some of his advisers have warned against the move  —  WASHINGTON—President Trump has for months privately discussed firing Federal Reserve Chair Jerome Powell … ",
    "url": "https://www.wsj.com/economy/central-banking/trump-has-for-months-privately-discussed-firing-fed-chair-powell-628d3d79?st=xhpbir&reflink=article_copyURL_share"
  },
  {
    "text": "Trump's newest grift: Building a cryptocurrency empire while destroying its regulators  —  Listen to me read this post here (not an AI-generated voice!), subscribe to the feed in your podcast app, or download the recording for later.  —  In an unprecedented abuse of presidential power … ",
    "url": "https://www.citationneeded.news/trump-crypto-empire/"
  },
  {
    "text": "AP and the Trump administration argue over presidential access before appeals judges  —  The Associated Press and the Trump administration returned to a courtroom Thursday — and will be in another on Friday — as part of the high-stakes battle over who can control which journalists are able to question the president.",
    "url": "https://apnews.com/article/ap-trump-court-free-press-pool-fc897b3c82c26984198397de1ef83243"
  },
  {
    "text": "Gwen Walz on RFK Jr. comments: People with autism ‘contribute more to this nation than this man ever will’  —  Minnesota's first lady, Gwen Walz, slammed Health and Human Services Secretary Robert.  F Kennedy Jr. over comments he made about autism on Wednesday.",
    "url": "https://thehill.com/policy/healthcare/5254735-gwen-walz-on-rfk-jr-comments-people-with-autism-contribute-more-to-this-nation-than-this-man-ever-will/"
  },
  {
    "text": "Trump's United States of Emergency  —  In his first 100 days, President Trump has declared more national emergencies — more creatively and more aggressively — than any president in modern American history.  —  Why it matters: Powers originally crafted to give the president flexibility … ",
    "url": "https://www.axios.com/2025/04/18/trump-national-emergency-declarations"
  },
  {
    "text": "James Carville says he might sue ‘contemptible little twerp’ David Hogg for challenging incumbent Democrats  —  NewsNation anchor Chris Cuomo appeared to egg James Carville on, telling the veteran Democratic strategist to ‘sue his punk a**’  —  James Carville railed against Democratic … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/david-hogg-james-carville-lawsuit-b2735217.html"
  },
  {
    "text": "Google's digital ad network declared an illegal monopoly, joining its search engine in penalty box  —  Google has been branded an abusive monopolist by a federal judge for the second time in less than a year, this time for illegally exploiting some of its online marketing technology to boost … ",
    "url": "https://apnews.com/article/google-illegal-monopoly-advertising-search-a1e4446c4870903ed05c03a2a03b581e"
  },
  {
    "text": "Trump Officials Weigh Earth Day Move Against Green Groups  —  White House officials are preparing executive orders that would strip some environmental nonprofits of their tax-exempt status, setting up a possible Earth Day strike against organizations seen as standing in the way of President Donald Trump's push … ",
    "url": "https://www.bloomberg.com/news/articles/2025-04-18/trump-officials-weigh-earth-day-move-against-green-groups?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0NDk0MTAxNiwiZXhwIjoxNzQ1NTQ1ODE2LCJhcnRpY2xlSWQiOiJTVVZWRUtEV1gyUFMwMCIsImJjb25uZWN0SWQiOiIxMjIyNkM4MjZDN0Q0REM1OUFDRDFGQkVERjdENEFEMCJ9.UISloXijVZqw21aETB6E1sgAq7U7CQoIKQB1MtXYYsk"
  },
  {
    "text": "As Garber Stands Against Trump, Money From Harvard Donors Pours In  —  After Harvard publicly rejected the Trump administration's demands, a wave of support — and money — has come rushing in.  —  In the 24 hours after Harvard President Alan M. Garber '76 announced that he would not comply … ",
    "url": "https://www.thecrimson.com/article/2025/4/18/garber-trump-harvard-donors/"
  },
  {
    "text": "U.S. intelligence contradicts Trump's justification for mass deportations  —  The determination is the most comprehensive assessment to date undercutting the president's rationale for deporting suspected gang members without due process.  —  The National Intelligence Council … ",
    "url": "https://www.washingtonpost.com/national-security/2025/04/17/us-intelligence-tren-de-aragua-deportations-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0ODYyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2MjQ0Nzk5LCJpYXQiOjE3NDQ4NjI0MDAsImp0aSI6IjgyYWZiNzRmLTYxODEtNGRjNi1hNWFjLWJlMjMyYjRmM2VmYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA0LzE3L3VzLWludGVsbGlnZW5jZS10cmVuLWRlLWFyYWd1YS1kZXBvcnRhdGlvbnMtdHJ1bXAvIn0.F8QCNQIWtNgNiJQ9dxrBxcJEECASABX7wzrXXm8Kx2M&itid=gfta"
  },
  {
    "text": "Prominent ultra-processed food researcher leaves NIH, alleges censorship  —  Kevin Hall, a leading expert on ultra-processed foods, has raised concerns about the future of nutrition research and science at NIH.  —  Six years ago, Kevin Hall led a landmark study providing the most compelling evidence … ",
    "url": "https://www.washingtonpost.com/health/2025/04/17/ultra-processed-foods-nih-resignation/"
  },
  {
    "text": "Nearly 300 apply as French university offers US academics ‘scientific asylum’  —  Aix-Marseille University generates interest amid a US crackdown and calls for a ‘scientific refugee’ status  —  Nearly 300 academics have applied to a French university's offer to take in US-based researchers rattled … ",
    "url": "https://www.theguardian.com/education/2025/apr/17/nearly-300-applications-to-french-university-offer-to-take-in-us-academics"
  },
  {
    "text": "America's Mad King … Last monday, Donald Trump, seeking to fortify public support for his massive, across-the-board tariffs, posted: “The United States has a chance to do something that should have been done DECADES AGO.  Don't be Weak!  Don't be Stupid!  Don't be a PANICAN (A new party based on Weak and Stupid people!).”",
    "url": "https://www.theatlantic.com/ideas/archive/2025/04/donald-trump-authoritarian-actions/682486/?gift=QapXKM_IndoTlFMWOFVno4SWNYhV0qO5eJzJXCLBN4w&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Republican Opinion Shifts on Russia-Ukraine War  —  Democrats significantly more likely than Republicans to rate NATO positively and to say U.S. benefits from membership  —  Table of Contents Table of Contents  —  Democrats significantly more likely than Republicans to rate NATO positively and to say U.S. benefits from membership",
    "url": "https://www.pewresearch.org/global/2025/04/17/republican-opinion-shifts-on-russia-ukraine-war/"
  },
  {
    "text": "SCOTUS Can Let the President Break the Law; They Can't Change It … We are now cranking up another edition of the “will he or won't he” Trump song and dance, this time about firing Fed Chair Jerome Powell.  Trump manages to add an additional pungency to these dramas by trying to fire the guy who is actually his own Fed Chair.",
    "url": "https://talkingpointsmemo.com/edblog/scotus-can-let-the-president-break-the-law-they-cant-change-it"
  },
  {
    "text": "A Depleted Hamas Is So Low on Cash That It Can't Pay Its Fighters  —  Israel has disrupted the Gaza militant group's sources of cash and ability to distribute it  —  Hamas is facing a new problem in Gaza: coming up with the cash it needs to pay its rank and file.",
    "url": "https://www.wsj.com/world/middle-east/hamas-finances-fighters-payments-gaza-f98df760?st=Hd9P8M"
  }
]