[
  {
    "text": "Supreme Court says Trump has absolute immunity for core acts only  —  The U.S. Supreme Court, in a 6-3 decision along ideological lines, ruled that a former president has absolute immunity for his core constitutional powers — and is entitled to a presumption of immunity for his official acts, but lacks immunity for unofficial acts.",
    "url": "https://www.npr.org/2024/07/01/nx-s1-5002157/supreme-court-trump-immunity"
  },
  {
    "text": "The President Can Now Assassinate You, Officially  —  Under this new standard, a president can go on a four-to-eight year crime spree and then retire from public life, never to be held accountable.  —  Pocket  —  Welp, Donald Trump won.  The Supreme Court today ruled that presidents are entitled to … ",
    "url": "https://www.thenation.com/article/society/trump-immunity-supreme-court/"
  },
  {
    "text": "Supreme Court Impeachment Plan Released by Alexandria Ocasio-Cortez  —  announced plans to introduce articles of impeachment against the U.S.  —  justices on Monday after the court ruled that presidents have immunity for official actions.  —  The court on Monday ruled that former presidents … ",
    "url": "https://www.newsweek.com/supreme-court-justices-impeachment-aoc-1919728"
  },
  {
    "text": "Trump Immunity Ruling Will Be John Roberts' Legacy to American Democracy  —  This is part of Opinionpalooza, Slate's coverage of the major decisions from the Supreme Court this June.  Alongside Amicus, we kicked things off this year by explaining How Originalism Ate the Law.",
    "url": "https://slate.com/news-and-politics/2024/07/supreme-court-trump-immunity-john-roberts-legacy.html"
  },
  {
    "text": "Justice Roberts' Drone Strike on George Washington's Legacy  —  Chief Justice John Roberts cloaked his radical opinion granting Presidents broad immunity in the Farewell Address of George Washington, normally celebrated as the codification of the peaceful cession of power, the humility of the role of the President.",
    "url": "https://www.emptywheel.net/2024/07/01/justice-roberts-drone-strike-on-george-washingtons-legacy/"
  },
  {
    "text": "4 takeaways from the Supreme Court's Trump immunity decision  —  The ruling is a win for Trump for a few reasons, and is likely to reverberate in the 2024 campaign and beyond.  Here's what it means.  —  The Supreme Court ruled Monday that former president Donald Trump and other presidents enjoy … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/01/4-takeaways-supreme-courts-trump-immunity-decision/"
  },
  {
    "text": "“The president is now a king”: Key lines from Trump immunity ruling … “We conclude that under our constitutional structure of separated powers, the nature of Presidential power requires that a former President have some immunity from criminal prosecution for official acts during his tenure in office.",
    "url": "https://www.axios.com/2024/07/01/trump-immunity-scotus-ruling-key-lines"
  },
  {
    "text": "“The President Is Now a King”: The Most Blistering Lines From Dissents in the Trump Immunity Case  —  “Orders the Navy's Seal Team 6 to assassinate a political rival?  Immune.”  —  In response to the Supreme Court's momentous decision ruling that presidents are immune from criminal prosecution for … ",
    "url": "https://www.motherjones.com/politics/2024/07/sotomayor-jackson-blistering-dissents-trump-immunity-case/"
  },
  {
    "text": "Whitmer Disavows ‘Draft Gretch’ Movement — and Delivers A Warning to Biden  —  Democrats' 2028 bench is eager to avoid appearing eager to push Biden aside.  —  When Michigan Gov. Gretchen Whitmer telephoned a senior official with President Biden's campaign on Friday night … ",
    "url": "https://www.politico.com/news/magazine/2024/07/01/whitmer-biden-democrats-2028-00165995"
  },
  {
    "text": "Democrats Weigh Mid-July Vote to Formally Tap Biden as Nominee  —  The Democratic National Committee is considering formally nominating Joe Biden as early as mid-July to ensure that the president is on November ballots, while helping to stamp out intra-party chatter of replacing him after last week's poor debate performance.",
    "url": "https://www.bloomberg.com/news/articles/2024-07-01/democrats-weigh-early-biden-nomination-to-squash-talk-of-a-swap"
  },
  {
    "text": "Behind the Curtain: Biden's salvation plan … - Dismiss “bedwetting.” … - Squeeze polls for juice. … - Warn of chaos. … - Limit dissent. … - Keep elected leaders close. … - Get the donor class to chill. … - Prove vitality. … - Ignore/engage the media.",
    "url": "https://www.axios.com/2024/07/01/biden-2024-election-pr-campaign-step-aside"
  },
  {
    "text": "Supreme Court lets a truck stop sue the Federal Reserve in latest threat to agency regulations  —  The Supreme Court on Monday revived a lawsuit by a North Dakota truck stop that is challenging the fees banks can charge for debit-card transactions in a ruling that could have deeper implications for other government regulations.",
    "url": "https://www.cnn.com/2024/07/01/politics/corner-post-sec-supreme-court/"
  },
  {
    "text": "AOC to File ‘Articles of Impeachment’ Following Supreme Court Immunity Ruling: ‘Corruption Crisis Beyond Its Control’  —  Rep. Alexandria Ocasio-Cortez (D-NY) announced on Monday she intends to file articles of impeachment following the Supreme Court's ruling on presidential immunity.",
    "url": "https://www.mediaite.com/politics/aoc-to-file-articles-of-impeachment-following-supreme-court-immunity-ruling-corruption-crisis-beyond-its-control/"
  },
  {
    "text": "D.A. in Trump's Hush-Money Case to Make Sentencing Recommendation  —  District Attorney Alvin L. Bragg's submission may remain confidential until the judge levies his punishment on July 11.  —  The Manhattan district attorney's office on Monday is expected to make its recommendation to a judge … ",
    "url": "https://www.nytimes.com/2024/07/01/nyregion/trump-sentence-hush-money.html"
  },
  {
    "text": "Rep. Spartz charged with weapons violation at DC airport  —  (WISH) — U.S. Rep. Victoria Spartz has been charged with a weapons violation at Dulles International Airport in Washington, D.C.  —  A spokesperson for Metropolitan Washington Airports Authority confirmed to I-Team 8 that Spartz was charged Friday.",
    "url": "https://www.wishtv.com/news/politics/rep-spartz-charged-with-weapons-violation-at-dc-airport/"
  },
  {
    "text": "S.F. becomes first California city to miss its housing goals.  The impact will be massive  —  The majority of housing projects in San Francisco will now be eligible for over-the-counter approval, thanks to the activation of a new state law that eliminates the city's famously contentious land-use battles … ",
    "url": "https://www.sfchronicle.com/sf/article/s-f-housing-goals-19545405.php"
  },
  {
    "text": "Steve Bannon reports to prison for contempt of Congress sentence  —  Bannon was sentenced to four months in prison for contempt of Congress.  —  Steve Bannon, former advisor to U.S. President Donald Trump, aattends an event in Detroit, Michigan, June, 15, 2024.",
    "url": "https://abcnews.go.com/US/steve-bannon-surrenders-reports-prison/story?id=111569255"
  },
  {
    "text": "Five Takeaways From France's Snap Election  —  It was a big day for the far-right National Rally.  Just how big will not be clear until after a second round of voting.  —  A new week of frenetic campaigning started in France on Monday, a day after the far-right National Rally party dominated … ",
    "url": "https://www.nytimes.com/2024/07/01/world/europe/france-election-takeaways.html"
  },
  {
    "text": "First Lady Jill Biden on What's at Stake in 2024  —  Editor's Note: The debate on June 27 spurred a discussion about whether President Joe Biden should remain the Democratic nominee.  Dr. Jill Biden, the first lady and Vogue's August cover subject, has fiercely defended her husband and stood by him.",
    "url": "https://www.vogue.com/article/first-lady-jill-biden-august-2024-cover-interview"
  },
  {
    "text": "Biden's Handlers Release a New Video, and It's a Five-Alarm Fire Moment  —  It's only been four days since Joe Biden's disastrous debate performance, and the White House is scrambling to find its feet.  Truly, I've never seen anything like this.  I understand that there have been past presidents … ",
    "url": "https://redstate.com/bonchie/2024/07/01/biden-releases-a-new-video-and-its-a-five-alarm-fire-moment-n2176212"
  }
]