[
  {
    "text": "Ex-Chief of Staff Mark Meadows granted immunity, tells special counsel he warned Trump about 2020 claims: Sources  —  Meadows said Trump was “dishonest” on election night, according to sources.  —  Former President Donald Trump's final chief of staff in the White House, Mark Meadows … ",
    "url": "https://abcnews.go.com/US/chief-staff-mark-meadows-granted-immunity-tells-special/story?id=104231281"
  },
  {
    "text": "Mitt Romney sounds one last alarm on Trump  —  Ever since the rise of Donald Trump, many folks involved in politics have theorized about how we got here — and done a little introspection about whether anyone could have stopped him.  —  But my assumption is that there are three people alive today … ",
    "url": "https://www.nbcnews.com/politics/elections/chuck-todd-mitt-romney-sounds-one-last-alarm-trump-rcna121771"
  },
  {
    "text": "Trump rages as former acolytes turn against him under legal heat  —  Donald Trump's wealth, power and fame acted like a magnet for new associates keen to enter his orbit.  But now, key figures who sought a share of his reflected glory are turning against him to save themselves.",
    "url": "https://www.cnn.com/2023/10/25/politics/trump-former-aides-turn-against-him/"
  },
  {
    "text": "Cautions on ABC's Huge Mark Meadows Scoop  —  For more than six months, access journalists in DC have been trying to confirm how much Mark Meadows cooperated with Jack Smith.  —  Today, ABC has a huge scoop reporting that Meadows testified at least three times, one time — before a grand jury — with immunity.",
    "url": "https://www.emptywheel.net/2023/10/24/cautions-on-abcs-huge-mark-meadows-scoop/"
  },
  {
    "text": "Another Day of G.O.P. Chaos Winds Up With Speaker Nominee No. 4  —  House Republicans turned on themselves as they immolated yet another of their leaders in the bonfires of the speaker fight.  Then they chose their next nominee.  —  It was clear from the start that House Republicans … ",
    "url": "https://www.nytimes.com/2023/10/25/us/politics/house-republicans-speaker.html"
  },
  {
    "text": "10/25/23 ☀️ Punchbowl News AM  —  We have a new GOP speaker nominee.  The fourth in three weeks.  And the second in just one day.  But this time may be different.  —  Late Tuesday night, the House Republican Conference tapped Rep. Mike Johnson (R-La.) as its speaker designate.",
    "url": "https://punchbowl.news/archive/102523-punchbowl-news-am/"
  },
  {
    "text": "House GOP gives Mike Johnson Speaker nod after whirlwind Emmer dropout  —  House Republicans nominated Rep. Mike Johnson (R-La.) for Speaker Tuesday evening, making him the fourth GOP lawmaker to win the conference's nod — and its second nominee within a day after House Majority Whip Tom Emmer … ",
    "url": "https://thehill.com/homenews/house/4273648-mike-johnson-wins-fourth-speaker-nomination/"
  },
  {
    "text": "Who is Rep. Mike Johnson, the House GOP's latest speaker nominee?  —  Rep. Mike Johnson, Republicans' latest nominee to be the next speaker of the House, has been a vocal supporter of former President Donald Trump and was a key congressional figure in the failed efforts to overturn the 2020 election.",
    "url": "https://www.cnn.com/2023/10/25/politics/mike-johnson-speaker-nominee/"
  },
  {
    "text": "Voters soundly reject Gabrielle Hanson, other MAGA candidates in historic Franklin, Tennessee election  —  FRANKLIN, Tenn. (WTVF) — In perhaps the most bizarre race that this picturesque Middle Tennessee community has ever experienced, Franklin voters resoundingly rejected a candidate for mayor … ",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/franklin-politics/voters-soundly-reject-gabrielle-hanson-other-maga-candidates-in-historic-franklin-tennessee-election"
  },
  {
    "text": "Hillary Clinton Repeatedly Snaps At Heckler In Bonkers Exchange  —  A protester got in the face of the former secretary of state, and she just wanted him to shut up during a panel at Columbia University.  —  LOADING  —  Hillary Clinton attempted to quiet a theatrical heckler this week in a tense exchange that lasted several minutes.",
    "url": "https://www.huffpost.com/entry/hillary-clinton-heckler-columbia_n_6538ea9ee4b0c8556103621c"
  },
  {
    "text": "The 8th Amendment is next  —  Right-wing judges want to put the “cruel” back in “cruel and unusual punishment.” … Over the last year, the fallout from the Supreme Court's decision in New York State Rifle and Pistol Association v. Bruen has been profound.",
    "url": "https://www.publicnotice.co/p/8th-amendment-scotus-clarence-thomas-hardiman"
  },
  {
    "text": "Republicans pray for an early voting reversal in Virginia  —  The Republican Party under President Donald Trump has abandoned the practice.  Glenn Youngkin is betting Virginia Republicans can be convinced otherwise.  —  GLEN ALLEN, Va. — Gov. Glenn Youngkin is trying to get Republican voters … ",
    "url": "https://www.politico.com/news/2023/10/25/republicans-early-voting-virginia-youngkin-trump-00123376"
  },
  {
    "text": "Biden is worried about wider war in the Middle East.  Here's how it could happen.  —  From Yemen's rebels launching missiles to alleged Israeli settler killings of Palestinians in the West Bank, the entire region faces chaos.  —  U.S. officials are worried that violence in Israel's neighbors will spiral into a larger regional war.",
    "url": "https://www.politico.com/news/2023/10/25/israel-hamas-war-fallout-00123360"
  },
  {
    "text": "Threats to American Democracy Ahead of an Unprecedented Presidential Election  —  Introduction  —  In this divided era of American politics, the nation turns its eyes toward an unprecedented presidential election, with two of the oldest leading candidates in history … ",
    "url": "https://www.prri.org/research/threats-to-american-democracy-ahead-of-an-unprecedented-presidential-election/"
  },
  {
    "text": "It's time for DC to get rid of Black Lives Matter Plaza once and for all  —  Black Lives Matter Plaza is an unquestionable stain on our country's history.  Naming a section of Washington, D.C., after Black Lives Matter was always a horrible idea.  —  It was predicated on radical Democrat … ",
    "url": "https://www.washingtonexaminer.com/opinion/its-time-for-dc-to-get-rid-of-black-lives-matter-plaza-once-and-for-all"
  },
  {
    "text": "Google Launches ‘Jewish Allyship’ Bathroom Campaign to Address Anti-Semitism in Workplace  —  ‘Jewglers’ feeling especially vulnerable, fliers say  —  Google headquarters launched a campaign promoting sensitivity to Jews in the workplace by posting educational fliers in its office bathroom stalls last week … ",
    "url": "https://freebeacon.com/latest-news/google-launches-jewish-allyship-bathroom-campaign-to-address-anti-semitism-in-workplace/"
  },
  {
    "text": "Florida orders universities to ‘deactivate’ pro-Palestinian group  —  TALLAHASSEE, Fla. — Florida's university system chancellor, responding to a push by Gov. Ron DeSantis, directed state universities Tuesday to disband campus groups with ties to the national Students for Justice in Palestine organization … ",
    "url": "https://www.politico.com/news/2023/10/24/florida-orders-universities-to-deactivate-pro-palestinian-group-00123350"
  },
  {
    "text": "MAGA Diehards Are Furious Jenna Ellis Pleaded Guilty After Raising $200K  —  Jenna Ellis raised more than $216,000 to fight her Georgia RICO indictment ... then accepted a plea deal  —  Jenna Ellis smiled in her mugshot.  The former Trump attorney who was indicted alongside him and 17 others … ",
    "url": "https://www.rollingstone.com/politics/politics-news/jenna-ellis-draws-maga-ire-pleading-guilty-fundraising-1234861064/"
  }
]