[
  {
    "text": "One Big Unpopular Bill  —  Midday on Thursday, July 3, Republicans in the U.S. House of Representatives voted to approve a marquee tax cut and budget bill they've been trying to pass since May. Republicans in the Senate passed the same bill on Tuesday, courtesy of a tie-breaker by Vice President JD Vance … ",
    "url": "https://www.gelliottmorris.com/p/one-big-unpopular-bill"
  },
  {
    "text": "Is This Really How We're Legislating Now?  —  Speaker Mike Johnson once again defied skeptics and found a majority in a high-stakes vote, with the House passing the president's big policy bill on Thursday along party lines.  He and John Thune, the Senate leader, ably made whatever deals … ",
    "url": "https://www.nytimes.com/2025/07/04/opinion/congress-john-thune-mike-johnson.html"
  },
  {
    "text": "The U.S. Is Switching Sides  —  Trump is giving the Russian dictator every incentive to keep killing Ukrainians.  —  The American president wrote, “Vladimir, STOP!” on his Truth Social account in April, but the Russian president did not halt his offensive in eastern Ukraine.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/07/putin-trump-russia-ukraine/683414/?gift=hVZeG3M9DnxL4CekrWGK38jq6vvO2FygkuCulUcodbA&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump, Zelenskiy discuss weapons, escalating Russian strikes  —  Ukrainian President Volodymyr Zelenskiy said he discussed air defences in a conversation with U.S. President Donald Trump on Friday, and agreed to work on increasing Kyiv's capability to “defend the sky” as Russian attacks escalate.",
    "url": "https://www.reuters.com/business/aerospace-defense/trump-zelesnkiy-discuss-weapons-escalating-russian-strikes-2025-07-04/"
  },
  {
    "text": "Trump tells Zelensky he wants to help Ukraine with air defense, sources say  —  President Trump told Ukrainian President Zelensky in a call on Friday that the U.S. wants to help Ukraine with air defense, due to escalating Russian attacks, a Ukrainian official and a source with knowledge of the call said.",
    "url": "https://www.axios.com/2025/07/04/trump-zelensky-ukraine-air-defense"
  },
  {
    "text": "Trump uses term viewed as antisemitic slur to refer to unscrupulous bankers  —  President Donald Trump deployed the term during a rally at the Iowa State Fairgrounds held to kick off a year of events culminating in America's 250th birthday celebration.  —  President Donald Trump used a term … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/04/trump-rally-jewish-stereotype/"
  },
  {
    "text": "Trump uses antisemitic slur in remarks promoting his ‘big, beautiful bill’  —  Speaking at the Iowa State Fairgrounds, the president used the word “Shylocks” when talking about bankers lending money to family farms.  —  President Donald Trump used an antisemitic slur to describe exploitative bankers during … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-antisemitic-slur-shylocks-iowa-big-beautiful-bill-rcna216904"
  },
  {
    "text": "Hegseth halted weapons for Ukraine despite military analysis that the aid wouldn't jeopardize U.S. readiness  —  The move blindsided the State Department, Ukraine, European allies and members of Congress, who demanded an explanation from the Pentagon.  —  The Defense Department held … ",
    "url": "https://www.nbcnews.com/news/military/hegseth-halted-weapons-ukraine-military-analysis-aid-wouldnt-jeopardiz-rcna216790"
  },
  {
    "text": "The Fourth Of July, Rethought  —  For years, I have retold the story reprinted below every Fourth of July.  It describes a formative experience in my life and in my identity as an American.  I still feel powerfully many of its sentiments: my fondness and appreciation for the late Judge Lew … ",
    "url": "https://www.popehat.com/p/the-fourth-of-july-rethought"
  },
  {
    "text": "Congress Throws More Money at Removing Immigrants than Most Countries Spend on Their Armies  —  It's hard to convey just how big the new budget makes the country's immigration enforcement infrastructure.  —  The Bureau of Prisons?  Bigger than that.  The FBI?  Bigger.  The Marine Corps?",
    "url": "https://talkingpointsmemo.com/news/congress-throws-more-money-at-removing-immigrants-than-most-countries-spend-on-their-armies"
  },
  {
    "text": "Trump's Pardons Cost At Least $1.5 Billion In Restitution  —  Topline  —  President Donald Trump's pardons and commutations have cost more than $100 million in fines owed to the federal government and another $1.5 billion in restitution to victims.  —  Key Facts",
    "url": "https://www.forbes.com/sites/saradorn/2025/07/04/trumps-pardons-cost-at-least-15-billion-in-restitution/"
  },
  {
    "text": "Trump to host UFC fight at White House as part of “America250” celebrations  —  President Trump will host a UFC fight at the White House as part of celebrations marking 250 years since the signing of the U.S. Declaration of Independence, he announced at a Thursday rally in Iowa.",
    "url": "https://www.axios.com/2025/07/04/trump-ufc-white-house-fight-america-250-celebration"
  },
  {
    "text": "U.N. Pulls Nuclear Inspectors Out of Iran for Safety Reasons  —  Move intensifies standoff over agency's oversight of Iran's nuclear work  —  The United Nations atomic agency is pulling its inspectors out of Iran over safety concerns, severing the link between the agency and Tehran … ",
    "url": "https://www.wsj.com/world/middle-east/u-n-pulls-nuclear-inspectors-out-of-iran-for-safety-reasons-b65d84ef?st=W7U8GK&reflink=article_copyURL_share"
  },
  {
    "text": "Russian use of chemical weapons against Ukraine ‘widespread’, Dutch defence minister says  —  Dutch and German intelligence agencies have gathered evidence of widespread Russian use of banned chemical weapons in Ukraine, including dropping a choking agent from drones to drive soldiers … ",
    "url": "https://www.reuters.com/world/europe/russian-use-chemical-weapons-against-ukraine-widespread-dutch-defence-minister-2025-07-04/"
  },
  {
    "text": "Elon Musk floats strategy for new political party  —  Elon Musk on Friday floated an electoral strategy for his hypothetical political party, via a post on X. … - Most recently, Musk has been an outspoken critic of Trump's signature legislation, which the Tesla CEO believes is fiscally irresponsible … ",
    "url": "https://www.axios.com/2025/07/04/elon-musk-new-political-party"
  },
  {
    "text": "The Supreme Court and Congress cede powers to Trump and the presidency  —  The high court has given the president immunity and protected him from nationwide injunctions.  Congress is giving ground on spending and tariffs.  It adds up to a turbocharged executive.",
    "url": "https://www.washingtonpost.com/politics/2025/07/04/executive-trump-powers-congress-supreme-court/"
  },
  {
    "text": "Who's Afraid of Zohran Mamdani?  —  Here is one version of the story.  An anti-affirmative action hacker broke into Columbia's records, stealing private student information in the hope of providing material for Trump's authoritarian squeezing of the university.",
    "url": "https://donmoynihan.substack.com/p/whos-afraid-of-zohran-mamdani"
  }
]