[
  {
    "text": "Trump Leads in 5 Key States, as Young and Nonwhite Voters Express Discontent With Biden  —  A new set of Times/Siena polls, including one with The Philadelphia Inquirer, reveal an erosion of support for the president among young and nonwhite voters upset about the economy and Gaza.",
    "url": "https://www.nytimes.com/2024/05/13/us/politics/biden-trump-battleground-poll.html"
  },
  {
    "text": "Cross-Tabs: May 2024 Times/Siena Poll of the Presidential Battlegrounds  —  Donald Trump leads Joe Biden in five of six states polled by The New York Times, The Philadelphia Inquirer and Siena College from April 28 to May 9, 2024.  —  View toplines for the full set of polls and cross-tabs for: all registered voters |",
    "url": "https://www.nytimes.com/interactive/2024/05/13/us/elections/times-siena-poll-registered-voter-crosstabs.html"
  },
  {
    "text": "No, Your Pet Issue Is Not Making Biden Lose … The American political landscape in 2024 seems like a very simple story that people continue to overcomplicate.  There was a large, global surge in prices in 2021 and 2022 as the economy restarted following the COVID-19 pandemic.",
    "url": "https://nymag.com/intelligencer/article/why-joe-biden-is-trailing-the-election-polls-to-donald-trump.html"
  },
  {
    "text": "Live Updates: Cohen Testifies Trump Promised to Reimburse Hush-Money Payment  —  Michael D. Cohen testified that Donald J. Trump urged him to make the hush-money payment to Stormy Daniels as Election Day drew closer.  —  Cohen describes his efforts to protect Trump's campaign.  Here's the latest.",
    "url": "https://www.nytimes.com/live/2024/05/13/nyregion/trump-trial-michael-cohen"
  },
  {
    "text": "The biggest flaw in Justice Clarence Thomas' newest complaints  —  Justice Clarence Thomas wants the public to believe the serious accusations he's faced are “lies.”  He's going to have to be far more specific.  —  As a matter of jurisprudence, Supreme Court Justice Clarence Thomas has reason to be pleased.",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/biggest-flaw-justice-clarence-thomas-newest-complaints-rcna151935"
  },
  {
    "text": "Justice Thomas has used this “hideous place” to amass the power he now exploits  —  Anyone who lives in Washington, D.C., and says they hate it here have almost always, with rare exceptions, never made the actual Washington their home.  They have limited themselves to the halls of power … ",
    "url": "https://www.lawdork.com/p/justice-thomas-attacks-dc-as-hideous"
  },
  {
    "text": "Attack a Democrat Charged With Corruption?  Republicans Wouldn't Dare.  —  Earlier this month, federal prosecutors bestowed on Republicans what seemed like an election-year gift: charging a senior House Democrat in a competitive district with accepting $600,000 in bribes and acting as a foreign agent.",
    "url": "https://www.theatlantic.com/politics/archive/2024/05/henry-cuellar-charges-house-republicans/678368/"
  },
  {
    "text": "State Republican parties are going rogue  —  Good morning, Early Birds.  Staring at the sky to watch the eclipse is out.  Staring at the sky to watch the aurora borealis is in.  (At least it can't damage your eyes.)  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.",
    "url": "https://www.washingtonpost.com/politics/2024/05/13/state-republican-parties-are-going-rogue/"
  },
  {
    "text": "Psaki's new book falsely recounts Biden's watch check in troop ceremony  —  Former White House press secretary Jen Psaki claims in her new book that President Biden never looked at his watch during the ceremony for soldiers killed during the U.S. withdrawal from Afghanistan in 2021 … ",
    "url": "https://www.axios.com/2024/05/13/psaki-book-biden-watch-check-afghanistan"
  },
  {
    "text": "The real cancel culture  —  In 2020, Bari Weiss quit her job as an editor and writer at the New York Times editorial page in a huff.  In her public resignation letter, Weiss argued that she was forced out because the paper had become “illiberal” and her more conservative beliefs made her … ",
    "url": "https://popular.info/p/the-real-cancel-culture"
  },
  {
    "text": "How on Earth is Donald Trump Getting Credit for Joe Biden's Economy?  —  Joe Biden's trip to Wisconsin last week would, in normal political times, have been a grand slam.  He went to the very spot in Racine County where, in 2018, Donald Trump showed up literally holding a golden shovel … ",
    "url": "https://newrepublic.com/article/181499/earth-donald-trump-getting-credit-joe-bidens-economy"
  },
  {
    "text": "My life as a Chinese spy: Secret police agent tells all  —  Loading...  abc.net.au/news/china-spy-secret- police-agent-tells-all-four-corners/ 103826708  —  For the first time ever, an undercover agent for China's secret police steps out of the shadows to tell all about where he's been and who he's been targeting.",
    "url": "https://www.abc.net.au/news/2024-05-13/china-spy-secret-police-agent-tells-all-four-corners/103826708"
  },
  {
    "text": "Louisiana moves to make abortion pills ‘controlled dangerous substances’  —  Someone possessing the pills without a valid prescription or outside of professional practice could be prosecuted and sentenced to prison.  —  Louisiana could become the first state in the country to categorize mifepristone … ",
    "url": "https://www.washingtonpost.com/nation/2024/05/13/abortion-pills-louisiana-controlled-substance/"
  },
  {
    "text": "Conservative outside group drops $70M on Senate Democrats in battlegrounds  —  The lion's share of the new money will go into what Republicans currently see as their top three pick-up opportunities.",
    "url": "https://www.politico.com/live-updates/2024/05/13/congress/conservatives-drop-70m-more-on-senate-dems-00157355"
  }
]