[
  {
    "text": "Police union that endorsed Trump blasts Jan. 6 pardons … - “Allowing those convicted of these crimes to be released early diminishes accountability and devalues the sacrifices made by courageous law enforcement officers and their families,” per the statement.",
    "url": "https://www.axios.com/2025/01/22/police-union-trump-jan-6-pardons"
  },
  {
    "text": "Trump Pardons the Jan. 6 Cop Beaters  —  Law and order?  Back the blue?  What happened to that GOP?  —  Republicans are busy denouncing President Biden's pre-emptive pardons for his family and political allies, and deservedly so.  But then it's a shame you don't hear many, if any … ",
    "url": "https://www.wsj.com/opinion/donald-trump-pardons-jan-6-capitol-rioters-police-gop-258a4a6e?st=hi9PtA&reflink=mobilewebshare_permalink"
  },
  {
    "text": "“F—k it: Release 'em all”: Why Trump embraced broad Jan. 6 pardons … - Trump vacillated during an internal debate over targeted clemency vs. a blanket decision according to two insiders.  — But as Trump's team wrestled with the issue, and planned a shock-and-awe batch of executive orders Day 1 … ",
    "url": "https://www.axios.com/2025/01/22/trump-pardons-jan6-clemency"
  },
  {
    "text": "Republican Senators Seem Willing to Endure the ‘Challenge’ of Trump's Proposed Tariffs  —  Trump suggested Monday he'd put 25% tariffs on goods from Canada and Mexico, two of the U.S's top trading partners.  — Copy  —  President Donald Trump is getting closer to blowing up the trade agreement … ",
    "url": "https://www.notus.org/policy/trump-trade-canada-mexico-tariffs"
  },
  {
    "text": "GOP member wants bishop ‘added to deportation list’ after Trump prayer service  —  Rep. Mike Collins (R-Ga.) heavily criticized statements made by the Right Rev. Mariann Budde on Tuesday at the inaugural prayer service held for President Trump.  —  “The person giving this sermon should be added … ",
    "url": "https://thehill.com/homenews/house/5098959-gop-member-wants-bishop-added-to-deportation-list-after-trump-prayer-service/"
  },
  {
    "text": "Trump administration directs all federal diversity, equity and inclusion staff be put on leave  —  President Donald Trump 's administration moved Tuesday to end affirmative action in federal contracting and directed that all federal diversity, equity and inclusion staff be put on paid leave and eventually be laid off.",
    "url": "https://apnews.com/article/dei-trump-executive-order-diversity-834a241a60ee92722ef2443b62572540"
  },
  {
    "text": "Trump officials pause health agencies' communications, citing review  —  The agencies are charged with making decisions that touch the lives of every American and are the source of crucial information to health-care providers.  —  The Trump administration has instructed federal health agencies … ",
    "url": "https://www.washingtonpost.com/health/2025/01/21/trump-hhs-cdc-fda-communication-pause/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3NDM1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4ODE3OTk5LCJpYXQiOjE3Mzc0MzU2MDAsImp0aSI6ImEzODFhN2UxLTRhOGUtNGFjOS1hNGRmLTEyNDk5ZWIzNGFiOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9oZWFsdGgvMjAyNS8wMS8yMS90cnVtcC1oaHMtY2RjLWZkYS1jb21tdW5pY2F0aW9uLXBhdXNlLyJ9.cY26hIDkmu_AWumnD7uJ1Ge-rGGy5hoacMYbVpbSyJM&itid=gfta"
  },
  {
    "text": "Trump administration directs federal health agencies to pause communications  —  Amid a deluge of executive actions, the Trump administration has asked federal health agencies to pause external communications, such as regular scientific reports, updates to websites and health advisories, according to sources within the agencies.",
    "url": "https://www.cnn.com/2025/01/21/health/hhs-cdc-fda-trump-pause-communication/"
  },
  {
    "text": "Trump pardons dark web marketplace creator Ross Ulbricht  —  President Trump fulfilled a campaign promise to Libertarian supporters on his second day back in office by pardoning the former creator and owner of an underground e-commerce website known for drug trafficking.",
    "url": "https://www.npr.org/2025/01/21/nx-s1-5270051/trump-pardons-dark-web-marketplace-creator-ross-ulbricht"
  },
  {
    "text": "Trump Pardons Creator of Silk Road Drug Marketplace  —  Ross Ulbricht was serving a life sentence for creating a site in a shady corner of the internet to sell heroin, cocaine and other illicit substances.  —  President Trump on Tuesday granted a pardon to Ross Ulbricht … ",
    "url": "https://www.nytimes.com/2025/01/21/technology/trump-ross-ulbricht-silk-road.html?unlocked_article_code=1.rE4.tkKw.NOO0R7mrlsaX&smid=bs-share"
  },
  {
    "text": "Senators receive affidavit containing new allegations against Pete Hegseth, who denies the claims  —  The former sister-in-law of Trump's defense secretary pick said that Hegseth made his second wife fear for her safety.  Hegseth's second wife said, “There was no physical abuse in my marriage.”",
    "url": "https://www.nbcnews.com/politics/national-security/senators-received-affidavit-containing-new-allegations-pete-hegseth-de-rcna188342"
  },
  {
    "text": "Hegseth Ex-Sister-in-Law Tells Senators He Was ‘Abusive’ to Second Wife  —  A woman once married to the brother of Pete Hegseth, the defense secretary nominee, submitted a sworn statement to the Senate in a late-hour complication to his confirmation.  His attorney denied her account.",
    "url": "https://www.nytimes.com/2025/01/21/us/politics/hegseth-senators-affidavit.html?unlocked_article_code=1.q04.WqU2.FjpnG4Psf5Uq&smid=url-share"
  },
  {
    "text": "‘The gesture speaks for itself’: Germans respond to Musk's apparent Nazi salute  —  Some say it was an unambiguous Nazi salute but others are unsure and say focus should be on Musk's stated support for far-right  —  There were angry reactions across Europe to Elon Musk's apparent use … ",
    "url": "https://www.theguardian.com/technology/2025/jan/21/the-gesture-speaks-for-itself-germans-divided-over-musks-apparent-nazi-salute"
  },
  {
    "text": "22 states sue to stop Trump's order blocking birthright citizenship  —  Attorneys general from 22 states sued Tuesday to block President Donald Trump's move to end a century-old immigration practice known as birthright citizenship guaranteeing that U.S.-born children are citizens regardless of their parents' status.",
    "url": "https://apnews.com/article/birthright-citizenship-trump-executive-order-immigrants-fc7dd75ba1fb0a10f56b2a85b92dbe53"
  },
  {
    "text": "Change to Birthright Citizenship Would Affect Visa Holders, Too  —  President Trump's public rhetoric has focused on undocumented immigrants, but the raft of new orders he signed would also affect those seeking to enter the U.S. legally.  —  President Trump's executive order … ",
    "url": "https://www.nytimes.com/2025/01/21/us/politics/birthright-citizenship-visa-holders.html"
  },
  {
    "text": "Donald Trump's Medicare Executive Order Explained  —  's executive order 14087, which was put in place to lower the cost of prescription drugs for Americans.  —  Newsweek has reached out to the Trump transition team outside of regular working hours via email for comment.  —  Why It Matters",
    "url": "https://www.newsweek.com/donald-trump-medicare-executive-order-explained-2018138"
  },
  {
    "text": "Constitution page on White House website shows 404 error  —  The Constitution page on President Trump's White House website is showing a 404 error.  —  “Page not found,” the site reads.  —  Under former President Biden's term, the website highlighted the history behind the creation … ",
    "url": "https://thehill.com/homenews/administration/5098790-constitution-white-house-website-donald-trump/"
  },
  {
    "text": "Trump announces private-sector $500 billion investment in AI infrastructure  —  U.S. President Donald Trump on Tuesday announced a private sector investment of up to $500 billion to fund infrastructure for artificial intelligence, aiming to outpace rival nations in the business-critical technology.",
    "url": "https://www.reuters.com/technology/artificial-intelligence/trump-announce-private-sector-ai-infrastructure-investment-cbs-reports-2025-01-21/"
  },
  {
    "text": "‘DOGE’ revamp empowers Musk as frictions spur Ramaswamy's exit  —  A deep philosophical rift between the two billionaire leaders of the “Department of Government Efficiency” left Musk to run the group.  —  President Donald Trump's order establishing the “Department of Government Efficiency” … ",
    "url": "https://www.washingtonpost.com/business/2025/01/21/elon-musk-vivek-ramaswamy-doge/"
  },
  {
    "text": "Scoop: Top DOGE Dem is ready for a fight … - “All you need to do is see that they put [Rep.] Marjorie Taylor Greene (R-Ga.) in charge of the committee to know that this is likely going to be very much a political committee,” she said. … - Stansbury said that there are “a lot of good government … ",
    "url": "https://www.axios.com/2025/01/22/trump-musk-doge-democrat-melanie-stansbury"
  },
  {
    "text": "A new Trump Tower of corruption  —  President Donald Trump's son-in-law, Jared Kushner, was a top White House official during Trump's first term.  After exiting the White House in 2021, Kushner launched a new private equity firm, Affinity Partners, and announced he was seeking to raise $7 billion.",
    "url": "https://popular.info/p/a-new-trump-tower-of-corruption"
  }
]