[
  {
    "text": "The Inside Story of Alvin Bragg's Case Against Trump … Reporters vied for seats in the briefing room, some even crouching on the floor.  They all knew, on this Tuesday in early April 2023, that Alvin L. Bragg, the Manhattan district attorney, was about to announce something momentous … ",
    "url": "https://www.nytimes.com/2024/04/09/magazine/alvin-bragg-donald-trump-trial.html"
  },
  {
    "text": "Donald Trump's lawyers ask appeals court to lift gag order in hush money criminal case  —  NEW YORK (AP) — Donald Trump's lawyers asked a New York appeals court Tuesday to delay his hush-money criminal trial while they fight to lift the former president's gag order, just days before the trial is scheduled to start.",
    "url": "https://apnews.com/article/donald-trump-gag-order-hush-money-juan-merchan-0a10c7ee0236f760ce50c05cafb163ef"
  },
  {
    "text": "Don't fall for Trump's new abortion position claims  —  While once again taking credit for the end of Roe v. Wade and the constitutional right to an abortion, Donald Trump nonetheless tried to distance himself on Monday from the most extreme anti-abortion positions of his party in an explicit effort to “win elections.”",
    "url": "https://www.lawdork.com/p/dont-fall-for-trumps-new-abortion-position"
  },
  {
    "text": "I've Been at NPR for 25 Years.  Here's How We Lost America's Trust.  —  Uri Berliner, a veteran at the public radio institution, says the network lost its way when it started telling listeners how to think.  —  You know the stereotype of the NPR listener: an EV-driving, Wordle-playing, tote bag-carrying coastal elite.",
    "url": "https://www.thefp.com/p/npr-editor-how-npr-lost-americas-trust"
  },
  {
    "text": "Ken Buck knocks ‘Moscow Marjorie’ Taylor Greene  —  Former Rep. Ken Buck (R-Colo.) took shots at Rep. Marjorie Taylor Greene (R-Ga.) Monday, attacking his former GOP colleague as “Moscow Marjorie.”  —  The jab comes after former Speaker Kevin McCarthy (R-Calif.) called Greene a … ",
    "url": "https://thehill.com/homenews/house/4582430-ken-buck-knocks-moscow-marjorie-taylor-greene/"
  },
  {
    "text": "Arizona Supreme Court rules that a near-total abortion ban from 1864 is enforceable  —  The bombshell decision adds the state to the growing lists of places where abortion care is effectively banned.  —  PHOENIX — The Arizona Supreme Court ruled Tuesday that a 160-year-old near-total abortion ban still … ",
    "url": "https://www.nbcnews.com/politics/arizona-supreme-court-ruling-abortion-ban-rcna146915"
  },
  {
    "text": "MAGA Operatives Ordered to Pay $1.25M for Scheme Targeting Black Voters  —  NY AG announced settlement today.  —  New York Attorney General Letitia James announced today that right-wing operatives and conspiracy theorists Jacob Wohl and Jack Burkman have agreed to pay up to $1.25 million … ",
    "url": "https://www.meidastouch.com/news/maga-operatives-ordered-to-pay-1-25m-for-scheme-targeting-black-voters"
  },
  {
    "text": "Parents of Michigan school shooter sentenced to 10-15 years in prison  —  The parents of convicted Michigan school shooter Ethan Crumbley were each sentenced Tuesday to 10-15 years in prison for their role in the deaths of four high school students in 2021.  —  James and Jennifer Crumbley … ",
    "url": "https://thehill.com/homenews/state-watch/4582895-parents-michigan-school-shooter-sentenced-prison/"
  },
  {
    "text": "European court rules human rights violated by climate inaction  —  A group of older Swiss women have won the first ever climate case victory in the European Court of Human Rights.  —  The women, mostly in their 70s, said that their age and gender made them particularly vulnerable to the effects of heatwaves linked to climate change.",
    "url": "https://www.bbc.com/news/science-environment-68768598"
  },
  {
    "text": "As Kushner's Investment Firm Steps Out, the Potential Conflicts Are Growing  —  Jared Kushner's Affinity Partners has invested more than $1.2 billion, much of it in firms abroad, drawing new scrutiny as his father-in-law, Donald Trump, again seeks the presidency.",
    "url": "https://www.nytimes.com/2024/04/09/us/politics/jared-kushner-affinity-partners.html"
  },
  {
    "text": "Trump says Jews who vote for Biden do ‘not love Israel’ and ‘should be spoken to’  —  The presumptive Republican presidential nominee repeated an antisemitic trope he has pushed suggesting American Jews have dual loyalties to the U.S. and Israel.  —  Former President Donald Trump on Monday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-says-jews-vote-biden-not-love-israel-spoken-rcna146972"
  },
  {
    "text": "Tenth consecutive monthly heat record alarms and confounds climate scientists  —  If the anomaly does not stabilise by August, ‘the world will be in uncharted territory’, says climate expert  —  Another month, another global heat record that has left climate scientists scratching their heads … ",
    "url": "https://www.theguardian.com/global/2024/apr/09/tenth-consecutive-monthly-heat-record-alarms-confounds-climate-scientists"
  },
  {
    "text": "How Senate Dems plan to quickly ‘dispose’ of Mayorkas trial  —  Sen. Debbie Stabenow, the No. 3 Democrat, said the party will move to dismiss the articles of impeachment on Thursday.",
    "url": "https://www.politico.com/live-updates/2024/04/09/congress/dems-plan-to-dispose-of-mayorkas-trial-00151251"
  },
  {
    "text": "Biden's Latest Student Loan Bailout Has Election-Year Bribe Written All Over It  —  The Democrat's election-year bribe would be paid for by taxpayers forced to shoulder an ever-expanding national debt.  —  President Joe Biden campaigned in swing-state Wisconsin on Monday to sell … ",
    "url": "https://thefederalist.com/2024/04/09/bidens-latest-student-loan-bailout-has-election-year-bribe-written-all-over-it/"
  },
  {
    "text": "The deeply silly, extremely serious rise of ‘Alpha Male’ Nick Adams  —  Meet the Trump-backed raconteur who is teaching America's young men the art of being hard to deal with  —  Nick Adams was speaking to the men in the room.  —  “Never apologize,” he said.  “Never mask up.",
    "url": "https://www.washingtonpost.com/style/power/2024/04/09/nick-adams-alpha-male-trump-campaign-surrogate/"
  },
  {
    "text": "The Ugly Truth Behind Ted Cruz's Super PAC Podcast  —  CRUZ CONTROL  —  Ted Cruz is once again pushing the bounds of campaign finance laws, this time with his super PAC pocketing hundreds of thousands of dollars for his podcast appearances. … In recent weeks, a number of news reports … ",
    "url": "https://www.thedailybeast.com/ted-cruz-is-turning-an-allied-super-pac-into-a-media-company"
  },
  {
    "text": "Idaho Man Arrested for Attempting to Provide Material Support to ISIS  —  For Immediate Release  —  Alexander Scott Mercurio, 18, of Coeur d'Alene, Idaho, was arrested Saturday, April 6, 2024, in Coeur d'Alene for attempting to provide material support and resources to ISIS.",
    "url": "https://www.justice.gov/opa/pr/idaho-man-arrested-attempting-provide-material-support-isis"
  },
  {
    "text": "Who Wants to Be a Trillionaire?  —  Don't laugh.  That's exactly where America's oligarchic policies are taking us.  —  Forbes' annual list of the 400 richest Americans debuted in 1982 with shipping magnate Daniel Ludwig in the top slot.  Ludwig's wealth, the magazine reported, was $2 billion (about $6.3 billion in today's dollars).",
    "url": "https://www.motherjones.com/politics/2024/04/wealth-inequality-trillionaires-oligarchy-federal-tax-policy/"
  },
  {
    "text": "Biden Is Spending $1 Trillion to Fight Climate Change.  Voters Don't Care.  —  President's campaign is promoting the effort, hoping to attract young people  —  President Biden has done more to address climate change than any of his predecessors.  So far, voters don't seem to care.",
    "url": "https://www.wsj.com/politics/elections/biden-is-spending-1-trillion-to-fight-climate-change-voters-dont-care-21d8cb05"
  },
  {
    "text": "Smartphones in schools are bad  —  The narrow case against phones in school is clearly right  —  Like many people my age, I had a TI-86 programmable graphing calculator in high school.  —  It was quite useful for learning high school math.  But even though the device is built specifically for math use … ",
    "url": "https://www.slowboring.com/p/smartphones-in-schools-are-bad"
  },
  {
    "text": "The Black Market That Delivers Elon Musk's Starlinks to U.S. Foes  —  The satellite-internet devices are helping Russian fighters in Ukraine and paramilitary forces in Sudan; SpaceX hasn't shut them off  —  A salesman at Moscow-based online retailer shopozz.ru has supplemented his usual business … ",
    "url": "https://www.wsj.com/business/telecom/starlink-musk-ukraine-russia-sudan-satellite-communications-technology-f4fc79d9"
  },
  {
    "text": "ISIS stadium threat puts UEFA Champions League soccer teams on alert for quarterfinals  —  London — Anonymous online supporters of the Islamic terror group ISIS have issued a threat to soccer stadiums across Europe ahead of major games in the quarterfinals of the UEFA Champions League — European soccer's biggest club competition.",
    "url": "https://www.cbsnews.com/news/uefa-champions-league-isis-stadium-threat-europe-soccer-security-alert/"
  }
]