[
  {
    "text": "Trump Seeks, Without Evidence, to Blame D.E.I. and Democrats for the Crash  —  President Trump's remarks, suggesting that diversity in hiring and other Biden administration policies somehow caused the disaster, reflected his instinct to immediately frame major events through his political or ideological lens.",
    "url": "https://www.nytimes.com/2025/01/30/us/politics/trump-plane-crash-dei-faa-diversity.html?unlocked_article_code=1.tE4.Z0ud.JbQhMo4mtVkd"
  },
  {
    "text": "Trump's Plane Crash Response Is as Cheap as You'd Expect  —  THERE ARE PLENTY OF REASONABLE, nuanced, principled criticisms of DEI programs, and we at The Bulwark have made a lot of them.  —  But the attack on diversity, equity, and inclusion (DEI) programs that Donald Trump and JD Vance advanced … ",
    "url": "https://www.thebulwark.com/p/trumps-plane-crash-response-is-as"
  },
  {
    "text": "Plane crashes in D.C.'s Potomac River with 64 on board after midair collision with Army helicopter — live updates  —  What to know about the Washington, D.C., plane crash  — Search efforts continue in the Potomac River after an American Airlines plane with 60 passengers and four crew … ",
    "url": "https://www.cbsnews.com/live-updates/plane-crash-dc-helicopter-potomac-river/"
  },
  {
    "text": "Trump, without citing evidence, attacks FAA diversity initiatives during plane crash briefing, prompts fierce backlash  —  “I put safety first ... Democrats put policy first,” Trump said.  —  President Donald Trump speaks about the mid-air crash between American Airlines flight 5342 … ",
    "url": "https://abcnews.go.com/Politics/trump-evidence-appears-blame-faa-diversity-initiatives-factor/story?id=118272015"
  },
  {
    "text": "F.C.C. Chair Orders Investigation Into NPR and PBS Stations  —  Brendan Carr, the chairman of the Federal Communications Commission, recently expressed concern about NPR and PBS's sponsorships.  —  Brendan Carr, the chairman of the Federal Communications Commission, informed NPR and PBS … ",
    "url": "https://www.nytimes.com/2025/01/30/business/media/npr-pbs-fcc-investigation.html?unlocked_article_code=1.tE4.njGJ.s2ljEztrWYxy&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Patel Repeatedly Dodges Question of Whether Biden Won the 2020 Election  —  Under three minutes of questioning from Senator Peter Welch, a Vermont Democrat, Kash Patel conceded only that Joe Biden was “certified” as the president.  —  A senator at Kash Patel's confirmation hearing to be F.B … ",
    "url": "https://www.nytimes.com/2025/01/30/us/politics/patel-2020-election.html"
  },
  {
    "text": "Alexandria Ocasio-Cortez lays out battle plan against ‘shockingly dim’ Trump White House  —  The Trump White House this week sparked chaos across the nation when it issued an executive order that resulted in Medicaid portals getting shut down in all 50 states.",
    "url": "https://www.rawstory.com/alexandria-ocasio-cortez-2671031806/"
  },
  {
    "text": "A combative nomination hearing raises more questions about Gabbard  —  Tulsi Gabbard's comments on Edwards Snowden didn't appear to be helping her case as her confirmation bid for director of national intelligence remains uncertain.  —  President Donald Trump's nominee to be the nation's top spy chief faced … ",
    "url": "https://www.politico.com/news/2025/01/30/tulsi-gabbard-mark-warner-law-dni-unqualified-00201517"
  },
  {
    "text": "FAA Chief Quit on Jan. 20 After Elon Musk Told Him to Resign  —  The Federal Aviation Administration's leader stepped down on Jan. 20, months after Elon Musk demanded that he quit.The move by Michael Whitaker means the FAA has no Senate-confirmed leader for one of the biggest crises in its history … ",
    "url": "https://www.thedailybeast.com/faa-chief-michael-whitaker-quit-on-jan-20-after-elon-musk-told-him-to-resign/"
  },
  {
    "text": "Trump Gutted Key Aviation Safety Committee Before D.C. Plane Crash  —  Last week, just days after his inauguration, Donald Trump eliminated the membership of a key committee that handles aviation security.  And on Wednesday night,  a passenger plane collided with a military helicopter in the Washington, D.C., area.",
    "url": "https://newrepublic.com/post/190934/trump-aviation-safety-committee-dc-plane-crash"
  },
  {
    "text": "Former USDA Inspector General Defies Trump Order, Escorted from Her Office  —  Security agents escorted the inspector general of the U.S. Department of Agriculture out of her office on Monday after she refused to comply with her dismissal by the Trump administration, according to Reuters.",
    "url": "https://www.newsweek.com/former-usda-inspector-general-defies-trump-order-escorted-her-office-2023069"
  },
  {
    "text": "Singer Marianne Faithfull dies at 78  —  Singer and actress Marianne Faithfull has died at the age of 78, her spokesperson has said.  —  Faithfull was known for hits that included As Tears Go By, which reached the UK top 10 in 1964, and starring roles in films including 1968's The Girl On A Motorcycle.",
    "url": "https://www.bbc.com/news/articles/cp8k931j423o"
  },
  {
    "text": "It Had Been 16 Years Since a Fatal US Airlines Crash.  —  An ADSB-Exchange screen shot of flight paths that tragically intersected this evening, over the Potomac River in Washington DC.  From the south, a regional jet flown by American Airlines approached Runway 33 at National Airport, DCA.",
    "url": "https://fallows.substack.com/p/it-had-been-16-years-since-a-fatal"
  },
  {
    "text": "Trump and Musk Are Trying to Purge Veterans From the Government  —  The Trump administration emailed federal workers offering them temporary pay to resign — a repeat of Musk's scheme to force out Twitter employees … In a decision that will be remembered as a betrayal of the veteran community … ",
    "url": "https://www.rollingstone.com/politics/political-commentary/trump-musk-doge-purge-veterans-military-1235250861/"
  },
  {
    "text": "Criminal records of Jan. 6 rioters pardoned by Trump include rape, domestic violence  —  Editor's Note: This story includes descriptions of violent crimes and sexual abuse involving both adults and children that may be disturbing to readers.  —  On his first day in office … ",
    "url": "https://www.npr.org/2025/01/30/nx-s1-5276336/donald-trump-jan-6-rape-assault-pardons-rioters"
  },
  {
    "text": "MSU college abruptly cancels Lunar New Year event, citing Trump DEI orders  —  Michigan State University cancelled an annual Lunar New Year celebration following new executive orders targeting diversity, equity and inclusion policies and concerns from students, according to emails obtained by The State News.",
    "url": "https://statenews.com/article/2025/01/msu-college-abruptly-cancels-lunar-new-year-event-citing-trump-orders"
  },
  {
    "text": "To Pay for Trump Tax Cuts, House GOP Floats Plan to Slash Benefits for the Poor and Working Class  —  A menu of options being circulated by congressional Republicans also includes new tax cuts for corporations and the ultrawealthy.  —  One of the hallmarks of Donald Trump's presidential campaign … ",
    "url": "https://www.propublica.org/article/trump-tax-cuts-congress-republicans-plan-slash-benefits"
  },
  {
    "text": "Pentagon agency pauses celebrations for Martin Luther King Jr. Day, Black History Month and more  —  WASHINGTON — The Defense Department's intelligence agency has paused observances of Martin Luther King Jr. Day, Pride Month, Holocaust Days of Remembrance and other cultural or historical annual events … ",
    "url": "https://www.stripes.com/theaters/us/2025-01-29/department-of-defense-pauses-cultural-observances-16642776.html"
  },
  {
    "text": "See what Tulsi Gabbard deleted from her Senate Intel opening remarks … - The opening remarks Gabbard first provided to the Senate Intelligence Committee included lines later removed from the final version that she delivered at Thursday's hearing, according to both copies obtained by Axios.",
    "url": "https://www.axios.com/2025/01/30/tulsi-gabbard-senate-intel-opening-remarks-changes"
  },
  {
    "text": "Tulsi Gabbard refuses to call Edward Snowden a “traitor” … “So, was Edward Snowden a traitor?”  — Gabbard would not give a yes or no answer, saying only that she is “committed if confirmed as Director of National Intelligence to join you in making sure that there is no future Snowden-type leak.”",
    "url": "https://www.axios.com/2025/01/30/tulsi-gabbard-edward-snowden-traitor"
  },
  {
    "text": "In Tense Call, Governors Push Schumer to Fight Harder Against Trump  —  On a call with Senator Chuck Schumer, the minority leader, six Democratic governors pushed him to slow down the confirmation of President Trump's nominees and to do more to block his agenda.",
    "url": "https://www.nytimes.com/2025/01/29/us/politics/chuck-schumer-trump-agenda-cabinet.html?unlocked_article_code=1.tE4.uTbf.cKtvP65o9Anu&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Hiding in the attic in Donald Trump's America  —  It was the best of times, it was the worst of times.  On the seventh night of Donald Trump's long-dreaded second presidency, thousands of joyous Philadelphians poured into the streets.  Not for him , of course, but because our beloved Birds … ",
    "url": "https://www.inquirer.com/columnists/attytood/immigration-raids-trump-deepseek-tech-eagles-superbowl-20250128.html"
  },
  {
    "text": "Sam Bankman-Fried's Parents Explore Seeking Trump Pardon for Son  — They've met with lawyers and other figures in Trump's orbit  — FTX co-founder was sentenced to 25 years for fraud last year  —  The Impact of Trump's DEI Actions The Impact of Trump's DEI Actions The Impact of Trump's DEI Actions",
    "url": "https://www.bloomberg.com/news/articles/2025-01-30/sam-bankman-fried-s-parents-explore-seeking-trump-pardon-for-son"
  },
  {
    "text": "Exclusive: Trump Middle East envoy says rebuilding Gaza could take 10 to 15 years … - The administration is working on concluding implementation of the first phase of the deal between Israel and Hamas to release hostages held in Gaza in exchange for a ceasefire.",
    "url": "https://www.axios.com/2025/01/30/gaza-rebuilding-plans-trump-administration"
  },
  {
    "text": "Senior FBI leaders promoted by former Director Wray have been demoted or reassigned, sources say  —  At least five senior FBI leaders who were promoted by former Director Christopher Wray have been notified they are being demoted or reassigned, according to sources briefed on the matter … ",
    "url": "https://www.cnn.com/2025/01/30/politics/senior-fbi-leaders-demoted-wray/"
  },
  {
    "text": "“A Weak President”: Trump's Chaos Strategy Implodes in Epic OMB Fiasco … On Wednesday, Donald Trump's administration rescinded the Office of Management and Budget memo that instituted his disastrous funding freeze, an apparent surrender amid a national outcry.",
    "url": "https://newrepublic.com/article/190923/a-weak-president-trumps-chaos-strategy-implodes-epic-omb-fiasco"
  }
]