[
  {
    "text": "Haley Says She Is Going the Distance Against Trump.  Here's Her Plan.  —  The former South Carolina governor is expected to lose big in her home state.  Beyond that, it's an even steeper climb.  —  One week before the Republican presidential primary in South Carolina … ",
    "url": "https://www.nytimes.com/2024/02/18/us/politics/haley-trump-gop.html"
  },
  {
    "text": "In New York, the Trump Brand Is Costing Some Condo Owners  —  When Donald J. Trump became president, condominiums in buildings emblazoned with his name began selling for less, according to an analysis.  —  In the world of real estate, Donald J. Trump's name has long been synonymous with luxury.",
    "url": "https://www.nytimes.com/2024/02/18/realestate/trump-condos-prices-nyc.html"
  },
  {
    "text": "Seeing Haley's attacks on Trump, some claim her as a member of the resistance  —  But the former S.C. governor rejects the label, saying her campaign ‘is not an anti-Trump movement’  —  Speaking to influential Republican donors at a private gathering in Palm Beach, Fla., on the last Tuesday of January … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/18/haley-trump-resistance-gop-primary/"
  },
  {
    "text": "Trump hawks $399 branded shoes at ‘Sneaker Con,’ a day after a $355 million ruling against him  —  PHILADELPHIA (AP) — As he closes in on the Republican presidential nomination, former President Donald Trump made a highly unusual stop Saturday, hawking new Trump-branded sneakers at “Sneaker Con … ",
    "url": "https://apnews.com/article/trump-sneakers-sneaker-con-philadelphia-4de093eda6f8d1c68baf8fe8095f777b"
  },
  {
    "text": "Haley Calls Navalny a ‘Hero,’ Saying Trump Must Answer for His Death  —  Nikki Haley has long criticized her former boss over what she has described as his love of dictators and authoritarian leaders.  —  Nikki Haley on Saturday called Aleksei A. Navalny, the outspoken Russian opposition leader … ",
    "url": "https://www.nytimes.com/2024/02/17/us/politics/haley-trump-russia-navalny-putin.html"
  },
  {
    "text": "Trump launches sneaker line  —  Former President Donald Trump launched a line of sneakers ranging in price from $199 to $399.  —  If anyone was waiting for the other shoe to drop in the upcoming presidential race, former President Donald Trump just did, launching his own line of tennis shoes on Saturday.",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-launches-sneaker-line-rcna139334"
  },
  {
    "text": "Trump unveiled his line of gold sneakers at Sneaker Con in Philadelphia  —  Former President Donald Trump made a brief stop in Philadelphia on Saturday to announce his new sneaker brand and remind a crowd of sneakerheads to vote.Just hours before a planned campaign rally in Michigan … ",
    "url": "https://www.inquirer.com/politics/nation/donald-trump-sneakercon-philadelphia-sneaker-culture-20240217.html"
  },
  {
    "text": "Trump Launches $399 Sneaker Brand A Day After $355 Million Verdict Against Him  —  Former President Donald Trump hawked his new Trump-branded sneakers at “Sneaker Con,” a gathering that bills itself as the “The Greatest Sneaker Show On Earth!”.  —  LOADING",
    "url": "https://www.huffpost.com/entry/trump-launches-sneaker-line-at-sneaker-con_n_65d12c70e4b04daca6972e41"
  },
  {
    "text": "Navalny's death fails to move the dial for Republican Senator J.D. Vance  —  At Munich Security Conference, American senator doubles-down on view that Ukraine should cede territory to Russia.  —  U.S. Senator J.D. Vance has made a name for himself in the United States Congress … ",
    "url": "https://www.politico.eu/article/navalny-death-fails-to-move-the-dial-for-vance/"
  },
  {
    "text": "Germany Says Failure to Back Ukraine Aid Could Hurt US Economy  — Defense minister urges lawmakers to unlock stalled support  — Pistorius speaks to Bloomberg at Munich Security Conference  —  German Defense Minister Boris Pistorius urged US lawmakers to approve additional military aid … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-18/germany-says-failure-to-back-ukraine-aid-could-hurt-us-economy"
  },
  {
    "text": "Top Maricopa county official quits as election looms: ‘All I do is play defense’  —  Clint Hickman, who helped lead Arizona's largest county through the pandemic and 2020 election, has faced endless harassment for the last few years  —  For Clint Hickman, an official who helped lead Arizona's … ",
    "url": "https://www.theguardian.com/us-news/2024/feb/18/maricopa-county-clint-hickman"
  },
  {
    "text": "Cheney says it's ‘worth’ Johnson losing Speakership over passing Ukraine aid bill  —  Former Rep. Liz Cheney (R-Wyo.) said it's worth it for Speaker Mike Johnson (R-La.) to lose the Speakership if he passes a bill approving aid for Ukraine.  —  Cheney called on Johnson to bring a bill … ",
    "url": "https://thehill.com/homenews/house/4475545-cheney-says-its-worth-johnson-losing-speakership-over-passing-ukraine-aid-bill/"
  },
  {
    "text": "Rep. Rashida Tlaib urges Michigan Democrats to vote against Biden in the primary  —  The Michigan congresswoman urged voters to “vote uncommitted” while she stood outside an early voting site in a video posted to X on Saturday  —  Rep. Rashida Tlaib, D-Mich., is urging Democrats in Dearborn … ",
    "url": "https://www.nbcnews.com/politics/2024-election/rep-rashida-tlaib-urges-michigan-democrats-vote-biden-primary-rcna139360"
  },
  {
    "text": "Lyin' expelled ex-Rep. George Santos makes Jimmy Kimmel's ‘wishes come true’ by suing host over misusing Cameo clips  —  This is no laughing matter.  —  Expelled ex-Rep. George Santos is suing television host Jimmy Kimmel for allegedly misusing his Cameo clips on his show, The Post has learned.",
    "url": "https://nypost.com/2024/02/17/us-news/lyin-expelled-ex-rep-george-santos-makes-jimmy-kimmels-wishes-come-true-by-suing-host-over-misusing-cameo-clips/"
  },
  {
    "text": "Rep. Mike Turner: The White House seemed to be ‘sleepwalking’ on Russian nuclear threat  —  Rep. Mike Turner, R-Ohio, told NBC's “Meet the Press” on Saturday that he was concerned the White House was “hiding ... some inaction” on this threat.  —  Rep. Mike Turner told NBC's “Meet the Press” … ",
    "url": "https://www.nbcnews.com/politics/congress/rep-mike-turner-white-house-seemed-sleepwalking-russian-nuclear-threat-rcna139354"
  }
]