[
  {
    "text": "Trump's Name Is on Contributor List for Epstein Birthday Book … An introductory letter to a book celebrating Jeffrey Epstein's 50th birthday, handwritten by Ghislaine Maxwell.  —  President Trump's name appeared on a contributor list for a book celebrating the 50th birthday … ",
    "url": "https://www.nytimes.com/2025/07/24/us/politics/trump-epstein-birthday-book.html?unlocked_article_code=1.ZE8.Pl-Y.-bXmQFyY6nlL&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Jeffrey Epstein's Birthday Album Included Letters From Bill Clinton, Leon Black  —  Former president, Wall Street billionaire were listed along with Donald Trump as ‘friends’ in the 2003 book's table of contents, which named around five dozen contributors  —  The biggest name … ",
    "url": "https://www.wsj.com/us-news/jeffrey-epstein-birthday-album-included-letters-from-bill-clinton-leon-black-a7cd8cb1?st=1q6ZFr&reflink=article_copyURL_share"
  },
  {
    "text": "Here's how the Fed's renovation budget ballooned to $2.5 billion  —  The Fed's renovation project broke ground in 2022 after years of planning.  — The Federal Reserve's renovation project is bogged down largely by invisible labor, preservation, raw material, and environmental costs … ",
    "url": "https://fortune.com/2025/07/23/federal-reserve-renovation-cost-explained/"
  },
  {
    "text": "Trump to sign order pushing cities and states to remove homeless people from streets  —  Amid record high homelessness, Trump wants to move homeless people from the streets and into treatment centers.  —  WASHINGTON ― President Donald Trump is set to take executive action that looks … ",
    "url": "https://www.usatoday.com/story/news/politics/2025/07/24/trump-homeless-people-streets-order-housing/85358060007/"
  },
  {
    "text": "France Will Recognize Palestinian Statehood, Macron Says  —  The announcement sets France apart from the United States and most of its close allies, and could cause friction with President Trump.  —  President Emmanuel Macron announced late Thursday that France would recognize Palestine … ",
    "url": "https://www.nytimes.com/2025/07/24/world/europe/france-palestine-statehood-macron-gaza.html"
  },
  {
    "text": "The Worst-Kept Secret of the Israeli-Palestinian Conflict  —  The president opened the door to the ethnic cleansing of Gaza.  He needs to close it.  —  One of the more poorly kept secrets of the Israeli-Palestinian conflict is that many of those involved would prefer to take all the land and have the other side disappear.",
    "url": "https://www.theatlantic.com/international/archive/2025/07/trump-gaza-mistakes/683651/?gift=Y5UOGK3oJJO3esRHvDP7oTneQ3j2vMlYV4y8YyZ7RaQ&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Alina Habba to remain N.J. prosecutor: “I don't cower to pressure”  —  Alina Habba on Thursday proclaimed herself the acting U.S. attorney for the District of New Jersey, days after federal judges replaced her from the position. … Pam Bondi is the Attorney General.",
    "url": "https://www.axios.com/2025/07/25/alina-habba-nj-prosecutor-trump-administration"
  },
  {
    "text": "Independents Drive Trump's Approval to 37% Second-Term Low  —  WASHINGTON, D.C. — Six months into his second term, President Donald Trump's job approval rating has dipped to 37%, the lowest of this term and just slightly higher than his all-time worst rating of 34% at the end of his first term.",
    "url": "https://news.gallup.com/poll/692879/independents-drive-trump-approval-second-term-low.aspx"
  },
  {
    "text": "Hulk Hogan Dead at 71  —  EXCLUSIVE  —  Wrestling legend Hulk Hogan has died at 71 years old, TMZ Sports has learned.  —  Medics were dispatched to the WWE icon's Clearwater, Florida home early Thursday morning ... with operators stating it was regarding a “cardiac arrest.”  —  CARDIAC ARREST CALLED IN",
    "url": "https://www.tmz.com/2025/07/24/hulk-hogan-dead/"
  },
  {
    "text": "F.C.C. Approves Skydance's Merger With Paramount  —  The agency's blessing was one of the last hurdles for the deal, which was being subjected to close scrutiny by the Trump administration.  —  The Federal Communications Commission said Thursday it would allow Paramount to merge … ",
    "url": "https://www.nytimes.com/2025/07/24/business/media/fcc-skydance-merger-paramount.html"
  },
  {
    "text": "Trump White House Rages Over ‘South Park’ Episode, Calls Show ‘Fourth-Rate’  —  The president cowed Paramount execs, but the company's talent is rebelling.  Now, the administration is melting down … “The Left's hypocrisy truly has no end — for years they have come after South Park … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-white-house-rages-south-park-premiere-1235393132/"
  },
  {
    "text": "Columbia ends uncertainty with Trump deal, head says  —  Columbia University's agreement to pay over $200 million to the U.S. government in a settlement with President Donald Trump's administration to resolve federal probes and restore most of its suspended federal funding ends a period of … ",
    "url": "https://www.reuters.com/legal/government/columbia-ends-uncertainty-with-trump-deal-head-says-2025-07-24/"
  },
  {
    "text": "Can Ghislaine Maxwell be trusted to tell the truth about Jeffrey Epstein?  —  As the uproar over the Epstein files continues, prosecutors say the late sex offender's longtime accomplice has a history of lying.  Her defense lawyer says she will speak truthfully.",
    "url": "https://www.nbcnews.com/politics/justice-department/will-ghislaine-maxwell-tell-truth-investigators-rcna216872"
  },
  {
    "text": "How a Frantic Scouring of the Epstein Files Consumed the Justice Dept. … Justice Department officials diverted hundreds of F.B.I. employees and federal prosecutors from their regular duties to go through the Jeffrey Epstein files at least four times — including once to flag any references … ",
    "url": "https://www.nytimes.com/2025/07/24/us/politics/epstein-files-trump-bondi-justice-department-fbi.html?unlocked_article_code=1.Y08.JtxW.TqTju80t4vZ0&smid=url-share"
  },
  {
    "text": "Senate Inches Forward With Trump's Alarming Court Pick, Emil Bove  —  The Senate voted Thursday to advance Trump's most concerning judicial nominee to date, Emil Bove.  —  In a procedural vote, every Democrat voted against moving forward with Bove, along with two Republicans: Lisa Murkowski of Alaska and Susan Collins of Maine.",
    "url": "https://www.huffpost.com/entry/trump-tariffs-white-house-latest_n_686ec29fe4b09bd98fe4be7e/liveblog_68828080e4b01be72b3e6739"
  },
  {
    "text": "New York's Kathy Hochul opens the door to redrawing House lines … “I'm not surprised that they're trying to break the rules to get an advantage,” Hochul added.  “But that's undemocratic, and not only are we calling them out, we're also going to see what our options are.”",
    "url": "https://www.politico.com/news/2025/07/24/new-york-redistricting-hochul-00475043"
  },
  {
    "text": "Justice Department Sues New York City Over Sanctuary Policies  —  For Immediate Release  —  WASHINGTON - Today, the Justice Department filed a lawsuit against New York City, Mayor Eric Adams, and several other city officials to challenge New York's sanctuary city laws.",
    "url": "https://www.justice.gov/opa/pr/justice-department-sues-new-york-city-over-sanctuary-policies"
  },
  {
    "text": "Mass starvation stalks Gaza as deaths from hunger rise  —  Israel has severely limited the amount of food entering Gaza, where society is on the brink of collapse.  —  After four months of a near-total Israeli siege, Gaza's few remaining hospitals now have wards for the growing number … ",
    "url": "https://www.washingtonpost.com/world/2025/07/24/gaza-starvation-israel-restrictions/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzMzI5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU0NzExOTk5LCJpYXQiOjE3NTMzMjk2MDAsImp0aSI6ImJjNjFiNjIwLTVkZmItNDA4NS04OWY2LWYyZmNmMjA4YjM2NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI1LzA3LzI0L2dhemEtc3RhcnZhdGlvbi1pc3JhZWwtcmVzdHJpY3Rpb25zLyJ9.93ILZybvyRKJ7vrXPrJQPyu6a1Ax7MLiw0cLsl03_oc&itid=gfta"
  },
  {
    "text": "RFK Jr. Pictured Partying With Child Sex Predator Jeffrey Epstein  —  WITH FRIENDS LIKE THESE  —  The renewed scrutiny on the HHS Secretary comes amid an ongoing firestorm over the Epstein files.  —  Robert Kennedy Jr. is facing fresh questions about his ties to Jeffrey Epstein … ",
    "url": "https://www.thedailybeast.com/rfk-jr-pictured-partying-with-child-sex-predator-jeffrey-epstein/"
  },
  {
    "text": "Quebec man warning Canadian boaters after he was detained by U.S. Coast guard, put in jail cell  —  A Quebec man says he is outraged after the U.S. Coast Guard accused him of fishing in American waters and then arrested him before putting him in a jail cell for nearly two hours.",
    "url": "https://www.ctvnews.ca/montreal/article/quebec-man-warning-canadian-boaters-after-he-was-detained-by-us-coast-guard-put-in-jail-cell/"
  },
  {
    "text": "Texas lawsuit challenges telehealth abortions, citing Comstock Act  —  A Texas man is suing a California doctor for allegedly providing his girlfriend with abortion medication.  —  The lawsuit—a civil complaint filed in the federal court for the Southern District of Texas … ",
    "url": "https://thehill.com/homenews/5419121-texas-lawsuit-telehealth-abortions/"
  },
  {
    "text": "Amy Sherald Cancels Her Smithsonian Show, Citing Censorship  —  The artist said that she made the decision after she said she learned that her painting of a transgender Statue of Liberty might be removed to avoid provoking President Trump.  —  Amy Sherald — the artist who rocketed to fame … ",
    "url": "https://www.nytimes.com/2025/07/24/arts/design/amy-sherald-smithsonian-censorship.html?unlocked_article_code=1.Y08.Wq7P.vQrr0WNRL1br&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump's FCC abandons the future (permalink)  —  The corollary of “you treasure what you measure,” is “you don't give a shit about what you stop measuring,” which is why Trump's FCC has decided to stop measuring the speed of the broadband it subsidizes with billions in public funds:",
    "url": "https://pluralistic.net/2025/07/24/geometry-hates-cars/#dogshit-unit-economics"
  },
  {
    "text": "The Supreme Court Is Now Asking Judges to Do the Impossible … The Supreme Court expanded Donald Trump's power yet again on Wednesday, granting him the authority to fire Democratic members of the Consumer Product Safety Commission in direct violation of federal law.",
    "url": "https://slate.com/news-and-politics/2025/07/supreme-court-precedent-judges-must-rule-for-trump.html"
  },
  {
    "text": "Ken Paxton Claimed Three Houses as His Primary Residence, Records Show  —  The attorney general of Texas, who is challenging Senator John Cornyn, could have secured favorable mortgage rates, and may have violated the law if he knowingly falsified loan documents.",
    "url": "https://www.nytimes.com/2025/07/24/us/politics/ken-paxton-mortgage.html"
  },
  {
    "text": "Barack Obama Sees Death Threat Surge After Trump's Treason Claims  —  Former U.S. President Barack Obama has been the subject of online death threats and calls for imprisonment after President Donald Trump and the director of national intelligence (DNI) Tulsi Gabbard accused … ",
    "url": "https://www.newsweek.com/barack-obama-trump-treason-arrest-russia-death-threats-2102949"
  }
]