[
  {
    "text": "Bongino still in limbo as Trump fumes and JD Vance seeks to play mediator, sources say  —  Several of President Donald Trump's top officials went to work on Monday with a key question unanswered: would Dan Bongino show up today?  —  The deputy FBI director did not go into the office Friday … ",
    "url": "https://cnn.com/2025/07/14/politics/dan-bongino-epstein"
  },
  {
    "text": "Trump's Jeffrey Epstein post contradicts what top Fox hosts have argued  —  Just months ago, Trump allies claimed the deep state hid the “Epstein Files.”  Trump now claims that they were fabricated all along.  —  President Donald Trump claimed Sunday that the “Epstein Files” … ",
    "url": "https://www.mediamatters.org/fox-news/trumps-jeffrey-epstein-post-contradicts-what-top-fox-hosts-have-argued"
  },
  {
    "text": "The Five MAGA Factions Waging an Epstein Civil War  —  A taxonomy of truculent Trumpists.  —  The Leopard Will Eat the Face  —  TRUMP WORLD FELL INTO CHAOS just before the weekend, as the shock from the Justice Department's Jeffrey Epstein memo continued to reverberate.",
    "url": "https://www.thebulwark.com/p/five-maga-factions-waging-civil-war-jeffrey-epstein"
  },
  {
    "text": "Supreme Court Clears the Way for Trump's Cuts to the Education Department  —  The move by the justices represents an expansion of executive power, allowing President Trump to dismantle the inner workings of a government department.  —  The Supreme Court agreed on Monday that the Trump administration … ",
    "url": "https://www.nytimes.com/2025/07/14/us/politics/supreme-court-education-department.html"
  },
  {
    "text": "Supreme Court allows Trump to lay off nearly 1,400 Education Department employees  —  The Supreme Court is allowing President Donald Trump to put his plan to dismantle the Education Department back on track — and to go through with laying off nearly 1,400 employees.",
    "url": "https://apnews.com/article/supreme-court-trump-education-layoffs-9370415531185092341b16a6bfea9344"
  },
  {
    "text": "Supreme Court allows Trump to proceed with mass firings at Education Department  —  The Supreme Court on Monday said President Donald Trump may proceed with his plan to carry out mass layoffs at the Department of Education in the latest win for the White House at the conservative high court.",
    "url": "https://cnn.com/2025/07/14/politics/supreme-court-firings-education"
  },
  {
    "text": "Trump Kept Gold Club World Cup Trophy for Himself So FIFA Had to Give the Winners a Replica  —  OWN GOAL  —  Trump took every opportunity to make the new, expanded soccer tournament all about himself.  —  President Trump has revealed that the champions of the Club World Cup won't be getting … ",
    "url": "https://www.thedailybeast.com/trump-kept-gold-club-world-cup-trophy-for-himself-so-fifa-had-to-give-the-winners-a-replica/"
  },
  {
    "text": "US imposes a 17% duty on fresh Mexican tomatoes  —  The U.S. government said Monday it is placing a 17% duty on most fresh Mexican tomatoes after negotiations ended without an agreement to avert the tariff.  —  Proponents said the import tax will help rebuild the shrinking U.S. tomato industry … ",
    "url": "https://apnews.com/article/mexico-tomatoes-duty-commerce-e1b113bfb9458d2443d5bb999795375c"
  },
  {
    "text": "Two-thirds of the DOJ unit defending Trump policies in court have quit  —  The U.S. Justice Department unit charged with defending against legal challenges to signature Trump administration policies - such as restricting birthright citizenship and slashing funding to Harvard University … ",
    "url": "https://www.reuters.com/legal/litigation/two-thirds-doj-unit-defending-trump-policies-court-have-quit-2025-07-14/"
  },
  {
    "text": "ICE declares millions of undocumented immigrants ineligible for bond hearings  —  A memo from ICE's acting director instructs officers to hold immigrants who entered the country illegally “for the duration of their removal proceedings,” which can take months or years.",
    "url": "https://www.washingtonpost.com/immigration/2025/07/14/ice-trump-undocumented-immigrants-bond-hearings/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUyNDY1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUzODQ3OTk5LCJpYXQiOjE3NTI0NjU2MDAsImp0aSI6ImQyNzRmNjMwLWE4MjQtNDMwYi1hZDU1LTUxNjg3NzA1MWU4NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzA3LzE0L2ljZS10cnVtcC11bmRvY3VtZW50ZWQtaW1taWdyYW50cy1ib25kLWhlYXJpbmdzLyJ9.rceL8rWTDoUkGGjtDBssAsvEI63vqxUKB2RvL1BdsCA&itid=gfta"
  },
  {
    "text": "How Putin Humiliated Trump  —  President Donald Trump is finally taking the fight to Vladimir Putin.  Sort of.  For now.  —  Trump's deference to Russia's authoritarian leader has been one of the most enduring geopolitical subplots of the past decade.  But his frustration with Putin has grown.",
    "url": "https://www.theatlantic.com/politics/archive/2025/07/trump-putin-russia-ukraine/683531/?gift=SCYx-5scVta3-cr_IlgTyTDiTbtyLvjUWQTqlVZK6ZU"
  },
  {
    "text": "Marc Andreessen and the Billionaire Victims Club  —  The gripes of this bigwig of the tech right don't stand up to scrutiny.  —  ∙ Paid  —  1. White People  —  Over the weekend the Washington Post got hold of a text chain in which Marc Andreessen explained some facts of life to his fellow travelers in the Trump White House.",
    "url": "https://www.thebulwark.com/p/marc-andreesen-and-the-billionaire"
  },
  {
    "text": "Why Gov. Greg Abbott Won't Release His Emails With Elon Musk  —  We asked Abbott for his and his staff's emails with Elon Musk and Musk's companies.  The governor's office won't turn them over, saying some contain “intimate and embarrassing” information that is “not of legitimate concern to the public.”",
    "url": "https://www.propublica.org/article/texas-governor-greg-abbott-elon-musk-emails-foia"
  },
  {
    "text": "Cuomo to Fight On in Mayor's Race After Bruising Primary Loss to Mamdani  —  Former Gov. Andrew M. Cuomo is expected to announce his commitment to a third-party run against Assemblyman Zohran Mamdani, who soundly defeated him in the Democratic primary for New York City mayor.",
    "url": "https://www.nytimes.com/2025/07/14/nyregion/andrew-cuomo-mamdani-nyc-mayor.html?unlocked_article_code=1.WU8.nwO-.AWpGD56nTku7&smid=url-share"
  },
  {
    "text": "Defense Department to begin using Grok, Musk's controversial AI Model  —  Elon Musk's artificial intelligence start-up said its models are now available to federal agencies.  —  The U.S. Department of Defense will begin using Grok, the AI chatbot built by Elon Musk's start-up xAI, the company announced in a post on Monday.",
    "url": "https://www.washingtonpost.com/technology/2025/07/14/elon-musk-grok-defense-department/"
  },
  {
    "text": "EXCLUSIVE: Jeffery Epstein's accomplice Ghislaine Maxwell is ready to reveal ‘truth’ of the pedophile client list, say insiders.  So, why are Republicans blocking her?  —  Ghislaine Maxwell is willing to speak in front of Congress about The Epstein Files, sources tell Daily Mail.",
    "url": "https://www.dailymail.co.uk/news/article-14901591/Jeffery-Epstein-Ghislaine-Maxwell-trump-congress.html"
  },
  {
    "text": "Obama's blunt message for Democrats: ‘Toughen up’  —  Former President Barack Obama issued a call to action for Democrats at a private fundraiser in New Jersey on Friday evening, urging those frustrated by the state of the country under President Donald Trump to “stand up for the things that you think are right.”",
    "url": "https://cnn.com/2025/07/14/politics/obama-democrats-message"
  },
  {
    "text": "The Young GOPer Behind “Alligator Alcatraz” Is the Dark Future of MAGA  —  The other day, Stephen Miller went on Fox News and offered a plea that got surprisingly little attention given its highly toxic and unnerving implications.  Miller urged politicians in GOP-run states to build their own versions of … ",
    "url": "https://newrepublic.com/article/197899/james-uthmeier-florida-alligator-alcatraz-maga-dark-future"
  },
  {
    "text": "Key Senate Republican to meet with Trump on funding clawback request  —  Sen. Eric Schmitt is heading to the White House Monday to meet with President Donald Trump on the administration's effort to claw back $9.4 billion in funding, according to a person granted anonymity to disclose the private gathering.",
    "url": "https://www.politico.com/live-updates/2025/07/14/congress/key-senate-republican-to-meet-with-trump-on-funding-clawback-request-00451417"
  },
  {
    "text": "The Situation: The Case of Erez Reuveni  —  What if America had checks and balances and nobody came?  —  benjaminwittes.lawfaremedia.org  —  Meet The Authors … The Situation on Wednesday predicted that the so-called investigation of John Brennan and James Comey will prove to be a ghost … ",
    "url": "https://www.lawfaremedia.org/article/the-situation--the-case-of-erez-reuveni"
  },
  {
    "text": "167. The Inconsistent Court Strikes Again  —  Welcome back to “One First,” an (increasingly frequent) newsletter that aims to make the U.S. Supreme Court more accessible to all of us.  If you're not already a subscriber, I hope you'll consider becoming one (and, if you already are … ",
    "url": "https://www.stevevladeck.com/p/167-the-inconsistent-court-strikes"
  },
  {
    "text": "Mark Cuban Reveals A Cold Truth About Why Democrats Are Flailing  —  “That's not the way to win.  It's just not,” said the billionaire.  —  Billionaire investor and “Shark Tank” alum Mark Cuban pulled no punches when talking about what he sees as the Democratic Party's current failings.",
    "url": "https://www.huffpost.com/entry/mark-cuban-democrats-suck_n_6874bcb8e4b04f3e272f574b"
  },
  {
    "text": "House Democratic leaders won't whip against crypto bills  —  House Democratic leaders will not whip against the landmark cryptocurrency bills that will be on the floor later this week despite opposition from the party's top member on the Financial Services Committee.",
    "url": "https://www.politico.com/live-updates/2025/07/14/congress/house-dems-crypto-bills-waters-clark-french-hill-00451763"
  },
  {
    "text": "DOGE told regulator to ‘rubber stamp’ nuclear … The meeting was held after President Donald Trump signed a May 23 executive order that would supplant the NRC's historical role as the sole agency responsible for ensuring commercial nuclear projects are safe and won't threaten public health.",
    "url": "https://www.politico.com/news/2025/07/14/doge-to-regulator-rubber-stamp-nuclear-00450658"
  },
  {
    "text": "Pentagon pulls all military speakers from ‘globalist’ Aspen Security Forum  —  A dozen top U.S. military commanders and officials was slated to participate in the Aspen Security Forum this week.  — Article  — Dig Deeper  —  The Pentagon has pulled roughly a dozen high-ranking U.S … ",
    "url": "https://justthenews.com/government/security/pentagon-pulls-all-military-speakers-globalist-aspen-security-forum"
  },
  {
    "text": "Exclusive: NIH to dismiss dozens of grant reviewers to align with Trump priorities … - Max Kozlov  —  Search author on:  —  PubMed Google Scholar  —  In an unprecedented move, the US National Institutes of Health (NIH) will soon disinvite dozens of scientists who were about to take positions … ",
    "url": "https://www.nature.com/articles/d41586-025-02221-6"
  }
]