[
  {
    "text": "WATCH: Stephen Miller says Trump administration is ‘actively looking at’ suspending habeas corpus  —  Stephen Miller, a top White House adviser, said the administration is looking for ways to expand its legal power to deport migrants who are in the country illegally.  —  Watch Miller's remarks in the video player above.",
    "url": "https://www.pbs.org/newshour/politics/watch-stephen-miller-says-trump-administration-is-actively-looking-at-suspending-habeas-corpus"
  },
  {
    "text": "White House ‘actively looking’ at suspending habeas corpus in immigration crackdown  —  White House deputy chief of staff Stephen Miller said Friday that President Trump and his team are “actively looking at” suspending habeas corpus as part of the administration's immigration crackdown.",
    "url": "https://thehill.com/homenews/administration/5292820-white-house-miller-immigration-crackdown/"
  },
  {
    "text": "148. Suspending Habeas Corpus  —  Welcome back to “One First,” an (increasingly frequent) newsletter that aims to make the U.S. Supreme Court more accessible to all of us.  If you're not already a subscriber, I hope you'll consider becoming one (and, if you already are … ",
    "url": "https://www.stevevladeck.com/p/148-suspending-habeas-corpus"
  },
  {
    "text": "White House considering suspending habeas corpus, Stephen Miller says  —  Stephen Miller, President Trump's top policy adviser, said Friday the White House is exploring the option of suspending habeas corpus, the constitutional provision that protects from unlawful detainment.",
    "url": "https://www.axios.com/2025/05/09/habeas-corpus-white-house"
  },
  {
    "text": "Trump Officials Consider Suspending Habeas Corpus for Detained Migrants  —  Stephen Miller, a top aide, repeated a justification used in the immigration crackdown: that the country is fighting an invasion.  But it is unclear the president has the power to take such a step.",
    "url": "https://www.nytimes.com/2025/05/09/us/trump-habeas-corpus.html"
  },
  {
    "text": "Newark's Mayor Arrested at Protest Outside ICE Detention Center  —  Ras J. Baraka and city officials have said that the lockup is operating without a valid certificate of occupancy.  Three members of Congress from New Jersey were with Mr. Baraka when he was arrested.",
    "url": "https://www.nytimes.com/2025/05/09/nyregion/newark-ice-protest-arrest-ras-baraka.html"
  },
  {
    "text": "Newark Mayor Ras Baraka arrested for alleged trespass at New Jersey ICE detention facility … Newark Mayor Ras Baraka was arrested Friday for allegedly trespassing inside a U.S. Immigration and Customs Enforcement detention center in his city, New Jersey's interim top prosecutor said.",
    "url": "https://www.cnbc.com/2025/05/09/newark-mayor-arrested-baraka-ice.html"
  },
  {
    "text": "Newark's Mayor Was Arrested at an Immigration Protest  —  A Democratic member of Congress said she was “assaulted by multiple ICE officers” at the facility protest.  — Copy  —  A protest at a new immigration detention facility in New Jersey descended into an uproar on Friday … ",
    "url": "https://www.notus.org/immigration/ras-baraka-arrest-newark-congress-protest"
  },
  {
    "text": "Judge Orders Release of Tufts Student Detained by ICE  —  The student, Rumeysa Ozturk, was being detained in Louisiana.  A federal judge said her detention threatened to chill the speech of millions of noncitizens.  —  A federal judge in Vermont ordered the Trump administration on Friday … ",
    "url": "https://www.nytimes.com/2025/05/09/us/judge-orders-government-release-tufts-student.html"
  },
  {
    "text": "Tufts student detained by ICE in viral video is released, thanks supporters  —  Rumeysa Ozturk has been in Louisiana for over six weeks following an op-ed she co-wrote last year that criticized the school's response to Israel's war in Gaza  —  Tufts University student Rumeysa Ozturk … ",
    "url": "https://www.nbcboston.com/news/local/bail-hearing-tufts-student-rumeysa-ozturk-detained-in-louisiana/3708999/?at"
  },
  {
    "text": "New FEMA head tells staff: “Don't get in my way... I will run right over you”  —  During his first all-hands meeting with agency personnel, acting Federal Emergency Management Agency Administrator David Richardson issued a striking warning: “Don't get in my way,” the former United States … ",
    "url": "https://www.cbsnews.com/news/fema-acting-administrator-david-richardson-staff-meeting/"
  },
  {
    "text": "U.S. spy agencies told to gather intelligence on Greenland  —  Denmark's foreign minister, Lars Løkke Rasmussen, said the report “worries me greatly because we do not spy on friends.”  —  U.S. officials have ordered spy agencies to ramp up efforts to gather intelligence on Greenland … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/us-spy-agencies-told-gather-intelligence-greenland-rcna205982"
  },
  {
    "text": "Rep. Marjorie Taylor Greene says she won't run for U.S. Senate  —  Republicans, who are wary of Greene, have been looking for an alternative candidate after Georgia Gov. Brian Kemp said he wouldn't enter the Senate race.  —  Rep. Marjorie Taylor Greene, R-Ga., said definitively on Friday … ",
    "url": "https://www.nbcnews.com/politics/congress/rep-marjorie-taylor-greene-says-wont-run-us-senate-rcna205987"
  },
  {
    "text": "Trump fires 3 Democrats on Consumer Product Safety Commission  —  President Trump fired the three Democrats on the Consumer Product Safety Commission (CPSC), a White House official told The Hill, aligning with his view that the president has authority over independent agencies.",
    "url": "https://thehill.com/homenews/administration/5292326-trump-fires-dems-cpsc-reports/"
  },
  {
    "text": "DOGE's Zombie Contracts: They Were Killed but Have Come Back to Life  —  The Times found that federal agencies have revived dozens of contracts that Elon Musk's group still publicly listed as canceled, inflating what it has saved.  —  At least 44 of the government contracts canceled … ",
    "url": "https://www.nytimes.com/2025/05/09/us/politics/doge-musk-contracts-agencies.html"
  },
  {
    "text": "Trump has sat for only 12 ‘daily’ intelligence briefings since taking office  —  The scarcity of the President's Daily Briefings comes as he pursues high-stakes diplomacy with America's friends and foes.  —  Since President Donald Trump was sworn into office in January … ",
    "url": "https://www.politico.com/news/2025/05/09/trump-intelligence-briefing-frequency-00338946"
  },
  {
    "text": "Lawmakers did not seek Hayden's firing as Librarian of Congress  —  President Donald Trump did not act at the behest of lawmakers overseeing the Library of Congress when he fired its chief, Carla Hayden, three people close to those overseers said.  Members on key congressional committees … ",
    "url": "https://www.politico.com/live-updates/2025/05/09/congress/trump-carla-hayden-firing-congress-00340034"
  },
  {
    "text": "Kash Patel Is Seriously Infuriating FBI Officials  —  NOT A FAN OF BRIEFINGS  —  The FBI director has canceled key intelligence briefings and upset rank-and-file by carrying a field agent badge he never earned.  —  FBI Director Kash Patel has alarmed some members of the bureau by taking … ",
    "url": "https://www.thedailybeast.com/kash-patel-is-seriously-infuriating-fbi-officials/"
  },
  {
    "text": "Judge Temporarily Blocks Trump Plans for Mass Layoffs and Program Closures  —  An emergency ruling by a federal judge in California amounted to the broadest effort yet to halt the Trump administration's overhaul of the federal government.  —  A federal judge on Friday called for a two-week pause … ",
    "url": "https://www.nytimes.com/2025/05/09/us/politics/federal-layoffs-trump-ruling.html"
  },
  {
    "text": "Trump to Tap McKernan for Domestic Finance Role at Treasury  —  President Donald Trump intends to nominate attorney Jonathan McKernan as the Treasury Department's head of domestic finance, a surprise move given he was previously tapped to run the Consumer Financial Protection Bureau.",
    "url": "https://www.bloomberg.com/news/articles/2025-05-09/trump-to-nominate-mckernan-for-domestic-finance-role-at-treasury"
  },
  {
    "text": "A New Kind of Battle for Two Old Enemies  —  Pakistan accused India of launching air-to-surface missiles that targeted at least three bases.  Soon after, Pakistani officials said retaliatory action against Indian bases had begun.  —  The military conflict between India and Pakistan hit … ",
    "url": "https://www.nytimes.com/2025/05/09/world/asia/india-pakistan-kashmir-drones.html"
  },
  {
    "text": "Texas Senate passes bill requiring solar plants to provide power at night  —  The Texas Senate passed a bill Thursday that leading business interests fear would lead to an age of expensive power and rolling blackouts.  —  If passed by the House, state S.B. 715 would require all renewable projects … ",
    "url": "https://thehill.com/policy/equilibrium-sustainability/5292792-texas-senate-bill-power-cost/"
  },
  {
    "text": "Most Americans disapprove of Trump's treatment of colleges, a new AP-NORC poll finds  —  A majority of U.S. adults disapprove of President Donald Trump's handling of issues related to colleges and universities, according to a new poll, as his administration ramps up threats … ",
    "url": "https://apnews.com/article/poll-college-trump-harvard-higher-education-109dae2e19d5fe570a7c02e105bab6e6"
  },
  {
    "text": "White House to take choice of Pentagon chief of staff out of Hegseth's hands  —  Exclusive: The intervention to marginalize Ricky Buria is aimed at insulating the Pentagon from any more missteps  —  Exasperated by the turmoil that has dogged Pete Hegseth's office in recent weeks … ",
    "url": "https://www.theguardian.com/us-news/2025/may/09/white-house-pentagon-hegseth-chief-of-staff"
  },
  {
    "text": "An isolated John Fetterman clashes with colleagues and staff as he skips his Senate duties  —  Fetterman, who is facing scrutiny after former staffers have raised concerns about his mental health, has missed nearly every committee hearing and regularly skips votes.",
    "url": "https://www.nbcnews.com/politics/congress/john-fetterman-clashes-colleagues-staff-skips-senate-duties-rcna205596"
  },
  {
    "text": "Trove of documents unsealed in NYC mayor's criminal case offers a glimpse of thwarted investigation  —  Federal agents investigating New York City Mayor Eric Adams were still seizing phones and applying for search warrants days before Justice Department leaders ordered prosecutors to drop the corruption case … ",
    "url": "https://apnews.com/article/nyc-mayor-eric-adams-trump-6a76e9abeeb3ef6328e3195806aba663"
  },
  {
    "text": "USDA, DOGE demand states hand over personal data about food stamp recipients  —  The Department of Agriculture is demanding states hand over personal data of food assistance recipients — including Social Security numbers, addresses and, in at least one state, citizenship status … ",
    "url": "https://www.npr.org/2025/05/09/nx-s1-5389952/usda-snap-doge-data-immigration"
  }
]