[
  {
    "text": "Homeland Security Dept. accuses lawmakers of ‘storming’ an ICE facility despite oversight laws saying they could be there  —  The battle over immigration came to a dramatic head Friday afternoon when Democratic lawmakers faced off with Homeland Security Department officers as they tried to visit a Newark … ",
    "url": "https://cnn.com/2025/05/10/politics/dhs-lawmakers-ice-newark-mayor-arrest"
  },
  {
    "text": "Trump admin eyes arrests for House Dems over ICE incident  —  Democratic members of Congress who were part of a scuffle with law enforcement officers at an ICE facility in New Jersey may face arrests, the Department of Homeland Security confirmed to Axios Saturday.",
    "url": "https://www.axios.com/2025/05/10/trump-ice-arrest-house-democrats-new-jersey"
  },
  {
    "text": "DHS spokesperson threatens arrests of House Democrats who were at N.J. ICE facility  —  Tricia McLaughlin accused members of Congress of assaulting and even body-slamming ICE officers.  A congresswoman who was present denied the allegation.  —  A spokesperson for the Department … ",
    "url": "https://www.nbcnews.com/politics/politics-news/dhs-spokesperson-threatens-arrests-house-democrats-nj-ice-facility-rcna206052"
  },
  {
    "text": "Trump fires director of U.S. Copyright Office, sources say  —  The Trump administration has fired the head of the U.S. Copyright Office, two sources familiar with the situation confirmed to CBS News Saturday.  —  The firing of Register of Copyrights Shira Perlmutter came after Perlmutter … ",
    "url": "https://www.cbsnews.com/news/trump-fires-director-of-u-s-copyright-office-shira-perlmutter-sources/"
  },
  {
    "text": "Morelle's Statement on Abrupt Firing of Shira Perlmutter, Register of Copyrights  —  WASHINGTON - Rep. Joe Morelle (NY-25), the top Democrat on the Committee on House Administration, issued this statement after Register of Copyrights and Director of the U.S. Copyright Office, Shira Perlmutter … ",
    "url": "https://democrats-cha.house.gov/media/press-releases/morelles-statement-abrupt-firing-shira-perlmutter-register-copyrights"
  },
  {
    "text": "Trump fires top US copyright official  —  Democrats are alleging foul play.  —  President Donald Trump continued a firing spree at the Library of Congress on Saturday when he dismissed the top copyright official in the nation — a position traditionally overseen by the legislative branch.",
    "url": "https://www.politico.com/news/2025/05/10/trump-u-s-copyright-official-00340306"
  },
  {
    "text": "Secretary of Defense Pete Hegseth '03 ‘plagiarized’ small portions of his senior thesis, experts say.  But how serious is it?  —  “After Card's whisper, Bush looked distracted and somber but continued to listen to the second-graders, joking that they ‘read like sixth-graders,’” … ",
    "url": "https://www.dailyprincetonian.com/article/2025/05/princeton-news-pete-hegseth-senior-thesis-plagiarism-allegations"
  },
  {
    "text": "Pentagon Furthers Crackdown on Diversity Policies With Fresh Order for Review of Library Books  —  The move is the latest denunciation by the Trump administration against anything related to diversity, equity and inclusion.  —  The Pentagon continued its purge of anything related to diversity … ",
    "url": "https://www.nytimes.com/2025/05/09/us/politics/pentagon-hegseth-dei-library-books.html"
  },
  {
    "text": "Iran and the US begin a 4th round of negotiations over Tehran's nuclear program in Oman  —  Iran and the United States began a fourth round of negotiations Sunday over Tehran's rapidly advancing nuclear program, officials said, just ahead of a visit by President Donald Trump to the Middle East this week.",
    "url": "https://apnews.com/article/iran-us-nuclear-talks-oman-mideast-tensions-trump-1b47c24a5f97e20bfebbc34ad8047e90"
  },
  {
    "text": "Republicans' partial tax plan estimated to cost $5 trillion  —  House Republicans released a partial text for the GOP tax bill on Friday and are expected to release the full text on Monday.  —  An early version of the House GOP's tax plan would cost nearly $5 trillion … ",
    "url": "https://www.politico.com/news/2025/05/10/republicans-partial-tax-plan-estimated-to-cost-5-trillion-00340347"
  },
  {
    "text": "Putin Proposes Direct Russia-Ukraine Talks in Istanbul on May 15  —  Russian President Vladimir Putin on Sunday proposed holding direct talks with Ukraine in Istanbul on May 15, hours after Kyiv and European leaders called for an unconditional 30-day ceasefire to start Monday.",
    "url": "https://www.themoscowtimes.com/2025/05/11/putin-proposes-direct-russia-ukraine-talks-in-istanbul-on-may-15-a89040"
  },
  {
    "text": "Quebec riding of Terrebonne flips to Liberals after recount shows candidate won by single vote  —  Liberals now have 170 seats in House of Commons, two shy of a majority government  —  After a judicial recount, the Quebec riding of Terrebonne has flipped to the Liberals, who have beaten the Bloc Québécois by one vote.",
    "url": "https://www.cbc.ca/news/politics/terrebone-recount-liberal-1.7532136"
  },
  {
    "text": "ICE raids have ‘overwhelmed’ coastal California communities ‘We continue to allow double punishment for noncitizens’  —  After a lull in U.S. Immigration and Customs Enforcement activity on California's Central Coast, a rash of raids has reportedly swept through San Luis Obispo, Santa Barbara and Ventura counties over the past week.",
    "url": "https://www.sfgate.com/centralcoast/article/ice-raids-overwhelm-california-communities-20319412.php"
  },
  {
    "text": "Is Trump Out-of-Touch, Senile, Nuts or Something Worse?  —  CRAZY TALK  —  It takes a degree of insanity to think sharing a picture of yourself as Pope or as Luke Skywalker is somehow helping raise your plummeting poll numbers.  —  OPINION  —  It was the cringiest of times.  It was the craziest of times.",
    "url": "https://www.thedailybeast.com/is-trump-out-of-touch-senile-nuts-or-something-worse/"
  },
  {
    "text": "Trump envoy relied on Kremlin interpreter in meetings with Putin to end war in Ukraine  —  Using the Kremlin's interpreter was “a very bad idea” that put Witkoff “at a real disadvantage,” Michael McFaul, a former U.S. ambassador to Russia, told NBC News.  —  MOSCOW — President Donald Trump's … ",
    "url": "https://www.nbcnews.com/world/russia/russia-ukraine-war-trump-envoy-witkoff-interpreter-kremlin-rcna205878"
  },
  {
    "text": "The many big things Trump 'didn't know' about  —  Repeatedly in his second term, Trump has pleaded ignorance about major events and suggested he's not involved in major decisions.  —  One of the major themes of President Donald Trump's 2024 campaign was the idea that Joe Biden had no idea what was happening around him.",
    "url": "https://www.washingtonpost.com/politics/2025/05/10/trump-second-term-unaware/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2ODQ5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4MjMxOTk5LCJpYXQiOjE3NDY4NDk2MDAsImp0aSI6IjYyNjY4MmMzLTlmZjEtNDgzNC04NDlmLWJkM2Q0MWU4Mzc2MyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA1LzEwL3RydW1wLXNlY29uZC10ZXJtLXVuYXdhcmUvIn0.PSrB5nMhPc0uErumWQD0t1McOV_u_FLR4ig-EdJo29o&itid=gfta"
  },
  {
    "text": "Ye song glorifying Hitler gets millions of views on X while other platforms struggle to remove it  —  Spotify, SoundCloud and other platforms have pulled the song, but its spread underscores the challenges tech platforms face in removing content that violate their policies.",
    "url": "https://www.nbcnews.com/tech/tech-news/ye-song-glorifying-hitler-gets-millions-views-x-platforms-struggle-rem-rcna205905"
  },
  {
    "text": "Democratic senator says GOP is trying to woo Fetterman  —  Ruben Gallego said Democrats should keep Fetterman in their tent.  —  BUCKS COUNTY, Pennsylvania — Arizona Democratic Sen. Ruben Gallego said Republicans are trying to pull John Fetterman to the right and argued Democrats should keep … ",
    "url": "https://www.politico.com/news/2025/05/10/republicans-john-fetterman-gallego-00340274"
  },
  {
    "text": "Stakes Rise as U.S. and China Prep for Second Day of Trade Talks  —  The first day of hourslong discussions concluded without an announced deal  —  GENEVA—Marathon conversations here between U.S. and China officials came to an end Saturday, with more talks scheduled for Sunday … ",
    "url": "https://www.wsj.com/politics/policy/us-china-tariffs-trade-talks-switzerland-a3171637"
  },
  {
    "text": "Trump administration halts research to help babies with heart defects  —  James Antaki has worked for over 30 years on a device to help infants with holes in their hearts and other defects.  Now it's all at risk.  —  For James Antaki, a biomedical engineering professor at Cornell University … ",
    "url": "https://www.nbcnews.com/news/us-news/pediaflow-research-babies-heart-defects-trump-administration-rcna197155"
  },
  {
    "text": "The First Thing George Santos Should Do in Prison  —  What the disgraced former lawmaker should know as he heads to prison, according to another ex-con ex-congressman.  —  Former U.S. Rep. George Santos arrives at federal court for sentencing, in Central Islip, N.Y., April 25, 2025.",
    "url": "https://www.politico.com/news/magazine/2025/05/10/george-santos-prison-advice-00339788"
  },
  {
    "text": "Trump signs EO offering illegal migrants ‘exit bonus’ in first-ever self-deportation program  —  Homeland Security said earlier this week that migrants would be offered a $1,000 stipend each to leave the US  —  President Donald Trump on Friday signed an executive order establishing … ",
    "url": "https://www.foxnews.com/politics/trump-signs-eo-offering-illegal-migrants-exit-bonus-first-ever-self-deportation-program"
  }
]