[
  {
    "text": "So, Can We Trust the Polls?  —  Recent changes add up to a case for cautious optimism on better accuracy, but that's far from a guarantee.  —  The polls underestimated Donald J. Trump in 2016.  —  They underestimated him again in 2020.  —  So can we trust the polls this time?",
    "url": "https://www.nytimes.com/2024/11/01/upshot/so-can-we-trust-the-polls.html"
  },
  {
    "text": "Why the Polls Might Be Wrong — in Kamala Harris' Favor  —  It's taken pollsters eight years to pin down Trump's voters.  Is 100 days really enough to accurately capture potential Harris voters?  —  For eight years, pollsters have been striving to accurately capture former President Donald Trump's level of support among voters.",
    "url": "https://www.politico.com/news/magazine/2024/11/01/shy-kamala-harris-voters-polling-00186653"
  },
  {
    "text": "Election guru Nate Silver accuses pollsters of putting ‘finger on the scale,’ lying to keep presidential race close  —  Polling guru Nate Silver lashed out at other survey junkies in his field for “cheating” in the final stretch of the 2024 presidential election — accusing them of recycling … ",
    "url": "https://nypost.com/2024/11/01/us-news/election-guru-nate-silver-accuses-pollsters-of-putting-finger-on-the-scale-lying-to-keep-presidential-race-close/"
  },
  {
    "text": "When You Thought He Couldn't Sink Lower  —  Donald Trump's two strongest personality traits each had a moment on the campaign trail yesterday.  —  At a rally in Albuquerque, New Mexico, the buffoon: “I'm here for one very simple reason.  I like you very much, and it's good for my credentials with the Hispanic and Latino community.”",
    "url": "https://www.thebulwark.com/p/when-you-thought-he-couldnt-sink"
  },
  {
    "text": "Trump Assails Liz Cheney and Imagines Guns ‘Shooting at Her’  —  Former President Donald J. Trump used violent imagery as he slammed one of his leading Republican critics while criticizing U.S. involvement in foreign conflicts.  —  Former President Donald J. Trump assailed Liz Cheney … ",
    "url": "https://www.nytimes.com/2024/11/01/us/politics/trump-liz-cheney-tucker-carlson.html"
  },
  {
    "text": "Arizona's top prosecutor investigating Trump's comments about Cheney as possible death threat  —  During his Glendale appearance, Trump suggested his Republican critic should face ‘nine barrels shooting at her.’  —  PHOENIX — Arizona's top prosecutor tells 12News she is investigating whether … ",
    "url": "https://www.12news.com/article/news/politics/elections/arizona-top-prosecutor-kris-investigating-trumps-comments-about-cheney-possible-death-threat/75-91f8b734-06eb-4aeb-a633-89be0df7c4c4"
  },
  {
    "text": "AP sources: White House altered record of Biden's ‘garbage’ remarks despite stenographer concerns  —  White House press officials altered the official transcript of a call in which President Joe Biden appeared to take a swipe at supporters of Donald Trump, drawing objections from the federal workers … ",
    "url": "https://apnews.com/article/biden-garbage-transcript-puerto-rico-trump-326e2f516a94a470a423011a946b6252"
  },
  {
    "text": "Hugh Hewitt quits Washington Post after storming off livestream talk over dispute with liberal columnists: 'I won't come back'  —  Conservative radio host Hugh Hewitt resigned from the Washington Post after he stormed off a livestreamed discussion on Friday amid a dispute … ",
    "url": "https://nypost.com/2024/11/01/media/hugh-hewitt-quits-washington-post-after-storming-off-broadcast/"
  },
  {
    "text": "Hugh Hewitt resigns from Washington Post after storming out of live interview  —  Hewitt abruptly left a live broadcast of the Post's show “First Look,” leaving the host and his fellow guest stunned.  —  Conservative radio host Hugh Hewitt resigned Friday from his columnist position at The Washington Post … ",
    "url": "https://www.politico.com/news/2024/11/01/hugh-hewitt-washington-post-00186778"
  },
  {
    "text": "Longtime Washington Post columnist Hugh Hewitt quits newspaper  —  Hewitt quit after walking off newspaper's ‘Washington Post Live’ show  —  Longtime Washington Post columnist Hugh Hewitt quit the newspaper on Friday, he told Fox News Digital.  —  Hewitt, a conservative who hosts … ",
    "url": "https://www.foxnews.com/media/longtime-washington-post-columnist-hugh-hewitt-quits-newspaper-after-seven-year-run"
  },
  {
    "text": "A Pregnant Teenager Died After Trying to Get Care in Three Visits to Texas Emergency Rooms  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Candace Fails screamed for someone in the Texas hospital to help her pregnant daughter.",
    "url": "https://www.propublica.org/article/nevaeh-crain-death-texas-abortion-ban-emtala"
  },
  {
    "text": "Trump targets Washington Post, CBS with long-shot legal actions over Harris coverage, ads … Days before the presidential election, Donald Trump and his campaign have launched legal actions against two major media outlets, claiming that they are illegally helping Kamala Harris through their news coverage and advertising.",
    "url": "https://www.cnbc.com/2024/11/01/trump-media-legal-action-fec-harris-election.html"
  },
  {
    "text": "How Risky Is a Trump Second Term?  —  He'd slow the left's coercive march, but his policies are likely to be a jump ball. … Unlimited access across all platforms and devices.",
    "url": "https://www.wsj.com/opinion/donald-trump-candidacy-2024-election-kamala-harris-f8f99a69"
  },
  {
    "text": "Elon Musk's Machine for Fascism: A One-Stop Shop for Disinformation and Violence  —  Just over a year ago, I described how Twitter had been used as a way to sow false claims in support of Trump in 2016 and 2020.  —  I described how, in 2016, trolls professionalized their efforts … ",
    "url": "https://www.emptywheel.net/2024/11/01/elon-musks-machine-for-fascism-a-one-stop-shop-for-disinformation-and-violence/"
  },
  {
    "text": "Some Maga men seem to think women don't have rights - starting with their wives  —  The 2024 election is in part about whether women can be free and equal citizens of this republic.  Right now too many cannot  —  This week, the fundamentalist Christian pastor Dale Partridge argued in a series … ",
    "url": "https://www.theguardian.com/commentisfree/2024/nov/01/maga-trump-men-supporters-womens-rights"
  },
  {
    "text": "Texas hospitals must now ask patients whether they're in the US legally.  Here's how it works  —  Texas hospitals must ask patients starting Friday whether they are in the U.S. legally and track the cost of treating people without legal status following an order by Republican Gov. Greg Abbott … ",
    "url": "https://apnews.com/article/texas-immigration-hospital-health-care-abbott-florida-aeee92d7515a18b492c737b3657569ab"
  },
  {
    "text": "European Greens ask Jill Stein to stand down and endorse Kamala Harris  —  US Green party leader urged to withdraw from presidential race to prevent Donald Trump victory  —  A coalition of European Greens have urged the US Green party's nominee, Jill Stein, to pull out of next week's election … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/01/european-greens-ask-jill-stein-to-stand-down-and-endorse-kamala-harris"
  },
  {
    "text": "Trump is almost 2 billion in debt and the amount is growing  —  Former President Donald Trump's debt obligations currently amount to around $1.8 billion, and that amount is growing every month.  CNN's Erica Hill speaks with Forbes senior editor Dan Alexander about Trump's financial situation.",
    "url": "https://www.cnn.com/2024/10/31/politics/video/trump-debt-growing-dan-alexander-ebof-digvid"
  },
  {
    "text": "‘All hell has broken loose’: Inside Elon Musk's high-stakes pro-Trump door-knocking effort  —  More than a half-dozen operatives and canvassers connected to America PAC described an inordinate number of suspect entries and having to canvass during Hurricane Helene.",
    "url": "https://www.nbcnews.com/politics/2024-election/elon-musks-high-stakes-trump-door-knocking-effort-america-pac-rcna176255?taid=6724d0249f2d880001f6fdb4"
  },
  {
    "text": "Justice Department to Monitor Polls in 27 States for Compliance with Federal Voting Rights Laws  —  For Immediate Release  —  Civil Rights Division Staff Available to Receive Nationwide Reports Throughout Election Day  —  The Justice Department announced today that it plans to monitor compliance … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-monitor-polls-27-states-compliance-federal-voting-rights-laws"
  },
  {
    "text": "Donald Trump Is Done With Checks and Balances  —  What does it mean to say that “democracy is on the ballot” on Election Day?  —  In her speech on Tuesday in Washington, D.C., delivered from the same place near the White House where Donald Trump incited a crowd to attack the Capitol on Jan. 6 … ",
    "url": "https://www.nytimes.com/2024/11/01/opinion/donald-trump-kamala-harris-election-power.html?unlocked_article_code=1.Wk4.S1lK.O7tbymT0gllX&smid=url-share"
  },
  {
    "text": "Trump and Vance make anti-transgender attacks central to their campaign's closing argument  —  Donald Trump has made his opposition to transgender rights central to his closing argument before Election Day, using demeaning language and misrepresentations to paint an exceedingly narrow slice … ",
    "url": "https://apnews.com/article/trump-harris-transgender-politics-61cff97a64fac581ffc5f762be4c57d3"
  },
  {
    "text": "“Voter Report Card” mailings described as “creepy” and “insulting,” defended as effective tool  —  Julia Ramsey is used to a deluge of election-related mail.  Campaign mailings have clogged her Pennsylvania mailbox day after day for months, but one she received this week stood out from the rest.",
    "url": "https://www.cbsnews.com/news/voter-report-card-mailings-described-as-creepy-and-insulting-defended-as-effective-tool/"
  },
  {
    "text": "Shifting $677m from the banks to the people, every year, forever (permalink)  —  “Switching costs” are one of the great underappreciated evils in our world: the more it costs you to change from one product or service to another, the worse the vendor, provider, or service you're using today can treat you without risking your business.",
    "url": "https://pluralistic.net/2024/11/01/bankshot/#personal-financial-data-rights"
  }
]