[
  {
    "text": "Nevada GOP ‘fake electors’ indicted for falsely claiming Trump won state's 2020 election  —  A Nevada grand jury has indicted the six Republicans — including the chair of the Nevada Republican Party — who falsely pledged Nevada's electoral votes to Donald Trump following … ",
    "url": "https://thenevadaindependent.com/article/nevada-gop-fake-electors-indicted-for-falsely-claiming-trump-won-states-2020-election"
  },
  {
    "text": "Republicans Block Aid to Ukraine, Jeopardizing Its Fight Against Russia  —  The vote spotlighted waning support in Congress for backing Ukraine in the war, and left the fate of the effort uncertain.  —  Republicans on Wednesday blocked an emergency spending bill to fund the war in Ukraine … ",
    "url": "https://www.nytimes.com/2023/12/06/us/politics/senate-ukraine-aid-bill.html"
  },
  {
    "text": "Senate Republicans block procedural vote for Ukraine aid package  —  Senate Republicans on Wednesday blocked a procedural vote to advance a national security bill that includes billions of dollars in Ukraine aid because it includes no changes to border security policy.",
    "url": "https://www.washingtonpost.com/politics/2023/12/06/ukraine-israel-aid-biden-senate/"
  },
  {
    "text": "Trump says he wouldn't be a dictator ‘except for Day One’  —  When asked during a Fox News town hall if he would seek retribution upon returning to office, the former president largely sidestepped the question  —  Former president Donald Trump said Tuesday that he would not be a dictator upon returning … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/06/trump-dictator-day-one-hannity/"
  },
  {
    "text": "My Next Chapter  —  I'm leaving the House but not the fight.  —  I'm an optimist.  How could I not be?  I'm the son of a firefighter.  For 17 years I've served in the same congressional seat—the same office in which I was once denied an internship.  Only in America.",
    "url": "https://www.wsj.com/articles/kevin-mccarthy-my-next-chapter-house-gop-retirement-california-e4e593d7?mod=followamazon"
  },
  {
    "text": "Chris Christie Savages Vivek Ramaswamy as ‘Obnoxious Blowhard’  —  “So, do everybody a favor, just walk yourself off that stage, enjoy a nice meal, and get the hell out of this place!”  Ramaswamy told his 2024 rival during Wednesday night's debate.  —  GOP presidential hopeful Chris Christie finally … ",
    "url": "https://www.thedailybeast.com/chris-christie-savages-vivek-ramaswamy-as-most-obnoxious-blowhard-in-america"
  },
  {
    "text": "Christie slams Ramaswamy as ‘most obnoxious blowhard in America’  —  It took about 15 minutes before former New Jersey governor Chris Christie was able to get a word in during the fourth Republican presidential primary debate Wednesday — but once he did, he held nothing back.",
    "url": "https://www.washingtonpost.com/politics/2023/12/06/chris-christie-vivek-ramaswamy-republican-debate/"
  },
  {
    "text": "At the GOP debate, Ron DeSantis calls Middle Eastern garb ‘man dresses’  —  The Florida governor has come under fire in the past for his comments about Muslims.  —  During the fourth Republican presidential debate on Wednesday, Florida Gov. Ron DeSantis, citing his time serving in the Middle East … ",
    "url": "https://www.nbcnews.com/politics/2024-election/on-desantis-man-dress-gop-debate-middle-eastern-garb-rcna128462"
  },
  {
    "text": "Person of the Year  —  Taylor Swift  —  Taylor Swift is telling me a story, and when Taylor Swift tells you a story, you listen, because you know it's going to be good—not only because she's had an extraordinary life, but because she's an extraordinary storyteller.",
    "url": "https://time.com/6342806/person-of-the-year-2023-taylor-swift/"
  },
  {
    "text": "Do Trump's rivals know what time it is?  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  LIFE COMES AT YOU FAST — “Candidate for Santos' old seat is convicted on Jan. 6 charges after testifying he had ‘no idea’ Congress met in the Capitol,” by NBC's Megan Lebowitz",
    "url": "https://www.politico.com/newsletters/playbook/2023/12/07/do-trumps-rivals-know-what-time-it-is-00130566"
  },
  {
    "text": "Harvard's president answers backlash over response to calls for ‘genocide of Jews’  —  Threats to the Jewish community “have no place at Harvard,” Claudine Gay said.  —  Harvard University President Claudine Gay watches a video being played during a House Education and The Workforce Committee hearing titled … ",
    "url": "https://abcnews.go.com/Politics/harvards-president-answers-backlash-response-calls-genocide-jews/story?id=105433835"
  },
  {
    "text": "GOP Wife in Sex Scandal Erased From Conservative Site  —  Bridget Ziegler had a top position at the Leadership Institute.  She's reportedly out after her husband was accused of raping their threesome partner.  —  Moms for Liberty co-founder Bridget Ziegler appears to have departed her role … ",
    "url": "https://www.thedailybeast.com/bridget-ziegler-wife-of-florida-gop-boss-christian-ziegler-erased-from-leadership-instit"
  },
  {
    "text": "A Biden donor calls it quits  —  Welcome to POLITICO's West Wing Playbook, your guide to the people and power centers in the Biden administration.  With help from producer Raymond Rapada.  —  Democratic donor and humanitarian AMED KHAN is done with President JOE BIDEN.",
    "url": "https://www.politico.com/newsletters/west-wing-playbook/2023/12/06/a-biden-donor-calls-it-quits-00130478"
  },
  {
    "text": "A Black Texas student has been suspended once again for his natural hairstyle  —  A Black high school student in Texas who was suspended for more than a month for wearing a natural hairstyle returned to regular classes this week after spending more than a month at an alternative school.",
    "url": "https://www.npr.org/2023/12/06/1217580867/black-texas-student-returns-to-class-suspended-again-natural-hair"
  },
  {
    "text": "EXCLUSIVE: Fulton prosecutors list top Trump aides, Ga. officials as witnesses  —  Ex-Justice Department leaders, VP Pence and Gov. Brian Kemp could be called  —  Fulton County prosecutors could call several senior officials who served in the Trump administration and Georgia's top elected leaders … ",
    "url": "https://www.ajc.com/politics/exclusive-fulton-prosecutors-list-top-trump-aides-ga-officials-as-witnesses/FC4RPKGUIVCVRDGS3VP37L6UXY/"
  },
  {
    "text": "‘Squad’ member Ayanna Pressley calls for allowing ‘incarcerated citizens’ and 16-year-olds to vote  —  Ayanna Pressley introduced the Inclusive Democracy Act on Wednesday  —  Democrat Massachusetts Rep. Ayanna Pressley, a far-left ‘Squad’ member, called for allowing “incarcerated citizens” … ",
    "url": "https://www.foxnews.com/politics/squad-member-ayanna-pressley-calls-allowing-incarcerated-citizens-and-16-year-olds-to-vote"
  },
  {
    "text": "New York Man Found Guilty of Felony Obstruction and Other Charges for Actions During Jan. 6 Capitol Breach  —  For Immediate Release  —  U.S. Attorney's Office, District of Columbia  —  WASHINGTON - A New York man was found guilty in the District of Columbia on Tuesday, Dec. 5, 2023 … ",
    "url": "https://www.justice.gov/usao-dc/pr/new-york-man-found-guilty-felony-obstruction-and-other-charges-actions-during-jan-6"
  },
  {
    "text": "Mike Johnson Compares Himself to Moses at Christian Nationalist Gala  —  The House Speaker alleges God directed his path to power through the “roiling sea”  —  IN A KEYNOTE speech to a gathering of Christian nationalist lawmakers Tuesday night, House Speaker Mike Johnson compared himself to Moses … ",
    "url": "https://www.rollingstone.com/politics/politics-news/mike-johnson-moses-christian-nationalist-gala-1234918565/"
  },
  {
    "text": "Asst. Law Prof Politely Suggests Hamas Rape Victims Check Their Victimization  —  She seems nice.  In fact, she's almost too cute by half.  —  Now, before we get too deep in the argle-bargle weeds of elite academia here, maybe you're asking yourself (much as I did), “Vurt da furk is ‘sex exceptionalism’?”",
    "url": "https://hotair.com/tree-hugging-sister/2023/12/06/asst-law-prof-politely-suggests-hamas-rape-victims-check-their-victimization-n596957"
  },
  {
    "text": "Advanced Placement Program Releases Revised African American Studies Framework  —  Course to Officially Launch in 2024-25 School Year  —  Today, the Advanced Placement® Program delivers its revised framework for the AP® African American Studies course, which will officially launch in the 2024-25 school year.",
    "url": "https://newsroom.collegeboard.org/advanced-placement-program-releases-revised-african-american-studies-framework"
  }
]