[
  {
    "text": "House Republicans hit the brakes on town halls after blowback over Trump's cuts  —  A number of Republican lawmakers faced significant pushback in their home districts over Trump and Elon Musk's slashing of the federal government.  —  WASHINGTON — House Republicans are becoming weary … ",
    "url": "https://www.nbcnews.com/politics/congress/house-republicans-town-halls-blowback-trump-cuts-rcna193766"
  },
  {
    "text": "House GOP, after pulling budget resolution, brings it back for a vote  —  House GOP leaders brought their budget resolution to the floor for the vote, just minutes after pulling it at the last minute Tuesday evening as they struggled to win over a handful of conservative fiscal hawks … ",
    "url": "https://thehill.com/homenews/house/5164168-house-gop-leaders-pull-budget-resolution/"
  },
  {
    "text": "Trump targets Washington law firm that aided Jack Smith  —  The president suspended security clearances of lawyers at Covington & Burling over their pro bono work for special counsel Jack Smith.  —  President Donald Trump retaliated Tuesday against a Washington law firm that provided free legal services … ",
    "url": "https://www.politico.com/news/2025/02/25/donald-trump-jack-smith-covington-lawyers-022770"
  },
  {
    "text": "Trump Takes Aim at Law Firm Aiding Jack Smith  —  The move, signed by President Trump on Thursday, is a major escalation of his promise to pursue perceived foes.  —  President Trump plans to punish a prominent Washington law firm that has aided the former special counsel Jack Smith … ",
    "url": "https://www.nytimes.com/2025/02/25/us/trump-jack-smith-law-firm-security.html?unlocked_article_code=1.zk4.ZC2a.V7FT4i33g4-2"
  },
  {
    "text": "Federal technology staffers resign rather than help Musk and DOGE  —  More than 20 civil service employees resigned Tuesday from billionaire Trump adviser Elon Musk's Department of Government Efficiency, saying they were refusing to use their technical expertise to “dismantle critical public services.”",
    "url": "https://apnews.com/article/doge-elon-musk-federal-government-resignations-usds-6b7e9b7022e6d89d69305e9510f2a43c"
  },
  {
    "text": "Who is Amy Gleason, the person named DOGE's acting administrator by the White House?  —  The acting administrator of the Department of Government Efficiency is a low-profile executive who has expertise in health care technology and worked in the first Trump administration.",
    "url": "https://apnews.com/article/doge-acting-administrator-amy-gleason-65af638e646fdd5dd6d5fcc5cc04a2e7"
  },
  {
    "text": "This is who the White House says is the DOGE acting administrator  —  A White House official says Amy Gleason is the acting administrator of the Department of Government Efficiency, after the White House struggled to answer who is technically at the top of the organizational chart.",
    "url": "https://www.cbsnews.com/news/this-is-who-the-white-house-says-is-in-charge-of-doge/"
  },
  {
    "text": "White House seizes control of press pool, will decide which outlets cover events with president  —  The move reverses the long established precedent of journalists determining who participates in the press pool.  —  The White House announced on Tuesday that the administration … ",
    "url": "https://www.politico.com/news/2025/02/25/trump-white-house-press-pool-access-00206001"
  },
  {
    "text": "White House to take over press pool amid ‘Gulf of America’ fight with AP  —  The White House said Tuesday that it would take over which outlets are allowed into the press pool covering the president, wrestling such control from the White House Correspondents' Association.",
    "url": "https://thehill.com/homenews/media/5163291-white-house-press-pool-ap/"
  },
  {
    "text": "Trump to Offer ‘Gold Card’ Visas for $5 Million to the Rich  — Initiative would replace the existing EB-5 visa program  — Trump, Lutnick tout move as draw for wealthy investors  —  President Donald Trump said he is starting a program to offer residency and a path to citizenship … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-25/trump-to-launch-gold-card-visa-program-for-wealthy-investors"
  },
  {
    "text": "DOGE Quietly Deletes the 5 Biggest Spending Cuts It Celebrated Last Week  —  The cuts, highlighted on an earlier version of the “wall of receipts” posted by Elon Musk's team, contained mistakes that vastly inflated the amount of money saved.  —  Last week, Elon Musk's government cost-slashing initiative … ",
    "url": "https://www.nytimes.com/2025/02/25/upshot/doge-spending-cuts-changed.html?unlocked_article_code=1.zk4.b82f.Kh1AnGbHOfOG&smid=url-share"
  },
  {
    "text": "Ukraine agrees minerals deal with US  —  Kyiv hopes agreement on jointly exploring resources will improve relations with Trump administration  —  Kyiv has agreed terms with Washington on a minerals deal that Ukrainian officials hope will improve relations with the Trump administration … ",
    "url": "https://www.ft.com/content/1890d104-1395-4393-a71d-d299aed448e6?accessToken=zwAAAZU-aRdLkc8YkNEEE5VDk9OnHdKZrtRI5g.MEUCIH6zPwj2DIjUCuIiJRKw87FNWYqsd-Y24NSOfyUBhXCEAiEAq9xHBCnBuaCRJTwFmc3nHO8Fp7lRT6vGHZRnQWltusA&segmentId=e95a9ae7-622c-6235-5f87-51e412b47e97&shareId=fb705b02-cb2e-4bdd-b6e4-5e1b66c87949&shareType=enterprise"
  },
  {
    "text": "French Resistance Steps in After AP Banned From Trump-Macron Presser  —  MERCI  —  The Paris Press Corps today ensured that an AP reporter could enter and ask a question.",
    "url": "https://www.thedailybeast.com/paris-press-corps-intervene-when-reporter-is-barred-from-trump-macron-press-conference/"
  },
  {
    "text": "Board agrees to pause firings for some feds, potentially upending Trump's widespread terminations  —  Some federal employees fired by the Trump administration while in their probationary periods have at least temporarily won back their jobs, a federal board that hears appeals from civil servants has ruled.",
    "url": "https://www.govexec.com/workforce/2025/02/board-agrees-pause-firings-some-feds-potentially-upending-trumps-widespread-terminations/403283/"
  },
  {
    "text": "Rachel Maddow staff to be let go as part of MSNBC overhaul  —  News comes as leading network star criticizes management for decision to cancel shows hosted by non-white anchors  —  MSNBC has told the majority of the employees who produce Rachel Maddow and Joy Reid's primetime evening news shows … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/25/msnbc-layoffs-rachel-maddow"
  },
  {
    "text": "Trump Proposes Fines, Prison Time for Migrants Who Don't Join Registry  —  Administration plans to establish registration website as soon as this week  —  WASHINGTON—The Trump administration plans to create a registry for immigrants in the U.S. illegally to submit their personal information … ",
    "url": "https://www.wsj.com/politics/policy/trump-immigration-migrant-registry-jail-time-95c405a7?st=REipHQ"
  },
  {
    "text": "DOGE to cancel government contracts that help veterans, records show  —  Records show the 875 contracts included support for medical and burial services, cancer programs and efforts to recruit doctors for critical vacancies  —  Veterans Affairs Secretary Douglas A. Collins took to social media … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/25/veterans-affairs-contracts-canceled/"
  },
  {
    "text": "DOJ Hires A State Judge Who Was Once Suspended To Advise The Deputy AG  —  Ex-Oregon Judge Vance Day was suspended by a state judicial ethics commission in 2018.  —  A new top Justice Department appointee brings a bizarre past to the job: he was a state judge in Oregon but was, in 2018 … ",
    "url": "https://talkingpointsmemo.com/news/doj-hires-a-state-judge-who-was-once-suspended-to-advise-the-deputy-ag"
  },
  {
    "text": "For Trump, 3 court losses in 90 minutes  —  Three different federal judges delivered legal setbacks and slap downs to President Donald Trump in the span of an hour and a half on Tuesday in a series of cases challenging controversial moves taken during the early days of his second term.",
    "url": "https://www.cnn.com/2025/02/25/politics/trump-court-losses-immigration-spending-freeze/"
  },
  {
    "text": "Two Planes, in Washington and Chicago, Abort Landings to Avoid Collisions  —  The near misses on Tuesday came after a string of aviation disasters, including the midair collision between an Army helicopter and a passenger jet last month that killed 67 people.",
    "url": "https://www.nytimes.com/2025/02/25/us/politics/planes-near-miss-crash-washington-chicago.html"
  },
  {
    "text": "DOGE Is Working on Software That Automates the Firing of Government Workers  —  Operatives working for Elon Musk's DOGE appear to be editing the code of AutoRIF—software designed by the Defense Department that could assist in mass firings of federal workers, sources tell WIRED.",
    "url": "https://www.wired.com/story/doge-autorif-mass-firing-government-workers/"
  },
  {
    "text": "As Texas measles outbreak grows, parents are choosing to vaccinate kids  —  At least 124 people, mostly babies, children and teens, have been infected.  Eighteen people have been hospitalized.  —  As the measles outbreak in Texas keeps spreading, parents who previously chose not to vaccinate … ",
    "url": "https://www.nbcnews.com/health/health-news/texas-measles-outbreak-grows-parents-vaccinate-rcna193637"
  },
  {
    "text": "Gabbard Says More Than 100 Intelligence Officers Fired for Chat Messages  —  The chats had been set up to discuss sensitive security matters.  But a group of employees used it for discussions that contained sexual themes, intelligence officials said this week.",
    "url": "https://www.nytimes.com/2025/02/25/us/politics/gabbard-nsa-firing-explicit-chat.html?unlocked_article_code=1.z04.YCV3.5UjxWf4-TV4r&smid=url-share"
  },
  {
    "text": "Judge gives Trump administration two days to release billions of dollars in blocked foreign aid  —  A federal judge on Tuesday gave the Trump administration less than two days to release billions of dollars in U.S. foreign aid, saying the administration had given no sign of complying … ",
    "url": "https://apnews.com/article/funding-freeze-usaid-trump-d592d015249934827e023c65e644c51a"
  },
  {
    "text": "Under Trump, America's New Friends: Russia, North Korea and Belarus  —  When it comes to the war in Ukraine, President Trump finds common cause with the world's outlier states and stands against traditional U.S. allies like Britain, France, Germany, Canada, Japan and Italy.",
    "url": "https://www.nytimes.com/2025/02/25/us/politics/trump-diplomacy.html"
  }
]