[
  {
    "text": "Trump doubles down on call for Liz Cheney to be prosecuted  —  Former President Trump on Sunday doubled down on his push for former Rep. Liz Cheney (R-Wyo.) to be prosecuted over allegations she and the other Jan. 6 committee members purposely withheld testimony and details from their investigation … ",
    "url": "https://thehill.com/homenews/campaign/4538333-trump-doubles-down-on-call-for-liz-cheney-to-be-prosecuted/"
  },
  {
    "text": "Pelosi: Democrats ‘have to win this election’ following Trump's ‘bloodbath’ remarks  —  Former Speaker Nancy Pelosi (D-Calif.) on Sunday underscored the stakes of the November election after former President Trump warned of a “bloodbath” for the auto industry and the country if he doesn't win a second term in the White House.",
    "url": "https://thehill.com/homenews/house/4538009-pelosi-democrats-have-to-win-this-election-following-trumps-bloodbath-remarks/"
  },
  {
    "text": "Trump says he'll decide whether to support a national abortion ban ‘pretty soon’  —  Former President Trump said Sunday that he will decide “pretty soon” whether to back a national abortion ban.  —  Trump's comments come after reports surfaced last month that he is considering embracing … ",
    "url": "https://thehill.com/homenews/campaign/4537973-trump-says-hell-decide-pretty-soon-on-whether-to-support-a-national-abortion-ban/"
  },
  {
    "text": "Protesters Take to Streets in Cuba as Lights Go Out Across Island  — Blackouts spark rare demonstrations in communist-run nation  — Government accuses US seizing on crisis to foment dissent  —  Protesters took to the streets of Cuba on Sunday in a rare outburst of social unrest … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-18/cuban-protesters-take-to-streets-as-lights-go-out-across-island"
  },
  {
    "text": "Allegations UNRWA collaborated with Hamas are ‘flat-out lies’: Van Hollen  —  Sen. Chris Van Hollen (D-Md.) ripped into Israel's allegations that the U.N.'s Palestinian refugee agency, commonly referred to as UNRWA, is a proxy for the Palestinian militant group Hamas, arguing the accusations … ",
    "url": "https://thehill.com/homenews/senate/4538265-allegations-unrwa-collaborated-with-hamas-are-flat-out-lies-van-hollen/"
  },
  {
    "text": "Biden to sign executive order to expand research on women's health  —  President Biden on Monday will sign an executive order aimed at expanding research and improving government initiatives on women's health, a move that will coincide with a White House Women's History Month reception.",
    "url": "https://thehill.com/homenews/administration/4538271-biden-to-sign-executive-order-to-expand-research-on-womens-health/"
  },
  {
    "text": "Kushner Deal in Serbia Follows Earlier Interest by Trump  —  More than a decade ago, before running for president, Donald Trump expressed interest in developing the same site in Belgrade that his son-in-law now plans to invest $500 million in rebuilding.  —  The plan by Jared Kushner … ",
    "url": "https://www.nytimes.com/2024/03/17/us/politics/kushner-deal-serbia-trump.html"
  },
  {
    "text": "Exclusive: Top Republican calls for canceling future Biden SOTU speeches … - “That was about the most divisive State of the Union — I wouldn't extend him an invitation next year, if that's what we're going to get,” Emmer said during an interview at the House GOP retreat.",
    "url": "https://www.axios.com/2024/03/17/biden-state-of-the-union-invitation-republicans"
  },
  {
    "text": "Trump Doubles Down on Migrants ‘Poisoning’ the Country  —  In an interview on Fox News, the former president said again that migrants crossing the southern border were criminals from prisons and mental institutions.  —  Former President Donald J. Trump, in an interview broadcast Sunday … ",
    "url": "https://www.nytimes.com/2024/03/17/us/politics/trump-fox-interview-migrants.html"
  },
  {
    "text": "AP PHOTOS: Boston celebrates St. Patrick's Day; Biden holds White House brunch with Irish leader  —  BOSTON (AP) — While some American cities celebrated St. Patrick's Day a day early this weekend, Boston, one of the most Irish cities in the country, held its parades and festivities on Sunday, or March 17.",
    "url": "https://apnews.com/article/st-patricks-day-boston-biden-kansas-city-3f3db00d515d8696c0509f663a9256a4"
  },
  {
    "text": "The education of a true believer  —  Linda Wenhold absorbed Patriot Academy's message that America is falling apart as it drifts from its biblical roots.  Then she won a seat on her local Pennsylvania school board.  —  BETHLEHEM, Pa. — Linda Wenhold closed her eyes, bowed her head and offered a prayer.",
    "url": "https://www.washingtonpost.com/politics/2024/03/17/patriot-academy-biblical-citizenship-school-board/"
  },
  {
    "text": "‘Knock it off’: Speaker Mike Johnson tries to stop Republicans from campaigning against each other in bitter primary battles  —  Hear more on House Republican primary races on “Inside Politics Sunday with Manu Raju” at 8 a.m. ET and 11 a.m. ET.  —  House Republicans, who have seen … ",
    "url": "https://www.cnn.com/2024/03/17/politics/mike-johnson-house-republican-primary-fights/"
  },
  {
    "text": "Trump Economic Advisers Float Three Names for Fed Chair  —  Kevin Warsh, Kevin Hassett, Arthur Laffer on shortlist presented to Trump during meeting at Mar-a-Lago  —  WASHINGTON—Influential economic advisers to Donald Trump presented the former president with a shortlist of potential candidates … ",
    "url": "https://www.wsj.com/politics/policy/trump-economic-advisers-float-three-names-for-fed-chair-e3b694d8"
  },
  {
    "text": "Illegal migrant from Lebanon caught at border admitted he's a Hezbollah terrorist hoping ‘to make a bomb’ — and was headed for NY  —  A Lebanese migrant who was caught sneaking over the border admitted he's a member of Hezbollah, he hoped to make a bomb, and his destination was New York, The Post can reveal.",
    "url": "https://nypost.com/2024/03/17/us-news/illegal-migrant-from-lebanon-admitted-terror-ties/"
  }
]