[
  {
    "text": "Trump Media auditor warns that losses ‘raise substantial doubt’ about company's ability to continue  —  The Truth Social parent, which trades under the stock ticker DJT, said it lost more than $58 million last year.  —  An auditor has raised doubts about the ability of Donald Trump's publicly traded company … ",
    "url": "https://www.nbcnews.com/business/business-news/trump-media-auditor-warns-losses-raise-doubt-company-rcna145831"
  },
  {
    "text": "Trump's net worth plunges $1 billion as his media stock tumbles  —  New York CNN  —  Shares of Truth Social owner Trump Media & Technology Group plunged Monday after the company disclosed that it lost more than $58 million and generated very little revenue in 2023.",
    "url": "https://www.cnn.com/2024/04/01/media/truth-social-trump-media-stock-losses/"
  },
  {
    "text": "Trump Media Shares Slump as Early Fervor Fades  —  A rapid fall in price erased billions of dollars in the market value of the parent company of Truth Social, eating into some of the gains made in the volatile stock's public debut.  —  Shares of former President Donald J. Trump's social media company slumped … ",
    "url": "https://www.nytimes.com/2024/04/01/business/trump-media-stock.html"
  },
  {
    "text": "Trump Media stock closes 21% lower after company reports $58 million loss for 2023 … This photo illustration shows an image of former President Donald Trump reflected in a phone screen that is displaying the Truth Social app, in Washington, DC, on February 21, 2022.",
    "url": "https://www.cnbc.com/2024/04/01/trump-media-lost-58-million-last-year-sec-filing-shows.html"
  },
  {
    "text": "Gag Order Against Trump Is Expanded to Bar Attacks on Judge's Family  —  Donald Trump had in recent days targeted the daughter of Juan Merchan, the judge overseeing his criminal trial in Manhattan, in blistering social media posts.  —  The New York judge overseeing Donald J. Trump's upcoming … ",
    "url": "https://www.nytimes.com/2024/04/01/nyregion/trump-gag-order-juan-merchan.html"
  },
  {
    "text": "Trump ramps up attacks on judges, sparking concerns as criminal trial nears  —  The judge overseeing the criminal trial that will start April 15 issued an expanded gag order late Monday in response to some of the former president's rhetoric  —  Former president Donald Trump is ramping … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/01/trump-judges-attacks-trials/"
  },
  {
    "text": "Supporting Trump Means Supporting a Culture of Violence  —  The former president is encouraging threats against his enemies—again.  —  Over the weekend, Donald Trump sent out a video with an image of Joe Biden bound like a hostage, and linked to an article with a photo of the daughter of the judge in his hush-money trial in New York.",
    "url": "https://www.theatlantic.com/newsletters/archive/2024/04/supporting-trump-means-supporting-a-culture-of-violence/677941/"
  },
  {
    "text": "Donald Trump has posted a $175 million bond to avert asset seizure as he appeals NY fraud penalty  —  Donald Trump posted a $175 million bond on Monday in his New York civil fraud case, halting collection of the more than $454 million he owes and preventing the state from seizing his assets … ",
    "url": "https://apnews.com/article/donald-trump-civil-fraud-trial-feb0593a5bbd3837edc0db195554eda1"
  },
  {
    "text": "Trump secures $175 million bond in New York civil fraud case  —  An appeals court last week reduced the amount of bond he was required to post.  —  Former President Donald Trump speaks at a campaign rally in Rome, GA, March 9, 2024.  —  Former President Donald Trump and his co-defendants … ",
    "url": "https://abcnews.go.com/US/trump-secures-175-million-bond-new-york-civil/story?id=108715465"
  },
  {
    "text": "Trump posts $175M bond to keep N.Y. authorities from seizing property  —  NEW YORK — Donald Trump posted a $175 million bond on Monday to prevent New York authorities from seizing his assets, including properties such as Trump Tower, pending appeal of a civil fraud judgment against him of nearly a half-billion dollars.",
    "url": "https://www.washingtonpost.com/national-security/2024/04/01/trump-new-york-bond-175-million/"
  },
  {
    "text": "Florida Supreme Court upholds state's 15-week ban on most abortions, paving way for 6-week ban  —  TALLAHASSEE, Fla. (AP) — The Florida Supreme Court on Monday upheld the state's ban on most abortions after 15 weeks of pregnancy, which means a subsequently passed six-week ban can soon take effect.",
    "url": "https://apnews.com/article/florida-abortion-ban-supreme-court-ruling-6a4949fc7459afe9b5e298086a793126"
  },
  {
    "text": "Trump Allies Plan Anti-Racism Overhaul to Protect White People: Report  —  NEW PRIORITY  —  Donald Trump's close allies want to overhaul anti-racism protections to focus on protecting white people rather than people of color if he wins another term in November, according to a report.",
    "url": "https://www.thedailybeast.com/trump-allies-plan-anti-racism-overhaul-to-protect-white-people-report"
  },
  {
    "text": "First human case of avian flu in Texas raises alarm  —  Potential cow-to-cow avian flu transmission in Idaho is worrying pandemic experts.  —  A Texas dairy worker has tested positive for the avian flu, marking the first identified human case of an illness in the U.S. that has sickened … ",
    "url": "https://www.politico.com/news/2024/04/01/first-human-avian-flu-case-texas-00149949"
  },
  {
    "text": "RFK Jr. Lays Out Argument That Biden's a Bigger Threat to Democracy Than Trump  —  DEVIL'S ADVOCATE  —  On CNN, Kennedy—who some believe could help Trump win in November—was also confronted with his old criticisms of “spoiler” candidate Ralph Nader before the 2000 election.",
    "url": "https://www.thedailybeast.com/rfk-jr-lays-out-argument-that-bidens-a-bigger-threat-to-democracy-than-trump"
  },
  {
    "text": "Trump's Call for Israel to ‘Finish Up’ War Alarms Some on the Right  —  Recent private remarks he made urging an end to the Gaza conflict, with no insistence on freeing Israeli hostages first, were another departure from conservatives' support for Benjamin Netanyahu.",
    "url": "https://www.nytimes.com/2024/04/01/us/politics/trump-israel-conservative.html"
  },
  {
    "text": "Lou Conter, last survivor of USS Arizona from Pearl Harbor attack, dies at 102  —  Lou Conter, the last living survivor of the USS Arizona battleship that exploded and sank during the Japanese bombing of Pearl Harbor, has died.  He was 102.  —  Conter passed away on Monday at his home in Grass Valley … ",
    "url": "https://apnews.com/article/pearl-harbor-uss-arizona-survivor-lou-conter-e4fdc131104be724691c364177e55076"
  },
  {
    "text": "The Church of Trump: How He's Infusing Christianity Into His Movement  —  Ending many of his rallies with a churchlike ritual and casting his prosecutions as persecution, the former president is demanding — and receiving — new levels of devotion from Republicans.",
    "url": "https://www.nytimes.com/2024/04/01/us/politics/trump-2024-religion.html"
  },
  {
    "text": "Conservative US judge says AI could strengthen ‘originalist’ movement  —  A conservative federal appeals court judge on Monday said future developments in artificial intelligence could revolutionize how judges like himself tie their rulings to the past by interpreting the U.S. Constitution based on the nation's history and tradition.",
    "url": "https://www.reuters.com/legal/transactional/conservative-us-judge-says-ai-could-strengthen-originalist-movement-2024-04-01/"
  },
  {
    "text": "Anti-Muslim Incidents In U.S. Break Records, According To New Report  —  The CAIR report points to the war in Gaza as the primary driver behind the dramatic increase in anti-Muslim sentiment.  —  LOADING  —  The Council on American-Islamic Relations, the country's largest Muslim civil rights group … ",
    "url": "https://www.huffpost.com/entry/anti-muslim-incidents-us-break-record-cair-report_n_660b21ffe4b005f1609ec231"
  },
  {
    "text": "Letter to the nation's teaching hospitals and medical schools  —  To the nation's teaching hospitals and medical schools:  —  Today, the Department of Health and Human Services (the Department), through the Centers for Medicare & Medicaid Services (CMS), released new guidance to reiterate … ",
    "url": "https://www.hhs.gov/about/news/2024/04/01/letter-to-the-nations-teaching-hospitals-and-medical-schools.html"
  },
  {
    "text": "Migrants in Iowa wonder whether to leave over a bill that could see some arrested and deported  —  A bill in Iowa that would allow the state to arrest and deport some migrants is stoking anxiety among immigrant communities, leaving some to wonder: “Should I leave Iowa?”",
    "url": "https://apnews.com/article/iowa-bill-deport-immigrants-police-texas-6e650bfaa39c5a0332194dd1e1ba7363"
  }
]