[
  {
    "text": "Young voters backing Biden over Trump by 23-point margin: Poll  —  President Biden has a comfortable lead over former President Trump among voters under the age of 30, according to a new poll.  The CBS News/YouGov poll found 61 percent of likely voters under the age of 30 surveyed support Biden while 38 percent support Trump.",
    "url": "https://thehill.com/homenews/campaign/4736410-biden-trump-young-voters/"
  },
  {
    "text": "Trump is on a fundraising blitz.  But there are other warning signs for Republicans.  —  For the first time this year, the Fox News poll had Joe Biden leading Donald Trump by two points, within the poll's margin of error.  —  For Republicans who spent much of the year crowing about Joe Biden's weaknesses … ",
    "url": "https://www.politico.com/news/2024/06/24/trump-fundraising-republicans-nervous-00164588"
  },
  {
    "text": "Conservative-backed group is creating a list of federal workers it suspects could resist Trump plans  —  From his home office in small-town Kentucky, a seasoned political operative is quietly investigating scores of federal employees suspected of being hostile to the policies of Republican Donald Trump … ",
    "url": "https://apnews.com/article/trump-biden-president-project-2025-33d3fc2999a74f4aa424f1128dca2d16"
  },
  {
    "text": "Special counsel probed Trump Mar-a-Lago trip that aides ‘kept quiet’ weeks before FBI search: Sources  —  One witness was told Trump was “checking on the boxes,” sources said.  —  In this June 9, 2017, file photo, President Donald Trump is shown at the White House in Washington, D.C.",
    "url": "https://abcnews.go.com/US/special-counsel-probed-trump-mar-lago-trip-aides/story?id=111334156"
  },
  {
    "text": "Louisiana Republicans write a guide for Alito and Thomas  —  Their Ten Commandments law has a small but powerful audience. … On its own, Louisiana's new law requiring the Ten Commandments to be displayed in every public school classroom is bad enough, a victory for evangelicals who want to push … ",
    "url": "https://www.publicnotice.co/p/louisiana-ten-commandments-law-alito-thomas"
  },
  {
    "text": "Same-Sex Relations, Marriage Still Supported by Most in U.S.  —  Republican backing for legalizing same-sex unions dips back below 50%  —  WASHINGTON, D.C. — More than two in three Americans continue to believe that marriage between same-sex couples should be legal (69%) … ",
    "url": "https://news.gallup.com/poll/646202/sex-relations-marriage-supported.aspx"
  },
  {
    "text": "Trump taunted Jewish employees with jokes about Nazi ovens: Ex-Trump Org VP  —  During an appearance on MSNBC on Sunday morning, a former executive vice president of the Trump Organization revealed that her former boss thought it was funny to make jokes about the Nazi ovens around Jewish employees.",
    "url": "https://www.rawstory.com/trump-attacking-jews/"
  },
  {
    "text": "Nineteen dead in attacks on churches and synagogue in southern Russia  —  Attacks on police posts, churches and a synagogue in Russia's North Caucasus republic of Dagestan have left 19 people and five gunmen dead.  —  At least 16 people were taken to hospital with injuries after the Sunday evening attack.",
    "url": "https://www.bbc.com/news/articles/crgggwg158do"
  },
  {
    "text": "How Trump and Biden compare on running up debt … - Both candidates bear a share of the responsibility, as each added trillions to that tally while in office.  — But Trump's contribution was significantly higher, according to the fiscal watchdogs at the Committee for a Responsible Federal Budget … ",
    "url": "https://www.axios.com/2024/06/24/trump-biden-debt-deficits-election"
  },
  {
    "text": "Russia started Berlin factory fire as part of hybrid war on Europe, report says  —  German police believe a technical defect caused the blaze, but security officials have blamed Russia.  —  Russian saboteurs trying to disrupt shipments of critical arms and ammunition to Ukraine set fire … ",
    "url": "https://www.politico.eu/article/russia-berlin-fire-diehl-behind-arson-attack-on-factory/"
  },
  {
    "text": "South Carolina poised to impose draconian censorship regime on school libraries  —  On Tuesday, the South Carolina State Board of Education will impose a centralized and expansive censorship regime on every K-12 school library in the state.  The new regulations could result in the banning … ",
    "url": "https://popular.info/p/south-carolina-poised-to-impose-draconian"
  },
  {
    "text": "I Know What America's Leading C.E.O.s Really Think of Donald Trump  —  Recent headlines suggest that our nation's business leaders are embracing the presidential candidate Donald Trump.  His campaign would have you believe that our nation's top chief executives are returning to support … ",
    "url": "https://www.nytimes.com/2024/06/23/opinion/ceo-trump-republican-support.html"
  },
  {
    "text": "An Egyptian Bank Claimed Details of a Suspected $10 Million Payment to Trump Might be in China  —  Back on September 19, 2018, then DC Chief Judge Beryl Howell denied a motion brought by an Egyptian bank to quash a subpoena for information on a suspected $10 million payment made to then-candidate Trump in fall 2016.",
    "url": "https://www.emptywheel.net/2024/06/23/an-egyptian-bank-claimed-details-of-a-suspected-10-million-payment-to-trump-might-be-in-china/"
  },
  {
    "text": "Melania Trump might not return to D.C. full-time for a second term … Melania was so atypically reclusive for a first lady that a long-running whisper campaign questioned whether she lived at the White House or with her parents in the 'burbs.  — So the prospect of her rolling in for a second full-time stint in the East Wing?",
    "url": "https://www.axios.com/local/washington-dc/2024/06/24/melania-trump-dc-first-lady-sightings"
  },
  {
    "text": "In This Debate, CNN Is the Decider  —  One network is in charge of every aspect of the Biden-Trump debate, a major shift from previous years.  Tens of millions of viewers are expected to be watching.  —  The prime-time matchup on Thursday between President Biden and former President Donald … ",
    "url": "https://www.nytimes.com/2024/06/24/business/media/cnn-presidential-debate.html"
  }
]