[
  {
    "text": "Special counsel seeks ‘narrowly tailored’ gag order against Trump, citing ‘disparaging and inflammatory attacks’  —  The court filing accuses Trump of engaging in a campaign of disinformation.  —  Special counsel Jack Smith and his team have requested a federal judge in Washington, D.C. … ",
    "url": "https://abcnews.go.com/US/special-counsel-seeks-narrowly-tailored-gag-order-trump/story?id=103197976"
  },
  {
    "text": "Special counsel asks for ‘narrow’ gag order for Trump in election interference case  —  Jack Smith's office says Trump's “disparaging and inflammatory attacks” have spurred threats against witnesses and threaten the court process.  —  WASHINGTON — Citing threats against individuals former … ",
    "url": "https://www.nbcnews.com/politics/justice-department/special-counsel-asks-narrow-gag-order-trump-election-interference-case-rcna105365"
  },
  {
    "text": "Special Counsel Seeking Gag Order on Trump in Election Case  —  Prosecutors have asked Judge Tanya S. Chutkan to curb statements from the former president that could intimidate witnesses, influence potential jurors or lead to harassment of others in the case.",
    "url": "https://www.nytimes.com/2023/09/15/us/politics/trump-gag-order.html"
  },
  {
    "text": "Florida Republicans reject DeSantis for Trump in loyalty pledge fight  —  “People will be pissed if we keep Trump off the ballot,” said one state GOP member.  —  ORLANDO — The latest contest between former President Donald Trump and Gov. Ron DeSantis in Florida came down to a loyalty pledge.",
    "url": "https://www.politico.com/news/2023/09/15/florida-republicans-desantis-trump-pledge-00116387"
  },
  {
    "text": "Trump keeps distance from impeachment inquiry while assailing Biden  —  The former president has shown more interest in lobbying to expunge his own impeachments  —  Former president Donald Trump often shows more interest in expunging his impeachments than impeaching President Biden.",
    "url": "https://www.washingtonpost.com/politics/2023/09/16/trump-impeachment-inquiry-house-republicans/"
  },
  {
    "text": "There's Videotape!  Annals of Feral Lauren Boebert ...  THE BACKCHANNEL  —  Ever since she managed to get reelected last year by only a few hundred votes, words been out that she'd have to put some time into securing her seat if she wanted to remain in Congress.",
    "url": "https://talkingpointsmemo.com/edblog/theres-videotape-annals-of-feral-lauren-boebert"
  },
  {
    "text": "Lauren Boebert Now Admits She Vaped in Theater: 'I'm Truly Sorry'  —  “There's not a person walking the face of this planet that hasn't had a moment of weakness and fallen short and I think people will get that,” Boebert told The Daily Beast.  —  Rep. Lauren Boebert (R-CO) … ",
    "url": "https://www.thedailybeast.com/lauren-boebert-now-admits-she-vaped-in-theater-im-truly-sorry"
  },
  {
    "text": "Ramaswamy wants to end the H-1B visa program he used 29 times  —  The GOP candidate pledges to get rid of a the system he calls “indentured servitude.”  —  GOP candidate Vivek Ramaswamy has vowed to “gut” the system for H-1B temporary worker visas if he wins the White House.",
    "url": "https://www.politico.com/news/2023/09/16/ramaswamy-h1b-visa-gop-visa-00116383"
  },
  {
    "text": "An Update From Thorn  —  Today we are sharing that Ashton Kutcher, our co-founder, will be resigning from his role as Board Chair at Thorn, effective immediately.  This decision is rooted in the recognition of recent events and ensuring Thorn remains focused on its mission: to build technology to defend children from sexual abuse.",
    "url": "https://www.thorn.org/blog/an-update-from-thorn/"
  },
  {
    "text": "Hunter Biden's lawyer says gun statute unconstitutional, case will be dismissed  —  The younger Biden's attorney spoke to ABC News on Friday.  —  The attorney for President Joe Biden's son Hunter Biden, who is facing felony gun charges, said Friday that the statute is “likely unconstitutional” … ",
    "url": "https://abcnews.go.com/US/hunter-bidens-lawyer-gun-statute-unconstitutional-case-dismissed/story?id=103214828"
  },
  {
    "text": "Justice Ketanji Brown Jackson Calls on Nation to Remember Ugly Past Truths  —  She was the keynote speaker at the 60th anniversary of the Ku Klux Klan bombing that killed four young girls at the Sixteenth Street Baptist Church in Birmingham, Ala.  —  Supreme Court Justice Ketanji Brown Jackson … ",
    "url": "https://www.nytimes.com/2023/09/15/us/politics/kentanji-brown-jackson-racism.html"
  },
  {
    "text": "UAW strike: Republican senators pin blame on Biden  —  Republican senators are blaming the Biden administration for the United Auto Workers' strike, attempting to drive a wedge between the union and President Joe Biden's push for electric vehicles.  —  About 13,000 workers walked … ",
    "url": "https://www.washingtonexaminer.com/news/senate/uaw-strike-republican-senators-pin-blame-on-biden"
  },
  {
    "text": "Chaos erupts as furious protesters heckle AOC during Dems' press conference for NYC's escalating migrant crisis  —  Furious protestors screaming “close the border” heckled Rep. Alexandria Ocasio-Cortez, Rep. Jerry Nadler and other Democrats Friday during a Midtown a press conference on the Big Apple's escalating migrant crisis.",
    "url": "https://nypost.com/2023/09/15/nyc-chaos-erupts-as-protesters-heckle-aoc-amid-escalating-migrant-crisis/"
  },
  {
    "text": "Hasan Minhaj's “Emotional Truths”  —  In his standup specials, the former “Patriot Act” host often recounts harrowing experiences he's faced as an Asian American and Muslim American.  Does it matter that much of it never happened to him?  —  The comedian Hasan Minhaj came of age … ",
    "url": "https://www.newyorker.com/news/annals-of-communications/hasan-minhajs-emotional-truths"
  },
  {
    "text": "Trump lawyer Jenna Ellis turns on ‘malignant narcissist’ ex-president  —  Ellis, one of 18 Trump associates charged in Georgia election subversion case, says she 'simply can't support him' again  —  Jenna Ellis - the Donald Trump lawyer who like the former president faces criminal charges … ",
    "url": "https://www.theguardian.com/us-news/2023/sep/15/trump-lawyer-jenna-ellis"
  },
  {
    "text": "The Ken Paxton saga is exposing the limits of Trump's coattails  —  Nearly a quarter of Texas Republicans now disapprove of the embattled attorney general, an all-time high.  —  Ken Paxton and his MAGA allies framed his stunning impeachment trial as the last gasp of the GOP's weakened establishment.",
    "url": "https://www.politico.com/news/2023/09/15/ken-paxton-saga-trump-00116273"
  }
]