[
  {
    "text": "New speaker of the House Mike Johnson once wrote in support of the criminalization of gay sex  —  Speaker of the House Mike Johnson has a history of harsh anti-gay language from his time as an attorney for a socially conservative legal group in the mid-2000s.",
    "url": "https://www.cnn.com/2023/10/25/politics/mike-johnson-gay-sex-criminalization-kfile/"
  },
  {
    "text": "The New Speaker is Everything Voters Hate about the GOP  —  The election of a Far Right Speaker is a huge opportunity for Democrats to once again run against MAGA Extremism  —  After three weeks, multiple failed votes, and several well known Republicans face-planting on the House floor … ",
    "url": "https://www.messageboxnews.com/p/the-new-speaker-is-everything-voters"
  },
  {
    "text": "How Mike Johnson's main strength will become his biggest liability  —  Everyone agrees that the Louisianan's anonymity helped him get the speakership.  It won't help him with the long list of other congressional crises.  —  Mike Johnson's anonymity in Washington was a driving force … ",
    "url": "https://www.politico.com/news/2023/10/25/how-mike-johnson-won-an-impossible-speakership-00123529"
  },
  {
    "text": "Mainstream media ignores new Speaker of the House Mike Johnson's history of anti-LGBTQ extremism  —  Rep. Johnson (R-LA) opposes same-sex marriage equality and worked with the anti-LGBTQ organization Alliance Defending Freedom for years  —  Several mainstream media outlets ignored … ",
    "url": "https://www.mediamatters.org/alliance-defending-freedom/mainstream-media-ignores-new-speaker-house-mike-johnsons-history-anti"
  },
  {
    "text": "Mike Johnson played a central role in trying to overturn the 2020 vote  —  The new House speaker worked behind the scenes to boost Donald Trump's efforts to stay in office through a long-shot court challenge  —  In the weeks after the 2020 election, an obscure Republican lawmaker … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/25/speaker-mike-johnson-election-denier/"
  },
  {
    "text": "The Terrifying Learning Curve Facing Mike Johnson  —  What a neophyte speaker needs to know right now.  —  “It was perhaps Mike Johnson's short tenure in the House that allowed him to win the gavel.  But now he faces a terrifyingly steep learning curve and almost no margin for error,” writes Brendan Buck.",
    "url": "https://www.politico.com/news/magazine/2023/10/25/mike-johnson-speaker-learning-curve-00123521"
  },
  {
    "text": "A fifth-string speaker suits up for House Republicans  —  It happened on Day 22 of House Republicans' slapstick quest to find a new speaker, as they were bickering their way toward nominating Majority Whip Tom Emmer of Minnesota, their fourth-string choice for the position, who would be shot down just a few hours after he was chosen.",
    "url": "https://www.washingtonpost.com/opinions/2023/10/25/house-speaker-mike-johnson-gop-fifth-choice/"
  },
  {
    "text": "Exclusive: Fulton County DA has discussed plea deals with at least 6 more Trump co-defendants  —  Fulton County prosecutors have discussed potential plea deals with at least six additional co-defendants charged alongside Donald Trump for attempting to subvert the 2020 presidential election, multiple sources tell CNN.",
    "url": "https://www.cnn.com/2023/10/25/politics/fulton-county-da-is-discussing-plea-deals-with-at-least-5-more-trump-co-defendants/"
  },
  {
    "text": "The One Simple Trick For Avoiding Prison Could Be Slipping Out Of Reach For Trump  —  As the coup-attempting former president's co-defendants continue taking plea deals, his bargaining position for a deal of his own gets weaker.  —  WASHINGTON — As Donald Trump's co-defendants and associates … ",
    "url": "https://www.huffpost.com/entry/trump-plea-deal-slipping_n_65394be5e4b0c8556103bef9"
  },
  {
    "text": "Special counsel urges judge to reimpose Trump's federal gag order  —  Prosecutors say Trump's recent verbal attacks show he's a threat to D.C. proceedings — and the safety of witnesses.  —  Special counsel Jack Smith is urging a federal judge to reinstate a gag order on Donald Trump … ",
    "url": "https://www.politico.com/news/2023/10/25/special-counsel-trump-federal-gag-order-00123676"
  },
  {
    "text": "Justice Thomas's R.V. Loan Was Forgiven, Senate Inquiry Finds  —  The justice failed to repay much, perhaps all, of the $267,230 loan.  His benefactor wiped the slate clean, with ethical and potential tax consequences.  —  The terms of the private loan were as generous as they were clear … ",
    "url": "https://www.nytimes.com/2023/10/25/us/politics/clarence-thomas-rv-loan-senate-inquiry.html"
  },
  {
    "text": "Justice Thomas Did Not Repay Substantial Portion of $267,230 Loan, Finance Committee Investigation Reveals; Failed to Report Forgiven Debt on Ethics Filings, Raising Questions About Tax Compliance  —  Documents Show Businessman Forgave the Loan, which Thomas used to Purchase a Luxury RV",
    "url": "https://www.finance.senate.gov/chairmans-news/justice-thomas-did-not-repay-substantial-portion-of-267230-loan-finance-committee-investigation-reveals-failed-to-report-forgiven-debt-on-ethics-filings-raising-questions-about-tax-compliance"
  },
  {
    "text": "Judge orders Trump to take the stand in N.Y. fraud trial, fines him $10,000 for violating gag order again  —  Trump was called to testify for the first time in the New York trial and was fined $10,000 for violating his gag order again.  —  Donald Trump stormed out of a Manhattan courtroom Wednesday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-orders-trump-take-stand-ny-fraud-trial-fines-10000-violating-gag-rcna122199"
  },
  {
    "text": "Trump Hit With $10,000 Fine for Gag Order Violation After Judge Puts Ex-President on Witness Stand and Finds Him ‘Not Credible’  —  The former president claimed under oath that he had been referring to his former fixer Michael Cohen, who was on the witness stand throughout the day and the focal point … ",
    "url": "https://themessenger.com/politics/trumpg-gag-order-violation-judge-engoron"
  },
  {
    "text": "At Least 16 Killed in Maine Shootings With Suspect at Large  —  A man opened fire at a bowling alley and a bar in Lewiston, Maine, on Wednesday night, killing at least 16 people and engulfing the state's second-largest city in chaos.  The suspect remained at large as authorities ordered residents … ",
    "url": "https://www.bloomberg.com/en/news/thp/2023-10-26/urgent-police-say-there-s-an-active-shooter-in-lewiston-maine-and-they-are-investigating-multiple-scenes"
  },
  {
    "text": "Harvard Creates Task Force for Doxxed Students Amid Backlash Over Israel Statement  —  Harvard will establish a task force to support students experiencing doxxing, harassment, and online security issues following backlash against students allegedly affiliated with a statement that held Israel … ",
    "url": "https://www.thecrimson.com/article/2023/10/25/doxxing-task-force/"
  }
]