[
  {
    "text": "The AP Interview: Harris says Trump can't be spared accountability for Jan. 6  —  U.S. Vice President Kamala Harris sat down with Associated Press reporter Chris Megerian in Jakarta, Indonesia on Wednesday.  She spoke about democracy and accountability regarding the January 6 Capitol riot.  —  Videos",
    "url": "https://apnews.com/article/harris-2024-election-vice-president-7ecabc8d9f0117edad8e83a0c37c9134"
  },
  {
    "text": "Former Proud Boys leader Enrique Tarrio sentenced to 22 years for role in Jan. 6 attack  —  “I will have to live with that shame ... for the rest of my life,” Tarrio said.  —  A federal judge on Tuesday sentenced former Proud Boys leader Enrique Tarrio to 22 years in prison … ",
    "url": "https://abcnews.go.com/Politics/former-proud-boys-chairman-enrique-tarrio-convicted-seditious/story?id=102929276"
  },
  {
    "text": "Tarrio, a Miami-made Proud Boy, got what he deserved.  But Miami is far from blameless  —  “Make no mistake.  We did this.”  —  That's what Henry “Enrique” Tarrio, the Miami-made Proud Boy insurrectionist, wrote on social media during the deadly riot that overran the U.S. Capitol on Jan. 6, 2021.",
    "url": "https://www.miamiherald.com/opinion/editorials/article278972509.html"
  },
  {
    "text": "Christie slams DeSantis for not meeting Biden after hurricane: ‘He was playing politics’  —  Chris Christie slammed GOP presidential rival Ron DeSantis for “playing politics” after the Florida governor chose not to meet with President Biden during his trip to the Sunshine State to survey damage from Idalia.",
    "url": "https://thehill.com/homenews/campaign/4188815-christie-slams-desantis-for-not-meeting-biden-after-idalia-he-was-playing-politics/"
  },
  {
    "text": "Trump was warned FBI could raid Mar-a-Lago as team feared he'd ‘go ballistic’ complying with subpoena, lawyer's notes show  —  Trump attorney Evan Corcoran saved his recollections in a series of voice memos.  —  In May of last year, shortly after the Justice Department issued a subpoena … ",
    "url": "https://abcnews.go.com/US/trump-warned-fbi-raid-mar-lago-team-feared/story?id=102932105"
  },
  {
    "text": "Top Trump Loyalist Is About to Finish Falling on His Sword for His Master  —  Peter Navarro is finally facing the music for refusing to testify before the Jan. 6 Committee—and playing out a familiar story in Trumpworld.  —  Peter Navarro, the diehard MAGA devotee who took a role … ",
    "url": "https://www.thedailybeast.com/top-trump-loyalist-peter-navarro-is-about-to-finish-falling-on-his-sword-for-his-master"
  },
  {
    "text": "Wagner to be declared a terrorist organisation by UK  —  Wagner, the Russian mercenary group, is set to be proscribed as a terrorist group by the UK government - meaning it will be illegal to be a member or support the organisation.  —  A draft order to be laid in Parliament will allow … ",
    "url": "https://www.bbc.com/news/uk-66724396"
  },
  {
    "text": "Blinken visits Kyiv in show of support for Ukraine's counteroffensive  —  U.S. Secretary of State Anthony Blinken arrived in Ukraine's capital Wednesday for an unannounced visit hours after Russia launched a missile attack on the city, in a trip intended to show confidence in Kyiv's forces amid a grinding counteroffensive.",
    "url": "https://apnews.com/article/russia-ukraine-war-blinken-counteroffensive-92b9ff2b9328f40516a4e47864d446e9"
  },
  {
    "text": "Trump scores big social media vote victory  —  Truth Social, former President Trump's social media platform, got a major reprieve on Tuesday, courtesy of shareholders in the blank-check company seeking to take it public. … - Had the shareholder vote failed, DWAC would have liquidated … ",
    "url": "https://www.axios.com/2023/09/05/trump-vote-victory-truth-social-dwac"
  },
  {
    "text": "All signs point to a rise in Covid  —  Covid hospitalizations, deaths and wastewater data — among other indicators — are all increasing as the U.S. heads into fall.  —  Signs in the U.S. continue to point to a rise in Covid activity as fall approaches.  —  Hospitalizations are rising.",
    "url": "https://www.nbcnews.com/health/health-news/signs-point-rise-covid-rcna103439"
  },
  {
    "text": "The truth about Elon Musk and anti-Semitism  —  Elon Musk, a self-proclaimed “free speech absolutist,” is threatening to sue the Anti-Defamation League (ADL) for billions of dollars because the group has publicly criticized his management of X, the platform formerly known as Twitter.",
    "url": "https://popular.info/p/the-truth-about-elon-musk-and-anti"
  },
  {
    "text": "George Santos Insists He Is Not Working On A Plea Deal  —  The U.S. attorney prosecuting the case against freshman Rep. George Santos (R-N.Y.) has indicated they are involved in discussions on how to resolve the case.  However, in a series of texts to TPM, Santos insisted those talks … ",
    "url": "https://talkingpointsmemo.com/news/george-santos-insists-he-is-not-working-on-a-plea-deal"
  },
  {
    "text": "DeSantis built a massive network of big donors.  Many have ditched him.  —  A POLITICO analysis shows just a substantial drop off in giving.  —  Former Illinois Gov. Bruce Rauner was among Ron DeSantis' biggest boosters during the 2022 midterm election, giving nearly $1 million to his reelection bid.",
    "url": "https://www.politico.com/news/2023/09/06/desantis-donors-florida-election-00114080"
  },
  {
    "text": "Former GOP Rep. Mike Rogers jumps into Michigan Senate race  —  The moderate gives Republicans a credible candidate for an open seat.  —  Former Rep. Mike Rogers, a GOP moderate who once chaired the House Intelligence Committee, launched a bid Wednesday for Michigan's open Senate seat.",
    "url": "https://www.politico.com/news/2023/09/06/former-gop-rep-mike-rogers-jumps-into-michigan-senate-race-00114151"
  },
  {
    "text": "9/6/23 ☀️ Punchbowl News AM  —  THE TOP … And the message is that he's in a prime position to get jammed by the Senate.  —  Senate Minority Leader Mitch McConnell is voicing support for the Biden administration's $40 billion-plus supplemental spending package on Ukraine, border security and domestic disaster relief.",
    "url": "https://punchbowl.news/archive/9623-punchbowl-news-am/"
  },
  {
    "text": "A Huge Threat to the U.S. Budget Has Receded.  And No One Is Sure Why.  —  For decades, runaway Medicare spending was the story of the federal budget.  —  Now, flat Medicare spending might be a bigger one.  —  Something strange has been happening in this giant federal program.",
    "url": "https://www.nytimes.com/interactive/2023/09/05/upshot/medicare-budget-threat-receded.html"
  },
  {
    "text": "Gaetz advocates forcing impeachment votes in warning to McCarthy  —  Rep. Matt Gaetz (R-Fla.) on Tuesday forecast upcoming moves to force House votes on impeachment, while sending a warning shot to Speaker Kevin McCarthy (R-Calif.).  —  The firebrand Republican's remarks come as McCarthy … ",
    "url": "https://thehill.com/homenews/house/4188271-gaetz-advocates-forcing-impeachment-votes-in-warning-to-mccarthy/"
  },
  {
    "text": "Senator appears to suggest bipartisan bill will censor transgender content online  —  The Kids Online Safety Act, aimed at protecting children from harmful online content, has been endorsed by lawmakers on both sides of the aisle, as well as by President Joe Biden.",
    "url": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/senator-appears-suggest-bipartisan-bill-will-censor-transgender-conten-rcna103479"
  },
  {
    "text": "Gabe Amo Wins Rhode Island Special Congressional Primary  —  Amo becomes the overwhelming favorite to become the first person of color to represent Rhode Island in Congress  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/gabe-amo-wins-rhode-island-special-congressional-primary"
  },
  {
    "text": "‘Good To Be On’: Ramaswamy Appears on Anti-Semitic YouTuber's Podcast  —  Podcaster Albert Faleski has accused Jews of ‘dual loyalty’  —  Vivek Ramaswamy on Tuesday appeared on a podcast hosted by an anti-Semitic YouTuber who has accused Jews of having “dual loyalty” and claimed that Zionists … ",
    "url": "https://freebeacon.com/elections/good-to-be-on-ramaswamy-appears-on-anti-semitic-youtubers-podcast/"
  },
  {
    "text": "New York AG asks judge to sanction Trump for rehashing failed legal arguments  — New York Attorney General Letitia James asked a judge Tuesday to sanction Donald Trump, other defendants, and their lawyers for rehashing the same legal arguments in James' big civil fraud lawsuit against the former president.",
    "url": "https://www.cnbc.com/2023/09/05/new-york-ag-asks-judge-to-sanction-trump-for-rehashing-failed-legal-arguments.html"
  },
  {
    "text": "Appeals court limits special counsel's effort to access Rep. Scott Perry's phone  —  Investigators have long been fighting to obtain records from Perry, who aided Donald Trump's effort to remain in power after the 2020 election.  —  A federal appeals court panel has partially blocked efforts … ",
    "url": "https://www.politico.com/news/2023/09/05/scott-perry-phone-court-ruling-00114005"
  }
]