[
  {
    "text": "Defiant Biden tells donors: 'We're done talking about the debate'  —  A defiant President Joe Biden insisted to his donors on Monday that he is “done talking about the debate” and implored the party to ignore any further distractions and direct its attention back to Donald Trump.  “We need to move forward.",
    "url": "https://www.politico.com/live-updates/2024/07/08/congress/defiant-biden-tells-donors-were-done-with-the-debate-00166834"
  },
  {
    "text": "House Democrat joins donor discussion about replacing Biden on ballot  —  The donors say they have since raised $30,000 for Rep. Angie Craig's campaign as part of an effort to encourage other lawmakers to break with the president.  —  Rep. Angie Craig (D-Minn.) joined a Zoom call Sunday … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/08/house-democrat-joins-donor-discussion-about-replacing-biden-ballot/"
  },
  {
    "text": "House and Senate races draw renewed focus for Democrats after Biden's bad debate  —  Donors are looking to direct their cash to down-ballot contests as candidates keep their heads down and strategize about how to attract ticket-splitters.  —  President Joe Biden's shaky debate performance … ",
    "url": "https://www.nbcnews.com/politics/2024-election/house-senate-races-draw-renewed-focus-democrats-bidens-bad-debate-rcna160728"
  },
  {
    "text": "In the Aging Senate, Nobody Wants to Be the One to Nudge Biden Aside  —  Senators have had plenty of practice watching colleagues hold stubbornly onto their positions of power as they grow old.  None wants to lead a public call for President Biden to withdraw.",
    "url": "https://www.nytimes.com/2024/07/08/us/politics/senate-age-biden.html"
  },
  {
    "text": "Joe Biden Is Not A Decent Man  —  The refrain that Biden is a ‘good’ or ‘decent’ man falls flat when you consider the president's decades of recorded lies and slander.  —  Even as they attempt to force him out, Democrats are still praising the sterling character of the president, especially in contrast to Trump.",
    "url": "https://thefederalist.com/2024/07/08/joe-biden-is-not-a-decent-man/"
  },
  {
    "text": "Trump proposes scaled back platform that softens language on abortion, same sex marriage  —  The draft was circulated Monday among members of the 2024 Republican convention platform committee.  It will be discussed and voted on later this week.  —  The 2024 Republican convention platform aides … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/08/trump-abortion-republican-platform/"
  },
  {
    "text": "Republicans Move at Trump's Behest to Change How They Will Oppose Abortion  —  (MILWAUKEE) — The Republican National Committee's platform committee has adopted a policy document that reflects former President Donald Trump's position opposing a federal abortion ban and ceding limits to states … ",
    "url": "https://time.com/6996118/republican-national-committee-platform-abortion-trump/"
  },
  {
    "text": "Parkinson's Expert Visited the White House Eight Times in Eight Months  —  The White House has said that President Biden has no signs of the disease and that there has been no reason to update the most recent testing, conducted in February.  —  An expert on Parkinson's disease … ",
    "url": "https://www.nytimes.com/2024/07/08/us/politics/parkinsons-expert-white-house.html"
  },
  {
    "text": "Official Kristi Noem social media accounts appear to have been deleted  —  Error messages shown on Facebook and Twitter pages for South Dakota governor plagued by dog-killing admission  —  Kristi Noem, the Republican governor of South Dakota who has been dogged by controversy since recounting … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/08/kristi-noem-social-media-deleted"
  },
  {
    "text": "Texas Governor Greg Abbott Jets Off to Asia as Hurricane Beryl Lashes His State  —  SOUND FAMILIAR?  —  Abbott departed for South Korea, Taiwan, and Japan on Friday as forecasts showed that Beryl was likely to hit Texas on Monday.  —  Texas Governor Greg Abbott boasted of having … ",
    "url": "https://www.thedailybeast.com/gov-greg-abbott-tours-jets-to-asia-as-hurricane-beryl-lashes-texas"
  },
  {
    "text": "What Trump doesn't want you to know about Project 2025  —  Project 2025 is a radical blueprint for a potential second Trump administration, spearheaded by the right-wing Heritage Foundation.  The plan calls for withdrawing approval for the abortion pill, banning pornography, slashing corporate taxes … ",
    "url": "https://popular.info/p/what-trump-doesnt-want-you-to-know"
  },
  {
    "text": "“Some folks need killing!”:  It's time to take MAGA threats of violence literally and seriously  —  A leader of Project 2025 declares the authoritarian “revolution” will be “bloodless” only “if the left allows it”  —  Attempts by Donald Trump and his MAGA minions to create plausible deniability … ",
    "url": "https://www.salon.com/2024/07/08/some-folks-need-killing-people-must-take-maga-of-violence-literally-and-seriously/"
  },
  {
    "text": "The Supreme Incompetents  —  All of the United States' most important governing institutions are failing at once.  —  Congress, of course, has long been barely able to function.  Every year, it struggles merely to fund the rest of the government, and the risk that it will trigger … ",
    "url": "https://www.vox.com/scotus/359206/supreme-court-incompetent-abortion-trump-immunity"
  },
  {
    "text": "Trump accused of swindling millions from his fans for a bogus ‘election defense fund’  —  Appearing on MSNBC's “Morning Joe” to promote his latest book, longtime political observer and author Joe Conason accused Donald Trump of bilking his MAGA followers out of millions for an election integrity project that never got off the ground.",
    "url": "https://www.rawstory.com/trump-swindling/"
  },
  {
    "text": "Marjorie Taylor Greene Botches Basic American History In Most Humiliating Way … LOADING",
    "url": "https://www.huffpost.com/entry/marjorie-taylor-greene-declaration-age_n_668b89d0e4b07ef2c81768ec"
  }
]