[
  {
    "text": "Is the US job market beginning to weaken?  Friday's employment report may provide hints  —  America's employers added a vigorous 272,000 jobs in May, accelerating from April and a sign that companies are still confident enough in the economy to keep hiring despite persistently high interest rates.",
    "url": "https://apnews.com/article/jobs-hiring-unemployment-economy-inflation-federal-reserve-d1d73005dbc40b081a555850a44e73d1"
  },
  {
    "text": "Robust job growth in May once again exceeds expectations  —  By nearly every metric, the latest jobs report points to a very strong U.S. job market.  The political implications have the potential to be dramatic.  —  Expectations heading into this morning showed projections of about 190,000 … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/robust-job-growth-may-exceeds-expectations-rcna156001"
  },
  {
    "text": "Live Updates: U.S. Hiring Rises Strongly  —  The pace of hiring was unexpectedly robust in May, showing a gain of 272,000 jobs, but the unemployment rate ticked up slightly, to 4 percent.  —  What to know about the latest jobs report.  —  The American labor market continued charging ahead in May … ",
    "url": "https://www.nytimes.com/live/2024/06/07/business/jobs-report-may-economy"
  },
  {
    "text": "As Biden rallies the free world, Trump serves a higher cause: Himself  —  In Phoenix, at his first post-conviction campaign rally, Trump portrayed a dark and desperate America.  —  The 80th anniversary of D-Day on Thursday provided the contrast that should define the election.",
    "url": "https://www.washingtonpost.com/opinions/2024/06/07/trump-phoenix-campaign-rally/"
  },
  {
    "text": "Biden to offer forceful defense of democracy in Normandy speech commemorating D-Day  —  ABC's Mary Bruce reports the contrasts with Donald Trump will be clear.  —  President Joe Biden attends a ceremony to mark the 80th anniversary of D-Day at the Normandy American Cemetery and Memorial in Colleville-sur-Mer, France, June 6, 2024.",
    "url": "https://abcnews.go.com/Politics/biden-offer-forceful-defense-democracy-normandy-speech-commemorating/story?id=110923613"
  },
  {
    "text": "Alex Jones agrees to liquidate his assets to pay Sandy Hook families, in move that would end his ownership of Infowars  —  Right-wing conspiracy theorist Alex Jones on Thursday moved to liquidate his personal assets, agreeing to demands from the families of Sandy Hook victims whom he owes … ",
    "url": "https://www.cnn.com/2024/06/06/media/alex-jones-assets-sandy-hook/"
  },
  {
    "text": "Revisiting “the biggest political crime in American history, by far”  —  Remember “Obamagate”?  You should. … It's tough to remember now as Donald Trump regularly wails about the need for total presidential immunity, but four years ago, the then-president was a huge proponent of prosecuting presidents.",
    "url": "https://www.publicnotice.co/p/trump-obamagate-revisited-presidential-immunity"
  },
  {
    "text": "A Staggering Tally: Supreme Court Justices Accepted Hundreds of Gifts Worth Millions of Dollars  —  Following the groundbreaking reporting from ProPublica and other outlets, FTC ventured to compile all the SCOTUS gifts, found a few unreported ones  —  Ahead of tomorrow's expected release … ",
    "url": "https://fixthecourt.com/2024/06/a-staggering-tally-supreme-court-justices-accepted-hundreds-of-gifts-worth-millions-of-dollars/"
  },
  {
    "text": "Biden is to meet with Ukraine's Zelenskyy in Paris as Russia leans into its battlefield offensive  —  U.S. President Joe Biden on Friday for the first time publicly apologized to Ukraine for a monthslong congressional holdup in American military assistance that let Russia make gains on the battlefield.",
    "url": "https://apnews.com/article/russia-ukraine-war-biden-zelenskyy-a77546e23fa571eb7f6509d4e14b89b3"
  },
  {
    "text": "'Donald Trump doesn't like America': Ex-GOP pollster writes MAGA movement's obituary  —  Republicans booed and walked out on two former Capitol police officers at the Pennsylvania statehouse, and a former GOP pollster was disgusted by that display of antipathy to American democracy.",
    "url": "https://www.rawstory.com/maga-movement-2668476457/"
  },
  {
    "text": "Playbook: A credibility crisis rocks the WaPo CEO  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  In late April, WILL LEWIS arrived at the former Georgetown home of KATHARINE GRAHAM.  —  Graham was the most revered publisher in the Washington Post's history.",
    "url": "https://www.politico.com/newsletters/playbook/2024/06/07/a-credibility-crisis-rocks-the-wapo-ceo-00162253"
  },
  {
    "text": "Statement from President Joe Biden on the May Jobs Report  —  The great American comeback continues, but we still have to make more progress.  On my watch, 15.6 million more Americans have the dignity and respect that comes with a job.  Unemployment has been at or below 4% for 30 months—the longest stretch in 50 years.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/06/07/statement-from-president-joe-biden-on-the-may-jobs-report/"
  },
  {
    "text": "The Hunter Biden Case Is Solid.  There's Something Rotten About It Too.  —  WILMINGTON, Delaware — The line between criminal prosecution and public flogging was hard to detect this week when federal prosecutors began their case against Hunter Biden for allegedly buying a gun in 2018 while addicted to drugs.",
    "url": "https://www.politico.com/news/magazine/2024/06/07/hunter-biden-trial-truths-column-00162083"
  },
  {
    "text": "Netanyahu to address Congress on July 24  —  Israeli Prime Minister Benjamin Netanyahu will address Congress on July 24, a person familiar with the plans, granted anonymity to discuss the matter, confirmed to POLITICO.  The speech comes after the four top congressional leaders … ",
    "url": "https://www.politico.com/live-updates/2024/06/06/congress/netanyahu-speech-congress-israel-00162227"
  },
  {
    "text": "Kennedy's Campaign Is Accused of Lying About His New York Residency  —  A group aligned with President Biden has challenged his ballot petition with New York State officials, arguing he should not be on the fall ballot.  —  A group aligned with President Biden is challenging Robert F. Kennedy Jr.'s … ",
    "url": "https://www.nytimes.com/2024/06/06/us/politics/rfk-jr-ny-residency-challenged.html"
  },
  {
    "text": "Isolated and inexperienced: A portrait of the judge overseeing Trump's documents case from veterans of her courtroom  —  Judge Aileen Cannon had been on the federal bench for little more than a year when a senior judge offered to preside over one of her first criminal trials in her isolated south Florida courthouse.",
    "url": "https://www.cnn.com/2024/06/07/politics/aileen-cannon-judge-trump-classified-documents/"
  },
  {
    "text": "Briahna Joy Gray fired from The Hill days after rolling her eyes at sister of Oct. 7 hostage during interview  —  A political commentator was sacked from The Hill — days after rolling her eyes while interviewing the sister of an Israeli abducted on Oct. 7 victim.  —  “It finally happened.",
    "url": "https://nypost.com/2024/06/06/media/briahna-joy-gray-fired-from-the-hill-days-after-rolling-her-eyes-at-sister-of-oct-7-victim-during-interview/"
  },
  {
    "text": "Why do Republicans stick with Trump?  New study explores the role of white nationalism  —  A new study explores why many Americans, particularly Republican voters, continue to support former President Donald Trump despite serious charges against him.  Researchers found that white nationalism … ",
    "url": "https://www.psypost.org/why-do-republicans-stick-with-trump-new-study-explores-the-role-of-white-nationalism/"
  },
  {
    "text": "Fact check: Trump falsely claims Democratic states are passing laws allowing people to execute babies after birth  —  Former President Donald Trump continues to try to depict Democrats as the “true radicals” on abortion policy.  To make his case, though, the presumptive Republican presidential nominee has made wildly inaccurate claims.",
    "url": "https://www.cnn.com/2024/06/06/politics/fact-check-donald-trump-abortion-babies-executed/"
  },
  {
    "text": "Conservatives tied to Trump want to limit insurance coverage for abortions  —  The proposal could make it more difficult for those with private-employer insurance to get out-of-state abortions, legal experts say.  —  Conservative policymakers influential with former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/business/2024/06/06/abortion-health-insurance-coverage-trump/"
  },
  {
    "text": "Vermont GOP rules bar it from promoting any candidate who is a ‘convicted felon’  —  The party can vote to exempt a candidate, but it so far appears to be following the rule.  —  The Vermont Republican Party is prohibited from backing a candidate with a felony conviction, according to the party's publicly posted rules.",
    "url": "https://www.nbcnews.com/politics/2024-election/vermont-republican-party-rules-bar-convicted-felon-trump-rcna155918"
  },
  {
    "text": "Fox News Poll: Biden, Trump in a dead heat in Virginia  —  Two-thirds say Trump's conviction won't matter to their presidential vote  —  Join Fox News for access to this content  —  Virginia is not widely considered a battleground state this election cycle — or perhaps just not yet.",
    "url": "https://www.foxnews.com/official-polls/fox-news-poll-biden-trump-dead-heat-virginia"
  },
  {
    "text": "Rishi Sunak apologizes for skipping D-Day event to do TV interview  —  LONDON — Rishi Sunak apologized after he ditched D-Day commemorations in France to do a TV interview instead — sparking a furious backlash.  —  The Conservative prime minister, who is fighting to stay in office ahead … ",
    "url": "https://www.politico.eu/article/uk-rishi-sunak-apologizes-dday-80-years-commemorations-backlash-tv-interview/"
  },
  {
    "text": "Milwaukee-based retail giant Kohl's says ‘No’ to sponsoring Republican convention events … Milwaukee based department store giant Kohl's says it will not sponsor any events related to the Republican National Convention in that city this summer, where Donald Trump will be crowned the party's nominee for president.",
    "url": "https://www.cnbc.com/2024/06/06/kohls-donation-trump-republican-national-convention.html"
  }
]