[
  {
    "text": "Gov. Kristi Noem's account of meeting North Korean dictator in doubt  —  UPDATE: Since the original publication of this story, The Dakota Scout has been told: “The publisher will be addressing conflated world leaders' names in the book before it is released.”",
    "url": "https://www.thedakotascout.com/p/gov-kristi-noems-account-of-meeting"
  },
  {
    "text": "Playbook: Kristi Noem shoots at ‘lone wolf’ Nikki Haley  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WORTH YOUR TIME THIS MORNING — “What's Really Happening on College Campuses, According to Student Journalists,” by Catherine Kim",
    "url": "https://www.politico.com/newsletters/playbook/2024/05/03/kristi-noem-shoots-at-lone-wolf-nikki-haley-00155932"
  },
  {
    "text": "NYPD Officer Fired Gun Inside Columbia's Hamilton Hall, Manhattan DA's Office Confirms  —  An officer inside Columbia University's Hamilton Hall Tuesday evening to break up a pro-Palestinian student demonstration fired his gun, in an incident that is now under review by Manhattan District … ",
    "url": "https://www.thecity.nyc/2024/05/02/nypd-officer-fired-gun-columbia-hamilton-hall-raid/"
  },
  {
    "text": "Biden finalizes rule opening up Obamacare to DACA recipients  —  Federal health officials estimate that roughly 100,000 people enrolled in the Deferred Action for Childhood Arrivals program will sign up for subsidized plans through the health insurance marketplace over the next year under the rule.",
    "url": "https://www.politico.com/news/2024/05/03/biden-obamacare-daca-00155881"
  },
  {
    "text": "How one text exchange gave Trump an ominous day in court  —  Editor's Note: Norman Eisen is a CNN legal analyst and editor of “Trying Trump: A Guide to His First Election Interference Criminal Trial.”  He served as counsel to the House Judiciary Committee for the first impeachment and trial of then-President Donald Trump.",
    "url": "https://www.cnn.com/2024/05/02/opinions/keith-davidson-testimony-trump-ominous-day-in-court-eisen/"
  },
  {
    "text": "Who will Donald Trump choose as his running mate?  What to know as potential VPs gather in Florida.  —  WASHINGTON Former President Donald Trump will spend part of his weekend hosting the latest episode of “The Apprentice,” but this time it's the vice presidential edition.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/05/03/donald-trump-vice-president-running-mate/73510077007/"
  },
  {
    "text": "Biden Says Japan ‘Xenophobic’ Along With China, Russia  — Remarks come weeks after Biden welcomed Japan's PM Kishida  — Immigration inches up in Japan, population still shrinking  —  US President Joe Biden included ally Japan along with rivals China and Russia in a list of countries he called … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-02/biden-now-calls-ally-japan-xenophobic-along-with-china-russia"
  },
  {
    "text": "Michael Bloomberg, Al Gore, Nancy Pelosi among 19 to receive Medal of Freedom from Biden  —  WASHINGTON ― President Joe Biden on Friday will name 19 recipients of the Presidential Medal of Freedom, including several political allies such as former Vice President Al Gore … ",
    "url": "https://www.usatoday.com/story/news/politics/2024/05/03/al-gore-nancy-pelosi-medal-of-freedom-biden/73547017007/"
  },
  {
    "text": "Schumer poised to join Johnson invite for Netanyahu address to Congress  —  Senate Majority Leader Chuck Schumer (D-N.Y.) is poised to join Speaker Mike Johnson (R-La.) in inviting Israeli Prime Minister Benjamin Netanyahu to deliver an address to Congress, despite tensions between … ",
    "url": "https://thehill.com/homenews/senate/4640068-schumer-johnson-netanyahu-invite/"
  },
  {
    "text": "Hope Hicks witnessed nearly every Trump scandal.  Now she must testify.  —  Friends say the former aide and Trump have not spoken since she testified to Congress about the Jan. 6 Capitol attack, but the two continue to have affection for each other  —  Special counsel Robert S. Mueller III … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/03/hope-hicks-testimony-trump-hush-money-trial/"
  },
  {
    "text": "Make Billionaires Pay (Their Taxes)  —  Until recently, it was hard to know just how good the superrich are at avoiding taxes.  Public statistics are oddly quiet about their contributions to government coffers, a topic of legitimate interest in democratic societies.",
    "url": "https://www.nytimes.com/interactive/2024/05/03/opinion/global-billionaires-tax.html"
  },
  {
    "text": "Sen. Lindsey Graham's phone being investigated for potential hack  —  The South Carolina senator said on Wednesday that the FBI was in possession of his phone.  —  WASHINGTON — Sen. Lindsey Graham said on Wednesday that the FBI was in possession of his phone after he received a message … ",
    "url": "https://www.nbcnews.com/politics/congress/sen-lindsey-grahams-phone-investigated-potential-hack-rcna150507"
  },
  {
    "text": "Elon Musk to reinstate X account of white nationalist Nick Fuentes … - The decision also came hours after Holocaust survivors launched a new campaign targeting antisemitism and disinformation online.  — Fuentes' X account was still suspended as of Friday morning.",
    "url": "https://www.axios.com/2024/05/03/elon-musk-nick-fuentes-x-account"
  },
  {
    "text": "RFK Jr. Event Hosted by MAGA Group With Jan. 6 ties  —  THIRD PARTY FOUL  —  Kennedy's recent appearance at a “medical freedom conference” in New York was organized by a group with real connections to the 2020 election denial movement. … RFK'S TRUMP PROBLEM",
    "url": "https://www.thedailybeast.com/rfk-jr-event-hosted-by-maga-group-with-jan-6-ties"
  },
  {
    "text": "Treasury eases finalized electric vehicle tax credit to allow for Chinese graphite  —  The Biden administration has eased restrictions for its electric vehicle tax credit, giving automakers more time to adjust to sourcing requirements meant to reduce reliance on China for materials.",
    "url": "https://www.washingtonexaminer.com/policy/energy-and-environment/2989672/treasury-eases-finalized-electric-vehicle-tax-credit-allow-chinese-graphite/"
  },
  {
    "text": "Boeing sending first astronaut crew to space after years of delay  —  Boeing (BA.N) is poised to send the first Starliner space capsule with a crew of humans into orbit next week, giving it a long-delayed chance to score a badly needed win as it struggles to compete with Elon Musk's SpaceX.",
    "url": "https://www.reuters.com/science/boeing-sending-first-astronaut-crew-space-after-years-delay-2024-05-03/"
  },
  {
    "text": "Denmark to allow girls between 15 and 17 years old to have abortions without parental consent  —  Denmark announced significant changes to its country's abortion laws that allowed girls between the ages of 15 and 17 to have an abortion without requiring parental consent.",
    "url": "https://www.washingtonexaminer.com/news/2989722/denmark-to-allow-girls-between-15-and-17-years-old-to-have-abortions-without-parental-consent/"
  },
  {
    "text": "The Left's Phony ‘Fake Electors’ Crusade Ramps Up As 2024 Election Draws Closer  —  The litigious left has run into some problems trying to sell its legally flawed narrative that alternate electors for Trump tried to overthrow the 2020 election.  —  Perhaps not surprisingly … ",
    "url": "https://thefederalist.com/2024/05/02/the-lefts-phony-fake-electors-crusade-ramps-up-as-2024-election-draws-closer/"
  }
]