[
  {
    "text": "Mexican President's Harsh Takedown of Trump Exposes an Ugly MAGA Scam  —  Donald Trump's angry threat to impose 25 percent tariffs on all U.S. imports from Mexico—delivered Monday via the cautious diplomatic language of a Truth Social rant—is widely being depicted as a bluff.",
    "url": "https://newrepublic.com/article/188854/mexico-sheinbaum-responds-trump-tariffs"
  },
  {
    "text": "Team Trump Debates ‘How Much Should We Invade Mexico?’  —  In Trump's government-in-waiting, the only question is how massive the U.S. assault on Mexican drug cartels should be … “How much should we invade Mexico?” says a senior Trump transition member.  “That is the question.”",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-mexico-drug-cartels-military-invade-1235183177/"
  },
  {
    "text": "Goldman Sees ‘Significant’ Hit to US From Trump's Canada Tariffs  — President-elect vows 25% levies on all products from Canada  — Bank says tariffs ‘unlikely’ given the focus on energy costs … US consumers face “significant consequences” from President-elect Donald Trump's proposed tariffs … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-27/goldman-sees-significant-hit-to-us-from-trump-s-canada-tariffs"
  },
  {
    "text": "Elon Musk publicized the names of government employees he wants to cut.  It's terrifying federal workers  —  When President-elect Donald Trump said Elon Musk and Vivek Ramaswamy would recommend major cuts to the federal government in his administration, many public employees knew that their jobs could be on the line.",
    "url": "https://www.cnn.com/2024/11/27/business/elon-musk-government-employees-targets/"
  },
  {
    "text": "‘You deceived millions of us!’:  Trump fans tell him they're outraged over latest move  —  Some of Donald Trump's fans are outraged about his latest move involving the Navy, according to posts on the former and incoming president's social media.  —  Trump late Tuesday took to his Truth Social … ",
    "url": "https://www.rawstory.com/trump-fans-deceived-navy-pick/"
  },
  {
    "text": "Trump picks John Phelan, a businessman with no military experience, to be secretary of the Navy  —  Phelan, who told NBC News he was “greatly honored,” would be the first person in 15 years to lead the Navy without having served in the military.  —  President-elect Donald Trump has chosen John Phelan … ",
    "url": "https://www.nbcnews.com/news/us-news/trump-picks-john-phelan-businessman-navy-secretary-rcna182003"
  },
  {
    "text": "Trump turns to outsider to shake up Navy, but his lack of military experience raises concerns  —  President-elect Donald Trump's nominee to be secretary of the Navy, John Phelan, has not served in the military or had a civilian leadership role in the service.",
    "url": "https://apnews.com/article/trump-navy-secretary-nominee-phelan-3b36a03a837684370f494a116cea183c"
  },
  {
    "text": "X users left stunned by ‘terrible’ video of Harris speaking to supporters: ‘Who thought this was a good idea?’  —  Vice President Kamala Harris addressed her loss for the first time since her concession speech  —  Vice President Kamala Harris' first video to her supporters after the election stunned social media users Tuesday.",
    "url": "https://www.foxnews.com/media/x-users-left-stunned-terrible-video-harris-speaking-supporters-who-thought-good-idea"
  },
  {
    "text": "Trump Cabinet nominees, appointees targeted with ‘violent, unAmerican threats’  —  The “attacks ranged from bomb threats to ‘swatting’”  —  EXCLUSIVE: Nearly a dozen of President-elect Donald Trump's Cabinet nominees and other appointees tapped for the incoming administration … ",
    "url": "https://www.foxnews.com/politics/trump-cabinet-nominees-appointees-targeted-violent-unamerican-threats"
  },
  {
    "text": "Scoop: Huge wave of House members eyes 2026 exits … - Both sides are trying to maximize attendance and minimize early retirements in one of the most closely divided Houses in history. … - Rep. Tim Burchett (R-Tenn.) told Axios that “folks have talked about” him running for governor and that he is … ",
    "url": "https://www.axios.com/2024/11/27/house-members-running-for-senate-governor-2026"
  },
  {
    "text": "Democrat Derek Tran ousts Michelle Steel in CA House battle  —  The battle for the Orange County district turned harshly personal in the closing weeks of the campaign.  —  Derek Tran, a first-time Democratic candidate, has flipped a toss-up California House seat, narrowly defeating GOP Rep. Michelle Steel … ",
    "url": "https://www.politico.com/news/2024/11/27/derek-tran-wins-california-45-election-00187118"
  },
  {
    "text": "Elon Musk wants to ‘delete’ federal financial watchdog as ‘DOGE’ begins work  —  “Delete CFPB,” Elon Musk, the billionaire tech executive running the “Department of Government Efficiency,” said in an early-morning post on X.  —  Elon Musk on Wednesday called for the elimination … ",
    "url": "https://www.washingtonpost.com/business/2024/11/27/elon-musk-delete-cfpb-doge/"
  },
  {
    "text": "Trump's new Ukraine adviser suggested ceding territory to Russia … - It also would mark a shift from the Biden administration's stance on the war and could be met with pushback from European allies. … - “The United States would continue to arm Ukraine and strengthen its defenses … ",
    "url": "https://www.axios.com/2024/11/27/trump-ukraine-adviser-russia-keith-kellogg"
  },
  {
    "text": "FOX NEWS CHANNEL COMMANDS LARGEST CABLE NEWS SHARE IN ITS HISTORY AS MSNBC AND CNN RATINGS COLLAPSE CONTINUES  —  FNC is Television's Most-Watched Primetime Channel Since Election, Only Network to Notch Growth Post-Election  —  MSNBC Audience Sinks by 47%, CNN Viewership Craters by 33%",
    "url": "https://press.foxnews.com/2024/11/fox-news-channel-commands-largest-cable-news-share-in-its-history-as-msnbc-and-cnn-ratings-collapse-continues-2"
  },
  {
    "text": "Musk accuses Trump whistleblower Vindman of ‘treason,’ says ‘he will pay’  —  Elon Musk on Wednesday suggested retired Army Lt. Col Alexander Vindman “committed treason” and “will pay” after the former Trump impeachment witness accused the tech billionaire and close Trump ally of being unwittingly used by Russia.",
    "url": "https://thehill.com/policy/technology/5012743-musk-accuses-trump-whistleblower-vindman-of-treason-says-he-will-pay/"
  },
  {
    "text": "Trump transition team ethics pledge appears to exclude president-elect  —  President-elect Donald Trump's team submitted an ethics plan guiding the conduct of its members throughout the transition period that does not appear to include provisions for one key member of the team: the president himself.",
    "url": "https://www.cnn.com/2024/11/27/politics/trump-transition-ethics-pledge/"
  },
  {
    "text": "Ohio governor signs bill limiting bathroom use by transgender students  —  Transgender students from kindergarten through college at Ohio public and private schools will be banned from using multiperson bathrooms that fit their gender identities under a measure that Republican Gov. Mike DeWine said Wednesday that he has signed.",
    "url": "https://apnews.com/article/transgender-students-bathroom-ohio-3fe7c4d9178c17c97a64103d79668df0"
  },
  {
    "text": "Exclusive: Exxon lobbyist investigated over hack-and-leak of environmentalist emails, sources say  —  The FBI has been investigating a longtime Exxon Mobil consultant over the contractor's alleged role in a hack-and-leak operation that targeted hundreds of the oil company's biggest critics … ",
    "url": "https://www.reuters.com/business/energy/exxon-lobbyist-investigated-over-hack-and-leak-environmentalist-emails-sources-2024-11-27/"
  },
  {
    "text": "Ruble tumbles as Russia's war economy comes under increasing strain  —  New sanctions package closes one of the last conduits of hard currency to Moscow.  —  The ruble tumbled on Wednesday to its lowest level in over two years, as a mix of low oil prices, new sanctions against Russian businesses … ",
    "url": "https://www.politico.eu/article/ruble-value-falls-russia-war-economy-ukraine-oil-prices-sanctions-inflation-interest-rates-oligarchs/"
  },
  {
    "text": "When will Democrats finally realize that big tech is not an ally?  —  Tech titans, and big business in general, are not reliable partners against Trumpism.  Progressives need to accept this  —  As Democrats think about how to counter the Trump administration, they need to accept a very simple lesson from the last eight years.",
    "url": "https://www.theguardian.com/commentisfree/2024/nov/27/democrats-tech-google-apple-musk-trump"
  },
  {
    "text": "What's a Democratic Billionaire to Do Now?  —  The party's donor class is still wrestling with Donald Trump's victory, worried about retribution and sluggish liberal energy.  Some rich Democrats are even pondering leaving the country.  —  The party's donor class is still wrestling … ",
    "url": "https://www.nytimes.com/2024/11/27/us/politics/democratic-donors-reid-hoffman-democracy-alliance.html"
  },
  {
    "text": "Federal court dismisses defamation lawsuit against Fox News for Jan. 6 conspiracy theory  —  A federal judge on Wednesday threw out a defamation lawsuit against Fox News by a former Donald Trump supporter who said he received death threats when the network aired false conspiracy theories … ",
    "url": "https://apnews.com/article/fox-lawsuit-carlson-epps-jan-6-5ca694d3f731daed1617129a61f05f71"
  }
]