[
  {
    "text": "US Army rebukes Trump campaign for incident at Arlington National Cemetery  —  The US Army issued a stark rebuke of former President Donald Trump's presidential campaign over the incident on Monday at Arlington National Cemetery, saying in a statement on Thursday that participants in the ceremony … ",
    "url": "https://www.cnn.com/2024/08/29/politics/us-army-rebukes-trump-campaign-arlington-incident/"
  },
  {
    "text": "Johnson pulled strings to get Trump into Arlington — and now the scandal is spreading  —  The Republican Speaker of the House, Mike Johnson, reportedly pulled strings to get Donald Trump into Arlington National Cemetery, amid what has become a scandal and a crisis for the ex-president's campaign … ",
    "url": "https://www.rawstory.com/johnson-trump-arlington/"
  },
  {
    "text": "Army blasts Trump trip to Arlington cemetery for violating decorum  —  Army officials criticized former President Donald Trump's campaign staff for violating decorum rules at Arlington National Cemetery and abusing a cemetery worker earlier this week, but no further actions will be pursued … ",
    "url": "https://www.militarytimes.com/news/pentagon-congress/2024/08/29/army-blasts-trump-trip-to-arlington-cemetery-for-violating-decorum/"
  },
  {
    "text": "Fallout from Trump's Arlington National Cemetery visit continues after campaign video  —  The U.S. Army said an employee at Arlington National Cemetery who tried to “ensure adherence” to rules that prohibit political activities at the cemetery “was abruptly pushed aside,” … ",
    "url": "https://www.npr.org/2024/08/29/nx-s1-5092087/trump-arlington-cemetery-altercation-video"
  },
  {
    "text": "Vance defends telling Harris to ‘go to hell’ for nonexistent cemetery criticism  —  The GOP vice-presidential candidate said an Arlington cemetery worker pushed aside by a Trump aide does not deserve an apology.  —  Former president Donald Trump's running mate, Ohio Sen. JD Vance … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/29/trump-harris-cemetery-go-to-hell/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI0OTA0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI2Mjg2Mzk5LCJpYXQiOjE3MjQ5MDQwMDAsImp0aSI6IjRhYjJhNzRmLTg0ZjUtNDBlZC1hYTE0LWEwM2Y4NjgyZmQyNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzI5L3RydW1wLWhhcnJpcy1jZW1ldGVyeS1nby10by1oZWxsLyJ9.0A8wU79ODO0qUuydENu-6S0Y9zgVAiQUeiSFacVSMCI&itid=gfta"
  },
  {
    "text": "August 28, 2024  —  Former president Trump appears to have slid further since last night's news about a new grand jury's superseding indictment of him on charges of trying to overthrow the 2020 presidential election.  Over the course of about four hours this morning, Trump posted 50 times … ",
    "url": "https://heathercoxrichardson.substack.com/p/august-28-2024"
  },
  {
    "text": "24 hours of Trump: QAnon tributes, crude attacks and hawking pieces of his suit  —  With fewer than 70 days until the election, Trump is zigging and zagging with an arsenal of unfocused broadsides and peripheral pursuits.  —  Donald Trump amplified a vulgar joke about Vice President Kamala Harris performing a sex act.",
    "url": "https://www.washingtonpost.com/elections/2024/08/29/trump-false-attacks-q-anon-harris-suit/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI0OTA0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI2Mjg2Mzk5LCJpYXQiOjE3MjQ5MDQwMDAsImp0aSI6IjllODdjOWU5LTQ1MmUtNGQ0Yi04NzNiLTdiNDc1MmExZTJmYyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9lbGVjdGlvbnMvMjAyNC8wOC8yOS90cnVtcC1mYWxzZS1hdHRhY2tzLXEtYW5vbi1oYXJyaXMtc3VpdC8ifQ.0RP6m5AaVAlhq9LOkpRsP9IxR6MjdU2d4UIcxHq_ueM&itid=gfta"
  },
  {
    "text": "Harris Has Taken Narrow Lead Over Trump, WSJ Poll Finds  —  Voters have largely positive views of Democratic nominee, who gets 48% to 47% for Republican Donald Trump  —  WASHINGTON—Kamala Harris has stepped out of the shadow of her role as the Biden administration vice president … ",
    "url": "https://www.wsj.com/politics/elections/trump-harris-poll-august-election-2024-e6fa024e"
  },
  {
    "text": "August 2024 Swing State Polls: Toss-up Presidential Election in Swing States  —  Home Polls August 2024 Swing State Polls: Toss-up Presidential Election in Swing States  —  Democratic Statewide Candidates Lead Republican Candidates  —  New Emerson College Polling/The Hill swing state surveys find … ",
    "url": "https://emersoncollegepolling.com/august-2024-swing-state-polls-toss-up-presidential-election-in-swing-states/"
  },
  {
    "text": "Exclusive: Kamala Harris surges ahead of Donald Trump in latest poll taken after DNC  —  Harris has succeeded in doing what Biden never could this year: Lead Trump.  —  Democrat Kamala Harris has surged ahead of Republican Donald Trump, 48%-43%, in a new USA TODAY/Suffolk University Poll found.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/29/kamala-harris-donald-trump-suffolk-usa-today-poll-results/74984967007/"
  },
  {
    "text": "Harris Edges Trump in Key States, With Sun Belt Now Up for Grabs  —  The honeymoon for the new Democratic nominee is far from over, as she narrows or reverses Trump's advantages on key economic issues.  —  Kamala Harris has sustained the burst of momentum she brought to the presidential contest … ",
    "url": "https://www.bloomberg.com/news/articles/2024-08-29/election-2024-poll-harris-leads-or-ties-with-trump-in-swing-states"
  },
  {
    "text": "2024 Race: Harris And Trump Neck And Neck As RFK Jr. Exits Presidential Race, Quinnipiac University National Poll Finds; Nearly 7 In 10 Think America's Best Days Are Yet To Come  —  mail_outline  —  Fresh off the Democratic National Convention and heading into the final months of the presidential race … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3903"
  },
  {
    "text": "Harris explains in exclusive CNN interview why she's shifted her position on key issues since her first run for president  —  Note: The full interview will at 9 p.m. ET Thursday on CNN's “The First Interview: Harris & Walz, A CNN Exclusive”  —  Vice President Kamala Harris on Thursday offered … ",
    "url": "https://www.cnn.com/2024/08/29/politics/kamala-harris-tim-walz-cnntv/"
  },
  {
    "text": "Trump says he wants to make IVF treatments paid for by government or insurance companies if elected  —  In an interview with NBC News, the former president defended himself over abortion rights and said either the government or insurance companies will pay for IVF if he's elected.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-says-wants-make-ivf-treatments-paid-government-insurance-compani-rcna168804"
  },
  {
    "text": "Pennsylvania may be a problem for Harris  —  The Electoral College/popular vote gap is increasing in post-DNC data. … I'm going to keep this brief, both because I'm jetlagged in two different directions  —  1 and because the model is really hungry for post-DNC/post-RFK-dropout data … ",
    "url": "https://www.natesilver.net/p/pennsylvania-may-be-a-problem-for"
  },
  {
    "text": "Decision on Georgia election board threatens Kemp's détente with Trump  —  The governor must decide whether to seek the removal of board members who have been praised by the former president for changing election rules with months to go before the vote.",
    "url": "https://www.washingtonpost.com/politics/2024/08/29/trump-kemp-georgia-election-board/"
  },
  {
    "text": "Wes Moore and the Bronze Star He Claimed but Never Received  —  For years, the Maryland governor has faced questions about whether he had wrongfully said he had a Bronze Star.  He insisted no. But an old document proves otherwise.  —  When Wes Moore ran for governor of Maryland in 2022 … ",
    "url": "https://www.nytimes.com/2024/08/29/us/politics/wes-moore-bronze-star.html?unlocked_article_code=1.Gk4.-pH5.Dvt8Qh6lVO08&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb&ngrp=mxn"
  },
  {
    "text": "JD Vance booed during firefighters union speech in which he asked members what have Democrats ‘gotten you’?  —  Vance tells firefighters union they have been ‘let down’ after endorsing Biden in 2019 election  —  Republican vice presidential nominee JD Vance was booed Thursday by some members … ",
    "url": "https://www.foxnews.com/politics/jd-vance-booed-during-firefighters-union-speech-which-he-asked-members-what-have-democrats-gotten-you"
  },
  {
    "text": "Republicans for Harris: GOP gets ready to rescue MAGA from Trump  —  But it may be too little, too late — even God can't help Trump as his criminal sentencing looms  —  The 2024 presidential race may answer a question none of us knew we would ever ask: What can 70,000 disgruntled Republicans on one phone call do to save humanity?",
    "url": "https://www.salon.com/2024/08/29/for-harris-gets-ready-to-rescue-maga-from/"
  },
  {
    "text": "ABC Treats Kamala's 21-Year Old Misstatement about Prosecutions as News but Not Trump's Daily Lies about His Own Crimes  —  As the mainstream press continues to soil itself like toddlers over Kamala Harris' interview tonight, I was going to use this CNN piece — suggesting questions … ",
    "url": "https://www.emptywheel.net/2024/08/29/abc-treats-kamalas-21-year-old-misstatement-about-prosecutions-as-news-but-not-trumps-daily-lies-about-his-own-crimes/"
  }
]