[
  {
    "text": "Groups File Nationwide Class Action Lawsuit Over Trump's Birthright Citizenship Order  —  Their legal challenge comes hours after the Supreme Court blocked judges from issuing nationwide injunctions to halt the administration's lawlessness.  —  WASHINGTON — Immigrants rights' advocates … ",
    "url": "https://www.huffpost.com/entry/groups-file-nationwide-class-action-lawsuit-birthright-citizenship_n_685eeac5e4b015addf95e404"
  },
  {
    "text": "The United States Is About to Embark on a Terrifying Experiment in Mass Statelessness  —  Let's say a child is born this year in El Paso, Texas.  Her parents are undocumented but long-settled, working in construction and child care, respectively.  They've lived in the United States for over a decade … ",
    "url": "https://slate.com/news-and-politics/2025/06/scotus-analysis-amy-coney-barrett-texas-babies-stateless.html"
  },
  {
    "text": "Supreme Court limits nationwide injunctions in birthright citizenship order  —  The Supreme Court in a 6-3 decision along ideological lines on Friday sided with the Trump administration's request to limit universal injunctions issued by federal courts.  The opinion in the birthright citizenship case was highly anticipated.",
    "url": "https://www.npr.org/2025/06/27/nx-s1-5435786/scotus-birthright-citizenship-universal-injunctions"
  },
  {
    "text": "University of Virginia President Resigns Under Pressure From Trump Administration  —  The Justice Department had demanded that James E. Ryan step down in order to help resolve a civil rights investigation into the school.  —  The University of Virginia's president, James E. Ryan … ",
    "url": "https://www.nytimes.com/2025/06/27/us/politics/university-of-virginia-president-resigns-trump-justice-department.html"
  },
  {
    "text": "Pam Bondi fires two Jan. 6 prosecutors, sending another chill through DOJ workforce  —  The dismissals were the first time that prosecutors who worked on Jan. 6 cases and were past their probationary period of federal employment had been fired by the Justice Department.",
    "url": "https://www.nbcnews.com/politics/justice-department/attorney-general-pam-bondi-fires-jan-6-prosecutors-capitol-riot-doj-rcna215661"
  },
  {
    "text": "Justice Department abruptly fires 3 prosecutors involved in Jan. 6 criminal cases, AP sources say  —  The Justice Department on Friday fired at least three prosecutors involved in U.S. Capitol riot criminal cases, the latest moves by the Trump administration targeting attorneys connected … ",
    "url": "https://apnews.com/article/jan-6-prosecutions-capitol-riot-trump-bondi-1107441a68cef171dfff4e680e438452"
  },
  {
    "text": "Senate Blocks War Powers Resolution to Limit Trump's Ability to Strike Iran Again  —  The vote against the measure was mostly along party lines, with Republicans opposing it and Democrats almost unanimously in favor.  —  The Senate on Friday blocked a Democratic resolution … ",
    "url": "https://www.nytimes.com/2025/06/27/us/politics/trump-war-powers-iran-strike.html"
  },
  {
    "text": "Senate rejects limiting Trump's military authority on Iran  —  The Senate on Friday rejected a resolution that would have blocked U.S. military action in Iran without authorization from Congress. … - The resolution, offered by Sen. Tim Kaine (D-Va.), was rejected 47-53.",
    "url": "https://www.axios.com/2025/06/27/senate-war-powers-tim-kaine-iran"
  },
  {
    "text": "Republican Rep. Don Bacon to Announce Retirement from Congress  —  Bacon's formal announcement that he is retiring from Congress is expected next week.  — Copy  —  Republican Rep. Don Bacon of Nebraska will not seek re-election next year, according to four sources familiar with the situation … ",
    "url": "https://www.notus.org/republicans/don-bacon-retirement"
  },
  {
    "text": "Senate Republicans release updated text for most of their megabill  —  Senate Republicans released updated text for their sweeping domestic policy bill late Friday, as leadership prepares to start voting as soon as Saturday.  Republican leaders viewed releasing the text as a key step for trying … ",
    "url": "https://www.politico.com/live-updates/2025/06/27/congress/senate-republicans-release-updated-text-megabill-lindsey-graham-00430647"
  },
  {
    "text": "DOGE loses control over government grants website, freeing up billions  —  The DOGE team's loss of control is the latest sign of its declining influence following Elon Musk's departure from Washington.  —  The U.S. DOGE Service has lost the power to control the government's process … ",
    "url": "https://www.washingtonpost.com/politics/2025/06/27/doge-loses-control-federal-grants/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwOTk2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUyMzc5MTk5LCJpYXQiOjE3NTA5OTY4MDAsImp0aSI6Ijg5MDBiZTk1LTc0ODktNGUyMC1iNmY0LTZjOWZhNGFmODNlMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA2LzI3L2RvZ2UtbG9zZXMtY29udHJvbC1mZWRlcmFsLWdyYW50cy8ifQ.Sd0lvhogISrMbsfmJpF3BJJZwMZe82DlkqnlEq2e8Kg&itid=gfta"
  },
  {
    "text": "Award-Winning Journalist Arrested and Charged with Possession of Child Pornography  —  For Immediate Release  —  U.S. Attorney's Office, District of Columbia  —  WASHINGTON - Thomas Pham LeGro, 48, made his first appearance today in U.S. District Court for allegedly possessing child pornography.",
    "url": "https://www.justice.gov/usao-dc/pr/award-winning-journalist-arrested-and-charged-possession-child-pornography"
  },
  {
    "text": "Tuberville says ‘inner city rats’ live off the American taxpayers: Trump should send them ‘back home’  —  Alabama U.S. Sen. Tommy Tuberville says President Donald Trump should defund major American cities where leadership is “godawful.”  —  Tuberville appeared on The Benny Show with Benny Johnson … ",
    "url": "https://www.al.com/politics/2025/06/tuberville-says-inner-city-rats-live-off-the-american-taxpayers-trump-should-send-them-back-home.html"
  },
  {
    "text": "Supreme Court says Maryland parents can pull their kids from public school lessons using LGBTQ books  —  The Supreme Court ruled on Friday that Maryland parents who have religious objections can pull their children from public school lessons using LGBTQ storybooks.",
    "url": "https://apnews.com/article/supreme-court-lgbtq-books-religion-maryland-schools-c0b0fb4b96531636fcb98b08aabc3cf9"
  },
  {
    "text": "U.S. law firm Susman Godfrey defeats Trump executive order  —  Law firm Susman Godfrey convinced a judge on Friday to permanently block a White House executive order against it, capping a string of court victories for firms targeted for their association with U.S. President Donald Trump's perceived enemies.",
    "url": "https://www.reuters.com/legal/government/us-law-firm-susman-godfrey-defeats-trump-executive-order-2025-06-27/"
  },
  {
    "text": "South Korea police detain six Americans trying to send cash, rice to North Korea  —  South Korean police have detained six U.S. citizens who were attempting to deliver around 1,300 plastic bottles filled with rice, dollar notes and Bibles to North Korea, a police official said on Friday.",
    "url": "https://www.reuters.com/world/asia-pacific/south-korea-police-detain-six-americans-trying-send-cash-rice-north-korea-2025-06-27/"
  },
  {
    "text": "How Might the Reconciliation Bill's Medicaid Cuts Affect Rural Areas?  —  Share this page on Facebook (opens in a new tab) Share this page on LinkedIn (opens in a new tab) Share this page via Email Print this page  —  Approximately 66 million people - about 20% of the U.S. population … ",
    "url": "https://www.kff.org/policy-watch/how-might-the-reconciliation-bills-medicaid-cuts-affect-rural-areas/"
  },
  {
    "text": "Utah Student Freed From ICE Detention Says Immigrants Just Want To Thrive ‘In The Country We Call Home’  —  Caroline Dias Goncalves, the University of Utah student who was abducted by Stephen Miller's mass deportation agents following a routine traffic stop earlier this month … ",
    "url": "https://americasvoice.org/blog/utah-student-freed-from-ice-detention-says-immigrants-just-want-to-thrive-in-the-country-we-call-home/"
  },
  {
    "text": "N.Y. Senator ‘Misspoke’ When She Falsely Claimed Zohran Mamdani Condoned ‘Global Jihad’  —  Kirsten Gillibrand said her constituents are “alarmed” by the New York mayoral nominee's past statements, including a big one he didn't make  —  During a radio interview Thursday … ",
    "url": "https://www.rollingstone.com/politics/politics-features/kirsten-gillibrand-zohran-mamdani-global-jihad-1235373902/"
  },
  {
    "text": "Family outraged after federal agents detain US citizen, accuse her of assault  —  A 32-year-old U.S. citizen was released from federal custody Thursday evening after her family said she was wrongfully detained by agents during an immigration enforcement operation in downtown Los Angeles.",
    "url": "https://www.nbclosangeles.com/news/local/family-outraged-federal-agents-detain-us-citizen/3733508/"
  }
]