[
  {
    "text": "President Biden should not run again in 2024  —  Joe Biden launched his candidacy for president in 2019 with the words “we are in the battle for the soul of this nation.”  He was right.  And though it wasn't obvious at first to many Democrats, he was the best person to wage that fight.",
    "url": "https://www.washingtonpost.com/opinions/2023/09/12/biden-trump-election-step-aside/"
  },
  {
    "text": "Mitt Romney says he will not seek a second term in the Senate  —  In a Post interview, Romney is critical of both Trump and Biden, and says most Republicans are drawn to a ‘populist demagogue message.’ His decision not to seek reelection is likely to be the end of the 2012 GOP presidential nominee's political career.",
    "url": "https://www.washingtonpost.com/politics/2023/09/13/mitt-romney-senate-reelection/"
  },
  {
    "text": "White House sends letter to news execs urging outlets to ‘ramp up’ scrutiny of GOP's Biden impeachment inquiry ‘based on lies’  —  The White House sent a letter to top US news executives on Wednesday, urging them to intensify their scrutiny of House Republicans after Speaker Kevin McCarthy launched … ",
    "url": "https://www.cnn.com/2023/09/12/media/white-house-letter-news-executives/"
  },
  {
    "text": "Trump Has Been Privately Encouraging G.O.P. Lawmakers to Impeach Biden  —  The former president has talked regularly with members of the House Freedom Caucus and other congressional Republicans who pushed for impeachment.  —  On a sweeping patio overlooking the golf course at his private club in Bedminster … ",
    "url": "https://www.nytimes.com/2023/09/13/us/politics/trump-gop-biden-impeachment.html"
  },
  {
    "text": "Pence backtracks on impeachment comments after McCarthy's U-turn on House floor vote  —  The former vice president had praised the speaker for pledging to hold a floor vote on opening a Biden impeachment inquiry, but that's not what McCarthy did Tuesday.  —  Pence supports McCarthy's decision on Biden impeachment inquiry",
    "url": "https://www.nbcnews.com/politics/2024-election/mike-pence-backtracks-impeachment-comments-kevin-mccarthy-u-turns-hous-rcna104770"
  },
  {
    "text": "Far-right Republicans tell McCarthy his impeachment inquiry won't soften their spending demands  —  WASHINGTON — Far-right Republicans are delivering a clear message to House Speaker Kevin McCarthy that they won't soften their spending-cut demands on government funding legislation one bit … ",
    "url": "https://www.nbcnews.com/politics/congress/conservatives-tell-mccarthy-impeachment-wont-resolve-government-shutdo-rcna104822"
  },
  {
    "text": "Lauren Boebert escorted out of “Beetlejuice” musical in Denver after “causing a disturbance”  —  Boebert campaign manager says congresswoman was just “enthusiastically” enjoying Sunday's show  —  U.S. Rep. Lauren Boebert was escorted out of a Sunday night performance of the “Beetlejuice” … ",
    "url": "https://www.denverpost.com/2023/09/12/lauren-boebert-removed-beetlejuice-musical-denver/"
  },
  {
    "text": "Lauren Boebert ditches the MAGA thing in Colorado  —  With her seat in danger, the Coloradan is starting to sound like a completely different person at home.  —  FRUITA, Colo. — Lauren Boebert is one of Washington's loudest proponents of impeaching Joe Biden.",
    "url": "https://www.politico.com/news/2023/09/13/lauren-boebert-maga-colorado-election-00113943"
  },
  {
    "text": "Alaska Rep. Mary Peltola's husband dies in plane crash  —  Rep. Mary Peltola's (D-Alaska) husband has died in a plane accident in Alaska, her chief of staff announced Wednesday.  —  “We are devastated to share that Mary's husband, Eugene Peltola Jr.—'Buzzy' to all of us who knew and loved him … ",
    "url": "https://thehill.com/homenews/house/4201929-alaska-rep-mary-peltolas-husband-dies-in-plane-crash/"
  },
  {
    "text": "Is AOC Married?  Her Office Says No. Her Legal Filings in Congress Say Otherwise.  —  Rep. Alexandria Ocasio-Cortez's (D., N.Y.) office says she isn't married.  But she has described her fiancé, Riley Roberts, as her “spouse” in forms filed with the House Ethics Committee in 2023 … ",
    "url": "https://freebeacon.com/democrats/aoc-cites-longtime-partner-as-spouse-but-keeps-his-finances-under-wraps-a-potential-breach-of-ethics-rules/"
  },
  {
    "text": "‘Alien corpses’ unveiled at Mexico's Congress as UFO speculation intensifies  —  An “alien” discovery was on the docket in Mexico's Congress on Tuesday, as “non-human” corpses were unveiled to politicians at a public hearing.  —  Prominent Mexican UFO expert and journalist Jaime Maussan presented … ",
    "url": "https://www.washingtonexaminer.com/news/alien-corpses-unveiled-mexico-congress-ufo-speculation-intensifies"
  },
  {
    "text": "She's 25, idealistic, and believes she has the formula to win North Carolina for Joe Biden  —  The state's Democratic Party chair is organizing youth and rural voters, and people have noticed: “They know she's fighting for them.”  —  Anderson Clayton, the youngest statewide party leader in the country … ",
    "url": "https://www.politico.com/news/2023/09/13/shes-25-idealistic-and-believes-she-has-the-formula-to-win-north-carolina-for-joe-biden-00114640"
  },
  {
    "text": "Judge denies Trump aide Mark Meadows request to pause ruling that sent Georgia election case back to state court  — A federal judge denied former White House chief of staff Mark Meadows' request for an emergency stay of a ruling that sent his Georgia election interference case back to state court.",
    "url": "https://www.cnbc.com/2023/09/13/judge-denies-trump-aide-mark-meadows-request-to-pause-ruling-that-sent-georgia-election-case-back-to-state-court.html"
  },
  {
    "text": "Ramaswamy says he wants to cut 1M civilian federal employees  —  GOP presidential candidate Vivek Ramaswamy vowed to cut 1 million civilian federal employees from the government if elected to the White House next year.  —  In interviews with Axios and Semafor, Ramaswamy said he wanted to make drastic cuts to the federal government.",
    "url": "https://thehill.com/homenews/campaign/4201722-ramaswamy-wants-to-cut-1m-federal-employees/"
  },
  {
    "text": "Lawmakers Cringe in Horror as GOP Senator Reads Graphic Sex Scenes Aloud  —  BUSINESS AS USUAL  —  Let the record show that Sen. John Kennedy (R-LA) used the words “dildo,” “cock,” and “strap-on” at a Tuesday hearing of the Senate Judiciary Committee.  The awkward viral moment occurred … ",
    "url": "https://www.thedailybeast.com/sen-john-kennedy-reads-graphic-sex-scenes-aloud-as-lawmakers-cringe-in-horror-at-book-ban-hearing"
  }
]