[
  {
    "text": "It's ‘insulting’ to have ‘nonsense Republicans’ on Biden impeachment inquiry panel, Democrat says  —  Rep. Jasmine Crockett (D-Texas) dubbed some of her Republican colleagues “idiots” and “a-holes” alongside criticism of the House Oversight Committee's attempts to launch a formal impeachment inquiry into President Biden.",
    "url": "https://thehill.com/homenews/house/4355290-jasmine-crockett-nonsense-republicans-biden-impeachment-inquiry-panel/"
  },
  {
    "text": "Some House Republicans Admit There Is No Evidence To Impeach Biden  —  ‘Probably not,’ Rep. Don Bacon, R-Neb., said Tuesday when asked if Biden committed high crimes or misdemeanors  —  A number of House Republicans are openly admitting that there is no evidence to impeach President Joe Biden … ",
    "url": "https://themessenger.com/politics/some-house-republicans-admit-there-is-no-evidence-to-impeach-biden"
  },
  {
    "text": "Biden says Netanyahu must change Israel government, losing global support  —  U.S. President Joe Biden said on Tuesday that Israeli Prime Minister Benjamin Netanyahu needs to change his hardline government and that Israel cannot say no in the future to a Palestinian state, ramping up pressure on the Israelis.",
    "url": "https://www.reuters.com/world/middle-east/biden-israel-starting-lose-support-over-indiscriminate-bombing-gaza-2023-12-12/"
  },
  {
    "text": "The history behind Jack Smith's Trump-Supreme Court gambit  —  A key 2020 episode — also involving the Supreme Court and a Trump claim of absolute immunity — is worth recalling in this moment  —  The question of Donald Trump's criminal jeopardy could be headed to the Supreme Court sooner rather than later.",
    "url": "https://www.washingtonpost.com/politics/2023/12/11/history-behind-jack-smiths-trump-supreme-court-gambit/"
  },
  {
    "text": "Trump on Hannity's show: 24 false or misleading claims in 5 minutes  —  The Fact Checker  —  A bogus claim every 12 seconds, on average.  That's what a single five-minute clip of former president Donald Trump speaking in Iowa on Dec. 5 yielded.  In the clip, from a Fox News “town hall” … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/12/trump-hannitys-show-24-false-or-misleading-claims-5-minutes/"
  },
  {
    "text": "10 alarming things Trump has promised to do in a second term  —  This is reality: Donald Trump will almost certainly be the Republican nominee for President for the third consecutive election.  Given the United State's polarized political climate, either major party nominee has a realistic chance … ",
    "url": "https://popular.info/p/10-alarming-things-trump-has-promised"
  },
  {
    "text": "'We'll Be at Each Others' Throats': Fiona Hill on What Happens If Putin Wins  —  The veteran Russia watcher is deeply alarmed as Washington reaches an inflection point on the war in Ukraine.  —  It was nearly two years ago that Russia launched its full-scale invasion of Ukraine … ",
    "url": "https://www.politico.com/news/magazine/2023/12/12/fiona-hill-ukraine-putin-00131285"
  },
  {
    "text": "U.S. declassifies intel as the White House pushes for more Ukraine funding  —  The U.S. assesses that more than 13,000 Russian soldiers have been killed or wounded in a key eastern Ukrainian battleground since October.  —  The U.S. has declassified intelligence on the situation in Ukraine … ",
    "url": "https://www.politico.com/news/2023/12/12/white-house-ukraine-intel-declassified-00131296"
  },
  {
    "text": "Poll: A fifth of Black voters want ‘someone else’ instead of Trump or Biden  —  The former president has also substantially improved his 2020 numbers with Black voters, according to the GenForward survey.  —  One of the best-respected polls of voters of color shows President Joe Biden … ",
    "url": "https://www.politico.com/news/2023/12/12/poll-a-fifth-of-black-voters-want-someone-else-instead-of-trump-or-biden-00131185"
  },
  {
    "text": "Far-right Polish lawmaker uses fire extinguisher on Hanukkah candles in parliament  —  A far-right Polish lawmaker used a fire extinguisher to put out Hanukkah candles in the country's parliament on Tuesday during an event with members of the Jewish community, provoking outrage and leading the speaker to exclude him from the sitting.",
    "url": "https://www.reuters.com/world/europe/far-right-polish-lawmaker-uses-fire-extinguisher-hanukkah-candles-parliament-2023-12-12/"
  },
  {
    "text": "Statement from the Harvard Corporation: Our President  —  As members of the Harvard Corporation, we today reaffirm our support for President Gay's continued leadership of Harvard University.  Our extensive deliberations affirm our confidence that President Gay is the right leader to help … ",
    "url": "https://www.harvard.edu/blog/2023/12/12/statement-from-the-harvard-corporation-our-president/"
  },
  {
    "text": "Pharmacies share medical data with police without a warrant, inquiry finds  —  The revelation could shape the debate over Americans' health privacy as states move to criminalize abortion and drugs related to reproductive health  —  The nation's largest pharmacy chains have handed … ",
    "url": "https://www.washingtonpost.com/technology/2023/12/12/pharmacy-records-police-privacy-abortion/"
  },
  {
    "text": "12/12/23 ☀️ Punchbowl News AM  —  When he walks into the historic Mansfield Room this morning, Ukrainian President Volodymyr Zelensky will be thrust into a brutal political dynamic over which he has alarmingly little control.  —  For starters, Zelensky isn't going to get Senate Republicans … ",
    "url": "https://punchbowl.news/archive/121223-punchbowl-news-am/"
  },
  {
    "text": "Missouri AG launches investigation of Media Matters  —  Missouri Attorney General Andrew Bailey (R) says he has launched an investigation into Media Matters for America, the progressive watchdog, following its report about harmful antisemitic content on X, the platform formerly known as Twitter.",
    "url": "https://thehill.com/homenews/4355644-missouri-ag-launches-investigation-of-media-matters/"
  },
  {
    "text": "Israel's Netanyahu Rejects U.S. Plan for Postwar Gaza  —  The prime minister says he won't allow the Palestinian Authority to take over Gaza  —  TEL AVIV—Israeli Prime Minister Benjamin Netanyahu on Monday said he would block the Biden administration's postwar plan to have the Palestinian Authority … ",
    "url": "https://www.wsj.com/world/middle-east/israels-netanyahu-rejects-u-s-plan-for-post-war-gaza-d60fc0c3?mod=followamazon"
  },
  {
    "text": "Judge: Giuliani may have defamed Georgia election workers again outside DC courthouse  —  Just minutes after leaving the first day of his civil trial, Rudy Giuliani repeated a false allegation about the pollworkers.  —  Rudy Giuliani's defiant public statements outside a Washington, D.C. … ",
    "url": "https://www.politico.com/news/2023/12/12/judge-giuliani-defamed-georgia-election-workers-00131288"
  },
  {
    "text": "FBI arrests an ‘internet pornography personality’ on Jan. 6 charges  —  Paul Caloia, who went by the name “GodHypnotic,” was “bragging” in a Skype chat about taking part in the Jan. 6 attack on the Capitol, an FBI affidavit stated.  —  WASHINGTON — The FBI has arrested an … ",
    "url": "https://www.nbcnews.com/politics/justice-department/fbi-arrests-internet-pornography-personality-jan-6-charges-rcna129325"
  },
  {
    "text": "An Iowa fight over a Satanic display reminds us: Republicans believe “free speech” is only for them  —  The key to understanding the GOP furor over “anti-semitism” on campus?  A altar to Lucifer in the Des Moines Capitol  —  It's become a holiday tradition, especially in the red states.",
    "url": "https://www.salon.com/2023/12/12/an-iowa-fight-over-a-satanic-display-reminds-us-believe-free-speech-is-only-for-them/"
  },
  {
    "text": "Harvard's Board Says President Will Stay, Despite Calls for Her Ouster  —  Claudine Gay, who became head of the university in July, faced criticism for her responses to questions at a congressional hearing about antisemitism.  —  Claudine Gay will stay on as president of Harvard University … ",
    "url": "https://www.nytimes.com/2023/12/12/us/harvard-president-claudine-gay.html"
  },
  {
    "text": "Gov. Chris Sununu to announce endorsement in Republican presidential race at Tuesday event, sources tell WMUR  —  Governor to endorse Nikki Haley, sources say  —  MANCHESTER, N.H. —  Republican presidential candidates have been competing for Gov. Chris Sununu's endorsement for months.",
    "url": "https://www.wmur.com/article/chris-sununu-new-hampshire-primary-endorsement/46101497"
  },
  {
    "text": "Seattle student failed quiz for saying men can't get pregnant  —  An activist history teacher failed a Seattle student on a quiz for saying only women can get pregnant and that only men have penises.  —  A 10th grade Ethnic Studies World History teacher at Chief Sealth International High School … ",
    "url": "https://mynorthwest.com/3942486/rantz-seattle-student-failed-quiz-for-saying-men-cant-get-pregnant/"
  },
  {
    "text": "Democrat Says Elise Stefanik Plagiarized Her Letter To Universities  —  Rep. Kathy Manning (D-N.C.) claimed the New York Republican undermined the bipartisan effort to “score political points.”  —  LOADING  —  Democratic Rep. Kathy Manning (N.C.) on Monday accused Rep. Elise Stefanik … ",
    "url": "https://www.huffpost.com/entry/elise-stefanik-kathy-manning-letter-universities_n_65786041e4b0881b79187d76"
  }
]