[
  {
    "text": "Paramount to Pay Trump $16 Million to Settle ‘60 Minutes’ Lawsuit  —  President Trump sued Paramount over a “60 Minutes” interview with his opponent, former Vice President Kamala Harris.  —  Paramount has agreed to pay President Trump $16 million to settle his lawsuit over the editing … ",
    "url": "https://www.nytimes.com/2025/07/02/business/media/paramount-trump-60-minutes-lawsuit.html?unlocked_article_code=1.TU8.YC_b.1krdNQ5ih266&smid=nytcore-android-share"
  },
  {
    "text": "CBS owner Paramount settles Trump lawsuit over Harris interview for $16M  —  The network will not apologize as part of the agreement.  The lawsuit stemmed from the editing of a “60 Minutes” interview with Kamala Harris.  —  Paramount, the parent company of CBS News, has agreed to pay $16 million … ",
    "url": "https://www.washingtonpost.com/style/media/2025/07/02/paramount-cbs-settlement-trump-harris-interview/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUxNDI4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUyODExMTk5LCJpYXQiOjE3NTE0Mjg4MDAsImp0aSI6IjczYzBjZWVjLTllNjUtNDFiOC1hYWM5LWRiM2YwM2RmYjM2MCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9zdHlsZS9tZWRpYS8yMDI1LzA3LzAyL3BhcmFtb3VudC1jYnMtc2V0dGxlbWVudC10cnVtcC1oYXJyaXMtaW50ZXJ2aWV3LyJ9.YvucLwfb0johgzMR76AME10Leu5Lc21I0o6yNYEj99k&itid=gfta"
  },
  {
    "text": "Paramount, CBS forced to pay eight figures, change editorial policy in settlement with President Trump  —  Result of the agreement on lawsuit could reach north of $30 million with $16 million upfront  —  FIRST ON FOX - Paramount Global and CBS agreed on Tuesday to pay President Donald Trump … ",
    "url": "https://www.foxnews.com/media/paramount-global-settles-trumps-lawsuit-against-cbs-news-over-60-minutes-interview"
  },
  {
    "text": "Paramount settles with Trump over ‘60 Minutes’ interview for $16 million  —  CBS parent company Paramount (PARA.O) on Wednesday settled a lawsuit filed by U.S. President Donald Trump over an interview broadcast in October, the latest concession by a media company to a president who has targeted outlets … ",
    "url": "https://www.reuters.com/business/media-telecom/paramount-settles-with-trump-over-60-minutes-interview-la-times-reports-2025-07-02/"
  },
  {
    "text": "Paramount agrees to pay $16 million to settle Trump's CBS ‘60 Minutes’ lawsuit  —  Paramount Global has agreed to pay $16 million to end President Trump's lawsuit over edits to a “60 Minutes” interview — a legal tussle that roiled CBS News, spurred high-level departures and threatened to derail the company's hoped-for sale.",
    "url": "https://www.latimes.com/entertainment-arts/business/story/2025-07-01/paramount-settles-trump-cbs-60-minutes-lawsuit"
  },
  {
    "text": "An Ignominious Bill Passed By an Inglorious Body  —  Millions will lose health insurance, but at least all those struggling Americans in the top 1 percent will get a big tax break.  —  Senate Votes to Comfort the Comfortable and Afflict the Afflicted  —  THE LEGISLATION SENATE REPUBLICANS passed … ",
    "url": "https://www.thebulwark.com/p/an-ignominious-bill-passed-by-an-inglorious-body-afflict-afflicted-comfort-comfortable-trump-republicans-medicaid-bbb"
  },
  {
    "text": "Wisconsin Supreme Court's liberal majority strikes down 176-year-old abortion ban  —  The Wisconsin Supreme Court's liberal majority struck down the state's 176-year-old abortion ban on Wednesday, ruling 4-3 that it was superseded by a newer state law that criminalizes abortions only after a fetus can survive outside the womb.",
    "url": "https://apnews.com/article/wisconsin-abortion-ban-1849-01658358639a63db7df92aeec34c612d"
  },
  {
    "text": "Wisconsin Supreme Court invalidates the state's strict 1849 abortion law  —  MADISON - Women in Wisconsin will continue to have access to abortion services under a new ruling from the state's highest court that invalidates a 176-year-old state law that had banned abortions in nearly every situation.",
    "url": "https://eu.jsonline.com/story/news/politics/2025/07/02/wisconsin-supreme-court-invalidates-the-states-1849-abortion-law/83024259007/"
  },
  {
    "text": "The private sector lost 33,000 jobs in June, badly missing expectations for a 100,000 increase, ADP says … Private sector hiring unexpectedly contracted in June, payrolls processing firm ADP said Wednesday, in a possible sign that the economy may not be as sturdy as investors believe … ",
    "url": "https://www.cnbc.com/2025/07/02/adp-jobs-report-june-2025.html"
  },
  {
    "text": "Immigration crackdown ripples through economy  —  President Trump's immigration crackdown is hitting key pockets of the economy, disrupting workplaces and communities around the country. … - There will be fewer workers to produce goods and services, slowing down growth and putting pressure on wages.",
    "url": "https://www.axios.com/2025/07/02/trump-immigration-crackdown-economy"
  },
  {
    "text": "The Grand Opening of an American Concentration Camp  —  What were you doing the day the president attended the opening of an American concentration camp in the Everglades?  Dubbed “Alligator Alcatraz” by Republican officials because of the predators living in the surrounding swampland … ",
    "url": "https://newrepublic.com/article/197508/alligator-alcatraz-trump-concentration-camp"
  },
  {
    "text": "Ukraine summons top US diplomat after Washington halts some arms supplies  —  Reduction in weapons shipments makes Kyiv more vulnerable to Russia's escalating attacks  —  Christopher Miller and Fabrice Deprez in Kyiv and James Politi in Washington  —  Ukraine summoned a top diplomat … ",
    "url": "https://www.ft.com/content/b69e327d-95a3-487d-a9b6-6a72ef48ba61"
  },
  {
    "text": "Pardoned Jan. 6 Rioter Who Threatened Police Joins Justice Dept.  —  The pardoned rioter, a former F.B.I. agent who was charged with encouraging the mob that stormed the Capitol, is a counselor to Ed Martin, the director of the so-called weaponization committee.",
    "url": "https://www.nytimes.com/2025/07/01/us/politics/justice-department-rioter-weaponization.html?unlocked_article_code=1.TU8.f4oR.otlThwYIrbnU&smid=url-share"
  },
  {
    "text": "Lack of New U.S. Sanctions Allows Restricted Goods and Funds Into Russia  —  President Trump has issued no new restrictions on Russia this year, in effect allowing Moscow to acquire the money and materials it needs in its conflict with Ukraine.  —  Since President Trump returned to office in January … ",
    "url": "https://www.nytimes.com/2025/07/02/us/politics/trump-russia-sanctions.html?unlocked_article_code=1.TU8.Ws2y.fRC0JkjyS7Sx&smid=url-share"
  },
  {
    "text": "Trump's Finances Were Shaky.  Then He Began to Capitalize on His Comeback. … An attendee posed with a cutout of President Trump at a Bitcoin conference in Las Vegas at the end of May.Gabriela Bhaskar/The New York Times  —  Last spring, even as Donald J. Trump's march back toward … ",
    "url": "https://www.nytimes.com/2025/07/02/us/trump-finances-crypto.html?unlocked_article_code=1.TU8.0-Hw.gkOsbJKO2qrj&smid=url-share"
  },
  {
    "text": "Immigration Policy and Its Macroeconomic Effects in the Second Trump Administration  —  We assess the macroeconomic implications of the observed and expected changes to immigration policy during the second Trump administration.  We project that net migration in 2025 will be between −525,000 … ",
    "url": "https://www.aei.org/research-products/report/immigration-policy-and-its-macroeconomic-effects-in-the-second-trump-administration/"
  },
  {
    "text": "Trump Withholds Nearly $7 Billion for Schools, With Little Explanation  —  The money, which was allocated by Congress, helps pay for after-school programs, support for students learning English and other services.  —  The Trump administration has declined to release nearly $7 billion … ",
    "url": "https://www.nytimes.com/2025/07/01/us/trump-education-funds.html?unlocked_article_code=1.TU8.RehK.-U2C3eIqvrZt&smid=url-share"
  },
  {
    "text": "Attorney general: ‘Everyone is Welcome Here’ sign cannot be displayed in Idaho schools  —  (UPDATED, 3:30 p.m., Monday, with comments from Sarah Inama.)  —  The “Everyone is Welcome Here” sign that sparked a viral nationwide controversy can no longer be displayed in Idaho schools … ",
    "url": "https://www.idahoednews.org/top-news/attorney-general-everyone-is-welcome-here-sign-cannot-be-displayed-in-idaho-schools/"
  },
  {
    "text": "Inside the Dysfunction at Rubio's Shrunken National Security Council  —  Fewer meetings, more top-down demands and worries some officials may go rogue are upending the system.  —  When the Pentagon recently launched a review of a landmark security pact with Australia and the United Kingdom … ",
    "url": "https://www.politico.com/news/magazine/2025/07/02/trumps-national-security-council-is-flailing-00436700"
  },
  {
    "text": "Tesla Sales Fall as Elon Musk Focuses on Self-Driving Cars  —  The company has devoted resources to autonomous driving rather than developing new models to attract car buyers.  —  Tesla's global car sales fell sharply in the second quarter, continuing a decline that began last year … ",
    "url": "https://www.nytimes.com/2025/07/02/business/tesla-sales-elon-musk.html"
  },
  {
    "text": "Trump pick to run federal watchdog: A 30-year-old who once shared a 9/11 conspiracy video and has ties to a Holocaust denier  —  The man President Donald Trump wants to put in charge of protecting whistleblowers - and rooting out government corruption - is a 30-year-old lawyer with barely … ",
    "url": "https://cnn.com/2025/07/02/politics/kfile-paul-ingrassia-office-of-special-counsel-nomination"
  },
  {
    "text": "National TV news largely failed to connect the record-breaking eastern U.S. heat dome to climate change  —  Only 4% of segments mentioned climate change … A Media Matters review of national TV news coverage from June 16 through June 26 of the extreme heat dome found:",
    "url": "https://www.mediamatters.org/broadcast-networks/national-tv-news-largely-failed-connect-record-breaking-eastern-us-heat-dome"
  },
  {
    "text": "Fox News, MAGA hats and cookies: Inside Trump's West Wing  —  Trump likes to see whom he wants and call whom he chooses, and in the new term, he presides over a White House that mirrors the man, current and former aides say.  —  WASHINGTON — The military leaders who came to the Oval Office … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/fox-news-maga-hats-cookies-trump-west-wing-rcna214754"
  }
]