[
  {
    "text": "Trump's legal advisers urge him to cancel press conference to refute Georgia allegations: Sources  —  Trump had announced a plan to release info on alleged election interference.  —  Former President Donald Trump's promised press conference to refute the allegations in the indictment handed … ",
    "url": "https://abcnews.go.com/US/trumps-legal-advisers-urge-cancel-press-conference-refute/story?id=102336380"
  },
  {
    "text": "Officials Investigate Threats Against Trump Grand Jurors in Georgia  —  Some of the jurors' identities have been shared on social media, with suggestions that they be harassed or made “infamous.”  —  Anna Betts and Nicholas Bogel-Burroughs reported from Atlanta.",
    "url": "https://www.nytimes.com/2023/08/17/us/trump-georgia-grand-jurors.html"
  },
  {
    "text": "Ex-Trump Aide Says Trump's Use Of Word ‘Riggers’ Is A Racist Dog Whistle  —  “I do think that's deliberate,” said Alyssa Farah Griffin, Trump's former White House communications director.  —  LOADING  —  Former White House communications director Alyssa Farah Griffin said she believes … ",
    "url": "https://www.huffpost.com/entry/alyssa-farah-griffin-trump-riggers-racist_n_64ddf04de4b0b74956e4493d"
  },
  {
    "text": "Purported names, photos and addresses of Fulton County grand jurors circulate on far-right internet  —  Names, photographs, social media profiles and even the home addresses purportedly belonging to members of the Fulton County grand jury that this week voted to indict former President Donald Trump … ",
    "url": "https://www.cnn.com/2023/08/17/politics/fulton-county-grand-jurors-far-right-internet/"
  },
  {
    "text": "Defend Trump and ‘Hammer’ Ramaswamy: DeSantis Allies Reveal Debate Strategy  —  Hundreds of pages of blunt advice, memos and internal polling were posted online by the main super PAC backing the Florida governor, offering an extraordinary glimpse into his operation's thinking.",
    "url": "https://www.nytimes.com/2023/08/17/us/politics/desantis-debate-strategy.html"
  },
  {
    "text": "Ron DeSantis debate memo urges him to defend Trump and take ‘a sledge-hammer’ to Vivek Ramaswamy  —  A memo authored by leaders of a pro-DeSantis super PAC outlined the “overarching goals” for Florida Gov. Ron DeSantis in next week's first GOP presidential primary debate.",
    "url": "https://www.nbcnews.com/politics/2024-election/desantis-debate-memo-urges-defend-trump-attack-ramaswamy-rcna100414"
  },
  {
    "text": "Why Democrat Dean Phillips says Biden shouldn't run  —  The Minnesota Democrat said he is worried a Biden candidacy will lead to another Donald Trump presidency  —  Rep. Dean Phillips has nothing but good things to say about President Biden's time in office, supporting his policies … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/17/phillips-biden-trump/"
  },
  {
    "text": "Texas and others create ‘punitive’ barriers to EV transition  —  A growing number of conservative states are imposing new taxes on drivers using electric vehicle charging stations and trying to limit EV sales.  —  Electric vehicle drivers in Texas have started to get some bad news in the mail.",
    "url": "https://www.politico.com/news/2023/08/17/punitive-texas-other-states-roadblocks-ev-transition-00110125"
  },
  {
    "text": "Marijuana and hallucinogen use, binge drinking reached historic highs among adults 35 to 50  —  NIH-funded study also shows younger adults reported marijuana, vaping, and hallucinogen use at or near historically high levels.  —  For more information on substance and mental health treatment programs … ",
    "url": "https://www.nih.gov/news-events/news-releases/marijuana-hallucinogen-use-binge-drinking-reached-historic-highs-among-adults-35-50"
  },
  {
    "text": "As Xitter's Lawyer Stalled DOJ, Elon Musk Met with Jim Jordan (Twice!) and Kevin McCarthy  —  Elon Musk has been eerily quiet about being held in contempt by Beryl Howell since the DC Circuit opinion was first released on August 9.  —  It's not like him to pass up the opportunity to make an obnoxious comment.",
    "url": "https://www.emptywheel.net/2023/08/17/as-xitters-lawyer-stalled-doj-elon-musk-met-with-jim-jordan-twice-and-kevin-mccarthy/"
  },
  {
    "text": "Trump team seeks to delay federal election interference trial until 2026  —  Former President Donald Trump wants a federal judge to reject special counsel Jack Smith's request to get the trial underway in early January of next year.  —  WASHINGTON — Former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-lawyers-seeks-delay-federal-election-trial-2026-rcna100062"
  },
  {
    "text": "‘Squad’ Democrat Ilhan Omar's World Cup trip funded by Hamas-tied Qatar  —  “Squad” Rep. Ilhan Omar (D-MN), who has come under fire from Democrats and Republicans for anti-Israel remarks, had her 2022 World Cup trip paid for by the government of Qatar, an Arab country that has been a top funder of the terrorist group Hamas.",
    "url": "https://www.washingtonexaminer.com/news/house/squad-democrat-ilhan-omars-world-cup-trip-funded-qatar"
  },
  {
    "text": "The Hard-Tweeting Defense Lawyer GOP Candidates Have Learned to Fear  —  Ron Filipkowski's uncovered videos have embarrassed multiple campaigns.  Now he's aiming for Ron DeSantis.  —  Ron Filipkowski poses for a portrait outside of his office in Sarasota, Fla., on Friday, June 2, 2023.",
    "url": "https://www.politico.com/news/magazine/2023/08/17/ron-filipkowski-desantis-trump-00110950"
  },
  {
    "text": "GOP Georgia State Lawmaker Calls for Investigation Into Fani Willis  —  State Sen. Colton Moore quickly got the support of fellow Trump supporter Rep. Marjorie Taylor Greene  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/gop-georgia-state-lawmaker-calls-for-investigation-into-fani-willis"
  },
  {
    "text": "Comer to NARA: Turn over all your Biden comms — as “Robert L. Peters”; Update: “JRB Ware”?  —  Call this the Pierre Delecto Twist in the Case of the Influence-Peddling Bidens.  Where Mitt Romney adopted a nom de plume for social-media sock puppetry, Joe Biden apparently put his pseudonym to a more, ah, commercial use.",
    "url": "https://hotair.com/ed-morrissey/2023/08/17/comer-to-nara-turn-over-all-your-biden-comms-as-robert-l-peters-n571813"
  },
  {
    "text": "Hawaiian Electric Knew of Wildfire Threat, but Waited Years to Act  —  Four years ago, the utility said it needed to do more to prevent its power lines from emitting sparks.  It made little progress, focusing on a shift to clean energy.",
    "url": "https://www.wsj.com/us-news/wildfire-risk-maui-hawaiian-electric-7beed21e"
  },
  {
    "text": "Inside the Incredible Drama Over One Senator's Trump Endorsement  —  One senator has been reluctant to endorse Trump because she serves on an RNC advisory board.  That excuse doesn't seem to be working for right-wing media. … When Republican National Committee chair Ronna McDaniel formed … ",
    "url": "https://www.thedailybeast.com/inside-the-incredible-drama-over-senator-katie-britts-trump-endorsement"
  },
  {
    "text": "Pentagon study calls for reforms at US military academies to combat wave of sexual assaults  —  A new Pentagon study says the U.S. military academies must step up efforts to address a spike in reported cases of sexual assault and harassment among cadets and midshipmen, including strengthening … ",
    "url": "https://thehill.com/policy/defense/4157392-pentagon-study-calls-for-reforms-at-us-military-academies/"
  },
  {
    "text": "Treasury Targets Individuals Involved in the Poisoning of Aleksey Navalny  —  WASHINGTON — Today, the U.S. Department of the Treasury's Office of Foreign Assets Control (OFAC) is once again taking action to hold the Government of Russia accountable for its poisoning of Russian opposition … ",
    "url": "https://home.treasury.gov/news/press-releases/jy1700"
  },
  {
    "text": "Dual citizen of France and Canada who mailed ricin to Trump sentenced to nearly 22 years in prison  —  A dual citizen of France and Canada who sent letters containing homemade ricin to then-President Donald Trump and eight Texas law enforcement officials was sentenced Thursday to nearly 22 years in prison.",
    "url": "https://www.cnn.com/2023/08/17/politics/ricin-trump-pascale-cecile-veronique-ferrier-sentenced/"
  },
  {
    "text": "Fact-Checking the Breadth of Trump's Election Lies  —  The former president faces multiple charges related to his lies about the 2020 election.  Here's a look at some of his most repeated falsehoods.  —  Before the 2020 election had even concluded, President Donald J. Trump laid the groundwork … ",
    "url": "https://www.nytimes.com/2023/08/17/us/politics/trump-election-lies-fact-check.html"
  },
  {
    "text": "Federal judge rejects push to block Florida Chinese land ownership law  —  The groups that challenged the law — which they called “racist” — said they intend to appeal the ruling.  —  TALLAHASSEE — A federal judge on Thursday rejected attempts, including from the Biden administration … ",
    "url": "https://www.politico.com/news/2023/08/17/florida-chinese-land-ownership-law-00111732"
  },
  {
    "text": "Maui survivors say government help still lags  —  FEMA is confronting growing disasters fueled by climate change while suffering staffing and funding shortages  —  Nine days after the deadliest wildfires in modern U.S. history scorched much of the historic town of Lahaina on Maui … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/17/fema-maui-response-lahaina-fires-biden/"
  },
  {
    "text": "Pence world poised for a showdown with Trump  —  'We've been waiting for this for a while,' the former vice president's senior adviser told POLITICO.  —  INDIANAPOLIS — Mike Pence tosses out a now well-honed line whenever he's asked how he could go from loyally defending Donald Trump to throwing spears at him on the debate stage.",
    "url": "https://www.politico.com/news/2023/08/17/pence-debate-showdown-trump-00111589"
  },
  {
    "text": "Democratic Group Plans $10 Million Push to Protect Election Officials  —  The group is starting a new venture that will focus on five battleground states: Georgia, Arizona, North Carolina, Nevada and Wisconsin.  —  A group that works to elect Democrats as the top election officials … ",
    "url": "https://www.nytimes.com/2023/08/17/us/politics/democrats-election-officials-value-the-vote.html"
  },
  {
    "text": "Rudy Giuliani pocketed $300,000 from farmers investing in anti-Biden documentary that was never made, lawsuit claims  — A lawsuit claims Rudy Giuliani was paid $300,000 while pitching investors on an anti-Biden film.  — Giuliani allegedly said it would be a “kill shot” that would sink Joe Biden's campaign.",
    "url": "https://www.businessinsider.com/rudy-giuliani-biden-documentary-scam-money-lawsuit-2023-8?op=1"
  },
  {
    "text": "World chess body bars trans women from competing in women's events  —  The International Chess Federation's new guidelines also strip transgender men of previously won women's titles.  —  The international governing body of competitive chess is effectively banning transgender women … ",
    "url": "https://www.nbcnews.com/nbc-out/out-news/world-chess-body-bars-trans-women-competing-womens-events-rcna100372"
  }
]