[
  {
    "text": "Trump's New York Fraud Trial in Limbo After His Legal Gambit Works  —  Trump's lawyers are going after Judge Arthur F. Engoron, saying he's overstepped his bounds. … An appellate judge has taken the remarkable step of hitting pause on the New York Attorney General's upcoming bank fraud trial … ",
    "url": "https://www.thedailybeast.com/trump-turns-new-york-ag-case-against-judge-arthur-f-engoron"
  },
  {
    "text": "Trump, His Kids, and His Bankers: New York AG Lays Out Witnesses in Case  —  The world will soon hear from Donald Trump's long-silent bankers at Deutsche Bank, his insurers at Zurich, property appraisers at Cushman and Wakefield, and his children. … The New York Attorney General plans … ",
    "url": "https://www.thedailybeast.com/trump-his-kids-and-his-bankers-new-york-ag-lays-out-witnesses-in-case"
  },
  {
    "text": "Workers strike at all 3 Detroit automakers in a battle for a bigger share of industry profits  —  About 13,000 U.S. auto workers stopped making vehicles and went on strike Friday after their leaders couldn't bridge a giant gap between union demands in contract talks and what Detroit's three automakers are willing to pay.",
    "url": "https://apnews.com/article/auto-uaw-workers-strike-gm-ford-stellantis-7ce3ca9d94b911250d07556b7af376c7"
  },
  {
    "text": "U.A.W. Strike Is a Real-Time Test of Biden's Economic Agenda  —  White House aides believe the outcome of the battle between the car companies and its workers will underscore many of the president's policy positions.  —  Rarely do so many parts of a president's political identity collide in one place.",
    "url": "https://www.nytimes.com/2023/09/15/us/politics/biden-uaw-strike.html"
  },
  {
    "text": "Congress is in crisis.  There's no clear escape.  —  “We've been seeing this coming ... I just didn't think we were dumb enough to get there,” Rep. Mike Simpson (R-Idaho) said.  —  The government is barreling toward a shutdown.  House Republicans threaten to impeach the president — though some of them don't see the evidence.",
    "url": "https://www.politico.com/news/2023/09/15/government-shutdown-congress-gop-00116066"
  },
  {
    "text": "Trump says it's ‘very unlikely’ he'd pardon himself if elected  —  In an interview with NBC's “Meet the Press,” former President Donald Trump said that in his final days in office, he told people, “The last thing I'd ever do is give myself a pardon.”  —  Trump: ‘I could have had a pardon’ before leaving office",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-unlikely-pardon-convicted-presidency-meet-the-press-rcna104779"
  },
  {
    "text": "Trump, DeSantis go head-to-head at key conservative group summits in DC  — Trump is set to give headline speeches at events hosted by the Concerned Women for America Legislative Action Committee and the Family Research Council in Washington, D.C.  — Trump's top Republican rival … ",
    "url": "https://www.cnbc.com/2023/09/15/trump-desantis-and-gop-pence-ramaswamy-court-key-conservative-groups-in-dc.html"
  },
  {
    "text": "Fox News Poll: Trump expands lead in GOP primary race  —  DeSantis continues to lose ground as Ramaswamy holds steady  —  Three weeks after the first Republican presidential primary debate, the latest Fox News survey finds Donald Trump has increased both his lead in the race and his strength of support.",
    "url": "https://www.foxnews.com/official-polls/fox-news-poll-trump-expands-lead-gop-primary-race"
  },
  {
    "text": "Biden Administration Aims to Trump-Proof the Federal Work Force  —  If Donald Trump wins a second term, he and his allies want to revive a plan to allow a president to fire civil service workers who are supposed to be hired on merit.  The Biden administration is trying to thwart it.",
    "url": "https://www.nytimes.com/2023/09/15/us/politics/trump-biden-schedule-f.html"
  },
  {
    "text": "Zelenskyy is expected to visit Washington as Congress is debating $24 billion in aid for Ukraine  —  Ukrainian President Volodymyr Zelenskyy is expected at the White House and on Capitol Hill next week as he visits the U.S. during the United Nations General Assembly.",
    "url": "https://apnews.com/article/zelenskyy-ukraine-congress-funding-war-8690dc44d00aa297c75cf514aeb5c63b"
  },
  {
    "text": "Hunter Biden indicted on federal gun charges  —  The indictment against the president's son comes after a plea agreement on tax and gun charges fell apart in July and amid a probe of his finances by House Republicans.  —  Federal prosecutors have indicted Hunter Biden, son of President Joe Biden, on gun charges, court documents show.",
    "url": "https://www.nbcnews.com/politics/politics-news/hunter-biden-indicted-federal-gun-charges-rcna39623"
  },
  {
    "text": "What I saw at the Texas border shocked me  —  On Sept. 6, a federal judge in Austin ordered Texas to remove a floating “buoy barrier” wall in the Rio Grande outside Eagle Pass, which has become a symbol of Governor Greg Abbott's (R) Operation Lone Star border program.",
    "url": "https://thehill.com/opinion/immigration/4200808-what-i-saw-at-the-texas-border-shocked-me/"
  },
  {
    "text": "With democracy on the ballot, the mainstream press must change its ways  —  US news organizations have turned Biden's age into a scandal and continue to cover Trump as an entertaining side show  —  Christiane Amanpour has reported all over the world, so she recognizes a democracy on the brink when she sees one.",
    "url": "https://www.theguardian.com/commentisfree/2023/sep/15/trump-biden-mainstream-politics-news-coverage"
  },
  {
    "text": "How a shutdown could blindfold the Fed  —  The Bureau of Labor Statistics won't collect or publish data such as unemployment numbers and the Consumer Price Index in the event of a shutdown, a spokesperson said.  —  Government funding gridlock is threatening to deprive the Federal Reserve … ",
    "url": "https://www.politico.com/news/2023/09/15/how-shutdown-could-blindfold-fed-00116076"
  },
  {
    "text": "By Asking for Tanya Chutkan's Recusal, Trump Invited a Lesson in His Centrality to January 6  —  Trump's motion for Tanya Chutkan to recuse was not designed to work.  Rather, it was designed as a messaging vehicle, to establish the basis for Trump to claim that a Black Judge was biased … ",
    "url": "https://www.emptywheel.net/2023/09/15/by-asking-for-tanya-chutkans-recusal-trump-invited-a-lesson-in-his-centrality-to-january-6/"
  },
  {
    "text": "60 Years  —  There is a lot going on in Georgia.  But I'm not going to write about it tonight, I'm going to leave it for another day.  Enough to know that the emergency hearing to stay the case that we expected to happen tomorrow morning will not take place.",
    "url": "https://joycevance.substack.com/p/60-years"
  },
  {
    "text": "‘It will take years to recover’ from Tuberville blockade, top Navy nominee says  —  Adm. Lisa Franchetti, the Navy's No. 2 officer, has been leading the service on an acting basis because of the impasse.  —  President Joe Biden's nominee to be the Navy's top officer, Adm. Lisa Franchetti … ",
    "url": "https://www.politico.com/news/2023/09/14/tuberville-blockade-franchetti-00115936"
  }
]