[
  {
    "text": "Trump Allies Plan New Sweeping Abortion Restrictions  —  His supporters are seeking to attack abortion rights and abortion access from a variety of angles should he regain the White House, including using a long-dormant law from 1873.  —  Allies of former President Donald J. Trump and officials … ",
    "url": "https://www.nytimes.com/2024/02/17/us/politics/trump-allies-abortion-restrictions.html"
  },
  {
    "text": "Trump launches sneaker line  —  Former President Donald Trump launched a line of sneakers ranging in price from $199 to $399.  —  If anyone was waiting for the other shoe to drop in the upcoming presidential race, former President Donald Trump just did, launching his own line of tennis shoes on Saturday.",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-launches-sneaker-line-rcna139334"
  },
  {
    "text": "Trump Launches $399 Sneaker Brand A Day After $355 Million Verdict Against Him  —  Former President Donald Trump hawked his new Trump-branded sneakers at “Sneaker Con,” a gathering that bills itself as the “The Greatest Sneaker Show On Earth!”.  —  LOADING",
    "url": "https://www.huffpost.com/entry/trump-launches-sneaker-line-at-sneaker-con_n_65d12c70e4b04daca6972e41"
  },
  {
    "text": "Can Trump pay?  What if he doesn't?  Here's what to know about Trump's massive civil judgments.  —  He's now on the hook for nearly a half-billion dollars across three civil cases.  These are the rules for when and how he must pay.  —  NEW YORK — A seven-figure verdict, an eight-figure verdict and, now, a nine-figure verdict.",
    "url": "https://www.politico.com/news/2024/02/16/trump-civil-judgments-what-to-know-00142034"
  },
  {
    "text": "How to Make Trump's Fraud Verdict Matter to Voters  —  The verdict in the civil fraud case should cost Trump more than money.  —  Yesterday, a New York City judge fined Donald Trump more than $350 million for falsely inflating the value of assets to secure better terms from lenders and insurers.",
    "url": "https://www.messageboxnews.com/p/how-to-make-trumps-fraud-verdict"
  },
  {
    "text": "Lyin' expelled ex-Rep. George Santos makes Jimmy Kimmel's ‘wishes come true’ by suing host over misusing Cameo clips  —  This is no laughing matter.  —  Expelled ex-Rep. George Santos is suing television host Jimmy Kimmel for allegedly misusing his Cameo clips on his show, The Post has learned.",
    "url": "https://nypost.com/2024/02/17/us-news/lyin-expelled-ex-rep-george-santos-makes-jimmy-kimmels-wishes-come-true-by-suing-host-over-misusing-cameo-clips/"
  },
  {
    "text": "George Santos Sues Jimmy Kimmel for Pranking Him on Cameo  —  The Republican fraudster wants at least $750,000 in damages.  —  “Put up or shut up,” former congressman George Santos likes to tell his haters.  Now, he's adding late night host Jimmy Kimmel to that list.",
    "url": "https://www.thedailybeast.com/george-santos-sues-jimmy-kimmel-for-pranking-him-on-cameo"
  },
  {
    "text": "Phillips announces campaign layoffs, says he will remain in race  —  “Today, sadly, I had to announce layoffs to a lot of my staff members,” the Minnesota lawmaker said in a video posted to X, formerly known as Twitter.  —  Longshot Democratic presidential contender Dean Phillips announced … ",
    "url": "https://www.politico.com/news/2024/02/17/dean-phillips-campaign-layoffs-00142053"
  },
  {
    "text": "Jimmy Carter's Long Goodbye  —  The former president is on the verge of having spent a year in hospice care, once again confounding expectations in a life that has lasted nearly a century.  —  Practically no one ever thought he would be elected president in the first place.",
    "url": "https://www.nytimes.com/2024/02/17/us/politics/jimmy-carter-hospice-anniversary.html"
  },
  {
    "text": "Speaker Johnson says he has priorities.  So why hasn't he acted on them?  —  Four months into his speakership, Rep. Mike Johnson (R-La.) is a leader in name only, failing to act on the policies he says are his priorities  —  House Speaker Mike Johnson (R-La.) has held his position for barely four months … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/17/speaker-johnson-fails-act/"
  },
  {
    "text": "Rep. Mike Turner: The White House seemed to be ‘sleepwalking’ on Russian nuclear threat  —  Rep. Mike Turner, R-Ohio, told NBC's “Meet the Press” on Saturday that he was concerned the White House was “hiding ... some inaction” on this threat.  —  Rep. Mike Turner told NBC's “Meet the Press” … ",
    "url": "https://www.nbcnews.com/politics/congress/rep-mike-turner-white-house-seemed-sleepwalking-russian-nuclear-threat-rcna139354"
  },
  {
    "text": "Biden Says Ukrainian City's Fall Shows Cost of US Aid Delays  — Zelenskiy tells allies Ukraine faces ‘artificial’ arms deficit  — Emergency aid to Ukraine stuck in congressional deadlock  —  President Joe Biden blamed US lawmakers' failure to approve emergency aid to Ukraine … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-17/biden-says-ukrainian-city-s-fall-shows-the-cost-of-us-aid-delays"
  },
  {
    "text": "National security experts criticize Biden's handling of classified documents  —  The disclosure that Biden told his ghostwriter he discovered classified documents in his Virginia home in 2017 but did not return them troubles some national security experts.  —  The controversy … ",
    "url": "https://www.nbcnews.com/politics/justice-department/national-security-experts-criticize-bidens-handling-classified-documen-rcna138689"
  },
  {
    "text": "U.S. Fears Russia Might Put a Nuclear Weapon in Space  —  American spy agencies are divided on whether Moscow would go so far, but the concern is urgent enough that Secretary of State Antony J. Blinken has asked China and India to try to talk Russia down.  —  When Russia conducted a series … ",
    "url": "https://www.nytimes.com/2024/02/17/us/politics/russia-nuclear-weapon-space.html"
  },
  {
    "text": "Biden Administration Is Said to Slow Early Stage of Shift to Electric Cars  —  The change to planned rules was an election-year concession to labor unions and auto executives, according to people familiar with the plan.  —  In a concession to automakers and labor unions … ",
    "url": "https://www.nytimes.com/2024/02/17/climate/biden-epa-auto-emissions.html"
  },
  {
    "text": "Haley presses Trump to call out Putin amid silence after Navalny death  —  GOP presidential candidate Nikki Haley pressed former President Trump to call out Russian President Vladimir Putin in the wake of opposition leader Alexei Navalny's death, while arguing that his silence is “a problem.”",
    "url": "https://thehill.com/homenews/campaign/4474409-haley-trump-putin-navalny-death-silence/"
  }
]