[
  {
    "text": "Trump eying Fox News host Jeanine Pirro for top prosecutor in DC  —  Pirro, if chosen, would be interim U.S. attorney for the District of Columbia.  —  Judge Jeanine Pirro speaks following an exclusive interview with Daniel Penny for FOX Nation, Dec. 10, 2024, in New York.",
    "url": "https://abcnews.go.com/US/trump-eying-fox-news-host-jeanine-pirro-top/story?id=121604820"
  },
  {
    "text": "Trump Drops Nominee for U.S. Attorney, Ed Martin, After Republicans Balk  —  The means of Ed Martin's ascent as the leading prosecutor for the U.S. attorney's office in Washington was his path out of power.  —  Ed Martin, the interim U.S. attorney for Washington, was breezing toward … ",
    "url": "https://www.nytimes.com/2025/05/08/us/politics/ed-martin-justice-department-republicans.html?unlocked_article_code=1.Fk8.-v3O.jBgQK2T2vZtE&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump names Jeanine Pirro interim US attorney for DC  —  President Donald Trump announced Thursday he's appointing Fox News host and former prosecutor Jeanine Pirro the interim US attorney for Washington, DC, after his first pick faced what appeared to be insurmountable pushback from Republicans on Capitol Hill.",
    "url": "https://cnn.com/2025/05/08/politics/jeanine-pirro-trump-acting-dc-prosecutor"
  },
  {
    "text": "Live updates: Robert Prevost of the United States is named Pope Leo XIV  —  EDITED BY  CURTIS YEE, KATARINA KRATOVAC AND MICHAEL WARREN  —  Cardinal Robert Prevost has taken the name Leo XIV.  The Chicago-born missionary who spent his career ministering in Peru and took over the Vatican's powerful office … ",
    "url": "https://apnews.com/live/conclave-pope-catholic-church-updates-5-8-2025"
  },
  {
    "text": "Meet Cardinal Robert Francis Prevost, the first American pope  —  Cardinal Robert Francis Prevost, 69, was elected as the 267th leader of the Catholic Church on Thursday, the second day of voting in the internationally watched papal conclave.  — He will be the first pope from the U.S. and will be known to the world as Pope Leo XIV.",
    "url": "https://www.axios.com/2025/05/08/pope-conclave-white-smoke-vatican"
  },
  {
    "text": "Fired FEMA chief threatened to quit weeks ago  —  Cameron Hamilton, the acting disaster chief, appeared to contradict Homeland Security Secretary Kristi Noem by defending the agency on Wednesday.  —  The head of the Federal Emergency Management Agency was fired Thursday morning and replaced … ",
    "url": "https://www.politico.com/news/2025/05/08/fema-chief-fired-cameron-hamilton-00335840"
  },
  {
    "text": "Leader of FEMA Is Dismissed as Trump Administration Takes Aim at the Agency  —  The ouster of Cameron Hamilton, less than a month before the start of the hurricane season, came a day after he told lawmakers that FEMA was vital to communities “in their greatest times of need” and should not be eliminated.",
    "url": "https://www.nytimes.com/2025/05/08/us/politics/fema-cameron-hamilton.html"
  },
  {
    "text": "U.S. and U.K. Unveil Framework for Trade Deal  —  President Trump lauds agreement as first with major trading partner since he imposed blanket tariffs on countries worldwide  —  WASHINGTON—President Trump announced the outlines of an agreement on trade with the U.K. on Thursday … ",
    "url": "https://www.wsj.com/economy/trade/trump-to-announce-trade-agreement-with-britain-bf937c67?st=XBnqHX&reflink=article_copyURL_share"
  },
  {
    "text": "Venerable New York Firm That Struck a Deal With Trump Is Losing Lawyers  —  Cadwalader avoided a punitive executive order but the accord has left the firm in turmoil  —  Cadwalader, Wickersham & Taft struck a deal with President Trump last month intended to secure the future of New York's oldest law firm.",
    "url": "https://www.wsj.com/us-news/law/venerable-new-york-firm-that-struck-a-deal-with-trump-is-losing-lawyers-10a87928"
  },
  {
    "text": "Johnson targets smaller tax package with $1.5T in spending cuts  —  Speaker Mike Johnson told House Republicans behind closed doors Thursday that he is pursuing $1.5 trillion in spending cuts as part of the GOP's party-line megabill, resulting in a smaller tax cuts package of $4 trillion.",
    "url": "https://www.politico.com/live-updates/2025/05/08/congress/johnson-targets-small-tax-package-with-1-5t-in-spending-cuts-00336222"
  },
  {
    "text": "New Pope Leo XIV Bashed Trump and JD Vance on Twitter Just Weeks Ago  —  YOU'RE WRONG!  —  The very online new pope has made his feelings about MAGA's top two figures clear.  —  Pope Leo XIV called out Vice President J.D. Vance in a social media post just weeks ago bluntly calling him … ",
    "url": "https://www.thedailybeast.com/new-pope-leo-xiv-bashed-jd-vance-on-twitter-just-weeks-ago/"
  },
  {
    "text": "West Point Is Supposed to Educate, Not Indoctrinate  —  It turned out to be easy to undermine West Point.  All it took was an executive order from President Trump and a memo from Defense Secretary Pete Hegseth dictating what could and couldn't be taught in the military and its educational institutions.",
    "url": "https://www.nytimes.com/2025/05/08/opinion/west-point-trump-military.html?unlocked_article_code=1.Fk8.nAsH.FJBUeCyms015&smid=url-share"
  },
  {
    "text": "Democrats vote to reject Senate crypto bill  —  All Democrats and three Republicans — including Sens. Rand Paul of Kentucky and Josh Hawley of Missouri — voted against the effort.  —  Senate Democrats on Thursday voted down a procedural motion that would allow the upper chamber … ",
    "url": "https://www.politico.com/news/2025/05/08/cryptocurrency-legislation-senate-vote-00336381"
  },
  {
    "text": "FBI opens formal criminal probe into New York AG Letitia James over alleged mortgage fraud  —  The FBI and US Attorney's Office in Albany have launched a criminal investigation into mortgage fraud claims against New York Attorney General Letitia James, a source familiar with the probe told The Post.",
    "url": "https://nypost.com/2025/05/08/us-news/fbi-opens-formal-criminal-probe-into-new-york-ag-letitia-james-over-alleged-mortgage-fraud/"
  },
  {
    "text": "A Subpoena for the White House?  —  On April 16, I wrote to you about a hearing in the Kilmar Abrego Garcia case, which is before U.S. District Judge Paula Xinis in Maryland.  At that time, she characterized the steps the government had taken to facilitate his return to the U.S. following … ",
    "url": "https://joycevance.substack.com/p/a-subpoena-for-the-white-house"
  },
  {
    "text": "Our Reporters' Notes on the May 7 Hearing in the J.G.G. Case  —  The judge seemed receptive to a class action on behalf of aliens sent to CECOT under President Trump's Alien Enemies Act proclamation.  —  annabower.bsky.social  —  rparloff.bsky.social  —  Meet The Authors",
    "url": "https://www.lawfaremedia.org/article/our-reporters--notes-on-the-may-7-hearing-in-the-j.g.g.-case"
  },
  {
    "text": "Trump to end spending on Biden-era digital equity law, calling it ‘racist and illegal’  —  President Trump said he is ending the Biden-era Digital Equity Act, intended to provide digital service to lower-income communities, to save the country billions of dollars.",
    "url": "https://www.washingtontimes.com/news/2025/may/8/trump-end-spending-biden-era-digital-equity-law-calling-racist/"
  },
  {
    "text": "Evening Roundup,  —  History was made today with the announcement of a new pope.  “Robert Francis Prevost, became the first American pope, taking the name Pope Leo XIV.  He was not considered a favorite...any American would be a long shot to become pontiff,” the New York Times reports.",
    "url": "https://contrarian.substack.com/p/evening-roundup-may-8"
  },
  {
    "text": "No One Has Ever Defeated Autocracy From the Sidelines  —  How will Americans know when we have lost our democracy?  —  Authoritarianism is harder to recognize than it used to be.  Most 21st-century autocrats are elected.  Rather than violently suppress opposition like Castro or Pinochet … ",
    "url": "https://www.nytimes.com/2025/05/08/opinion/trump-authoritarianism-democracy.html?unlocked_article_code=1.Fk8.HXmB.7gtBkcPbV4MG&smid=nytcore-ios-share&referringSource=articleShare&fbclid=IwY2xjawKJgTJleHRuA2FlbQIxMQBicmlkETFZUnNOZW9XZTNxWmdjRWN0AR5zMy8heIXpuccJnFe0VwdOmB07evj4TgM9VsdXBNy6FjhUYx95EFu-WKClmA_aem_S9Uhow7IXURgnYpM3ZNluQ"
  },
  {
    "text": "A Day in the Live-Streamed Life of Donald Trump  —  America's TV-obsessed President has made his rambling Oval Office press gaggles the signature of his second term—chaotic, self-aggrandizing, random, and frequently nasty.  —  In Donald Trump's first term, he reinvented many things about how the job of President was done.",
    "url": "https://www.newyorker.com/news/letter-from-trumps-washington/a-day-in-the-live-streamed-life-of-donald-trump"
  },
  {
    "text": "The Brain Rot Cabinet  —  How right-wing Internet claims and muddled conspiracies are an integral part of the second Trump administration.  —  Last week, baffling many and delighting a few, HHS secretary Robert F. Kennedy Jr. declared during a Trump administration cabinet meeting that he's engaged … ",
    "url": "https://www.motherjones.com/politics/2025/05/trump-cabinet-conspiracies-missing-children-epstein/"
  },
  {
    "text": "Bill Gates accuses Elon Musk of ‘killing’ children with USAID cuts  —  Billionaire reopens feud with Tesla chief as he unveils plan to spend $200bn on philanthropy and close foundation in 2045  —  Unlock the White House Watch newsletter for free  —  Your guide to what Trump's second term means for Washington, business and the world",
    "url": "https://t.co/gW0HJfrL46"
  },
  {
    "text": "Why I Chose the University of Florida  —  Santa J. Ono explains why he's pursuing the University of Florida presidency.  —  The University of Florida is already one of the nation's premier public universities.  But it has the potential to be the very best.",
    "url": "https://www.insidehighered.com/opinion/views/2025/05/08/why-i-chose-university-florida-santa-ono-opinion"
  },
  {
    "text": "Federal purge guts infant death prevention campaign, alarming doctors  —  Doctors fear the potential impact of the Trump budget cuts, with the number of babies dying of SIDS or other unexpected causes already on the rise.  —  A decades-long campaign to prevent infants from dying in their sleep … ",
    "url": "https://www.washingtonpost.com/nation/2025/05/08/infant-death-sleep-program-cuts/"
  },
  {
    "text": "DHS Secretary Flouts SCOTUS Order, Says ‘No Scenario’ Where Abrego Garcia Comes Back  —  Kristi Noem said the deported Maryland man “will not be coming back” despite a court order, a claim that one Democratic senator called “incredibly chilling.”  —  WASHINGTON — Homeland Security Secretary Kristi Noem … ",
    "url": "https://www.huffpost.com/entry/kristi-noem-supreme-court-order-kilmar-abrego-garcia_n_681cd152e4b0a178bbffc98e"
  },
  {
    "text": "US Customs and Border Protection Quietly Revokes Protections for Pregnant Women and Infants  —  CBP's acting commissioner has rescinded four Biden-era policies that aimed to protect vulnerable people in the agency's custody, including mothers, infants, and the elderly.",
    "url": "https://www.wired.com/story/cbp-rescinds-policies-on-care-of-pregnant-women-infants/"
  }
]