[
  {
    "text": "Yet Another Mark Robinson Eye-Popper  —  Donald Trump's legal troubles have been out of the news lately, but they may be coming back in a major way.  Per CNN: … Remember back when it was going to be a tentpole of this race that Donald Trump is a felon?  Hey, you never know.  Happy Wednesday.",
    "url": "https://www.thebulwark.com/p/yet-another-mark-robinson-eye-popper"
  },
  {
    "text": "Republicans' Electoral College Edge, Once Seen as Ironclad, Looks to Be Fading  —  A review of the evidence that Donald Trump's advantage relative to the national popular vote has declined significantly.  —  Ever since Donald J. Trump's stunning victory in 2016 — when he lost the popular vote … ",
    "url": "https://www.nytimes.com/2024/09/25/upshot/trump-electoral-college-harris.html"
  },
  {
    "text": "Donald Trump's Sexual Assault Accusers Tell Their Stories in Chilling New Ads (Exclusive)  —  Ads launching on Wednesday, Sept. 25, feature two of the presidential nominee's accusers, including former PEOPLE reporter Natasha Stoynoff  —  George Conway, the ex-husband of former Donald Trump … ",
    "url": "https://people.com/donald-trump-sexual-assault-accuser-ads-8717764"
  },
  {
    "text": "‘I Tried to Push Him, He Kept Coming Back At Me’: Trump's Sexual Assault Accusers Speak Out in Chilling 2024 Election Ad  —  Former President Donald Trump declared this week that he would be a “protector” of women.  In a pair of campaign ads, two women described how the ex-president sexually assaulted them.",
    "url": "https://www.mediaite.com/trump/i-tried-to-push-him-he-kept-coming-back-at-me-trumps-sexual-assault-accusers-speak-out-in-chilling-2024-election-ad/"
  },
  {
    "text": "Biden insists he would have beaten “loser” Trump … - Polling after Biden's shaky June debate performance — before he suspended his campaign — also showed that the majority of voters believed that the Democratic Party would perform better with a different candidate atop the ticket.",
    "url": "https://www.axios.com/2024/09/25/biden-trump-view-2024-democrats-republicans"
  },
  {
    "text": "Kamala Harris Announces First Solo Network Interview Since Democratic Nomination  —  will be interviewed by Stephanie Ruhle in Pittsburgh Wednesday night, in what will be her first one-on-one network interview since becoming the Democratic nominee.  —  The interview will air on",
    "url": "https://www.newsweek.com/kamala-harris-msnbc-solo-interview-stephanie-ruhle-1959118"
  },
  {
    "text": "Nice Little Jewish Community You Have Here  —  Donald Trump's former longtime adviser Michael Cohen has said of the ex-president, whom he has likened to a Mob boss: “He speaks in code.”  Trump used the code last week to send a warning to American Jews.  “If I don't win this election,” … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/trump-threat-to-american-jews-election/680023/?gift=Ut5zkH9vG00uzi0vmoT5fzD7bU8UVneQ1g_2ZcxCb1U&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "‘He should be doing better’: Even some Trump allies see him veering off course  —  While polls show an incredibly close race, some of Trump's allies are concerned about his lack of focus.  —  Donald Trump was meeting privately in mid-September with one of his oldest friends, Steve Wynn … ",
    "url": "https://www.politico.com/news/2024/09/25/trump-allies-warnings-00180869"
  },
  {
    "text": "Ocasio-Cortez Says Adams Should Resign ‘for the Good of the City’  —  Representative Alexandria Ocasio-Cortez became the most prominent elected official to call for Mayor Eric Adams to no longer lead New York City.  —  Representative Alexandria Ocasio-Cortez of New York on Wednesday … ",
    "url": "https://www.nytimes.com/2024/09/25/nyregion/aoc-eric-adams-resign.html"
  },
  {
    "text": "Trump's Hateful New Rants at Rally Are Harshly Debunked by Town Leader  —  They are taking from us.  At bottom, that's a key message that Donald Trump and his partner in slime, J.D. Vance, are running on when they falsely attack immigrants for eating pets, spreading diseases … ",
    "url": "https://newrepublic.com/article/186331/trump-hateful-rally-pennsylvania-debunked-town-leader"
  },
  {
    "text": "Secret Service agent under investigation for alleged sex assault on Harris aide … The U.S. Secret Service is investigating allegations that one of its agents sexually assaulted a female staff member of the office of Vice President Kamala Harris, the agency confirmed Wednesday.",
    "url": "https://www.cnbc.com/2024/09/25/secret-service-agent-investigated-for-sex-assault-harris-campaign-aide.html"
  },
  {
    "text": "Neo-Nazi Telegram Users Panic Amid Crackdown and Arrest of Alleged Leaders of Online Extremist Group  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  This story is part of a collaboration between FRONTLINE … ",
    "url": "https://www.propublica.org/article/telegram-terrorgram-collective-extremism-accelerationists-dallas-humber-matthew-allison"
  },
  {
    "text": "Donald Trump and Bernie Moreno rage at “crazy” female voters who refuse to fall in line  —  MAGA candidates can't hide their irritation that women are allowed to think for themselves  —  As Steve Kornacki of NBC News explained Monday, the polling gender gap between Vice President Kamala Harris and Donald Trump is “off the charts.”",
    "url": "https://www.salon.com/2024/09/25/donald-and-bernie-moreno-rage-at-crazy-female-refuse-to-fall-in-line/"
  },
  {
    "text": "Fox News does not have an independent decision desk  —  The 2020 cycle shows that network executives can overrule its calls  —  Fox News depicts the “decision desk” that calls elections for the network as an independent, data-driven body cordoned off from its right-wing propaganda machine.",
    "url": "https://www.mediamatters.org/fox-news/fox-news-does-not-have-independent-decision-desk"
  },
  {
    "text": "Judge to approve auctions liquidating Alex Jones' Infowars to help pay Sandy Hook families  —  Conspiracy theorist Alex Jones ' Infowars media platform and its assets will be sold off piece by piece in auctions this fall to help pay the more than $1 billion he owes relatives of victims … ",
    "url": "https://apnews.com/article/alex-jones-infowars-bankruptcy-sandy-hook-shooting-9052caad16dcdfd3bff0697454394d9f"
  },
  {
    "text": "Independent Challenger Overtakes Nebraska's Republican Senator in New Poll, Drops Scathing New Ad  —  Independent candidate Dan Osborn's run to oust Nebraska Sen. Deb Fischer (R-NE) this November has grabbed national attention as polls have shown a surprisingly close race … ",
    "url": "https://www.mediaite.com/politics/independent-challenger-overtakes-nebraskas-republican-senator-in-new-poll-drops-scathing-new-ad/"
  },
  {
    "text": "Why Mark Zuckerberg thinks AR glasses will replace your phone  —  Meta's CEO on his first pair of AR glasses, partnering with Ray-Ban, why he's done with politics, and more. … We have a very special episode of Decoder today.  It's become a tradition every fall to have Verge deputy editor … ",
    "url": "https://www.theverge.com/24253481/meta-ceo-mark-zuckerberg-ar-glasses-orion-ray-bans-ai-decoder-interview"
  },
  {
    "text": "Trump makes last-minute push for alternative stopgap with voting provisions  —  Former President Trump is making a last-minute push for House Republicans to adopt a short-term government funding package that includes language pertaining to voting, multiple sources told The Hill.",
    "url": "https://thehill.com/homenews/house/4898953-trump-stopgap-funding-voting/"
  },
  {
    "text": "Donald Trump Cut Ties to Some Online Fund-Raisers  —  The campaign also reduced the commission retained by the remaining vendors, as the former president falls behind Vice President Kamala Harris in the cash race.  —  Former President Donald J. Trump's campaign cut ties late last week … ",
    "url": "https://www.nytimes.com/2024/09/25/us/politics/trump-online-fund-raisers.html"
  },
  {
    "text": "Trump's Most Misunderstood Policy Proposal  —  Donald Trump's proposal to impose tariffs as high as 60 percent on imports from China, and a global tariff of 10 to 20 percent, takes the right approach to addressing globalization's failures—but it has drawn resounding mockery from economists, and, in turn, from the mainstream media.",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/economic-arguments-tariffs-trump/680015/"
  },
  {
    "text": "Democrats introduce ObamaCare tax credit extension bill, setting up fight with GOP  —  Congressional Democrats on Wednesday introduced a bicameral bill to extend enhanced subsidies that help make the Affordable Care Act's (ACA) insurance plans cheaper, the official opening shot in what will likely be the next major fight over the law.",
    "url": "https://thehill.com/policy/healthcare/4899297-democrats-obamacare-tax-credit-extension-bill/"
  },
  {
    "text": "Criminalizing Pregnancy: A Record Number of Women Were Prosecuted the Year After Dobbs  —  One night in March of 2023, Amari Marsh went to the bathroom and suffered a miscarriage.  “I screamed because I was scared, because I didn't know what was going on,” she recently recalled.",
    "url": "https://www.motherjones.com/politics/2024/09/criminalizing-pregnancy-a-record-number-of-pregnant-women-were-prosecuted-the-year-after-dobbs/"
  },
  {
    "text": "Why News Outlets Are Sitting on Hacked Trump Documents  —  The pilfered VP-vetting materials failed the “newsworthy” test, says New York Times editor Joseph Kahn.  Politico and The Washington Post also passed on publishing docs from the breach, which—as Popular Information revealed Tuesday … ",
    "url": "https://www.vanityfair.com/news/story/donald-trump-hack-news-outlets"
  },
  {
    "text": "What does 21st century infrastructure look like in your community?  —  Good afternoon from clouded Washington, where I am watching the role artificial intelligence is playing in this weird, intense, and accelerating election season.  —  If the 2016 presidential race brought “fake news” … ",
    "url": "https://civic-texts.ghost.io/what-does-21st-century-infrastructure-look-like-in-your-community/"
  },
  {
    "text": "Nothing to See Here, Just a Man of the People Hangin' With the Soroses  —  Who in the world thought this would make a great photo op for Tim Walz?  —  Besides Donald Trump, that is?  —  Frankly, I'm surprised this is still up after a few hours.  Twitchy picked up Alex Soros' weird photo op overnight … ",
    "url": "https://hotair.com/ed-morrissey/2024/09/25/nothing-to-see-here-just-a-man-of-the-people-hangin-with-the-soroses-n3794977"
  },
  {
    "text": "Kushner's Fund Has Reaped Millions in Fees, but So Far Returned No Profits  —  The son-in-law of former President Donald J. Trump has said he has intentionally moved slowly to invest investors' money, which came primarily from foreign entities.  —  The private equity firm run by Jared Kushner … ",
    "url": "https://www.nytimes.com/2024/09/25/us/politics/kushner-private-equity-saudi-arabia.html?unlocked_article_code=1.NU4.kINz.9m-MSRhU8pu6&smid=url-share"
  },
  {
    "text": "Republicans Have A Nazi Problem  —  The problem is that they're brimming with Nazis  —  Left intellectuals have argued in circles for years over whether it's academically valid to call Trump and his Republican devotees fascist.  —  The debate has mostly pitted practical thinkers … ",
    "url": "https://www.offmessage.net/p/republicans-have-a-nazi-problem"
  },
  {
    "text": "Trump Calls On Apple to Decrypt Phones of Would-Be Assassins … The former president said that the FBI had been unable to access “three potentially foreign-based apps” on the phone of Thomas Matthew Crooks, the Pennsylvania man who shot at and grazed Trump's ear during a rally in July.",
    "url": "https://www.bloomberg.com/news/articles/2024-09-25/trump-calls-on-apple-to-decrypt-phones-of-would-be-assassins"
  },
  {
    "text": "Hillary Clinton: To err is human, to empathize is superhuman  —  Is there any way to drain the fever swamps so we can stand together on firmer, higher ground? … Like anyone who is trying to understand how normal people get drawn into a life of hate and violence, I went for a canoe ride.",
    "url": "https://www.washingtonpost.com/opinions/2024/09/25/hillary-clinton-book-extremism-empathy/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3MjM2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI4NjE5MTk5LCJpYXQiOjE3MjcyMzY4MDAsImp0aSI6IjllOTY2MzQyLTNlMDUtNDFjNi1iMzUyLTA3MWMxZjQ5MGZmNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzA5LzI1L2hpbGxhcnktY2xpbnRvbi1ib29rLWV4dHJlbWlzbS1lbXBhdGh5LyJ9.OhEN551TsHtmE67uz-A23Tx2i57BOw_EhWMAz2gil5s&itid=gfta"
  },
  {
    "text": "It is so much nicer being a woman in Trump's world  —  Donald Trump is protecting you. … — Donald Trump, at a campaign rally in Pennsylvania on Monday  —  It is so much nicer being a woman, now that Donald Trump is in charge!  —  You barely remember the Biden times at all, except in nightmares.",
    "url": "https://www.washingtonpost.com/opinions/2024/09/25/trump-abortion-policy-women-support-satire/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3MjM2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI4NjE5MTk5LCJpYXQiOjE3MjcyMzY4MDAsImp0aSI6IjFlYjNhZDMxLTUyM2ItNGIyZi1iN2QxLTM5Njc0Y2RlZGVmYSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzA5LzI1L3RydW1wLWFib3J0aW9uLXBvbGljeS13b21lbi1zdXBwb3J0LXNhdGlyZS8ifQ.SD-msG17hyNOzv2TR32yo97ykN8XmUOlHI0ZiLr1EPE&itid=gfta"
  }
]