[
  {
    "text": "Harris paints Trump as threat, draws contrast with Biden in testy Fox News interview  —  Trump is “unfit to serve,” Harris said.  —  Vice President and current Democratic presidential candidate Kamala Harris attends a rally in Bucks County, Pa., Oct. 16, 2024.",
    "url": "https://abcnews.go.com/Politics/harris-paints-trump-national-threat-testy-fox-news/story?id=114869202"
  },
  {
    "text": "Election 2024 live updates: Harris spars with Bret Baier in testy Fox News interview; Trump holds town hall in Miami  —  Donald Trump's town hall in Miami will broadcast tonight on Univision, while Kamala Harris' interview with Fox News aired this evening.",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/trump-harris-election-live-updates-rcna175179#rcrd60353"
  },
  {
    "text": "Fox anchor tasked with interviewing Harris has a history of appeasing network's pro-Trump audience  —  New York CNN  —  Fox News anchor Bret Baier is all too keenly aware that Fox's viewers want him to affirm what they already feel.  —  This week, he is under pressure as he prepares … ",
    "url": "https://www.cnn.com/2024/10/16/media/fox-bret-baier-kamala-harris-interview/"
  },
  {
    "text": "MAGA host says friends are ‘moving to foreign countries’ if Kamala Harris beats Trump  —  Pro-MAGA TV host Gina Loudon revealed that her friends are “moving to a foreign country” if Vice President Kamala Harris wins her bid for the White House.  —  Loudon made the admission during a Wednesday broadcast on Real America's Voice.",
    "url": "https://www.rawstory.com/trump-fans-moving-if-harris-wins/"
  },
  {
    "text": "Harris Calls Out Trump For Spending Millions On Anti-Trans Ads  —  The vice president told Fox News that she will “follow the law” on providing gender-affirming care to people in prison.  —  LOADING  —  Vice President Kamala Harris did not reverse or recant her position … ",
    "url": "https://www.huffpost.com/entry/kamala-harris-calls-out-trump-for-spending-millions-on-anti-trans-ads_n_67101e25e4b0907fa507e36a"
  },
  {
    "text": "Fox News did not disclose its all-women town hall with Trump was packed with his supporters  —  New York CNN  —  Fox News hosted an all-women town hall with former President Donald Trump, billed as an opportunity for female voters to ask the Republican candidate questions that matter to them.",
    "url": "https://www.cnn.com/2024/10/16/media/fox-news-women-town-hall-supporters/"
  },
  {
    "text": "Fact check: Trump makes at least 19 false claims in one-hour Fox town hall with women  —  Former President Donald Trump, who trails with women in recent national polls, participated in a Fox News town hall event on Tuesday in front of a female audience.  —  He told a bunch of lies.",
    "url": "https://www.cnn.com/2024/10/16/politics/fact-check-trump-false-claims-fox-townhall/"
  },
  {
    "text": "Asked if He Thinks Trump Lost in 2020, Vance Finally Gives an Answer: No  —  Senator JD Vance, former President Donald J. Trump's running mate, had spent weeks dodging questions about Mr. Trump's false claims he won the 2020 election.  —  Senator JD Vance of Ohio has been dogged by questions … ",
    "url": "https://www.nytimes.com/2024/10/16/us/politics/vance-trump-2020-election.html"
  },
  {
    "text": "JD Vance says Donald Trump did not lose the 2020 election  —  Trump's running mate had danced around the issue since being pressed on it in a debate over two weeks ago.  —  Republican vice-presidential nominee JD Vance asserted for the first time Wednesday that Donald Trump did not lose … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/16/vance-2020-election-answer/"
  },
  {
    "text": "New Georgia election rules passed by Trump-backed board are unconstitutional, judge rules  —  A judge in Georgia has struck down a slate of controversial new election rules passed by Donald Trump allies, including two that Democrats say would inject post-election “chaos” into the critical battleground state.",
    "url": "https://www.cnn.com/2024/10/16/politics/georgia-trump-election-rules-struck-down"
  },
  {
    "text": "Audience laughs at Donald Trump as he tries to explain why he can't speak coherently anymore  —  GOP presidential candidate Donald Trump has shown an inability to answer direct questions over the course of his 2024 campaign, often jumping from one subject to another - and to another and another and another … ",
    "url": "https://www.lgbtqnation.com/2024/10/audience-laughs-at-donald-trump-as-he-tries-to-explain-why-he-cant-speak-coherently-anymore/"
  },
  {
    "text": "Jack Smith Takes Up the Aid and Abet Theory Endorsed by Judge Amit Mehta in 2022  —  Back in February 2022, 32 months ago, think I was the only one who made much of Judge Amit Mehta's ruling that Trump might plausibly be on the hook for abetting the assaults of cops at the Capitol on January 6.",
    "url": "https://www.emptywheel.net/2024/10/16/jack-smith-takes-up-the-aid-and-abet-theory-endorsed-by-judge-amit-mehta-in-2022/"
  },
  {
    "text": "Pro-Trump dark money network tied to Elon Musk behind fake pro-Harris campaign scheme  —  An initiative called Progress 2028 that purports to be Kamala Harris' liberal counter to the conservative Heritage Foundation's Project 2025 is actually run by a dark money network supporting former President Donald Trump.",
    "url": "http://opensecrets.org/news/2024/10/pro-trump-dark-money-network-tied-to-elon-musk-behind-fake-pro-harris-campaign-scheme"
  },
  {
    "text": "Maddow's bombshell reporting: Trump trying to pay Stormy Daniels to be quiet again  —  Rachel Maddow breaks down her bombshell reporting on how Trump is once again trying to pay Stormy Daniels to be quiet.",
    "url": "https://www.msnbc.com/all-in/watch/maddow-s-bombshell-reporting-trump-trying-to-pay-stormy-daniels-to-be-quiet-again-221947973843"
  },
  {
    "text": "How Russian propaganda reaches and influences the U.S.  —  The fake whistleblower videos started popping up last fall, the work of a small but prolific Russian group that researchers call Storm-1516.  —  Much remains unknown about Storm-1516 — one prong of Russia's propaganda operation … ",
    "url": "https://www.nbcnews.com/specials/russian-disinformation-2024-election-storm-1516/index.html"
  },
  {
    "text": "GOP Senate candidate: Department of Education only created to help ‘little Black girls’  —  The Montana U.S. Senate race took a turn when controversial businessman Tim Sheehy said that the U.S. should eliminate the Department of Education because it was turning children into slaves.",
    "url": "https://www.rawstory.com/tim-sheehy-education/"
  },
  {
    "text": "Elon Musk has given $75 million, so far, to put Donald Trump back in the White House  —  Elon Musk is now a Republican mega-donor.  —  Musk, estimated to be the world's richest person, was the sole donor to the political action committee he created, America PAC, a group that spent … ",
    "url": "https://www.npr.org/2024/10/16/g-s1-28591/elon-musk-donald-trump-america-pac-fec"
  },
  {
    "text": "JD Vance Adviser Posted on Reddit for Years About Use of Cocaine, ‘Gas Station Heroin,’ Other Drugs  —  Aaron Kofsky, JD Vance's financial policy adviser, called Vance “a Trump boot licker” and instructed users on how to transport drugs through TSA in the posts.  “Coke then opiates is always my go-to,” he wrote.",
    "url": "https://www.wired.com/story/jd-vance-adviser-posted-drug-use-reddit-cocaine-gas-station-heroin/"
  },
  {
    "text": "I'm an Undecided Hobbit, Torn Between a Dark Lord Who Promises an Age of Chaos and an Elf Queen Whom I Just Wish I Knew More About  —  I'm a well-informed Hobbit—a Boffin from Overhill, thank you very much—who is in a kerfuffle about whom to throw my Hobbit-sized support behind.",
    "url": "https://www.mcsweeneys.net/articles/im-an-undecided-hobbit-torn-between-a-dark-lord-who-promises-an-age-of-chaos-and-an-elf-queen-whom-i-just-wish-i-knew-more-about"
  },
  {
    "text": "You should be using an RSS reader (permalink)  —  No matter how hard we all wish it were otherwise, the sad fact is that there aren't really individual solutions to systemic problems.  For example: your personal diligence in recycling will have no meaningful impact on the climate emergency.",
    "url": "https://pluralistic.net/2024/10/16/keep-it-really-simple-stupid/#read-receipts-are-you-kidding-me-seriously-fuck-that-noise"
  },
  {
    "text": "Trump Super-PAC Sent Out Bogus Medicare Cancellation Notice to Scare Voters About Kamala Harris  —  In Arizona, older people recently received a mailer declaring Medicare had been cancelled.  It had a big red stamp that proclaimed, “Medicare Cancellation Notice.”",
    "url": "https://www.motherjones.com/politics/2024/10/trump-super-pac-maga-inc-sent-out-bogus-medicare-cancellation-notices-arizona/"
  },
  {
    "text": "America revolted against Tostitos and Ruffles.  Now they're making big changes  —  New York CNN  —  PepsiCo is unshrinking shrinkflation.  —  The owner of Lay's, Doritos, Tostitos and Ruffles chips will put more chips in some bags to claw back customers tired of higher prices with skimpier bags.",
    "url": "https://www.cnn.com/2024/10/16/business/tostitos-chips-shrinkflation-pepsi/"
  }
]