[
  {
    "text": "The GOP's revenge plot against Pelosi is unhinged — but revealing  —  Because Republicans are such firm believers in benevolence toward political foes, they are furious with Democrats for failing to save Kevin McCarthy.  After Democrats voted en masse this week to remove the California Republican … ",
    "url": "https://www.washingtonpost.com/opinions/2023/10/05/house-gop-speaker-jim-jordan-maga-trump-ukraine-aid/"
  },
  {
    "text": "Jim Jordan says he discussed speaker bid with Trump, wouldn't oust Gaetz from GOP caucus  —  “I talked to the president about this and all kinds of issues,” Jordan said in an interview with NBC News  —  WASHINGTON — Rep. Jim Jordan said Thursday he has spoken about his bid to be the next speaker … ",
    "url": "https://www.nbcnews.com/politics/congress/jim-jordan-says-discussed-speaker-bid-trump-wouldnt-oust-gaetz-gop-cau-rcna118981"
  },
  {
    "text": "Twitter Is at Death's Door, One Year After Elon Musk's Takeover  —  Since the tech tycoon took over the platform last October, he's done everything he can to run it into the ground … Following a $44 billion acquisition he tried to scuttle but was legally forced into closing … ",
    "url": "https://www.rollingstone.com/culture/culture-commentary/elon-musk-killed-twitter-one-year-1234840622/"
  },
  {
    "text": "US ad revenue at Musk's X declined each month since takeover -data  —  Monthly U.S. ad revenue at social media platform X has declined at least 55% year-over-year each month since billionaire Elon Musk bought the company formerly known as Twitter in October 2022, according to third-party data provided to Reuters.",
    "url": "https://www.reuters.com/technology/us-ad-revenue-musks-x-declined-each-month-since-takeover-data-2023-10-04/"
  },
  {
    "text": "Rep. Jared Moskowitz calls for Palm Beach County to tax Mar-a-Lago at rate Trump claims it's worth  —  Trump has claimed his Florida resort is worth as much as $1.5 billion, but the Palm Beach County property appraiser valued it far lower.  —  A Democratic House member is asking Palm Beach County … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/rep-jared-moskowitz-calls-palm-beach-county-tax-mar-lago-rate-trump-cl-rcna119042"
  },
  {
    "text": "Judge Tries to Stop Trump From Hiding His Money  —  Justice Arthur F. Engoron wants to make sure Trump doesn't shift around his assets to hide them from a judgment against the Trump Organization.  —  The judge who doomed Donald Trump's family business last week took an aggressive … ",
    "url": "https://www.thedailybeast.com/judge-tries-to-stop-trump-from-hiding-his-money"
  },
  {
    "text": "Georgia prosecutors seek trial testimony from top Trump adviser  —  Boris Epshteyn and two false electors are among six witnesses sought by DA Fani Willis for the Oct. 23 trial of two Trump co-defendants on election racketeering charges.  —  Georgia prosecutors intend to call Boris Epshteyn … ",
    "url": "https://www.politico.com/news/2023/10/05/trump-georgia-prosecutors-witness-list-00120152"
  },
  {
    "text": "GOP Senator Drops NSFW Claims About Matt Gaetz In Wild CNN Interview  —  Gaetz, in response, said the Oklahoma Republican is “coping with the death of” former House Speaker Kevin McCarthy's political career.  —  LOADING  —  Sen. Markwayne Mullin (R-Okla.) accused Rep. Matt Gaetz (R-Fla.) … ",
    "url": "https://www.huffpost.com/entry/markwayne-mullin-matt-gaetz-cnn-interview_n_651e2d17e4b0521d32377237"
  },
  {
    "text": "Biden administration waives 26 federal laws to allow border wall construction in South Texas  —  It marks the administration's first use of a sweeping executive power employed often during the Trump presidency.  —  McALLEN, Texas — The Biden administration announced on Wednesday … ",
    "url": "https://www.politico.com/news/2023/10/04/biden-administration-waives-26-federal-laws-to-allow-border-wall-construction-in-south-texas-00120045"
  },
  {
    "text": "Man with handgun seeking Gov. Tony Evers arrested at Wisconsin Capitol, returns later with assault rifle  —  The man, who was shirtless and had a holstered handgun, approached the governor's office on the first floor of the Capitol around 2 p.m. on Wednesday, officials said.",
    "url": "https://www.nbcnews.com/news/us-news/man-handgun-seeking-gov-tony-evers-arrested-wisconsin-capitol-returns-rcna119025"
  },
  {
    "text": "FBI arrests redheaded cosplayer dubbed 'Conan O'Riot' by Jan. 6 sleuths  —  Derek Nelson, a former U.S. Marine and Conan O'Brien lookalike, wore goggles and a respirator as rioters tried to breach the House floor during Capitol attack, the feds say.  —  WASHINGTON — An alleged Jan. 6 participant … ",
    "url": "https://www.nbcnews.com/politics/justice-department/fbi-arrests-redheaded-cosplayer-dubbed-conan-oriot-jan-6-sleuths-rcna118948"
  },
  {
    "text": "‘I was attacked and booed’: Gaetz whines about treatment after ousting McCarthy  —  After being on the receiving end of a chorus of boos from members of his own party while he was speaking on the House floor, Florida GOP Rep. Matt Gaetz sent out an email asking supporters to send him money.",
    "url": "https://www.rawstory.com/gaetz-mccarthy-2665805523/"
  },
  {
    "text": "Alabama gets new congressional map that could yield Democrats a second seat in the state  —  A federal court on Thursday approved a new congressional map in Alabama that significantly boosts the Black population of a second district and could represent a pickup opportunity for Democrats in next year's elections.",
    "url": "https://www.cnn.com/2023/10/05/politics/alabama-congressional-map-ruling/"
  },
  {
    "text": "U.S. Jet Shoots Down Turkish Drone Over Syria  —  Drone deemed a threat to U.S. forces in northeast Syria  —  WASHINGTON—A U.S. jet fighter shot down a Turkish drone Thursday after it was deemed a threat to U.S. forces in northeast Syria, a person familiar with the episode said.",
    "url": "https://www.wsj.com/world/u-s-jet-shoots-down-turkish-drone-over-syria-21634844?mod=followamazon"
  },
  {
    "text": "How Kevin McCarthy Set Up His Big Fail 14 Years Ago  —  The deposed House speaker saw a quick path to power.  It cost him in the end.  —  On April 15, 2009, Rep. Kevin McCarthy, the California Republican, brought Rep. John Boehner of Ohio, the leader of the House GOP caucus, to a rally in his home town of Bakersfield.",
    "url": "https://www.motherjones.com/politics/2023/10/how-kevin-mccarthy-tea-party-trump/"
  },
  {
    "text": "House GOP quietly panics over how to escape its self-inflicted mess  —  Expectations are at rock-bottom among House Republicans that their civil war will be resolved by the speaker vote on Wednesday, Axios has learned. … - Some moderates are threatening to tank any speaker if the rules … ",
    "url": "https://www.axios.com/2023/10/05/scalise-jordan-hern-speaker-vote-ukraine-rules"
  },
  {
    "text": "George Santos' Ex-Campaign Treasurer Will Plead Guilty to Felony, Prosecutors Say  —  The ex-campaign treasurer for U.S. Rep. George Santos will plead guilty on Thursday to an unspecified felony in connection with the sprawling federal investigation of financial irregularities surrounding … ",
    "url": "https://www.bloomberg.com/en/news/thp/2023-10-05/urgent-prosecutors-say-former-george-santos-campaign-treasurer-will-plead-guilty-to-unspecified-charge"
  },
  {
    "text": "Even some RNC members are fed up with ‘embarrassing,’ Trump-less debates  —  Top RNC officials aren't actively trying to court Trump to participate in future debates, as they did previously.  —  With Donald Trump boycotting and viewership falling off, some Republican National Committee members … ",
    "url": "https://www.politico.com/news/2023/10/05/trump-presidential-debates-rnc-future-00120012"
  }
]