[
  {
    "text": "USAID workers at Washington HQ told to stay home on Monday in unexpected, early-morning email  —  The main office of the US Agency for International Development in Washington was unexpectedly closed Monday and workers were emailed shortly after midnight that they should not come in … ",
    "url": "https://www.cnn.com/2025/02/03/politics/usaid-washington-workers/"
  },
  {
    "text": "Musk Says DOGE Halting Treasury Payments to US Contractors  — Musk Calls USAID ‘a criminal organization’ that should ‘die’  — Billionaire expanding his reach across government spending  —  Elon Musk said his “DOGE team” of government efficiency enforcers is shutting down payments … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-02/musk-says-doge-is-rapidly-shutting-down-treasury-payments?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczODUzOTUwMCwiZXhwIjoxNzM5MTQ0MzAwLCJhcnRpY2xlSWQiOiJTUjJTR1NUMEFGQjQwMCIsImJjb25uZWN0SWQiOiIxMjU5NzAwRUU5RUM0MDUzQjk4OEI4MUFEM0VEMkQ5RCJ9.5r9zjxbKYwabVG8kkG53W7ILZUFyIL4KFJsuG7zXsEA"
  },
  {
    "text": "The split personality of Big Journalism in covering this nightmare  —  On Friday, three reporters at the Washington Post broke a huge story.  It might have sounded like some kind of bureaucratic development inside the federal government, but it was much more important than that.",
    "url": "https://margaretsullivan.substack.com/p/the-split-personality-of-big-journalism"
  },
  {
    "text": "The Young, Inexperienced Engineers Aiding Elon Musk's Government Takeover  —  Engineers between 19 and 24, most linked to Musk's companies, are playing a key role as he seizes control of federal infrastructure.  —  Elon Musk's takeover of federal government infrastructure is ongoing … ",
    "url": "https://www.wired.com/story/elon-musk-government-young-engineers/"
  },
  {
    "text": "USAID staffers told to stay out of Washington headquarters after Musk said Trump agreed to close it  —  Staffers of the U.S. Agency for International Development were instructed to stay out of the agency's Washington headquarters on Monday, according to a notice distributed to them … ",
    "url": "https://apnews.com/article/trump-musk-usaid-c0c7799be0b2fa7cad4c806565985fe2"
  },
  {
    "text": "Trump Administration Closes USAID Headquarters  —  Monday closure comes as Elon Musk and DOGE are pushing to get rid of foreign-assistance agency  —  WASHINGTON—The U.S. Agency for International Development closed its headquarters to agency personnel on Monday following moves … ",
    "url": "https://www.wsj.com/politics/policy/trump-administration-shutters-usaid-headquarters-db3fac7e?st=DmHRG2&reflink=article_copyURL_share"
  },
  {
    "text": "Trump used fentanyl to justify tariffs, but the crisis was already easing  —  President Trump says illegal street fentanyl is one of the main justifications for sweeping trade tariffs he plans to impose against Canada, China and Mexico on Tuesday.  A statement issued by the White House describes … ",
    "url": "https://www.npr.org/2025/02/02/nx-s1-5283957/fentanyl-trump-tariffs-china-canada-mexico"
  },
  {
    "text": "Dow futures drop more than 450 points after Trump hits U.S. trading partners with tariffs: Live updates  —  Stock futures tumbled Sunday night to kick off a new trading month, as investors weighed new U.S. tariffs on goods from key trade partners and their potential impact on the economy and corporate profits.",
    "url": "https://www.cnbc.com/2025/02/02/stock-market-today-live-updates.html"
  },
  {
    "text": "Gabbard vote expected Tuesday  —  The Senate Intelligence Committee plans to vote on Tulsi Gabbard's nomination as the director of national intelligence during a closed session on Tuesday, according to two people familiar with the plans.  Razor's edge: Following a shaky performance … ",
    "url": "https://www.politico.com/live-updates/2025/02/03/congress/tulsi-gabbard-confirmation-vote-00202053"
  },
  {
    "text": "Primary Every Democrat  —  I spent almost a decade covering the United States Senate.  So, believe me when I tell you that I do not want to be a United States senator.  Imagine having a job where your mere existence in the role is a symbol of democratic backsliding, where your leaders torture … ",
    "url": "https://newrepublic.com/article/190922/primary-every-democrat-trump-durbin"
  },
  {
    "text": "Federal Workers Block Doors of Admin Building Over Elon Musk Data Breach  —  Nearly 100 Federal employees took part in a protest now into its second day of a takeover by Elon Musk surrogates of the high administration arm of the Federal government.  Photo: DCMediaGroup",
    "url": "https://dcmediagroup.us/2025/02/02/federal-workers-block-doors-of-admin-building-over-elon-musk-data-breach/"
  },
  {
    "text": "Musk associates given unfettered access to private data of government employees  —  Several of Elon Musk's associates installed at the Office of Personnel Management (OPM) have received unprecedented access to federal human resources databases containing sensitive personal information for millions of federal employees.",
    "url": "https://popular.info/p/musk-associates-given-unfettered"
  },
  {
    "text": "McConnell: Trump pardons a ‘mistake,’ Jan. 6 ‘an insurrection’  —  Former Senate Republican Leader Mitch McConnell (R-Ky.) said it was a “mistake” for President Trump to pardon individuals convicted of crimes connected to the attack on the Capitol on Jan. 6, 2021.",
    "url": "https://thehill.com/homenews/senate/5122585-trump-mcconnell-january-6-pardons/"
  },
  {
    "text": "Senator's ‘flatly unconstitutional’ proposal would lock in Republican control of chamber for years  —  A Republican senator is proposing an amendment to the state Constitution that would radically alter the structure of the Senate and effectively lock in Republican control of the chamber for the foreseeable future.",
    "url": "https://minnesotareformer.com/2025/02/03/gop-senators-flatly-unconstitutional-proposal-would-lock-in-republican-control-of-chamber-for-years/"
  },
  {
    "text": "Thousands rally in downtown Los Angeles, shut down 101 Freeway to protest Trump's immigration policies  —  Thousands of demonstrators rallied in downtown Los Angeles on Sunday and shut down a section of the 101 Freeway to protest President Trump's crackdown on illegal immigration and his aggressive deportation policies.",
    "url": "https://www.latimes.com/california/story/2025-02-02/thousands-of-protesters-rally-in-downtown-los-angeles-against-trump-deportation-policies"
  },
  {
    "text": "Alexandria Ocasio-Cortez Sounds ‘Five Alarm Fire’ Over Latest Elon Musk News  —  “This should not be a partisan issue,” said the New York Democrat.  —  LOADING  —  Rep. Alexandria Ocasio-Cortez (D-N.Y.) on Sunday slammed the Trump White House's reported placing on leave of two top security chiefs … ",
    "url": "https://www.huffpost.com/entry/alexandria-ocasio-cortez-five-alarm-fire_n_67a09574e4b0bef3e6d5754d"
  },
  {
    "text": "The GOP Still Has No Legislative Plan  —  Republicans agree on what they want broadly, but not on the details or how to get there.  Failure is not an option, and yet it may happen anyway.  —  House Speaker Mike Johnson (R-LA), with fellow Republicans, speaks during a news conference … ",
    "url": "https://prospect.org/politics/2025-02-03-gop-still-has-no-legislative-plan/"
  },
  {
    "text": "Exclusive: Trump's meme coin made nearly $100 million in trading fees, as small traders lost money  —  Entities behind President Donald Trump's crypto coin have accumulated close to $100 million in trading fees in less than two weeks, according to estimates from three blockchain analysis firms … ",
    "url": "https://www.reuters.com/markets/currencies/trumps-meme-coin-made-nearly-100-million-trading-fees-small-traders-lost-money-2025-02-03/"
  },
  {
    "text": "Follow the Money  —  Hey guys, I'm sending out Monday's Triad on Sunday night for reasons that will be clear when you read it.  So you won't get another Triad in your inbox on Monday—but keep your eyes on the Bulwark homepage, YouTube channel, and podcasts.  The team is doing great work making sense of the chaos monkeys.",
    "url": "https://www.thebulwark.com/p/follow-the-money-trump-musk-market-reaction-tariffs-canada-mexico-nyse-dow-sp500-treasury"
  }
]