[
  {
    "text": "Playbook: Inside NBC's McDaniel meltdown  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  SUDDENLY HE'S EVERYWHERE — “Big Republican Donor Jeff Yass Owned Shares in Trump Media Merger Partner,” by NYT's Matthew Goldstein: “JEFF YASS … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/03/25/inside-nbcs-mcdaniel-meltdown-00148769"
  },
  {
    "text": "‘Morning Joe’ Joins NBC Open Revolt Against Ronna McDaniel Hiring  —  ‘RECONSIDER’  —  NBC journos have been publicly blasting their own network for hiring the former RNC chair most infamous for her election denialism and Trump sycophancy.  —  The stars of MSNBC's Morning Joe kicked off Monday … ",
    "url": "https://www.thedailybeast.com/morning-joe-joins-nbc-open-revolt-against-ronna-mcdaniel-hiring"
  },
  {
    "text": "NBC's McDaniel mess threatens to explode  —  Network insiders are watching to see if more hosts and contributors speak out about the ex-RNC chair's hiring.  —  The uproar inside NBC over Ronna McDaniel's hiring spilled into Monday morning as more of the network's top personalities denounced … ",
    "url": "https://www.politico.com/news/2024/03/25/nbc-ronna-mcdaniel-chuck-todd-00148772"
  },
  {
    "text": "Ronna McDaniel quickly demonstrates that her view isn't worth the cost  —  There's not a lot of value for journalists in interviewing an echo.  Instead of standing inside a canyon trying to ask follow-up questions of the words bouncing off the walls around you, better to just go to the source.",
    "url": "https://www.washingtonpost.com/politics/2024/03/25/ronna-mcdaniel-nbc-trump/"
  },
  {
    "text": "‘Morning Joe’ hosts say Ronna McDaniel won't be guest after NBC hiring  —  The hosts of MSNBC's “Morning Joe” said Monday that former Republican National Committee Chair Ronna McDaniel — NBC News's new paid contributor — will not be asked to appear on their show as a guest … ",
    "url": "https://thehill.com/media/4553694-morning-joe-hosts-say-ronna-mcdaniel-wont-be-guest-after-nbc-hiring/"
  },
  {
    "text": "The secret to changing Trump's mind  —  On August 6, 2020, then-President Donald Trump issued an executive order “addressing the threat posed by TikTok,” the popular social network run by ByteDance, a Chinese company.  According to Trump's executive order, TikTok “automatically captures vast swaths … ",
    "url": "https://popular.info/p/the-secret-to-changing-trumps-mind"
  },
  {
    "text": "Big Republican Donor Jeff Yass Owned Shares in Trump Media Merger Partner  —  The billionaire Wall Street financier is also a major investor in ByteDance, the Chinese parent company of TikTok, which faces a possible ban in the United States.  —  Jeff Yass, the billionaire Wall Street financier … ",
    "url": "https://www.nytimes.com/2024/03/24/business/jeff-yass-shares-trump-media-merger.html"
  },
  {
    "text": "Newly released transcripts reveal a MAGA betrayal: Donald Trump never cared about Ashli Babbitt  —  Trump now hypes her as a January 6 martyr, but when he was told of Babbitt's death, there was “no, like, reaction”  —  Nine people died as a result of the Jan. 6, 2021 insurrection that Republicans pretend was a “normal tourist visit.”",
    "url": "https://www.salon.com/2024/03/25/newly-released-transcripts-reveal-a-maga-betrayal-donald-never-cared-about-ashli-babbitt/"
  },
  {
    "text": "The next Clarence Thomas?  Abortion pill case spotlights rightwing judge and his wife's shadowy connections  —  Judge James Ho ruled to restrict mifepristone.  His wife Allyson is linked to the anti-abortion group that brought the case  —  When the former president Donald Trump appointed … ",
    "url": "https://www.theguardian.com/world/2024/mar/25/judge-james-ho-wife-mifepristone-abortion-pill"
  },
  {
    "text": "Jim Jordan Gets Flustered As Simple Question Turns Awkward On ‘60 Minutes’  —  The Ohio lawmaker was asked about Donald Trump's debunked claims about the 2020 election.  —  LOADING  —  Rep. Jim Jordan (R-Ohio) seemed to have an uncomfortable moment on “60 Minutes” during Sunday night's segment on social media disinformation.",
    "url": "https://www.huffpost.com/entry/jim-jordan-awkward-60-minute_n_660112d2e4b0597501439bf9"
  },
  {
    "text": "UN Security Council resolution calls for Gaza ceasefire  —  The UN Security Council has passed a resolution calling for an “immediate ceasefire” in Gaza, after the US refrained from vetoing the measure in a change from its previous position.  —  The text also demands the immediate and unconditional release of all hostages.",
    "url": "https://www.bbc.com/news/world-middle-east-68658415"
  },
  {
    "text": "Live updates Hearing on new evidence in Trump N.Y. hush money case  —  New York Supreme Court Justice Juan Merchan began a hearing this morning about a late release of more than 100,000 pages of potential evidence in former president Donald Trump's trial over 2016 hush money payments.",
    "url": "https://www.washingtonpost.com/politics/2024/03/25/trump-new-york-hush-money-trial-hearing/"
  },
  {
    "text": "Joe Biden's Political Origin Story Is Almost Certainly Bogus.  It May Land Him In Legal Trouble.  —  For nearly two decades, President Joe Biden has told a story about why he devoted his life to politics.  He repeated the tale, at the risk of facing criminal charges for lying to a federal agent … ",
    "url": "https://freebeacon.com/biden-administration/joe-bidens-political-origin-story-is-almost-certainly-bogus-and-he-just-swore-to-it-under-oath/"
  },
  {
    "text": "Robert F. Kennedy Jr. flirts with the Libertarian nomination  —  The independent candidate has been in talks with the national party chair about pursuing the nomination.  —  Robert F. Kennedy Jr. is in talks to run on the Libertarian Party presidential ticket — a move that could translate … ",
    "url": "https://www.politico.com/news/2024/03/25/libertarian-candidate-president-robert-kennedy-jr-00148662"
  },
  {
    "text": "Forensic psychiatrist on physical signs of Trump's mental decline: “Changes in movement and gait”  —  “His walk appears wide-based,” Dr. Elizabeth Zoffman notes of Trump.  “He has developed a swing of his right leg.”  —  Donald Trump's obvious public challenges with speech, language, and thinking are continuing to get worse.",
    "url": "https://www.salon.com/2024/03/25/forensic-psychiatrist-on-physical-signs-of-mental-decline-changes-in-movement-and-gait/"
  },
  {
    "text": "Tammy Murphy will drop out of U.S. Senate race  —  Kim will run on lines that had gone to Murphy  —  Tammy Murphy will announce today that she is dropping out of the race for United States Senate, abruptly ending her campaign after four months, the New Jersey Globe has confirmed.",
    "url": "https://newjerseyglobe.com/congress/tammy-murphy-will-drop-out-of-u-s-senate-race/"
  }
]