[
  {
    "text": "Exclusive: Kamala Harris could join podcaster Joe Rogan for an interview - sources  —  Democratic presidential nominee Kamala Harris could sit down with popular podcaster Joe Rogan for an interview in the final stretch of the U.S. presidential campaign, three sources with knowledge of the matter said on Monday.",
    "url": "https://www.reuters.com/world/us/kamala-harris-could-join-podcaster-joe-rogan-an-interview-sources-2024-10-15/"
  },
  {
    "text": "Trump Is Big Mad That Fox News Is Interviewing Harris  —  After the network announced that the vice president would sit down for an interview, Trump raged on social media  —  REPUBLICAN PRESIDENTIAL NOMINEE Donald Trump, increasingly prone to temper tantrums and outbursts of violent rhetoric … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-mad-fox-news-harris-interview-1235133638/"
  },
  {
    "text": "Why I just endorsed Kamala Harris  —  Some conservatives reject Trump but cannot bring themselves to vote for the one candidate who could stop him.  I refuse to be one of them.  —  In Dante's “Inferno,” as I've previously written, moral cowards aren't even allowed into hell.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/wisconsin-republican-endorsing-kamala-harris-donald-trump-rcna175321"
  },
  {
    "text": "Harris campaign turns Trump's favorite weapon against him … - The campaign now uses those same tools to mock Trump and paint him in the opposite light. … - Another video, also posted Sunday, features one of Trump's rambling answers at an event, and the campaign labeled the former president “delulu” — Gen Z speak for “delusional.”",
    "url": "https://www.axios.com/2024/10/14/trump-harris-memes-social-media"
  },
  {
    "text": "Kamala Lays Smackdown On Trump, Crooked Press Ignores it  —  Harris calls Donald “weak and unstable”  —  Yesterday, Kamala Harris held a rally in the crucial swing state of North Carolina, not far from where I grew up.  The coliseum at East Carolina University was packed, the energy was electric, and the crowd was beyond deafening.",
    "url": "https://www.dworkinsubstack.com/p/kamala-lays-smackdown-on-trump-crooked"
  },
  {
    "text": "'That's You': Tim Walz Sounds the Alarm on Trump Threatening to Sic the Military on ‘The Enemy From Within’  —  Vice presidential candidate Tim Walz warned a crowd of supporters that former President Donald Trump was talking about them when denouncing “the enemy from within.”",
    "url": "https://www.mediaite.com/politics/thats-you-tim-walz-sounds-the-alarm-on-trump-threatening-to-sic-the-military-on-the-enemy-from-within/"
  },
  {
    "text": "CNN's Tapper, Youngkin spar over Trump's military remarks  —  CNN anchor Jake Tapper and Virginia Gov. Glenn Youngkin (R) got into a heated exchange Monday over recent comments former President Trump made about the U.S. military.  —  Trump suggested Sunday during an appearance on Fox News … ",
    "url": "https://thehill.com/homenews/media/4933376-jake-tapper-glenn-youngkin-donald-trump-military-comments/"
  },
  {
    "text": "Kamala Harris's Plagiarism Problem  —  The vice president appears to have airlifted sections of her book, Smart on Crime.  —  Kamala Harris has become famous, in part, for her unique rhetorical style.  She switches freely between various accents and peppers her speeches with catchphrases … ",
    "url": "https://christopherrufo.com/p/kamala-harriss-plagiarism-problem"
  },
  {
    "text": "Trump town hall derailed after medical emergencies in the crowd  —  What was supposed to be a Q&A with supporters was marred by fainting spells.  —  Republican presidential nominee former President Donald Trump gestures at a campaign town hall on Oct. 14, 2024, in Oaks, Pa., as South Dakota Gov. Kristi Noem watches.",
    "url": "https://abcnews.go.com/Politics/trump-town-hall-derailed-after-medical-emergencies-crowd/story?id=114796716"
  },
  {
    "text": "Cruz calls out McConnell-aligned group for not spending ‘a penny’ in Texas  —  Texas Sen. Ted Cruz (R) vented his frustration with the Senate Leadership Fund, a super PAC aligned with Senate Republican Leader Mitch McConnell (Ky.), for not spending any money in his competitive reelection race … ",
    "url": "https://thehill.com/homenews/senate/4932873-cruz-slf-mcconnell-senate-texas/"
  },
  {
    "text": "Business efforts to break the NLRB reach the Supreme Court  —  On Monday, a car supplier went to the U.S. Supreme Court, asking the court to block a National Labor Relations Board proceeding against the company from beginning on Tuesday — the highest-profile action yet in a growing effort … ",
    "url": "https://www.lawdork.com/p/nlrb-challenge-scotus-shadow-docket-yapp-usa"
  },
  {
    "text": "Trump sways and bops to music for 39 minutes in bizarre town hall episode  —  The scene comes as Vice President Kamala Harris has called Trump, 78, unstable and called into question his mental acuity.  —  OAKS, Pa. — The town hall, moderated by South Dakota Gov. Kristi L. Noem (R) … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/14/trump-music-sways-town-hall/"
  },
  {
    "text": "Suspect arrested after reports of threats toward FEMA operations in North Carolina  —  A North Carolina man was arrested over the weekend for allegedly threatening harm against FEMA employees responding to Hurricane Helene, according to the Rutherford County Sheriff's Office.",
    "url": "https://www.cnn.com/2024/10/14/us/fema-helene-north-carolina-reported-threats/"
  },
  {
    "text": "The Border Crisis Won't Be Solved at the Border  —  If Texas officials wanted to stop the arrival of undocumented immigrants, they could try to make it impossible for them to work here.  But that would devastate the state's economy.  So instead politicians engage in border theater.",
    "url": "https://www.texasmonthly.com/news-politics/border-crisis-texas-solutions/"
  },
  {
    "text": "Florida government finds fault with abortion ballot measure over ads and petitions  —  Florida's government is finding fault on multiple fronts with an abortion rights ballot measure that Gov. Ron DeSantis opposes.  —  This month, the state health department has been telling television stations … ",
    "url": "https://apnews.com/article/florida-abortion-ad-fraud-0c37fea6f71788e1c6b65c4488570e4d"
  },
  {
    "text": "NRA chief involved in gruesome cat killing as college fraternity member  —  Doug Hamlin pleaded no contest to animal cruelty over 1979 incident in which fraternity cat was tortured and killed  —  Douglas Hamlin, who was appointed to lead the NRA this summer in the wake of a long-running corruption scandal … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/14/nra-doug-hamlin-cat-killing"
  },
  {
    "text": "Massachusetts town issues cease and desist to resident projecting political signs on town water tower  —  The impending Cease and Desist order will impose a $100 per day fine until the activity stops  —  Join Fox News for access to this content  —  A resident of Hanson … ",
    "url": "https://www.foxnews.com/politics/massachusetts-town-issues-cease-desist-resident-projecting-political-signs-town-water-tower"
  },
  {
    "text": "University town becomes latest stiffed by Trump over campaign rally fees: report  —  Former President Donald Trump has yet again skipped the bill for a campaign rally, leaving the town that hosted it to foot the cost — this time the college town of St. Cloud, Minnesota.",
    "url": "https://www.rawstory.com/msn-uk/trump-st-cloud-fees/"
  },
  {
    "text": "Video captures worker's reaction when former president arrives at McDonald's in Georgia  —  An employee was in for quite the surprise when a president dropped by a McDonald's in Georgia over the weekend, only it wasn't the president she was thinking of.  —  “You Joe?",
    "url": "https://www.usatoday.com/story/news/nation/2024/10/14/bill-clinton-georgia-mcdonalds/75671642007/"
  },
  {
    "text": "D.C. Ready to Welcome China's Newest Ambassadors: Qing Bao and Bao Li the Giant Pandas  —  PANDAMONIUM  —  Leased from China for $1 million per year, two new giant pandas could bring a welcome reprieve to acrimonious relations between the U.S. and its adversary.",
    "url": "https://www.thedailybeast.com/china-sends-qing-bao-and-bao-li-two-new-panda-ambassadors-to-washington-dc-national-zoo"
  },
  {
    "text": "Republicans face backlash for lawsuits targeting overseas and military voting  —  House Democrats have asked Defense Secretary Lloyd Austin to guarantee that overseas Americans, including those serving in the armed forces, retain their right to participate in U.S. elections.",
    "url": "https://www.washingtonpost.com/politics/2024/10/14/republican-lawsuit-military-ballots-backlash/"
  },
  {
    "text": "2 men who were wounded when a gunman opened fire on Trump at rally say Secret Service failed them  —  Jim Copenhaver and David Dutch spoke for the first time publicly Monday in an exclusive interview with NBC News.  —  Two men who were shot when a gunman tried to assassinate former President Donald Trump … ",
    "url": "https://www.nbcnews.com/news/us-news/2-men-wounded-gunman-opened-fire-trump-rally-say-secret-service-failed-rcna173357"
  },
  {
    "text": "Trump's former Joint Chiefs chair: Trump is ‘fascist to the core’  —  “No one has ever been as dangerous to this country as Donald Trump,” retired Gen. Mark Milley said.  “Now I realize he's a total fascist.”  —  When Gen. Mark Milley retired last year, following more than four decades … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trumps-former-joint-chiefs-chair-trump-fascist-core-rcna175248"
  }
]