[
  {
    "text": "The Rage and Glee That Followed a C.E.O.'s Killing Should Ring All Alarms  —  It started barely minutes after the horrifying news broke that the chief executive of UnitedHealthcare, Brian Thompson, was fatally shot in midtown Manhattan.  Even before any details were available … ",
    "url": "https://www.nytimes.com/2024/12/06/opinion/united-health-care-ceo-shooting.html?unlocked_article_code=1.fk4.AaPM.urual_4V4Ud7&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Killing of insurance CEO reveals simmering anger at US health system  —  Mike Wendling in Chicago & Madeline Halpert in New York  —  The “brazen and targeted” killing of health insurance executive Brian Thompson, CEO of UnitedHealthcare, outside a New York hotel this week shocked America.",
    "url": "https://www.bbc.com/news/articles/cm2eeeep0npo"
  },
  {
    "text": "Slain UnitedHealth CEO faced ongoing court battles, threats  —  Common complaints against insurer denials were written on bullet casings found where Brian Thompson was killed.  —  Before UnitedHealthcare CEO Brian Thompson was gunned down in Midtown Manhattan this week … ",
    "url": "https://www.washingtonpost.com/nation/2024/12/06/unitedhealthcare-ceo-brian-thompson-threats-court-battles/"
  },
  {
    "text": "Democrats and Republicans in Congress worried that Gabbard might leak information to Syria  —  When she arrived in Congress, Tulsi Gabbard was seen as a rising Democratic star.  But over time, her views on Russia and Syria shocked, puzzled and alarmed her colleagues.",
    "url": "https://www.nbcnews.com/politics/national-security/democrats-republicans-congress-worried-gabbard-might-leak-information-rcna181316"
  },
  {
    "text": "Trump has an obsession with House members … - House members, by contrast, have to run for reelection every two years and are typically more in touch with the fanatically pro-Trump GOP base.  — “We know what people expect. … - Another two have served in the House … ",
    "url": "https://www.axios.com/2024/12/06/trump-cabinet-congress-house"
  },
  {
    "text": "The Musk Rat  —  A stark warning over Elon Musk's huge campaign contributions and his finger on the social media scales for Trump  —  The New York Times reported this morning that the world's richest man, Elon Musk, who owns Tesla, Space X and Twitter, spent a whopping $250 million to help elect Donald Trump.",
    "url": "https://statuskuo.substack.com/p/the-musk-rat"
  },
  {
    "text": "Plutocracies Thrive in Darkness  —  Elon Musk has been dubbed Donald Trump's “First Buddy” — a riff, I assume, on the title First Lady.  The moniker seems innocuous, almost cute.  It is anything but.  —  Musk now has unchecked access to Donald Trump.  He is a regular fixture at Trump's Florida estate, Mar-a-Lago.",
    "url": "https://steady.substack.com/p/plutocracies-thrive-in-darkness"
  },
  {
    "text": "Trump Still Faces 8 Civil Lawsuits Over the Jan. 6 Attack  —  Donald J. Trump has successfully defeated or impeded many legal challenges against him over the storming of the Capitol, but eight lawsuits on the matter remain in the courts.  —  There have been many efforts, over nearly four years … ",
    "url": "https://www.nytimes.com/2024/12/06/us/politics/trump-jan-6-civil-cases.html"
  },
  {
    "text": "South Korean President Yoon's impeachment vote fails after ruling party boycotts it  —  A South Korean legislative push to impeach President Yoon Suk Yeol over his short-lived imposition of martial law fell through on Saturday after most lawmakers from his conservative governing party boycotted the vote.",
    "url": "https://apnews.com/article/south-korea-politics-yoon-martial-law-impeachment-3f2a9190bf5cec83b49e2c6ad5cf5379"
  },
  {
    "text": "Iran Begins to Evacuate Military Officials and Personnel From Syria  —  The withdrawals by one of President Bashar al-Assad's key backers comes amid a resurgent rebel offensive.  —  Iran began to evacuate its military commanders and personnel from Syria on Friday, according to regional officials … ",
    "url": "https://www.nytimes.com/2024/12/06/world/middleeast/iran-syria-evacuation.html?unlocked_article_code=1.fk4.CWFS.VaNiRHsXBy1_&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "A big insurer backed off its plan to pay less for anesthesia.  That's bad.  —  Support independent journalism that matters — become a Vox Member today.  —  In November, the American Society of Anesthesiologists (ASA) issued a dire warning: One of America's largest insurance companies … ",
    "url": "https://www.vox.com/policy/390031/anthem-blue-cross-blue-shield-anesthesia-limits-insurance"
  },
  {
    "text": "Harris raised and spent twice as much as Trump in final days of 2024 election  —  WASHINGTON - Some Democrats are questioning how Kamala Harris' presidential campaign spent more than $1 billion but nonetheless lost to Donald Trump - and now they have more fodder as they continue with their post-election autopsies.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/12/06/harris-trump-final-campaign-spending-report/76460913007/"
  },
  {
    "text": "Far-right activists from Germany spent US election day at Trump's Mar-a-Lago  —  AfD parliamentary candidate and influencers posed for photos with now president-elect at his Florida home  —  As Donald Trump gathered his supporters, family and friends at Mar-a-Lago on US election day last month … ",
    "url": "https://www.theguardian.com/us-news/2024/dec/07/far-right-activists-from-germany-spent-us-election-day-at-trumps-mar-a-lago"
  },
  {
    "text": "How Alarmed Harris Staffers Went Rogue to Reach Black and Latino Voters  —  Worried that the campaign was neglecting voters of color in Philadelphia and other battleground cities, organizers secretly gathered at a Dunkin' Donuts and elsewhere to get out the vote.",
    "url": "https://www.nytimes.com/2024/12/07/us/politics/harris-philadelphia-black-latino-voters.html"
  },
  {
    "text": "Pam Bondi will face an ethics quagmire as attorney general  —  She and her firm have clients that have been doing legal battle with the U.S. government.  —  Over the past six years, Pam Bondi has worked as a Washington lobbyist for one of the top firms in the country, representing corporate behemoths such as Amazon and Uber.",
    "url": "https://www.politico.com/news/2024/12/07/pam-bondi-doj-ethics-00192890"
  },
  {
    "text": "Trump travels to Paris for Notre Dame Cathedral's reopening and to meet with Macron  —  PARIS — Donald Trump is off on his first international trip as president-elect, ready to join world leaders and dignitaries in Paris for a Saturday celebration of the renovation of Notre Dame Cathedral after a devastating fire in 2019.",
    "url": "https://www.npr.org/2024/12/07/g-s1-37279/trump-travel-paris-notre-dame-reopening-meet-macron"
  },
  {
    "text": "USDA requires bulk testing of raw milk supply for bird flu virus  —  The nation's milk supply must be tested for the bird flu virus H5N1 under a new order announced Friday by the U.S. Department of Agriculture (USDA).  —  The rules require unpasteurized milk samples from dairy farms … ",
    "url": "https://thehill.com/policy/healthcare/5026873-usda-mandatory-raw-milk-testing-bird-flu/"
  },
  {
    "text": "Biden and Trump spoke by phone last week  —  The previously unreported phone call marks the only known time Biden and Trump have spoken since the president-elect visited the White House last month.  —  President Joe Biden and President-elect Donald Trump spoke on the phone over the Thanksgiving holiday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/biden-trump-spoke-phone-call-rcna183272"
  },
  {
    "text": "How Childhood Tragedy Shaped the Doctor Trump Picked for Surgeon General  —  At the age of 13, Dr. Janette Nesheiwat said she accidentally knocked over a box in a darkened room.  A handgun went off, leaving her father dead.  —  Needing a pair of scissors, a 13-year-old girl went into the bedroom … ",
    "url": "https://www.nytimes.com/2024/12/06/nyregion/janette-nesheiwat-surgeon-general-shooting.html"
  },
  {
    "text": "Hegseth Brings His Nomination Back from the Brink  —  DONALD TRUMP WANTS HIS CABINET nominees to “earn” their confirmation on their own.  —  But on Friday, the president-elect went out of his way to give an attaboy to Pete Hegseth just hours after the defense secretary pick scolded reporters … ",
    "url": "https://www.thebulwark.com/p/hegseth-brings-his-nomination-back"
  },
  {
    "text": "How Trump's DOJ could severely curtail oversight of police  —  A new Justice Department investigation has revealed that officers in the Memphis Police Department use excessive force, discriminate against Black people and people with behavioral health disabilities, and engage in unlawful searches and arrests.",
    "url": "https://www.vox.com/politics/390158/memphis-police-justice-department-trump"
  },
  {
    "text": "Donald Trump says he thinks Pete Hegseth can get confirmed in NBC News interview  —  President-elect Donald Trump acknowledged “people were a little bit concerned” about Fox News host Pete Hegseth's nomination to run the Pentagon, but Trump said he maintains confidence in his pick.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-says-embattled-pentagon-pick-pete-hegseth-well-now-nbc-news-inte-rcna182856"
  },
  {
    "text": "Health insurers step up security, scrub websites of leadership information  —  The killing of UnitedHealthcare CEO Brian Thompson is spurring other major health companies to remove the photos of executives from their websites, close buildings and even switch to a virtual investor day rather than an in-person public event.",
    "url": "https://thehill.com/policy/healthcare/5027508-unitedhealthcare-ceo-killing-insurer-security/"
  },
  {
    "text": "Eric Adams Doesn't Rule Out Becoming a Republican Again  —  The Democratic mayor of New York City has embraced President-elect Donald J. Trump lately.  He was a registered Republican in the 1990s.  —  With his political future in doubt, Eric Adams, the Democratic mayor of New York City … ",
    "url": "https://www.nytimes.com/2024/12/06/nyregion/eric-adams-republican.html"
  },
  {
    "text": "UnitedHealth shooting stokes mourning and glee on social media  —  Jubilation among some users highlights scale of Americans' frustration over their health system  —  The killing on Wednesday of a top UnitedHealth Group executive unleashed a wave of commiseration, but also revelry … ",
    "url": "https://www.ft.com/content/79673e16-254f-4125-938b-b1d28683314f"
  },
  {
    "text": "The Silicon Valley Billionaires Steering Trump's Transition  —  The involvement of wealthy investors has made this presidential transition one of the most potentially conflict-ridden in modern history.  —  The week after the November election, President-elect Donald J. Trump gathered … ",
    "url": "https://www.nytimes.com/2024/12/06/us/politics/trump-elon-musk-silicon-valley.html"
  },
  {
    "text": "Military leaders are rattled by a list of ‘woke’ officers that a group urges Hegseth to fire  —  Military leaders are rattled by a list of “woke” senior officers that a conservative group urged Pete Hegseth to dismiss for promoting diversity in the ranks if he is confirmed to lead the Pentagon.",
    "url": "https://apnews.com/article/hegseth-trump-diversity-pentagon-list-602477b6e80641b53f4f9b640a14f4ce"
  },
  {
    "text": "Democrat Frost slams DOGE: Billionaires ‘cosplaying as government officials’  —  Rep. Maxwell Frost (D-Fla.) criticized President-elect Trump's choices to lead a new “Department of Government Efficiency” (DOGE) committee, saying it's “two billionaires who are cosplaying as government officials.”",
    "url": "https://thehill.com/homenews/administration/5026681-maxwell-frost-doge-musk-ramaswamy/"
  }
]