[
  {
    "text": "This Crew Is Totally Beatable  —  At the climax of the Republican National Convention last night, former President Donald Trump's nomination-acceptance speech was a disheveled mess, endless and boring.  He spoke for 93 minutes, the longest such speech on record.",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/donald-trump-republican-party-nomineee/679109/"
  },
  {
    "text": "Was That the Worst Convention Speech of All Time?  —  I hope that you were not, like me, required to watch Donald Trump's speech at the Republican National Convention on Thursday night (and into Friday morning), and were instead doing something more enjoyable: Going out with friends … ",
    "url": "https://jill.substack.com/p/was-that-the-worst-convention-speech"
  },
  {
    "text": "In the Blood  —  “That was some weird shit.”  So said George W. Bush after watching Donald Trump's inauguration speech in person in January 2017, and he might have said the same thing if he watched Trump give his 2024 convention speech in Milwaukee.  —  For days leading up to Trump's address … ",
    "url": "https://paulwaldman.substack.com/p/in-the-blood"
  },
  {
    "text": "Trump did something he's never done before with RNC speech.  Now, the election may already be over  —  I may be a Democrat, but I'm also a clear-eyed political analyst.  Donald Trump clearly rose to the occasion with his RNC speech  —  Donald Trump may well have sealed the outcome … ",
    "url": "https://www.foxnews.com/opinion/trump-did-something-hes-never-done-before-rnc-speech-now-election-may-already-over"
  },
  {
    "text": "Harris Struggles to Reassure Major Democratic Donors  —  On a call, Vice President Kamala Harris told about 300 donors that there was little to worry about.  Several listeners said they found the call to have little value.  —  Vice President Kamala Harris tried to buck … ",
    "url": "https://www.nytimes.com/2024/07/19/us/politics/kamala-harris-donors.html"
  },
  {
    "text": "Michael Moritz, Democratic Megadonor, Urges Biden Exit: ‘Clock Has Run Out’  —  Mr. Moritz became one of the party's top contributors to go public with his fears about the president's candidacy, saying that Mr. Biden had a choice: “vanity or virtue.”  —  Michael Moritz, the billionaire … ",
    "url": "https://www.nytimes.com/2024/07/19/us/politics/michael-moritz-biden.html"
  },
  {
    "text": "AOC Issues Dire Warning on Threats to Come if Biden Drops Out  —  On Instagram Live early Friday morning, Representative Alexandria Ocasio-Cortez discussed the ongoing debate over whether President Biden is fit to run for reelection.  —  Speaking for close to an hour, the New York progressive explained … ",
    "url": "https://newrepublic.com/post/184042/aoc-alexandria-ocasio-cortez-warning-biden-drop-out-instagram-live"
  },
  {
    "text": "Rep. Sean Casten: It's time for Joe Biden to pass the torch  —  Our country faces an existential threat this November.  —  On the one hand, we have Joe Biden.  A man who passed the biggest climate and infrastructure bills in our nation's history; expanded NATO; has overseen record-breaking economic growth … ",
    "url": "https://www.chicagotribune.com/2024/07/19/opinion-joe-biden-presidential-candidacy-pass-the-torch/"
  },
  {
    "text": "Biden's family starts discussing his exit plan from the 2024 race  —  The president's family members have discussed how he would want to end his re-election bid on his own timing and with a carefully calculated plan in place.  —  WASHINGTON — Members of President Joe Biden's family … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/bidens-family-starts-discussing-exit-plan-2024-race-rcna162658"
  },
  {
    "text": "Global cyber outage grounds flights, hits banks, telecoms, media  —  A software update wreaked havoc on computer systems globally on Friday, grounding flights, forcing some broadcasters off air and hitting services from banking to healthcare.  —  An update to a product offered … ",
    "url": "https://www.reuters.com/technology/global-cyber-outage-grounds-flights-hits-media-financial-telecoms-2024-07-19/"
  },
  {
    "text": "Fact Checking Donald Trump's RNC Speech  —  In his latest bid for reelection, Donald Trump delivered the longest nomination acceptance speech in US history, peppered with so many falsehoods that it's impossible to fact-check them all in a single article.  Perhaps that was the point.",
    "url": "https://www.qasimrashid.com/p/fact-checking-donald-trumps-rnc-speech"
  },
  {
    "text": "Leaked memo shows J.D. Vance's anti-woke ideology on foreign affairs  —  Trump's VP pick froze dozens of ambassador nominations over issues like gender transition care and diversity hiring, offering a glimpse into his anti-establishment views.  —  Before J.D. Vance became Donald Trump's pick … ",
    "url": "https://www.washingtonpost.com/elections/2024/07/19/jd-vance-leaked-memo-state-department/"
  },
  {
    "text": "George W. Bush's Attorney General Is Worried About Trump  —  Alberto Gonzales discusses the Supreme Court's ruling on presidential immunity — and the prospect of a second Trump administration with more vendettas and fewer guardrails.  —  As the onetime White House counsel … ",
    "url": "https://www.politico.com/news/magazine/2024/07/19/alberto-gonzales-interview-trump-00167350"
  },
  {
    "text": "Zuckerberg Calls Trump's Response to Shooting ‘Badass’  —  Meta CEO doesn't endorse Trump or Biden for president  —  Mark Zuckerberg said that former President Donald Trump's immediate reaction after being shot was “badass” and inspiring, and helps explain his appeal to voters.",
    "url": "https://www.bloomberg.com/news/articles/2024-07-19/mark-zuckerberg-calls-donald-trump-badass-without-endorsing-for-president"
  },
  {
    "text": "Foreign officials courted Trump allies at the Republican convention  —  A number of ambassadors from other countries came to Milwaukee to get ready for a second Trump administration.  —  MILWAUKEE — Top foreign officials courted Donald Trump's allies during the Republican National Convention … ",
    "url": "https://www.nbcnews.com/politics/2024-election/foreign-officials-courted-trump-allies-republican-convention-rcna161873"
  },
  {
    "text": "Behind the scenes as Joe Biden lost control of the Democratic Party  —  Many Democrats described the first three weeks of July as a kind of nightmare — too extraordinary to be real, too unexpected to be believed.  —  The president of the United States had spoken — with 24 million Americans watching on TV.",
    "url": "https://www.washingtonpost.com/politics/2024/07/19/biden-democrats-drop-out/"
  },
  {
    "text": "Treasury warns that anti-woke banking laws like Florida's are a national security risk  —  The Treasury Department is warning that state laws that restrict banks from considering environmental, social and governance factors could harm efforts to address money laundering and terrorism financing.",
    "url": "https://apnews.com/article/banking-esg-treasury-national-security-00984615e57dc14d72f04e6e61cc078b"
  }
]