[
  {
    "text": "Trump admin must seek return of another man who was improperly deported to El Salvador, judge rules  —  A Trump-appointed judge ruled that the administration deported a 20-year-old Venezuelan man last month in violation of a legally binding, court-approved settlement agreement.",
    "url": "https://www.politico.com/news/2025/04/24/trump-el-salvador-deportation-venezuelan-minor-judge-00307336"
  },
  {
    "text": "Trump's Tariffs Bump Into Reality as Economic Strategy Wavers  —  President Trump has said his punishing tariffs would force companies to build factories in the United States.  But it is far from clear that they will have the effects he predicted.  —  阅读.体中 … ",
    "url": "https://www.nytimes.com/2025/04/23/us/politics/trump-tariffs-economy.html"
  },
  {
    "text": "Hegseth had Signal messaging app installed on an office computer  —  The move was intended to circumvent a lack of cellphone service in much of the Pentagon and enable easier communication between Hegseth and other Trump officials, said people familiar with the matter.",
    "url": "https://www.washingtonpost.com/national-security/2025/04/23/hegseth-signal-pentagon-computer/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1MzgwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2NzYzMTk5LCJpYXQiOjE3NDUzODA4MDAsImp0aSI6IjYyMmY0OTNlLTk5ZDMtNDM0YS05Zjc2LTY0NmI0ZDcyY2NhOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA0LzIzL2hlZ3NldGgtc2lnbmFsLXBlbnRhZ29uLWNvbXB1dGVyLyJ9.A0seSxzj3gYpWQiU-qQMnb-Ho6c0B7D09djFMfTmh5M"
  },
  {
    "text": "Hegseth Set Up Signal on a Computer in His Pentagon Office  —  The app facilitated communications in a building where cell service is poor and personal phones are not allowed in some areas.  —  Defense Secretary Pete Hegseth had the commercial messaging app Signal set up on a computer … ",
    "url": "https://www.nytimes.com/2025/04/24/us/politics/hegseth-signal-pentagon.html"
  },
  {
    "text": "Hegseth orders makeup studio installed at Pentagon  —  Defense Secretary Pete Hegseth recently ordered modifications to a room next to the Pentagon press briefing room to retrofit it with a makeup studio that can be used to prepare for television appearances, multiple sources told CBS News.",
    "url": "https://www.cbsnews.com/news/hegseth-orders-makeup-studio-installed-pentagon/"
  },
  {
    "text": "Fox News Poll: The first 100 days of President Trump's second term  —  82% are extremely or very concerned about inflation, down from 89% in January  —  As Donald Trump approaches the 100th day of his second term, a Fox News survey finds voters pleased with the job he is doing on border security … ",
    "url": "https://www.foxnews.com/official-polls/fox-news-poll-first-100-days-president-trumps-second-term"
  },
  {
    "text": "Trump's Approval Rating Has Been Falling Steadily, Polling Average Shows  —  President Trump's approval rating has sunk to about 45 percent, down from 52 percent one week after he took office.  —  President Trump's job approval rating has fallen steadily during his first three months in office … ",
    "url": "https://www.nytimes.com/2025/04/23/us/politics/trump-approval-rating.html"
  },
  {
    "text": "Restoring Equality of Opportunity and Meritocracy  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  A bedrock principle of the United States is that all citizens are treated equally under the law.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/04/restoring-equality-of-opportunity-and-meritocracy/"
  },
  {
    "text": "Trump writes ‘Vladimir, STOP!’ after Russia launches deadliest strikes on Kyiv since last summer  —  US President Donald Trump said he is “not happy” after Russia launched its deadliest wave of attacks on Kyiv in nine months, telling President Vladimir Putin to “STOP!” as he attempts … ",
    "url": "https://cnn.com/2025/04/24/europe/russia-strikes-kyiv-trump-zelensky-crimea-intl-hnk/"
  },
  {
    "text": "The Untold Story of How Ed Martin Ghostwrote Online Attacks Against a Judge — and Still Became a Top Trump Prosecutor  —  Martin's career is dotted with ethical and professional questions, records show.  Some of the most serious ones about the interim U.S. attorney for D.C. have remained buried … ",
    "url": "https://www.propublica.org/article/ed-martin-trump-interim-dc-us-attorney-secret-judge-attacks"
  },
  {
    "text": "U.S. Texts Barnard Employees and Asks if They Are Jewish  —  A questionnaire from a federal commission also inquired about whether professors and other college staff members had been harassed.  —  The personal cellphones of dozens of current and former Barnard College employees pinged Monday evening … ",
    "url": "https://www.nytimes.com/2025/04/23/nyregion/barnard-faculty-eeoc-text-jewish.html"
  },
  {
    "text": "Illinois Lt. Gov. Juliana Stratton becomes the first to launch a bid for Dick Durbin's Senate seat  —  Stratton, who came into office alongside Gov. JB Pritzker in 2018, announced on Thursday she will seek Durbin's spot in the Senate.  —  CHICAGO — And the race is officially on.",
    "url": "https://www.nbcnews.com/politics/2026-election/illinois-lt-gov-juliana-stratton-first-run-dick-durbins-senate-seat-rcna202729?taid=680a2fc60c1f320001015ccb"
  },
  {
    "text": "Reforming Accreditation to Strengthen Higher Education  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  A group of higher education accreditors are the gatekeepers that decide … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/04/reforming-accreditation-to-strengthen-higher-education/"
  },
  {
    "text": "100 days of DOGE: lots of chaos, not so much efficiency  —  At the Social Security Administration, lawyers, statisticians and other high-ranking agency officials are being sent from the Baltimore headquarters to regional offices to replace veteran claims processors who have been fired or taken buyouts from the Trump administration.",
    "url": "https://www.reuters.com/world/us/100-days-doge-lots-chaos-not-so-much-efficiency-2025-04-24/"
  },
  {
    "text": "Fearing Trump's Visa Crackdown, College Students Race to Scrub Op-Eds  —  Campus newspapers confront ethics debates as international students try to remove their names and opinions from past articles  —  The Harvard Crimson, the student newspaper at one of America's most prominent universities … ",
    "url": "https://www.wsj.com/us-news/education/trump-student-visas-newspaper-op-eds-61595294?st=u4vaJe&reflink=mobilewebshare_permalink"
  },
  {
    "text": "The US Has Spent Over $500,000 on YouTube Ads to Discourage Irregular Migration  —  A WIRED investigation reveals that the US Department of Homeland Security has deployed at least 30 YouTube ads since April 1 to threaten irregular migrants with deportation and a ban on reentry.",
    "url": "https://www.wired.com/story/dhs-youtube-ads-mexico-migration/"
  },
  {
    "text": "Trump Is a Virus  —  Chaos is about to take its toll  —  Hammering out a few words before getting on the bike.  —  It has been amazing to watch the stock market gyrating in response to things that aren't even policy changes — they're hints and rumors of policy changes.",
    "url": "https://paulkrugman.substack.com/p/trump-is-a-virus"
  },
  {
    "text": "Trump to target ActBlue in presidential memorandum  —  The action is expected to come Thursday.  —  In a shot at ActBlue, the left's major online donation platform, President Donald Trump plans to sign a presidential memorandum on Thursday cracking down on foreign contributions in American elections … ",
    "url": "https://www.politico.com/news/2025/04/24/trump-to-target-actblue-in-presidential-memorandum-00307251"
  },
  {
    "text": "A Bomb Threat Targeted Student Protesters.  So Why Did They Get Blamed for It?  —  When a bomb threat coincided with a pro-Palestine student protest at Barnard College last month, the New York City Police Department arrested nine demonstrators.  By the next day, local and national media had picked up the story.",
    "url": "https://theintercept.com/2025/04/24/barnard-college-gaza-protests-bomb-threat/"
  },
  {
    "text": "Musk Goons Purged Living U.S. Citizens from Social Security  —  RESURRECTION DAY  —  Elon Musk and his DOGE foot soldiers effectively killed the financial lives of “countless” citizens through their database meddling.  —  What might be called Day of the Dead Living is being continually played … ",
    "url": "https://www.thedailybeast.com/doges-social-security-cuts-create-chaotic-day-of-the-dead-living/"
  },
  {
    "text": "High-Ranking Tren de Aragua Member in Custody on Terrorism and International Drug Distribution Charges  —  For Immediate Release  —  Case Marks First Instance of TdA Member Charged with Terrorism Related Crimes  —  A five-count superseding indictment has been unsealed today charging … ",
    "url": "https://www.justice.gov/opa/pr/high-ranking-tren-de-aragua-member-custody-terrorism-and-international-drug-distribution"
  },
  {
    "text": "How I Describe Myself Politically These Days  —  I struggle these days whenever someone asks me for my political affiliation.  But if you really force me, I'd describe myself as a “Waymo Democrat.”  Waymos are the self-driving electric taxis started by Google.",
    "url": "https://www.nytimes.com/2025/04/23/opinion/waymo-democrat-advanced-manufacturing.html"
  },
  {
    "text": "Runaway Tren  —  How a Colorado slumlord's psyop turned into a brand-new ‘forever war’ on Venezuela  —  Earlier this month, a middle-aged woman with shaggy, silvery hair and a pleasant smoker's contralto flew from Denver to Washington to testify before the House Judiciary Committee.",
    "url": "https://prospect.org/justice/2025-04-24-runaway-tren-de-aragua-colorado-housing-gangs/"
  },
  {
    "text": "The Real Lesson of SignalGate  —  A Surveillance Arms Race Has Poked a Gaping Hole in National Security  —  Ronald Deibert  —  In the weeks since the explosive revelation that top U.S. officials inadvertently shared attack plans in Yemen with a journalist on a Signal group chat … ",
    "url": "https://www.foreignaffairs.com/united-states/real-lesson-signalgate"
  },
  {
    "text": "Trump Offers Private Dinner to Top 220 Investors in His Memecoin  —  The offer, which caused President Trump's memecoin to surge in price, was his family's latest effort to profit from cryptocurrencies.  —  The flashy online announcement called it “the most EXCLUSIVE INVITATION in the World … ",
    "url": "https://www.nytimes.com/2025/04/23/technology/trump-private-dinner-crypto-memecoin.html?unlocked_article_code=1.B08.kUIm.MA2kymhX3fCb&smid=url-share"
  },
  {
    "text": "D.N.C. Will Send More Cash to Red States, Aiming to Strengthen Party's Reach  —  A 50-state program announced by the Democratic Party seeks to build on past efforts and help recruit candidates to take on Republicans in less-friendly terrain.  —  The Democratic National Committee is pledging … ",
    "url": "https://www.nytimes.com/2025/04/24/us/politics/democrats-fifty-state-strategy.html?unlocked_article_code=1.CE8.XIoT.jOMSqUGNNz0O&smid=url-share"
  },
  {
    "text": "White House Proposal Could Gut Climate Modeling the World Depends On  —  Over the past two months, the Trump administration has taken steps to eliminate regulations addressing climate change, pull back funding for climate programs and cancel methods used to evaluate how climate change is affecting American society and its economy.",
    "url": "https://www.propublica.org/article/trump-noaa-budget-cuts-climate-change-modeling-princeton-gfdl"
  },
  {
    "text": "In Defense of Everything-Bagel Liberalism  —  Critics warned that the Biden administration put so many conditions on the grants it offered to semiconductor manufacturers that the centerpiece of its industrial policy would fail.  Those conditions turned out to be key to the program's success.",
    "url": "https://washingtonmonthly.com/2025/04/24/in-defense-of-everything-bagel-liberalism/"
  }
]