[
  {
    "text": "Democratic Sen. Peter Welch: Biden should withdraw for the good of the country  —  The stakes this November could not be higher.  —  Peter Welch, a Democrat, represents Vermont in the U.S. Senate.  —  I have great respect for President Biden.  He saved our country from a tyrant.",
    "url": "https://www.washingtonpost.com/opinions/2024/07/10/welch-biden-withdraw/"
  },
  {
    "text": "Scoop: Schumer open to dumping Biden in 2024 … - Over the last 12 days, Schumer has been listening to donors' ideas and suggestions about the best way forward for the party, according to three people familiar with the matter.  — The majority leader is one of several Democrats … ",
    "url": "https://www.axios.com/2024/07/10/schumer-biden-dump-donors-2024-election"
  },
  {
    "text": "I Love Joe Biden.  But We Need a New Nominee.  —  I'm a lifelong Democrat; I make no apologies for that.  I'm proud of what my party represents and what it stands for.  As part of my participation in the democratic process and in support of my chosen candidate, I have led some of the biggest fund-raisers in my party's history.",
    "url": "https://www.nytimes.com/2024/07/10/opinion/joe-biden-democratic-nominee.html"
  },
  {
    "text": "Trump Is Planning for a Landslide Win  —  Sign up for The Decision, a newsletter featuring our 2024 election coverage.  —  The outcome of the presidential campaign, Republicans believed, was a fait accompli.  “Donald Trump was well on his way to a 320-electoral-vote win,” … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/trump-campain-election-2024-susie-wiles-chris-lacivita/678806/"
  },
  {
    "text": "C'mon, Man  —  Never underestimate the destructive power of a stubborn old narcissist with something to prove.  —  Ideally no one gets hurt along the way: Maybe grandpop refuses to give up his license, drives into an oak tree, and only the car gets totaled.  But sometimes there are casualties: Maybe a pedestrian gets hit.",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/biden-digging-in-presidential-race/678961/"
  },
  {
    "text": "Biden should provide evidence he can beat Trump, Democratic leaders say  —  The calls came as top union leaders, more lawmakers and even some campaign staff members expressed grave concerns about his candidacy.  —  Democratic leaders called on President Biden and his campaign Wednesday … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/10/biden-evidence-defeat-trump-drop-out/"
  },
  {
    "text": "Project 2025 Reported to IRS Over ‘Violations’  —  TikTokers are urging people to report the conservative think tank behind Project 2025 to the Internal Revenue Service for allegedly violating the rules of its tax-exempt status.  —  Project 2025 is spearheaded by The Heritage Foundation … ",
    "url": "https://www.newsweek.com/project-2025-reported-irs-1923145"
  },
  {
    "text": "A death knell for NATO: Project 2025 calls for Trump to “restructure” US foreign policy  —  The plan is for Donald Trump to “reset the nation's role in the world”  —  We haven't seen much of Donald Trump lately but he did poke his head up Tuesday to speak at a little rally he held at his Doral golf resort … ",
    "url": "https://www.salon.com/2024/07/10/a-knell-for-nato-project-2025-calls-for-to-restructure-us-foreign-policy/"
  },
  {
    "text": "Trump's ‘secretary of retribution’ has a ‘target list’ of 350 people he wants arrested  —  Retribution is at the center of Donald Trump's third presidential election campaign.  —  “I am your warrior,” Trump proclaimed earlier this year.  “I am your justice, and for those who have been wronged and betrayed, I am your retribution.”",
    "url": "https://www.rawstory.com/raw-investigates/ivan-raiklin/"
  },
  {
    "text": "Trump's ‘Secretary of Retribution’ compiles hit list for ‘vigilante death warrant’: Who's on it?  —  Former president Donald Trump — convicted in criminal court, held liable in civil courts and facing other indictments — has told supporters, “I am your retribution,” and now it appears he has a “future secretary of retribution.”",
    "url": "https://www.nj.com/politics/2024/07/trumps-secretary-of-retribution-compiles-hit-list-for-vigilante-death-warrant-whos-on-it.html"
  },
  {
    "text": "Trump/Thomas 2024  —  History books will tell you that the Republican Party's 1996 ticket was Bob Dole and Jack Kemp.  And it's certainly true that if Dole had won, Kemp would've been sworn in as Vice President.  But for campaign purposes, those of us who were involved in the effort … ",
    "url": "https://www.findinggravity.net/p/trumpthomas-2024"
  },
  {
    "text": "Judge signals he's likely to dismiss Rudy Giuliani's bankruptcy case  —  The judge said he intended to issue a final ruling by Friday.  —  A New York federal judge is poised to dismiss Rudy Giuliani's bankruptcy case, expressing concern Wednesday that Giuliani has used the proceedings … ",
    "url": "https://www.politico.com/news/2024/07/10/rudy-giuliani-bankruptcy-hearing-00167325"
  },
  {
    "text": "Baltimore bridge collapse survivor details how he climbed onto floating concrete to await rescue  —  “I think maybe there is still a goal for me,” Julio Cervantes Suarez said in an exclusive interview with NBC News.  —  BALTIMORE — Julio Cervantes Suarez endured the unthinkable … ",
    "url": "https://www.nbcnews.com/news/us-news/baltimore-bridge-collapse-survivor-julio-cervantes-suarez-rcna157254"
  },
  {
    "text": "Exclusive: House Oversight subpoenas top Biden aides over his mental fitness … - Since Biden's weak performance at the June 27 debate ignited questions about his candidacy, some Democrats — including administration officials — have been bracing for potential congressional probes into his mental fitness, and what aides know about it.",
    "url": "https://www.axios.com/2024/07/10/biden-house-oversight-committee-subpoena-aides"
  },
  {
    "text": "Fake electors get tapped as GOP convention delegates  —  Seven battleground states are sending fake electors and others who worked to upend the 2020 election results to represent their state parties at the Republican National Convention in Milwaukee, where they will officially anoint Donald Trump as their presidential nominee.",
    "url": "https://www.cnn.com/2024/07/10/politics/fake-electors-get-tapped-as-gop-convention-delegates"
  },
  {
    "text": "Biden's poor debate performance had almost no impact on voter preference, new report says  —  Minor changes in voter preference after the debate don't mean the course of the presidential race has shifted, Northeastern expert says.  —  by Cody Mello-Klein  —  July 9, 2024  —  Share this story",
    "url": "https://news.northeastern.edu/2024/07/09/biden-debate-performance-voter-preferences/"
  },
  {
    "text": "Hail to the Chick: Dirty Jill Is at it Again  —  All rise, and please honor The First Lady of the United States of America, DOCTOR Jill Biden!  —  You may genuflect, bow, curtsy, or kneel in proper homage to the woman who holds no office but is married to the president of the United States of America.",
    "url": "https://pjmedia.com/victoria-taft/2024/07/10/hail-to-the-chick-dirty-jill-is-at-it-again-n4930521"
  },
  {
    "text": "AOC launches effort to impeach Clarence Thomas and Samuel Alito  —  Alexandria Ocasio-Cortez's salvo seeks accountability over conservative supreme court justices' ethics controversies  —  Alexandria Ocasio-Cortez has introduced articles of impeachment against conservative US supreme court … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/10/aoc-articles-of-impeachment"
  },
  {
    "text": "Trump considering cutting back intel sharing with Europe, officials warn  —  European officials say they rely on U.S. intelligence to help fend off Russian aggression on their own soil.  —  Donald Trump is considering plans to reduce the sharing of U.S. intelligence with members of NATO … ",
    "url": "https://www.politico.com/news/2024/07/10/trump-considering-cutting-intel-sharing-europe-00167503"
  }
]