[
  {
    "text": "Special counsel Jack Smith resigns from DOJ  —  The special counsel's departure was disclosed in a court filing submitted Saturday afternoon to U.S. District Judge Aileen Cannon.  —  Special counsel Jack Smith has completed his work on two criminal investigations of President-elect Donald Trump … ",
    "url": "https://www.politico.com/news/2025/01/11/jack-smith-resigns-justice-department-trump-criminal-investigation-00197694"
  },
  {
    "text": "Jeff Bezos' WaPo reeling from losses and ‘internal drama’ as Trump returns to DC: report  —  At a time when the always newsworthy Donald Trump is headed back to the White House, the venerable Washington Post should be gearing up to cover his second term but instead is being subjected to an exodus … ",
    "url": "https://www.rawstory.com/bezos-washington-post/"
  },
  {
    "text": "Mark Zuckerberg lies about content moderation to Joe Rogan's face … I'll spare you the experience of listening to one of the richest men in the world whine and just tell you straight out: Mark Zuckerberg's interview on The Joe Rogan Experience is full of lies.",
    "url": "https://www.theverge.com/2025/1/10/24341117/mark-zuckerberg-facebook-joe-rogan-lies"
  },
  {
    "text": "Biden Awards Pope a Presidential Medal in Waning Days of Term  —  Joe Biden awarded a Presidential Medal of Freedom to Pope Francis, a personal marker of his Roman Catholic faith after devastating fires in California prompted the president to cancel a Vatican visit during his final days in office.",
    "url": "https://www.bloomberg.com/news/articles/2025-01-11/biden-awards-pope-a-presidential-medal-in-waning-days-of-term"
  },
  {
    "text": "President Biden Awards Presidential Medal of Freedom with Distinction to His Holiness Pope Francis  —  Today, President Biden spoke with His Holiness Pope Francis and named him as a recipient of the Presidential Medal of Freedom with Distinction.  The Presidential Medal of Freedom … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/11/president-biden-awards-presidential-medal-of-freedom-with-distinction-to-his-holiness-pope-francis/"
  },
  {
    "text": "DoJ releases its Tulsa race massacre report over 100 years after initial review  —  DoJ report acknowledges attack ‘was so systematic and coordinated that it transcended mere mob violence’  —  On Friday, the Department of Justice (DoJ) released its report on the Tulsa race massacre after announcing the review last September.",
    "url": "https://www.theguardian.com/us-news/2025/jan/10/tulsa-race-massacre-report-doj"
  },
  {
    "text": "Scoop: Denmark sent Trump team private messages on Greenland … - Trump has repeatedly declared that controlling Greenland — the world's largest island — is necessary for U.S. national security vis-a-vis Russia and China. … - Climate change is opening up the Arctic for competition between superpowers … ",
    "url": "https://www.axios.com/2025/01/11/denmark-response-trump-greenland-threat"
  },
  {
    "text": "O Canada, Come Join Us  —  My great-great-grandmother was born in Saint John, New Brunswick, and first saw the United States as a 10-year-old.  My great-grandfather was an Irish Canadian who married a Maine girl.  My wife's father was born in Ontario, descended from a long line of Newfoundlanders … ",
    "url": "https://www.nytimes.com/2025/01/11/opinion/o-canada-come-join-us.html"
  },
  {
    "text": "'There are a lot of bitter people here, I'm one of them': rust belt voters on why they backed Trump again despite his broken promises  —  Many in Youngstown, Ohio, believe the president-elect will tackle the town's decline this time.  Others are worried about his character flaws.",
    "url": "https://www.theguardian.com/us-news/2025/jan/11/there-are-a-lot-of-bitter-people-here-im-one-of-them-rust-belt-voters-on-why-they-backed-trump-again-despite-his-broken-promises"
  },
  {
    "text": "Despite Trump's Attacks, Republicans Made Big Gains in Mail Voting  —  As Republican voters embraced a practice that Donald J. Trump railed against for years, softening his tone only slightly in 2024, the party eroded a key Democratic advantage across the country.",
    "url": "https://www.nytimes.com/2025/01/11/us/politics/trump-2024-election-mail-votes.html"
  },
  {
    "text": "Scott Bessent, Trump's Billionaire Treasury Pick, Will Shed Assets to Avoid Conflicts  —  Financial disclosure forms show hundreds of millions of assets including property in the Bahamas and investments in Bitcoin and China's currency.  —  Scott Bessent, the billionaire hedge fund manager … ",
    "url": "https://www.nytimes.com/2025/01/11/business/scott-bessent-treasury-divest.html"
  },
  {
    "text": "The Second Time as Farce: Imperialism in the 21st Century  —  Hegel remarks somewhere that all great world-historic facts and personages appear, so to speak, twice.  He forgot to add: the first time as tragedy, the second time as farce.  — Karl Marx, “The Eighteen Brumaire of Louis Bonaparte”, 1851",
    "url": "https://nathangoldwag.wordpress.com/2025/01/11/the-second-time-as-farce-imperialism-in-the-21st-century/"
  },
  {
    "text": "In Congress, a Push for Proxy Voting for New Parents Draws Bipartisan Support … Representative Brittany Pettersen at the Capitol on Wednesday.Haiyun Jiang for The New York Times  —  Representative Brittany Pettersen, a second-term Colorado Democrat, was not planning to have a second child at the age of 43.",
    "url": "https://www.nytimes.com/2025/01/11/us/politics/congress-proxy-voting-parental-leave.html"
  },
  {
    "text": "Trump charms GOP rebels at Mar-a-Lago, with Musk in tow  —  “Unity was a huge part” of the confab, one of several House GOP meetings the president-elect has scheduled this weekend.  —  Donald Trump is working to smooth over roadblocks to his massive legislative agenda this weekend at his Florida resort … ",
    "url": "https://www.politico.com/news/2025/01/11/trump-freedom-caucus-mar-a-lago-00000260"
  },
  {
    "text": "Playbook: Kamala Harris' zombie fundraising  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  CALL IT THE 2028 BOWL — JD VANCE's Ohio State Buckeyes will meet PETE BUTTIGIEG's Notre Dame Fighting Irish in next Monday's college football national championship game in New Orleans.",
    "url": "https://www.politico.com/newsletters/playbook/2025/01/11/kamala-harris-zombie-fundraising-00197681"
  },
  {
    "text": "Kamala Snubs Trump With ‘Legendary’ Photo Crop  —  Days before Jimmy Carter's funeral, Harris presided over the certification of her lost election.",
    "url": "https://www.thedailybeast.com/kamala-snubs-trump-with-legendary-snapshot/"
  },
  {
    "text": "The California Wildfires Are the Latest Disaster Supercharged by Climate Change  —  Extreme weather events — deadly heat waves, floods, fires and hurricanes — are the consequences of a warming planet, scientists say.  —  As Los Angeles burned for days on end, horrifying the nation … ",
    "url": "https://www.nytimes.com/2025/01/10/climate/california-fires-climate-change-disasters.html?unlocked_article_code=1.oU4.teAw.73gudJ3Hvi9J&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Mike Pence Shares the First Thing He Said to Trump in Four Years … Though Mike Pence hadn't seen Donald Trump since leaving the White House, the former vice president said he was grateful to get a moment to speak with him at Jimmy Carter's state funeral this week.",
    "url": "https://www.christianitytoday.com/2025/01/mike-pence-donald-trump-carter-funeral-russell-moore/"
  },
  {
    "text": "Supreme Court to examine stalled Biden plan cancelling debt for defrauded students  —  The U.S. Supreme Court said on Friday it will review a lower court's decision to block a Biden administration rule that helped forgive student debt held by borrowers who were defrauded by their colleges.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2025/01/11/supreme-court-biden-student-debt-rule/77626456007/"
  }
]