[
  {
    "text": "Special counsel charges FBI informant with lying to the bureau about Hunter and Joe Biden  —  Alexander Smirnov, 43, disliked President Joe Biden, according to the Justice Department.  He was arrested in Las Vegas after returning from a trip overseas.  —  WASHINGTON — An FBI confidential human source … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/special-counsel-charges-fbi-informant-lying-bureau-hunter-joe-biden-rcna139091"
  },
  {
    "text": "FBI informant charged with lying about Joe and Hunter Biden's ties to Ukrainian energy company  —  An FBI informant has been charged with fabricating a multimillion-dollar bribery scheme involving President Joe Biden, his son Hunter and a Ukrainian energy company, a claim that is central … ",
    "url": "https://apnews.com/article/hunter-biden-burisma-fbi-informant-lying-6969656f6012780a23a4b8841ce2689b"
  },
  {
    "text": "FBI informant at heart of GOP's Biden bribery allegations indicted over false statements  —  The confidential source at the center of allegations being promoted by House Republicans that President Biden accepted a bribe has been arrested and charged with making false statements to the FBI.",
    "url": "https://thehill.com/regulation/court-battles/4471124-fbi-informant-at-heart-of-gops-biden-bribery-allegations-indicted-for-false-statements/"
  },
  {
    "text": "Special counsel charges FBI confidential source for allegedly providing false derogatory info on President Biden, Hunter Biden  —  Alexander Smirnov was arrested in Las Vegas on Wednesday.  —  The FBI seal is seen outside the headquarters building in Washington, DC on July 5, 2016.",
    "url": "https://abcnews.go.com/Politics/special-counsel-charges-fbi-confidential-source-alexander-smirnov/story?id=107275129"
  },
  {
    "text": "In fiery testimony, Fani Willis hits back at misconduct claims that threaten future of Trump case  —  (Feb 15) (AP production by Javier Arciga)  —  Fulton County District Attorney Fani Willis took the witness stand Thursday and forcefully pushed back against what she described as “lies” … ",
    "url": "https://apnews.com/article/fani-willis-hearing-trump-case-potential-conflict-c37fcf993ac33c150f3cb3e4a7a888db"
  },
  {
    "text": "Donald Trump Will Be the First Former President to Face a Criminal Trial, Judge Rules  —  Trump's New York case will begin in March.  —  A New York judge ruled Thursday that Donald Trump will stand trial in March on charges related to the Stormy Daniels coverup.",
    "url": "https://www.motherjones.com/politics/2024/02/donald-trump-stormy-daniels-new-york-trial/"
  },
  {
    "text": "Trump's first criminal trial will start March 25, judge says  —  The schedule means Trump will spend weeks in court instead of on the campaign trail.  —  Former President Donald Trump's first criminal trial will start on March 25 as scheduled, a judge said in New York on Thursday as he denied Trump's attempts to throw out the charges.",
    "url": "https://www.politico.com/news/2024/02/15/trump-hush-money-criminal-case-hearing-update-00141621"
  },
  {
    "text": "Rosendale drops Montana Senate bid — after less than a week  —  Rosendale had just launched his long-anticipated Senate bid last Friday.  —  GOP Rep. Matt Rosendale is dropping his Montana Senate bid less than a week after he officially launched it, he confirmed to POLITICO.",
    "url": "https://www.politico.com/news/2024/02/15/rosendale-drops-montana-senate-bid-00141812"
  },
  {
    "text": "Trump world considers having the former president deliver the official GOP State of the Union response  —  Two sources told NBC News that Trump is leaning against doing it.  The decision ultimately rests with the Republican leadership in Congress.  —  WASHINGTON — Aides and allies close … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-world-former-president-deliver-gop-state-union-response-rcna138979"
  },
  {
    "text": "Reporter asks Ron DeSantis why he can affirm his height with lifts, but stands against gender-affirming care  —  In a Thursday morning press conference in Florida, Republican Gov. Ron DeSantis, a failed 2024 presidential candidate, flanked by representatives from the Southern Poverty Law … ",
    "url": "https://www.advocate.com/politics/ron-desantis-shoe-lifts-presser"
  },
  {
    "text": "White House Clashed With Justice Dept. Over Special Counsel Report  —  Previously undisclosed letters show a testy exchange over whether the Justice Department violated its own guidelines in releasing a report with comments disparaging President Biden.  —  The White House clashed … ",
    "url": "https://www.nytimes.com/2024/02/15/us/politics/joe-biden-special-counsel.html"
  },
  {
    "text": "Truth Social merger deal wins key approval, a victory for Trump  —  The former president's stake in the post-merger company would be valued, at today's share price, at nearly $4 billion.  —  The Securities and Exchange Commission has approved the merger proposal of former president Donald Trump's media start … ",
    "url": "https://www.washingtonpost.com/technology/2024/02/15/truth-social-trump-merger-sec/"
  },
  {
    "text": "The final repudiation of ‘2000 Mules’  —  Since Donald Trump left office in January 2021, there has been no more influential presentation of his theory that the election was stolen than the film “2000 Mules,” created by activist — and Trump pardon recipient — Dinesh D'Souza.",
    "url": "https://www.washingtonpost.com/politics/2024/02/15/dsouza-2000-mules-repudiation/"
  },
  {
    "text": "US disrupts Russian hacking campaign that infiltrated home, small business routers: DOJ  —  The FBI coordinated with other foreign partners to disrupt the GRU-led campaign.  —  A laptop is seen on a Russian flag in this undated stock photo.  —  The FBI announced Thursday it successfully disrupted … ",
    "url": "https://abcnews.go.com/Politics/us-disrupts-russian-hacking-campaign-infiltrated-home-small/story?id=107258976"
  },
  {
    "text": "U.S. conducted cyberattack on suspected Iranian spy ship  —  The covert operation was intended to inhibit the ship's ability to share intelligence with Houthi rebels who have been attacking cargo ships in the Red Sea.  —  WASHINGTON — The United States recently conducted a cyberattack … ",
    "url": "https://www.nbcnews.com/news/investigations/us-conducted-cyberattack-suspected-iranian-spy-ship-rcna138638"
  },
  {
    "text": "Joe Rogan and Bret Weinstein Promote AIDS Denialism to an Audience of Millions  —  Weinstein repeated discredited theories to Rogan about HIV not being the cause of AIDS, alarming and infuriating public health experts.  —  Bret Weinstein, the evolutionary biology professor turned podcaster … ",
    "url": "https://www.vice.com/en/article/jg543y/joe-rogan-and-bret-weinstein-promote-aids-denialism-to-an-audience-of-millions"
  },
  {
    "text": "House GOP sets rule-vote failure record  —  Presented by With assists from POLITICO's Congress team  —  WHY RULE VOTE FAILURES COULD ONLY GET WORSE FOR JOHNSON  —  Failing to pass a rule.  It's typically a process that leadership gives little thought, a minor bump on the path to passage.",
    "url": "https://www.politico.com/newsletters/inside-congress/2024/02/15/house-gop-sets-rule-vote-failure-record-00141801"
  },
  {
    "text": "Air Canada's chatbot gave a B.C. man the wrong information.  Now, the airline has to pay for the mistake  —  Air Canada has been ordered to compensate a B.C. man because its chatbot gave him inaccurate information.  —  The Civil Resolution Tribunal's decision on the dispute was posted online Wednesday … ",
    "url": "https://bc.ctvnews.ca/air-canada-s-chatbot-gave-a-b-c-man-the-wrong-information-now-the-airline-has-to-pay-for-the-mistake-1.6769454"
  }
]