[
  {
    "text": "Sarah Palin Says Civil War Is ‘Going to Happen’ After Trump's Arrest  —  ‘RISE UP’  —  Sarah Palin responded to Donald Trump's arrest in Georgia on Thursday night by talking up the possibility of civil war.  Speaking to Eric Bolling as the former president was booked at the Fulton County Jail … ",
    "url": "https://www.thedailybeast.com/sarah-palin-says-civil-war-is-going-to-happen-after-trumps-arrest"
  },
  {
    "text": "The Georgia election case against Donald Trump and 18 others is about to get ugly.  Here's why.  —  For former President Donald Trump, Rudy Giuliani and their 17 other co-defendants, the threat of jail time is getting very real for those charged, arrested and booked in the Georgia election fraud case.",
    "url": "https://www.usatoday.com/story/news/politics/2023/08/25/trumps-georgia-election-case-could-get-ugly-as-others-seek-to-avoid-jail/70662386007/"
  },
  {
    "text": "Trump's Mug Shot Gives His Haters Nothing  —  Donald Trump dropped in for a photo op in Georgia last night—not the usual kibbitz on the hustings for a former president, but a killer visual to end the week with: a mug shot.  —  And just like that, Trump was restored to his accustomed place in the Republican dogpile: everywhere.",
    "url": "https://www.theatlantic.com/politics/archive/2023/08/donald-trump-georgia-mug-shot-debate/675133/"
  },
  {
    "text": "Trump Gets a Mug Shot  —  If you happened to search the records for inmates housed in the Fulton County, Georgia, jail this evening, you would have found this.  Briefly.  —  No designation as “President Trump,” the way his new lawyer, Atlanta criminal defense lawyer Steve Sadow, referred to him in a motion today.",
    "url": "https://joycevance.substack.com/p/trump-gets-a-mug-shot"
  },
  {
    "text": "5 more Trump defendants booked at Fulton jail overnight  —  X  —  Five more defendants in the Fulton County Trump case surrendered overnight at the Fulton County jail, hours after former President Donald Trump himself traveled to Atlanta to be booked.  —  First up, Michael Roman, a Trump campaign official.",
    "url": "https://www.ajc.com/news/crime/5-more-trump-defendants-booked-at-fulton-jail-overnight/DOOSLDJQZFCHJE6TGW5QJ4LQJY/"
  },
  {
    "text": "The Mugshot  —  This presidential portrait was inevitable, wasn't it?  —  Think for a moment what it took to bring us to this point: the twisted, bizarre, tangled story, with so many chapters, and legions of enablers, rationalizers, clowns, cowards, and co-conspirators.",
    "url": "https://morningshots.thebulwark.com/p/the-mugshot"
  },
  {
    "text": "Lock Him Up?  A New Poll Has Some Bad News for Trump  —  A new POLITICO Magazine/Ipsos poll punctures some prevailing political narratives about the Trump indictments.  —  To hear Donald Trump tell it, the fact that he keeps getting indicted by prosecutors is a boon to his reelection effort.",
    "url": "https://www.politico.com/news/magazine/2023/08/25/ipsos-poll-trump-indictment-00112755"
  },
  {
    "text": "Trumpworld Isn't Turning on Vivek Ramaswamy—Yet  —  The first GOP debate launched Ramaswamy to the front of the field challenging Trump—putting his ambitious campaign under the MAGA microscope. … Vivek Ramaswamy may have opened the first Republican presidential debate by ripping … ",
    "url": "https://www.thedailybeast.com/trumpworld-isnt-turning-on-vivek-ramaswamyyet"
  },
  {
    "text": "County of Maui releases validated list of names of individuals who remain unaccounted for following  —  8/24/2023 — County of Maui releases validated list of names of individuals who remain unaccounted for following Lahaina wildfire disaster  —  The County of Maui on Thursday released … ",
    "url": "https://www.mauicounty.gov/CivicAlerts.aspx?AID=12763"
  },
  {
    "text": "Split ballot board approves reproductive rights amendment summary written by Ohio Sec. of State  —  In a 3-2 decision, the Ohio Ballot Board rejected using the full amendment proposal text for voters to see, and the approved summary language leaves out protecting contraception, fertility treatment and miscarriage care",
    "url": "https://ohiocapitaljournal.com/2023/08/24/split-ballot-board-approves-reproductive-rights-amendment-summary-written-by-ohio-sec-of-state/"
  },
  {
    "text": "Maui utility may have compromised evidence in fire probe, lawyers say  —  The utility removed damaged poles, lines and other equipment from where the Lahaina fire reportedly started, documents show, before investigators were able to view the scene  —  LAHAINA, Hawaii — The Hawaii power utility believed … ",
    "url": "https://www.washingtonpost.com/climate-environment/2023/08/24/maui-fires-power-utility-lahaina-investigation/"
  },
  {
    "text": "Donald Trump Sold Mar-a-Lago Before Arrest, Listing Claims  —  A Zillow listing claimed to have shown that Donald Trump has sold his signature Mar-a-Lago luxury residence in Florida.  The listing claimed the resort was purchased on August 4—weeks before the former president voluntarily turned himself … ",
    "url": "https://www.newsweek.com/donald-trump-mar-lago-sold-arrest-listing-1822370"
  },
  {
    "text": "Watch Live  —  Good morning.  At last year's Jackson Hole symposium, I delivered a brief, direct message.  My remarks this year will be a bit longer, but the message is the same: It is the Fed's job to bring inflation down to our 2 percent goal, and we will do so.  We have tightened policy significantly over the past year.",
    "url": "https://www.federalreserve.gov/newsevents/speech/powell20230825a.htm"
  },
  {
    "text": "RNC Chooses Houston For Its Mid-Summer 2028 Nominating Convention  —  The Texas city, known for its hot and humid summers with no sea breeze, beat out Miami, Dallas and Salt Lake City for the honors.  —  MILWAUKEE ― Republicans on Friday officially chose Houston as the site of their 2028 presidential nominating convention.",
    "url": "https://www.huffpost.com/entry/republican-2028-convention-houston_n_64e8cdb8e4b0ca02a510eff5"
  },
  {
    "text": "Endicott man sentenced to federal prison for telephone threats to Marjorie Taylor Greene  —  A Broome County man will spend three months in federal prison for threatening a member of the U.S. Congress last year.  —  Joseph F. Morelli, 51, of Endicott was also sentenced to three years … ",
    "url": "https://www.pressconnects.com/story/news/local/2023/08/25/endicott-man-sentenced-to-prison-for-threats-against-congresswoman/70677121007/"
  }
]