[
  {
    "text": "Senior U.S. official to exit after rift with Musk allies over payment system  —  A top Treasury career staffer is expected to depart.  Surrogates of Musk's DOGE effort had sought access to sensitive payment systems.  —  The highest-ranking career official at the Treasury Department … ",
    "url": "https://www.washingtonpost.com/business/2025/01/31/elon-musk-treasury-department-payment-systems/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4Mjk5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NjgxOTk5LCJpYXQiOjE3MzgyOTk2MDAsImp0aSI6ImNmNDI1NjUyLWQ1MjYtNDZmMC05OWE2LTM4MjZkNjhhM2U3NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAxLzMxL2Vsb24tbXVzay10cmVhc3VyeS1kZXBhcnRtZW50LXBheW1lbnQtc3lzdGVtcy8ifQ.yZfsykqc6t_9ScDJY93aWJQZfsrqpSaNaPMIurEt720&itid=gfta"
  },
  {
    "text": "Elon Musk Is Trying to Get Control of Key Payment System—at Any Cost  —  A top-ranking official in the U.S. Department of the Treasury is resigning after a fight with Elon Musk over a sensitive payment system.  —  The Washington Post reports that David Lebryk, who has worked in the department … ",
    "url": "https://newrepublic.com/post/190983/top-treasury-official-quit-elon-musk-fight-payment-system"
  },
  {
    "text": "From Anguish to Aggression: Trump Goes on Offense After Midair Collision  —  President Trump at moments of national tragedy has always been more comfortable finding fault than providing comfort or expressing empathy.  —  After TWA Flight 800 crashed in New York in 1996, President Bill Clinton asked … ",
    "url": "https://www.nytimes.com/2025/01/31/us/politics/trump-washington-plane-crash.html"
  },
  {
    "text": "Paramount in Settlement Talks With Trump Over ‘60 Minutes’ Lawsuit  —  A settlement, if reached, would be an extraordinary concession by a major U.S. media company to a sitting president.  —  When Donald J. Trump sued CBS for $10 billion days before the 2024 election, accusing the company … ",
    "url": "https://www.nytimes.com/2025/01/30/business/media/paramount-trump-cbs-news-settlement.html?unlocked_article_code=1.tU4.TRir.c2EziAfO0_RQ&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "The Art of the Kneel  —  If a settlement deal is inked with Donald Trump, Shari Redstone will be remembered as the mogul who sold out “60 Minutes.”  —  The journalists at CBS News are livid at Paramount Global boss Shari Redstone over the company's move to engage in settlement talks with Donald Trump.",
    "url": "https://www.status.news/p/paramount-trump-60-minutes-settlement-talks"
  },
  {
    "text": "Trump Aides Hunt for 11th-Hour Deal to Dial Back Canada-Mexico Tariffs  —  President says he will decide tonight whether oil will be included in levies … President Trump's advisers are considering several offramps to avoid enacting the universal tariffs on Mexico and Canada that he had pledged … ",
    "url": "https://www.wsj.com/economy/trade/trump-trade-tariffs-mexico-canada-negotiations-1abfa01e?st=yuXFF7&reflink=article_copyURL_share"
  },
  {
    "text": "Clues From D.C. Plane Crash Suggest Multiple Failures in Aviation Safety  —  Clues emerging from the moments before an Army helicopter collided with a passenger jet suggest breakdowns in the system meant to help aircraft land safely at the busy Reagan National Airport.  — 1.2k",
    "url": "https://www.nytimes.com/2025/01/31/business/dc-plane-helicopter-crash-cause.html"
  },
  {
    "text": "Illinois Gov. JB Pritzker blocks Jan. 6 rioters from state jobs after Trump pardons  —  In a written directive, the Democratic Illinois governor tells his hiring office that “no one who attempts to overthrow a government should serve in government.”  —  Illinois Gov. JB Pritzker is blocking … ",
    "url": "https://www.nbcnews.com/politics/politics-news/illinois-gov-jb-pritzker-blocks-jan-6-rioters-state-jobs-trump-pardons-rcna190101"
  },
  {
    "text": "The fight over spending just got a lot more complicated … Russell Vought's likely confirmation to be President Donald Trump's White House budget chief is stoking fears among Democrats and other observers that the administration will disregard federal spending laws and throw a wrench into Congress' efforts to reach a funding deal.",
    "url": "https://www.eenews.net/articles/the-fight-over-spending-just-got-a-lot-more-complicated/"
  },
  {
    "text": "SCOOP: Robert F. Kennedy Jr. Admits Settlement for “Misconduct” Accusation  —  Robert F. Kennedy Jr. has admitted to the US Senate that he has reached at least one settlement agreement in which he was accused of misconduct or inappropriate behavior.  —  After the Senate Finance Committee … ",
    "url": "https://www.motherjones.com/politics/2025/01/robert-f-kennedy-jr-admits-settlement-for-misconduct-accusation-senate-confirmation/"
  },
  {
    "text": "Pentagon shocked by Trump's order to house migrants in Guantanamo Bay  —  Defense officials are trying to figure out how to hold thousands of people on an aging military base with minimal staff.  —  President Donald Trump's plan to use Guantanamo Bay to detain migrants thrusts the Pentagon … ",
    "url": "https://www.politico.com/news/2025/01/31/trump-guantanamo-bay-migrants-pentagon-00201715"
  },
  {
    "text": "WhatsApp says journalists and civil society members were targets of Israeli spyware  —  Messaging app said it had ‘high confidence’ some users were targeted and ‘possibly compromised’ by Paragon Solutions spyware  —  Stephanie Kirchgaessner in Washington DC",
    "url": "https://www.theguardian.com/technology/2025/jan/31/whatsapp-israel-spyware"
  },
  {
    "text": "Trump Administration Shocks Senior F.B.I. Ranks by Moving to Replace Them  —  Top officials have been told to retire or be fired in the coming days, fueling fear within an agency that has been a target of President Trump and Kash Patel, his nominee to be F.B.I. director.",
    "url": "https://www.nytimes.com/2025/01/30/us/politics/trump-fbi-firing.html?unlocked_article_code=1.tU4.pczk.aCzbtLWtj6IT&smid=url-share"
  },
  {
    "text": "New DOT Memo Directs Funds To Communities With Higher ‘Marriage And Birth Rates’  —  The memo also said recipients of federal transportation funding must also cooperate with immigration enforcement, a hit to so-called sanctuary cities.  —  LOADING  —  The Department of Transportation … ",
    "url": "https://www.huffpost.com/entry/dot-memo-funds-communities-marriage-birth-rates_n_679bf8d8e4b0e1faebeef9c8"
  },
  {
    "text": "How Trump Could Snatch a Third Term — Despite the 22nd Amendment  —  Four ways Trump could stay in power beyond 2028.  —  Less than two weeks have passed since the last presidential inauguration, but try to imagine the next one.  —  It's Jan. 20, 2029.  The nation has weathered another tumultuous four years under Donald Trump.",
    "url": "https://www.politico.com/news/magazine/2025/01/31/trump-defy-constitution-third-term-00200239"
  },
  {
    "text": "Senate Democrat: Republicans ‘really uncomfortable’ with Gabbard nomination  —  Sen. Mark Kelly (D-Ariz.) says he's unsure about the fate of former Hawaii Rep. Tulsi Gabbard's nomination as director of national intelligence, casting doubt on her ability to garner enough support for confirmation.",
    "url": "https://thehill.com/homenews/senate/5118428-mark-kelly-tulsi-gabbard-odni-senate-confirmation/"
  },
  {
    "text": "The DNC's outgoing chair says Democrats should have stuck with Joe Biden in 2024  —  As the Democratic National Committee prepares to elect a new chair, its departing leader says Democrats should have stuck with Joe Biden in the 2024 race.  In an interview with The Associated Press … ",
    "url": "https://apnews.com/article/jaime-harrison-democrats-dnc-chair-biden-election-7845ba0e43c3f4c18a4ed5a6b7b5e5ae"
  },
  {
    "text": "A career official tried to undo Trump's purge at USAID.  He was then purged, too.  —  The dramatic purge and counter-purge played out in emails obtained by The Washington Post, as Trump's pause on aid upends humanitarian work around the world.  —  The Trump administration's purge of dozens … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/30/usaid-trump-purge-foreign-assistance-freeze/"
  },
  {
    "text": "Trump, Facing Two Crises in His Second Week, Spreads the Blame Around  —  Second week of his second presidency shows how an administration moving at lightning speed deals with sudden challenges: by going on offense  —  WASHINGTON—President Trump's handling of two crises this week—one … ",
    "url": "https://www.wsj.com/politics/policy/trump-facing-two-crises-in-his-second-week-spreads-the-blame-around-55fe36d9?st=zVLr6M&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Civil rights attorney, former Miss Kansas contestant killed in plane crash near DC airport  —  WICHITA, Kan. (KWCH) - As families and communities identify victims in Wednesday night's plane crash near Washington, D.C., we're learning that a well-known civil rights attorney and former Miss Kansas contestant is among the 67 people dead.",
    "url": "https://www.kwch.com/2025/01/30/civil-rights-attorney-former-miss-kansas-contestant-killed-plane-crash-near-dc-airport/"
  },
  {
    "text": "Records undercut Tulsi Gabbard's claim of ignorance on cleric's views  —  The nominee for director of national intelligence said, under oath, that she did not know “until today” that a prominent cleric she met in Syria threatened to unleash suicide bombers in the United States.",
    "url": "https://www.washingtonpost.com/national-security/2025/01/30/gabbard-hearing-syria-suicide-bombers/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4MjEzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NTk1NTk5LCJpYXQiOjE3MzgyMTMyMDAsImp0aSI6IjIyNDUyM2Q1LWYyMTEtNGY4ZS1hYjM1LTMzYzM5YWFmZjM2NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAxLzMwL2dhYmJhcmQtaGVhcmluZy1zeXJpYS1zdWljaWRlLWJvbWJlcnMvIn0.kckDB2sM2cfcRoRKitNYk2u5WamccUTrQHZ3p3NsKR0&itid=gfta"
  },
  {
    "text": "Costco Raises Pay to Over $30 an Hour for Most Store Workers  — Company will raise wages for highest tier of hourly workers  — Costco is latest retailer to boost rates to attract more labor  —  Costco Wholesale Corp. is raising pay for most of its hourly US workers to more than $30 … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-30/costco-increases-pay-to-over-30-an-hour-for-most-store-workers"
  },
  {
    "text": "Trump and the Collapse of the Old Order  —  A disquieting Washington visit leaves me with a sense that America is making a big break from the past.  —  I would like to point out a simple fact.  A major and unnoticed part of Donald Trump's power is that 100% of Americans know who “the president” … ",
    "url": "https://www.wsj.com/opinion/trump-and-the-collapse-of-the-old-order-policy-politics-eb2fe178"
  }
]