[
  {
    "text": "Johnson says Ukraine aid and border policy reform ‘likely’ to be split  —  House Speaker Mike Johnson (R-La.) told the three leaders of the Baltic parliaments that President Biden's national security supplemental that includes aid for Ukraine is “likely” to be split up over concerns … ",
    "url": "https://thehill.com/policy/international/4440281-johnson-ukraine-aid-border-likely-split/"
  },
  {
    "text": "Hey, a Brave One!  Republican Senator Slams Trump for Killing Border Deal  —  At least one Republican has reached a breaking point over Donald Trump's border security chicanery.  —  On Tuesday, North Dakota Senator Kevin Cramer had swing voters at the front of his mind … ",
    "url": "https://newrepublic.com/post/178596/republican-senator-cramer-whacks-trump-killing-border-deal"
  },
  {
    "text": "The Surprising Twist That Saved Fani ... for Now  —  As the late, great Wilford Brimley declared in Absence of Malice: “Wonderful thing, subpoenas.”  In a divorce action that had dragged out for over two years, Jocelyn Wade had sent a subpoena to Fani Willis to explain why Wade's estranged husband Nathan … ",
    "url": "https://hotair.com/ed-morrissey/2024/01/31/the-surprising-twist-that-saved-fani-for-now-n608587"
  },
  {
    "text": "Fulton DA Willis, Wade subpoenaed to testify at Feb. 15 hearing  —  Fulton County District Attorney Fani Willis and special prosecutor Nathan Wade have been subpoenaed to testify at a Feb. 15 hearing involving motions to disqualify them from the election interference case, according to a lawsuit filed Tuesday.",
    "url": "https://www.ajc.com/politics/fulton-da-willis-wade-subpoenaed-to-testify-at-feb-15-hearing/T3J2ETVR4NCIRB3V6IMGJNW67M/"
  },
  {
    "text": "Pennsylvania man arrested after allegedly decapitating his father and displaying his head on YouTube  —  In the video, which has since been removed, Justin Mohn says his father was a federal employee and refers to him as a traitor while voicing right-wing conspiracy theories.",
    "url": "https://www.nbcnews.com/news/us-news/pa-man-arrested-decapitating-father-youtube-video-rcna136509"
  },
  {
    "text": "Why Trumpers are losing it over Taylor Swift  —  Swift goes to football games to support her boyfriend, shattering MAGA brains. … MAGA this week at last found its true, final, most hated enemy.  Not Barack Obama.  Not Hilary Clinton.  Not Joe Biden.  Not even Hunter Biden.",
    "url": "https://www.publicnotice.co/p/taylor-swift-causes-trumpers-to-lose-it-kelce"
  },
  {
    "text": "Republicans are weaponizing a boring House tradition.  The result is more paralysis.  —  GOP rebels are tanking “rules” to push their demands, raising the threshold to pass legislation to a supermajority and making the House look more like the Senate.  —  WASHINGTON — When Speaker Mike Johnson … ",
    "url": "https://www.nbcnews.com/politics/congress/republicans-are-weaponizing-boring-house-tradition-result-paralysis-rcna136436"
  },
  {
    "text": "House Republican reported for doing pull-ups at the top of Capitol dome  —  The Capitol Visitor's Center reported Rep. Rich McCormick to the sergeant at arms for “unsafe actions” while on a tour, according to an email reviewed by POLITICO.",
    "url": "https://www.politico.com/live-updates/2024/01/31/congress/republican-reported-for-unsafe-actions-00138833"
  },
  {
    "text": "Mark Zuckerberg apologizes to parents at online child safety hearing  —  “I'm sorry for everything you've all gone through,” the Meta CEO said at a Senate Judiciary Committee Hearing called “Big Tech and the Online Child Sexual Exploitation Crisis.”  —  Meta CEO Mark Zuckerberg apologized Wednesday … ",
    "url": "https://www.nbcnews.com/tech/social-media/mark-zuckerberg-apologizes-parents-online-child-safety-hearing-rcna136578"
  },
  {
    "text": "Elon Musk cannot keep Tesla pay package worth more than $55 billion, judge rules  —  Elon Musk is not entitled to landmark compensation package awarded by Tesla's board of directors that is potentially worth more than $55 billion, a Delaware judge ruled Tuesday.",
    "url": "https://apnews.com/article/elon-musk-tesla-compensation-pay-shareholders-e75687178d1175fba36ca55bd9c4c805"
  },
  {
    "text": "A State Supreme Court Just Issued the Most Devastating Rebuke of Dobbs Yet  —  The Supreme Court's eradication of the constitutional right to abortion in 2022's Dobbs v. Jackson Women's Health Organization had an immediate and devastating impact on gender equality in the United States.",
    "url": "https://slate.com/news-and-politics/2024/01/pennsylvania-supreme-court-dobbs-sam-alito-abortion.html"
  },
  {
    "text": "Iran threatens to respond to any US strikes as Biden weighs reaction  —  The United States has attributed the drone attack that killed three U.S. service members in Jordan to the Islamic Resistance in Iraq, an umbrella group of Iran-backed militias that includes the militant group Kataib Hezbollah.",
    "url": "https://apnews.com/article/yemen-houthi-us-navy-mideast-tensions-israel-hamas-red-sea-6d5662d09aad8aed0875025b75928ef5"
  },
  {
    "text": "Gaetz's measure on Trump and Jan. 6  —  Rep. Matt Gaetz is rounding up support for a measure that says Donald Trump did not “engage in insurrection or rebellion against the United States, or give aid or comfort to the enemies thereof,” according to a copy reviewed by POLITICO.",
    "url": "https://www.politico.com/live-updates/2024/01/31/congress/gaetzs-measure-on-trump-and-jan-6-00138846"
  },
  {
    "text": "The ‘Profound Influence’ of Christian Extremists on Mike Johnson  —  Speaker Mike Johnson's spiritual journey reveals ties to Christian fundamentalists who support slavery.  Johnson's office won't say where he stands on that issue. … If you want to know where Republican House Speaker Mike Johnson stands … ",
    "url": "https://www.thedailybeast.com/the-profound-influence-of-christian-extremists-on-mike-johnson"
  },
  {
    "text": "Michigan's Arabs and Muslims push to defeat Biden in critical state  —  As the war in Gaza leads to the deaths of friends and relatives, anger at Biden's refusal to call for a cease-fire has turned into political organizing  —  DEARBORN, Mich. — Mohammad Enayah relied on a cousin in Gaza … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/31/arab-muslim-voters-work-to-defeat-biden/"
  },
  {
    "text": "As judges mull presidential immunity, Trump reaps the benefits of delay  —  For over three weeks, the D.C. Circuit has been sitting on a potentially decisive question.  —  Whether Donald Trump faces a potential prison sentence in 2024 is at the mercy of a federal appeals court that's operating … ",
    "url": "https://www.politico.com/news/2024/01/31/trump-trial-immunity-delay-00138688"
  },
  {
    "text": "Judge dismisses Disney lawsuit against Florida Gov. Ron DeSantis alleging retaliation  — A judge dismissed a lawsuit Disney filed against Florida Gov. Ron DeSantis that alleged he retaliated against the company for publicly criticizing a controversial parental rights law in the state that the governor backed.",
    "url": "https://www.cnbc.com/2024/01/31/judge-dismisses-disney-lawsuit-against-florida-gov-ron-desantis-alleging-retaliation.html"
  },
  {
    "text": "Even Jefferson Davis recognized Section III ‘automatically disqualified him’: Dozens of historians urge Supreme Court to remove Trump from 2024 ballot  —  Even Jefferson Davis, leader of the Confederacy — and his lawyer — knew the insurrection clause in the U.S. Constitution not only disqualified … ",
    "url": "https://lawandcrime.com/high-profile/even-jefferson-davis-recognized-section-iii-automatically-disqualified-him-dozens-of-historians-urge-supreme-court-to-remove-trump-from-2024-ballot/"
  },
  {
    "text": "Activist who led ouster of Harvard president linked to ‘scientific racism’ journal  —  Christopher Rufo recommends a newsletter to his readers that has published several supporters of discredited genetics theory  —  Rightwing activist Christopher Rufo has links to a self-styled … ",
    "url": "https://www.theguardian.com/world/2024/jan/31/rightwing-activist-christopher-rufo-ties-scientific-racism-journal"
  },
  {
    "text": "John Podesta to succeed John Kerry as top U.S. climate diplomat  —  The veteran Democratic political strategist will add the role to his duties at a crucial time for President Biden's climate agenda  —  President Biden will tap senior adviser John D. Podesta to replace outgoing U.S. special … ",
    "url": "https://www.washingtonpost.com/climate-environment/2024/01/31/podesta-john-kerry-climate-envoy/"
  },
  {
    "text": "U.S. winning world economic war  —  The United States economy grew faster than any other large advanced economy last year — by a wide margin — and is on track to do so again in 2024.  —  Why it matters: America's outperformance is rooted in its distinctive structural strengths, policy choices, and some luck.",
    "url": "https://www.axios.com/2024/01/31/us-economy-2024-gdp-g7-nations"
  },
  {
    "text": "US veteran accused of tearing down Satanic Temple idol in Iowa Capitol charged with hate crime  —  A U.S. Navy veteran who is accused of tearing down a Satanic Temple statue within the Iowa state Capitol has been charged with a hate crime.  —  Michael Cassidy, a conservative Christian veteran … ",
    "url": "https://www.washingtonexaminer.com/news/2828416/news-veteran-tore-down-idol-iowa-capital-charged-hate-crime/"
  },
  {
    "text": "California introduces first-in-nation slavery reparations package  —  The set of bills notably excludes direct cash payments.  —  SACRAMENTO, California — California state lawmakers introduced a slate of reparations bills on Wednesday, including a proposal to restore property taken by … ",
    "url": "https://www.politico.com/news/2024/01/31/california-black-reparations-bills-00138854"
  },
  {
    "text": "2024 Matchups: Biden Opens Up Lead Over Trump In Head-To-Head, Quinnipiac University National Poll Finds; Haley Leads Biden 1 On 1, But Trails When Third Party Candidates Are Added  —  mail_outline  —  As signs point to the 2024 presidential election being a repeat of the 2020 race between … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3889"
  },
  {
    "text": "Biden super PAC launches historic $250M ad blitz  —  The Big Story  —  A colossal effort from Democratic super PAC Future Forward will fuel $140 million in TV ads and $110 million in digital ads supporting President Biden's reelection campaign in battleground states from August to Election Day.",
    "url": "https://thehill.com/newsletters/campaign-report/4440525-biden-super-pac-launches-historic-250m-ad-blitz/"
  },
  {
    "text": "Bloody floors, no pain meds, surrounded by the IDF: Inside Gaza's last major hospital  —  NBC News journalists have been spending time with Dr. Muhammad Harara, one of five doctors still working at the last major hospital functioning in Gaza.  —  Dr. Muhammad Harara is one of just five physicians left … ",
    "url": "https://www.nbcnews.com/news/world/gaza-nasser-hospital-surrounded-israeli-troops-idf-war-doctor-rcna135691"
  }
]