[
  {
    "text": "Justice Alito Caught on Tape Discussing How Battle for America 'Can't Be Compromised'  —  In a new, secret recording, the Supreme Court justice says he “agrees” that the U.S. should return to a place of godliness  —  Justice Samuel Alito spoke candidly about the ideological battle between … ",
    "url": "https://www.rollingstone.com/politics/politics-features/samuel-alito-supreme-court-justice-recording-tape-battle-1235036470/"
  },
  {
    "text": "Martha-Ann Alito Condemns Pride Flags, the Left, and the Media  —  In a new, secret recording, the Supreme Court justice's wife bemoans having to “look across the lagoon at the Pride flag” … If it were up to her, she would be flying a Sacred Heart of Jesus flag in response.",
    "url": "https://www.rollingstone.com/politics/politics-features/supreme-court-martha-ann-alito-pride-flags-left-media-1235037338/"
  },
  {
    "text": "Samuel Alito's Wife, Martha-Ann, Goes Full MAGA in Secret Recording  —  SWEET JESUS  —  The audio was posted hours after similarly shocking comments by the Supreme Court justice were published.  —  Martha-Ann Alito, the wife of Supreme Court Justice Samuel Alito, complained about the Pride flag … ",
    "url": "https://www.thedailybeast.com/samuel-alitos-wife-martha-ann-goes-full-maga-in-secret-recording"
  },
  {
    "text": "Samuel Alito Gets Remarkably Candid in Secret Audio Recording  —  'CAN'T BE COMPROMISED'  —  “One side or the other is going to win,” the Supreme Court justice says at one point.  —  Embattled U.S. Supreme Court Justice Samuel Alito was thrust into the middle of yet another controversy Monday … ",
    "url": "https://www.thedailybeast.com/justice-samuel-alito-gets-remarkably-candid-in-secret-audio-recording"
  },
  {
    "text": "Fox News Edited Out Trump Saying He Might Keep Epstein Files Sealed  —  But a later release of the interview included his full response.  —  LOADING  —  The initial airing of a Fox News interview with Donald Trump last week cut out the former president saying he may not declassify federal files … ",
    "url": "https://www.huffpost.com/entry/donald-trump-jeffrey-epstein-fox-news_n_6667330de4b019027bc727f4"
  },
  {
    "text": "Donald Trump completes mandatory presentencing interview after less than 30 minutes of questioning  —  Donald Trump completed his mandatory presentencing interview Monday after less than 30 minutes of routine, uneventful questions and answers, a person familiar with the matter told The Associated Press.",
    "url": "https://apnews.com/article/trump-hush-money-interview-probation-new-york-8c6e79c8b87fe361e2adce7536e31d27"
  },
  {
    "text": "Canada's Parliament rocked by allegations of treason  —  Foreign interference probe exposes links to “witting” lawmakers in Ottawa.  —  OTTAWA — The capital of one of the world's most stable democracies is gripped by growing panic about foreign agents working in elected office.",
    "url": "https://www.politico.com/news/2024/06/10/canada-parliament-treason-allegations-00162163"
  },
  {
    "text": "John Fetterman and wife Gisele are hospitalized after Democratic senator rear-ended car on the highway  — Fetterman and his wife were driving in northern Maryland at the time  —  Pennsylvania Democrat Sen. John Fetterman and his wife Gisele were hospitalized after a car crash Sunday morning.",
    "url": "https://www.dailymail.co.uk/news/article-13515011/john-fetterman-wife-gisele-hospitalized-car-accident.html"
  },
  {
    "text": "Judge Strikes One Element From Trump Indictment in Documents Case  —  Judge Aileen Cannon threw out one basis for the case against the former president, involving a highly sensitive military map he showed an aide after leaving office.  —  The federal judge overseeing former President Donald … ",
    "url": "https://www.nytimes.com/2024/06/10/us/politics/trump-documents-charges-cannon.html"
  },
  {
    "text": "Trump's Liquor Licenses Under Scrutiny After Felony Conviction  —  States across the country have laws restricting felons from selling alcohol.  What does that mean for Donald Trump, who does not drink but sells plenty of booze?  —  The State of New Jersey is reviewing whether Donald Trump's … ",
    "url": "https://www.forbes.com/sites/zacheverson/2024/06/10/donald-trump-liquor-licenses-felony-conviction-new-jersey-new-york-california/"
  },
  {
    "text": "Things to know about FDA warning on paralytic shellfish poisoning in Pacific Northwest  —  The U.S. Food and Drug Administration says consumers should avoid eating shellfish from Oregon and Washington state as they may be contaminated with toxins that cause paralytic shellfish poisoning.",
    "url": "https://apnews.com/article/fda-warning-shellfish-oregon-washington-f5724c1b91fb78ed16c3f98a7c9e8cae"
  },
  {
    "text": "Georgia Republican convicted in Jan. 6 riot walks out during televised congressional primary debate  —  A Georgia congressional candidate convicted of a misdemeanor for illegally demonstrating inside the U.S. Capitol on Jan. 6, 2021, walked out of a televised debate",
    "url": "https://apnews.com/article/georgia-january-6-congress-chuck-hand-johnson-8d13db524ed68f265c8183654597926f"
  },
  {
    "text": "The CFPB is genuinely making America better, and they're going HARD (permalink)  —  Let's take a sec here and notice something genuinely great happening in the US government: the Consumer Finance Protection Bureau's stunning, unbroken streak of major, muscular victories over the forces … ",
    "url": "https://pluralistic.net/2024/06/10/getting-things-done/#deliverism"
  },
  {
    "text": "Behind the Republican Effort to Win Over Black Men  —  The party is trying to make inroads with Black voters, a key demographic for Democrats, which could swing the 2024 election.  —  Two Black Republican House members and Trump surrogates reserved a cigar bar near downtown Philadelphia … ",
    "url": "https://www.nytimes.com/2024/06/10/us/politics/2024-election-gop-black-men-voters.html"
  },
  {
    "text": "U.N. Security Council passes Gaza cease-fire proposal drafted by the U.S.  —  China made no move to block the deal and Russia abstained, allowing the proposal to pass.  —  The United Nations Security Council passed a U.S.-drafted cease-fire deal aimed at halting eight months of bloody fighting between Israel and Hamas in Gaza.",
    "url": "https://www.nbcnews.com/news/us-news/us-calls-un-security-council-vote-cease-fire-proposal-gaza-rcna156373"
  },
  {
    "text": "Trump to meet with Republican senators  —  Trump will meet with GOP senators in Washington on Thursday, to discuss an agenda for 2025 if they win in the fall, according to plans first shared with NBC News.  —  Former President Donald Trump will meet with a group of Republican senators in Washington … ",
    "url": "https://www.nbcnews.com/politics/congress/trump-meet-republican-senators-rcna156438"
  },
  {
    "text": "Donald Trump Calls Taylor Swift ‘Unusually Beautiful’ but ‘Liberal’ in New ‘Apprentice’ Book (EXCLUSIVE)  —  Donald Trump is in his “Reputation” era.  —  The former president muses about pop princess Taylor Swift in a new book about his years as a reality star, “Apprentice in Wonderland … ",
    "url": "https://variety.com/2024/tv/news/donald-trump-taylor-swift-beautiful-liberal-apprentice-1236030425/"
  },
  {
    "text": "Trump won't mention abortion in brief, virtual remarks to anti-abortion group  —  The former president will deliver a pre-recorded message to a Christian advocacy group that calls abortion “child sacrifice.”  —  Hours before Donald Trump was expected to make a virtual address … ",
    "url": "https://www.politico.com/news/2024/06/10/trump-virtual-remarks-to-anti-abortion-group-00162500"
  },
  {
    "text": "Trump finds new ways to praise and celebrate Jan. 6 rioters  —  Team Trump and Team Biden may not agree on much, but it appears both are eager to put the Jan. 6 attack at the center of the 2024 presidential election.  —  Donald Trump hasn't exactly been subtle about his support for Jan. 6 rioters … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-finds-new-ways-praise-celebrate-jan-6-rioters-rcna156294"
  },
  {
    "text": "ERO Boston arrests Guatemalan national charged with rape of Massachusetts child  —  BOSTON — Enforcement and Removal Operations Boston apprehended an unlawfully present Guatemalan national charged with raping a minor in Bristol County.  Deportation officers from ERO Boston arrested Yader … ",
    "url": "https://www.ice.gov/news/releases/ero-boston-arrests-guatemalan-national-charged-rape-massachusetts-child"
  },
  {
    "text": "Leguizamo: White People are Overrepresented, Emmy Voters Must Choose non-White Winners  —  Progressive actor John Leguizamo wants you to know that he is still woke.  “I'm still woke!  Are you?”  —  He addressed that question in a full-page ad in Sunday's edition of The New York Times.",
    "url": "https://hotair.com/karen-townsend/2024/06/10/leguizamo-white-people-are-overrepresented-emmy-voters-must-choose-non-white-winners-n3789986"
  },
  {
    "text": "FBI Releases 2024 Quarterly Crime Report and Use-of-Force Data Update  —  the FBI's Uniform Crime Reporting (UCR) Program released the Quarterly Uniform Crime Report (Q1), January-March, 2024 and the National Use-of-Force Data Collection Update, March 2024, on the FBI's Crime Data Explorer (CDE) at https://cde.ucr.cjis.gov.",
    "url": "https://www.fbi.gov/news/press-releases/fbi-releases-2024-quarterly-crime-report-and-use-of-force-data-update"
  },
  {
    "text": "The Future is Terror  —  Robespierre, a central architect of the French revolution, may seem like an unlikely reference point for modern American politics, and Donald Trump in particular.  But in one way he articulated a theory of governing that Trump is enacting today:",
    "url": "https://donmoynihan.substack.com/p/the-future-is-terror"
  },
  {
    "text": "How the Trump Administration Sacrificed Slaughterhouse Workers for Meat Monopolies  —  As COVID ravaged production lines nationwide, the former president stoked baseless fears about meat shortages and personally ordered plants to stay open, all at the behest of the agribusiness lobby … ",
    "url": "https://www.vanityfair.com/news/story/how-the-trump-administration-sacrificed-slaughterhouse-workers-for-meat-monopolies"
  },
  {
    "text": "Minnesota Poll: Biden holds narrow lead over Trump, but GOP voters more enthusiastic  —  Biden leads Trump 45%-41% in Minnesota, according to a new Star Tribune/MPR News/KARE 11 poll.  —  President Joe Biden holds a narrow lead over former President Donald Trump among likely voters in Minnesota … ",
    "url": "https://www.startribune.com/new-minnesota-poll-shows-close-presidential-race/600371666/?refresh=true"
  },
  {
    "text": "Increase in Liberal Views Brings Ideological Parity on Social Issues  —  But the long-term increase is not as pronounced on economic issues, on which Americans still lean conservative  —  WASHINGTON, D.C. — Americans have become significantly more likely to identify as liberal in their views … ",
    "url": "https://news.gallup.com/poll/645776/increase-liberal-views-brings-ideological-parity-social-issues.aspx"
  }
]