[
  {
    "text": "The DNC Gave Kamala Harris a Major Boost  —  The campaign raised over $80 million while attracting an army of volunteers.  —  The Democratic National Convention wasn't just four days of good vibes: It was also the cause of a major fundraising and volunteer boom for the Harris-Walz ticket.",
    "url": "https://www.motherjones.com/politics/2024/08/kamala-harris-post-dnc/"
  },
  {
    "text": "Harris campaign says it has raised $540M, sees surge of donations during DNC  —  Vice President Kamala Harris' campaign says it has now raised $540 million for its election battle against Republican nominee former President Donald Trump.  —  The campaign has had no problems getting supporters … ",
    "url": "https://apnews.com/article/kamala-harris-donald-trump-fundraising-43b32b26125229db182234f7ec06da14"
  },
  {
    "text": "Trump aides alarmed he's ‘just golfing all day and stewing’ as election slips away: WaPo  —  According to a report from the Washington Post, Donald Trump's inner circle grew increasingly alarmed at his complacency during the Democratic National Convention and had to convince him to hit … ",
    "url": "https://www.rawstory.com/trump-campaign-faltering/"
  },
  {
    "text": "Harris leading Trump by 7 points: Poll  —  Vice President Harris holds a 7-point edge over former President Trump nationally in a new poll, marking the latest gain for the Democratic presidential candidate as the general election approaches.  —  A survey from Fairleigh Dickinson University … ",
    "url": "https://thehill.com/homenews/campaign/4846433-harris-leading-trump-by-7-points-poll/"
  },
  {
    "text": "Lindsey Graham Says Joy 'Doesn't Exist in the Real World'  —  WOMP WOMP  —  The senator made the comments in response to the DNC “love fest” during an appearance on CNN's “State of the Union.”  —  Senator Lindsey Graham (R-SC) said he isn't buying all that Democratic “joy” … ",
    "url": "https://www.thedailybeast.com/lindsey-graham-says-joy-doesnt-exist-in-the-real-world"
  },
  {
    "text": "Be Careful What Trump's Lawyers Wish For, Superseding Indictment Edition  —  On Friday, first Bloomberg (Yahoo version), then NYT reported that Jack Smith “has decided against seeking a major hearing” to address which of the allegations charged against Donald Trump were official versus unofficial acts.",
    "url": "https://www.emptywheel.net/2024/08/25/be-careful-what-trumps-lawyers-wish-for-superseding-indictment-edition/"
  },
  {
    "text": "Ignore my brother Bobby, Max Kennedy says  —  I'm heartbroken over my brother Bobby's endorsement of Donald Trump.  —  I think often about my father and how he might have viewed the politics of our time.  I'm not sure what he would have thought about TikTok or AI, but this much I know for sure: He would have despised Donald Trump.",
    "url": "https://www.latimes.com/opinion/story/2024-08-25/robert-kennedy-donald-trump-kamala-harris"
  },
  {
    "text": "Sunday Snapshot: Trump's ambiguous abortion messaging … 1. GOP lawmakers struggle with Trump's abortion policies … - Philip Klein, the editor of the conservative National Review Online, wrote Friday in a piece titled “Trump's Abandonment of Pro-Lifers Is Complete,” that with his Truth Social post … ",
    "url": "https://www.axios.com/2024/08/25/trump-reproductive-rights-sunday-snapshot"
  },
  {
    "text": "How I've been convincing Christians they don't have to vote Republican  —  Democrats need to embrace the idea that evangelicals, and especially white male evangelicals, are worth winning and can be won.  —  During the last month, Christians for Kamala joined the ranks of groups supporting … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/christians-kamala-can-pull-evangelical-voters-away-donald-trump-rcna167561"
  },
  {
    "text": "Vance dodges on whether Trump's immigration policy would lead to family separation  —  In an interview with NBC News' “Meet the Press,” Ohio Sen. JD Vance didn't give a direct answer to questions about whether Trump's policy proposals on the border would lead to family separation.",
    "url": "https://www.nbcnews.com/politics/2024-election/vance-dodges-whether-trumps-immigration-policy-family-separation-rcna168088"
  },
  {
    "text": "Why It's So Hard to Find a Therapist Who Takes Insurance  —  America is in the midst of a mental health crisis.  —  But finding a therapist who takes insurance can feel impossible.  —  Insurers say that's because there aren't enough therapists.  —  That's not entirely true.",
    "url": "https://projects.propublica.org/why-i-left-the-network/"
  },
  {
    "text": "Why Were Justice Dept. Officials Scared to Talk to This Book's Author?  —  In “Where Tyranny Begins,” the journalist David Rohde reveals how former President Donald Trump tried to use the federal law enforcement agency to help himself and punish his foes.  —  Buy Book ▾",
    "url": "https://www.nytimes.com/2024/08/25/books/review/where-tyranny-begins-david-rohde.html?unlocked_article_code=1.Fk4.BuNG.jijwJoTIiZtS&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Trump event at wall Obama built highlights an unkept promise  —  The Republican nominee heaped praise on a section of barrier that was actually built by his predecessor.  —  MONTEZUMA PASS, Ariz. — A brown ribbon carved a straight gash across a vast, flat desert basin, the only mark of human civilization visible on this wilderness.",
    "url": "https://www.washingtonpost.com/politics/2024/08/25/trump-event-wall-obama-built-highlights-an-unkept-promise/"
  },
  {
    "text": "‘America is not a museum’: Why Democrats are going big on housing despite the risks  —  Vice President Kamala Harris is trying to flip the script and own an issue impacting large swaths of Americans.  —  CHICAGO — Democrats are trying to turn a political vulnerability, housing affordability, into a winning issue for November.",
    "url": "https://www.politico.com/news/2024/08/25/democrats-housing-costs-00176265"
  }
]