[
  {
    "text": "Trump New York fraud trial cleared to start Monday after appeals panel ruling  — The New York civil fraud trial of former President Donald Trump and his company is back on track to start Monday after a state appeals court lifted a temporary stay of the case.",
    "url": "https://www.cnbc.com/2023/09/28/trump-new-york-fraud-trial-cleared-to-start-monday-after-appeals-panel-ruling.html"
  },
  {
    "text": "Trump's Promise of Lawlessness  —  Though it was lost in the four-year cyclone that was the presidency of Donald Trump, one of his most immoral acts was to pardon soldiers who were accused of committing war crimes by killing unarmed civilians or prisoners.  Military leaders … ",
    "url": "https://www.nytimes.com/2023/09/28/opinion/trump-debate-milley.html"
  },
  {
    "text": "Donald Trump: UAW negotiations 'don't mean as much as you think'  —  Clinton Township — Republican Donald Trump railed against electric vehicles during a campaign stop in suburban Detroit Wednesday night, saying they're too expensive, aren't capable of traveling far enough and would spur job losses for Americans.",
    "url": "https://www.detroitnews.com/story/news/politics/2023/09/27/donald-trump-returns-auto-industry-strike-uaw-ev-taking-center-stage-presidential-election-joe-biden/70960155007/"
  },
  {
    "text": "EXCLUSIVE: Trump Rips RNC, Says They Have To Stop Debates … In an exclusive sit-down interview with the Daily Caller, Trump said there would not be a breakout candidate and the debates are bad for the Republican Party.  —  “They have to stop the debates.  Because it is just bad for the Republican Party.",
    "url": "https://dailycaller.com/2023/09/28/exclusive-trump-rips-rnc-stop-debates/"
  },
  {
    "text": "My expectations for the debate were low, but holy crap  —  Republican also-rans put their unreadiness for prime time on full display. … The first thing to understand about the Republican primary is that it's not really a contest.  It's over.  It's been over for months now.  It was never even really in doubt.",
    "url": "https://www.publicnotice.co/p/gop-debate-fox-business-simi-valley-yikes"
  },
  {
    "text": "The biggest loser of last night's debate was ...  ... not any of the seven candidates on the stage.  It wasn't even one of the candidates who weren't on the stage — Donald Trump, Asa Hutchinson, and an assortment of also rans.  The biggest loser of the debate was Fox Business Channel, with the RNC that arranged it a close runner-up.",
    "url": "https://hotair.com/ed-morrissey/2023/09/28/the-biggest-loser-of-last-nights-debate-was-n581045"
  },
  {
    "text": "First Impeachment Hearing Yields No New Information on Biden  —  In a chaotic session, Republicans accused the president of crime and corruption, but even their witnesses said the case for impeachment hadn't been made.  —  The first hearing in House Republicans' impeachment inquiry … ",
    "url": "https://www.nytimes.com/2023/09/28/us/politics/biden-impeachment-hearing.html"
  },
  {
    "text": "Alarmed Republicans are preparing to draft Glenn Youngkin  —  Robert Costa is the chief election and campaign correspondent for CBS News.  —  Some of the biggest Republican donors in the country will converge next month at the historic Cavalier Hotel in Virginia Beach for a two-day meeting to rally behind Gov. Glenn Youngkin.",
    "url": "https://www.washingtonpost.com/opinions/2023/09/28/draft-glenn-youngkin-2024-gop-donors/"
  },
  {
    "text": "Trump's Sprawling Legal Defense Effort Comes Under Strain  —  Former President Donald Trump's team has found lawyers for others caught up in his prosecutions and has paid many of their legal bills.  That arrangement may not be sustainable.  —  The call came out of the blue.",
    "url": "https://www.nytimes.com/2023/09/28/us/politics/trump-lawyers-pac.html"
  },
  {
    "text": "It's not just a shutdown — Congress has no plan for the FAA either  —  The airline sector is staring down an authorization and funding lapse amid congressional paralysis.  —  It's not just a broader government shutdown.  By Sunday, the aviation system could also have almost … ",
    "url": "https://www.politico.com/news/2023/09/28/congress-faa-lapse-government-shutdown-00118718"
  },
  {
    "text": "Ice Spice Gave Matty Healy's Racist Nonsense the Only Response They Deserve  —  Matty Healy laughed along on a podcast in February when the hosts called the rapper a “chubby Chinese lady.”  —  So much can happen in a year: Taylor Swift went from Matty Healy's transient main squeeze to becoming … ",
    "url": "https://www.thedailybeast.com/ice-spice-gave-matty-healys-racist-nonsense-the-only-response-they-deserve"
  },
  {
    "text": "Democrats eye passport backlog with new legislation  —  A duo of Democrat lawmakers have introduced legislation that would implement new measures to clear passport application backlogs and reduce processing delays.  —  The proposed legislation, called the PASSPORT Act … ",
    "url": "https://thehill.com/homenews/house/4228157-democrats-eye-passport-backlog-with-new-legislation/"
  },
  {
    "text": "Trump's Tax Representative Said in 2020 He ‘Agrees’ With $26.6 Million Appraisal of Mar-a-Lago (Exclusive)  —  A letter obtained by The Messenger shows a contrast between what Trump's tax representative told local officials and claims his South Florida club is worth more than $1 billion",
    "url": "https://themessenger.com/politics/trumps-tax-representative-said-in-2020-he-agrees-with-26-6-million-appraisal-of-mar-a-lago-exclusive"
  },
  {
    "text": "Manchin snarls top VA nominee over abortion  —  Manchin and Republicans say the agency has overstepped its authority.  —  Sen. Joe Manchin has stalled President Joe Biden's nominee to serve as the VA's general counsel for more than a year to pressure the agency to stop providing abortions … ",
    "url": "https://www.politico.com/news/2023/09/28/manchin-snarls-top-va-nominee-over-abortion-00118753"
  },
  {
    "text": "Rumble host Stew Peters airs segment calling for the executions of Taylor Swift and Travis Kelce  —  Advertising for the NFL has been placed on Peters' X account  —  Rumble host Stew Peters yesterday aired a segment calling for the executions of Taylor Swift and Travis Kelce … ",
    "url": "https://www.mediamatters.org/coronavirus-covid-19/rumble-host-stew-peters-airs-segment-calling-executions-taylor-swift-and"
  },
  {
    "text": "Youngkin: Virginia districts 'really don't have a choice' in school transgender policy  —  Republican Virginia Gov. Glenn Youngkin on Thursday said local school districts “don't really have a choice” in adopting his administration's new model policies for the treatment of transgender students … ",
    "url": "https://thehill.com/homenews/lgbtq/4228986-youngkin-virginia-districts-really-dont-have-a-choice-in-school-transgender-policy/"
  },
  {
    "text": "New data on ultra-rich tax cheats wrecks the ‘working-class GOP’ ruse  —  Republicans have been amplifying the claim lately that their party has undergone a “populist” makeover, rendering it both anti-elite and pro-working class.  One way Republicans purport to illustrate … ",
    "url": "https://www.washingtonpost.com/opinions/2023/09/28/wealthy-tax-avoidance-ron-wyden-data/"
  },
  {
    "text": "Fetterman backs a vote to expel Menendez from Senate  —  An expulsion resolution requires a two-thirds threshold and would be extremely difficult to pass.  Only 15 senators have been expelled since 1789, nearly all during the Civil War.  —  WASHINGTON — Sen. John Fetterman, D-Pa. … ",
    "url": "https://www.nbcnews.com/politics/congress/fetterman-backs-vote-expel-menendez-senate-rcna117920"
  }
]