[
  {
    "text": "Trump to Begin Large-Scale Deportations Tuesday  —  Chicago will be early target and the government will send as many as 200 officers to carry out the operation, according to people familiar with the planning  —  The incoming Trump administration is planning a large-scale immigration raid … ",
    "url": "https://www.wsj.com/politics/policy/trump-to-begin-large-scale-deportations-tuesday-e1bd89bd?st=47HCM3&ref=paydayreport.com"
  },
  {
    "text": "Trump's Deportation Plan Is Said to Start Next Week in Chicago  —  The size of the planned immigration raids is unclear, but they would be the opening step in the president-elect's goal of overseeing the largest deportation program in history.  —  The incoming Trump administration intends to carry out … ",
    "url": "https://www.nytimes.com/2025/01/17/us/politics/trump-immigration-raids-chicago.html"
  },
  {
    "text": "Trump administration planning illegal immigrant arrests throughout US on ‘day one’  —  The incoming Trump administration is eyeing immigration arrests of illegal immigrants across the country as soon as day one, as top officials say they are ready to “take the handcuffs off” Immigration and Customs Enforcement (ICE).",
    "url": "https://www.foxnews.com/politics/trump-administration-planning-illegal-immigrant-arrests-across-us-day-one"
  },
  {
    "text": "Trump plans large immigration raid in Chicago on Tuesday - report  —  Administration to send 100 to 200 officers to city on day two of new presidency, Wall Street Journal reports  —  Donald Trump's incoming presidential administration plans to launch a large immigration raid in Chicago … ",
    "url": "https://www.theguardian.com/us-news/2025/jan/17/trump-ice-raid-chicago-report"
  },
  {
    "text": "Under Trump's Big Tent, Republicans Are Starting to Clash  —  Donald J. Trump won his battle with establishment Republicans.  Now, it's disputes over immigration, taxes and foreign policy that will test his party's unity.  —  Democrats have long been viewed as the big-tent party … ",
    "url": "https://www.nytimes.com/2025/01/18/us/politics/donald-trump-inauguration-republican-party.html"
  },
  {
    "text": "TikTok to ‘Go Dark’ on Sunday for Its 170 Million American Users  —  The Chinese-owned company said it would cut off its services unless the U.S. assures Apple, Google and other companies that they would not be punished for hosting and distributing TikTok.  —  TikTok said late Friday … ",
    "url": "https://www.nytimes.com/2025/01/17/technology/17tiktok-goes-dark-sunday-apple-google.html"
  },
  {
    "text": "The Real Story Behind Mike Turner's Firing  —  The speaker's decision to cashier his Intelligence chair wasn't about Donald Trump.  —  When Speaker Mike Johnson summarily fired House Intelligence Chair Mike Turner this week, everyone assumed it was about Donald Trump.",
    "url": "https://www.politico.com/news/magazine/2025/01/18/mike-johnson-mike-turner-firing-column-00199129"
  },
  {
    "text": "Support for Trump's Policies Exceeds Support for Trump  —  A new poll found the public is sympathetic to the president-elect's plans to deport migrants and reduce America's presence overseas.  —  Many Americans who otherwise dislike President-elect Donald J. Trump share his bleak assessment … ",
    "url": "https://www.nytimes.com/2025/01/18/us/politics/trump-policies-immigration-tariffs-economy.html?unlocked_article_code=1.qE4.Axo4.bt2hEdcb0Ofc&smid=url-share"
  },
  {
    "text": "Kennedy Sought to Stop Covid Vaccinations 6 Months After Rollout  —  Robert F. Kennedy Jr. petitioned the F.D.A. to revoke authorization of the shots at a time when they were in high demand and considered life-saving.  —  Robert F. Kennedy Jr., President-elect Donald J. Trump's choice to lead … ",
    "url": "https://www.nytimes.com/2025/01/17/health/rfk-jr-covid-vaccines.html?unlocked_article_code=1.p04.VtD-.Gp_05XPFwAE6&smid=url-share"
  },
  {
    "text": "Can He Do That?  Here's What Biden's Move on the Equal Rights Amendment Means.  —  Presidents have no direct role in approving constitutional amendments.  So what could President Biden's pronouncement recognizing a new one actually do?  —  President Biden on Friday declared that he believes … ",
    "url": "https://www.nytimes.com/2025/01/17/us/politics/biden-equal-rights-amendment-explained.html"
  },
  {
    "text": "Canada Prepares for Trump Tariff Threat With Three-Stage Plan  —  Canadian officials are preparing retaliatory measures if the new U.S. administration imposes tariffs on Canadian imports.  —  Orange juice from Florida.  Whiskey from Tennessee.  Peanut butter from Kentucky.",
    "url": "https://www.nytimes.com/2025/01/17/world/canada/canada-trump-tariffs.html?unlocked_article_code=1.qE4.CZVk.mWWEtM54elN3&smid=bs-share"
  },
  {
    "text": "Exclusive |  CBS Owner Discusses Settling Trump Suit, With Merger Review on Tap  —  Paramount, owner of CBS, its namesake studio and several cable channels, has a major piece of business in front of the new administration: its planned merger with Skydance Media.",
    "url": "https://www.wsj.com/business/media/cbs-owner-discusses-settling-trump-suit-with-merger-review-on-tap-a5916925?st=J6cdvU&reflink=article_copyURL_share"
  },
  {
    "text": "President-elect Donald Trump to hold ‘victory rally’ in Washington, DC before inauguration  —  President-elect Donald Trump is set to hold a victory rally in Washington, D.C. on Sunday, one day before returning back to the White House for a second term.  —  Preparations were underway … ",
    "url": "https://www.usatoday.com/story/news/politics/2025/01/18/trump-rally-washington-dc/77747982007/"
  },
  {
    "text": "Voters Want MAGA Lite From Trump, WSJ Poll Finds  —  Survey shows Biden leaves office with record-low approval and a badly tarnished party  —  Voters support many of the goals President-elect Donald Trump has set for his second term.  They are just not on board with all the ways he wants to accomplish them.",
    "url": "https://www.wsj.com/politics/policy/donald-trump-policy-approval-poll-849feb84?st=AdVB9g"
  },
  {
    "text": "After major 2024 defeats, the Democratic Party searches for a new direction  —  DETROIT — The Democratic Party begins 2025 with several looming questions about its future.  —  Among them: how to recover from losing the White House and the Senate, in an election that saw Democrats lose … ",
    "url": "https://www.npr.org/2025/01/18/nx-s1-5262358/democratic-party-future-trump"
  },
  {
    "text": "Fox News' Jessica Tarlov Hits Sean Hannity With Blunt Reality Check On Biden  —  Tarlov spotted the “reason” why Donald Trump “wants to take credit” for numbers coming out of the Biden administration.  —  LOADING  —  Fox News' Jessica Tarlov on Friday took on network host Sean Hannity … ",
    "url": "https://www.huffpost.com/entry/fox-news-jessica-tarlov-sean-hannity-biden-trump_n_678b3f56e4b0aa5a1d95ddd5"
  },
  {
    "text": "CNN settles lawsuit after $5 million defamation verdict  —  CNN reached a legal settlement with a security contractor Friday after a Florida jury found the network had defamed him by suggesting he was charging “exorbitant prices” to evacuate people from Afghanistan after the U.S. withdrawal in August 2021.",
    "url": "https://www.npr.org/2025/01/17/nx-s1-5251209/cnn-defamation-afghanistan-evacuations-black-market"
  },
  {
    "text": "Shove the Presidency Down Trump's Throat … The most recent entry in the “good advice for Democrats” canon comes from occasional TNR contributor and Bulwark writer Jonathan V. Last, who wrote, “The job of the Democratic party comes in two parts.  First: Do not help Republicans.  Not in any way.",
    "url": "https://newrepublic.com/post/190337/trump-second-term-democrats-respond"
  },
  {
    "text": "Curtis Yarvin Says Democracy Is Done.  Powerful Conservatives Are Listening.  —  Philip Montgomery for The New York Times  —  For a long time, Curtis Yarvin, a 51-year-old computer engineer, has written online about political theory in relative obscurity.",
    "url": "https://www.nytimes.com/2025/01/18/magazine/curtis-yarvin-interview.html?unlocked_article_code=1.qE4.g1_N.MPg0zn-z3kN-&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Former Trump aides are warning newbies: Buy legal insurance or risk a hefty bill  —  Many staffers who worked in Trump's first administration saw the need for an attorney when many were dragged before congressional committees and grand juries.  —  WASHINGTON — As Republicans gear up for new jobs … ",
    "url": "https://www.nbcnews.com/politics/white-house/former-trump-aides-are-warning-newbies-buy-legal-insurance-risk-hefty-rcna187505"
  },
  {
    "text": "Exclusive: Elon Musk May Be the Latest Leader of D.C.'s Line Hotel  —  The president-elect's best new buddy hopes to snap up the hot Adams Morgan address  —  In huge pre-inauguration news, tech titan Elon Musk is slated to be the highest bidder on D.C.'s trendy Line hotel.",
    "url": "https://dc.eater.com/2025/1/17/24346186/exclusive-elon-musk-dc-line-hotel"
  },
  {
    "text": "How moving Trump's inauguration inside spurred an all-out scramble  —  The sudden weather-induced change forced a scramble for hundreds of thousands of people who had spent months planning for the swearing-in of the nation's 47th president.  —  President-elect Donald Trump on Friday ordered … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/01/17/why-trump-inauguration-moved-indoors-capitol-rotunda-extreme-cold/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3MDkwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4NDcyMzk5LCJpYXQiOjE3MzcwOTAwMDAsImp0aSI6ImFjMjQ5MTk3LWYwN2ItNDNiNS1hOWJhLTc0ODA5NGQ2MmIxMCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS8yMDI1LzAxLzE3L3doeS10cnVtcC1pbmF1Z3VyYXRpb24tbW92ZWQtaW5kb29ycy1jYXBpdG9sLXJvdHVuZGEtZXh0cmVtZS1jb2xkLyJ9.xPLtkG3VmpJZ9tnEnG631S1lWhNfLmYRpBLi1Psj8Nc&itid=gfta"
  },
  {
    "text": "Bill Gates ‘Impressed’ With Trump's Interest in Global Health During Three-Hour Dinner  —  Microsoft co-founder says he discussed HIV, polio and global health with president-elect  —  Add Bill Gates to growing the list of billionaires dining with President-elect Donald Trump before he returns to the White House.",
    "url": "https://www.wsj.com/politics/policy/bill-gates-donald-trump-meeting-e54fc20d?st=Ljbkqs&reflink=desktopwebshare_permalink"
  }
]