[
  {
    "text": "Fetterman Plans to Give Back Menendez Donation In Cash-Filled Envelopes (Exclusive)  —  Fetterman is the only Senate Democrat to call on Menendez to resign after a federal bribery indictment  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/fetterman-plans-to-give-back-menendez-donation-in-cash-filled-envelopes-exclusive"
  },
  {
    "text": "Second Senate Democrat calls for Menendez resignation  —  Sen. Sherrod Brown (D-Ohio) on Monday became the second Senate Democrat to call on Sen. Bob Menendez (D-N.J.) to resign after he was indicted on federal bribery charges late last week.  —  “Senator Menendez has broken the public trust … ",
    "url": "https://thehill.com/homenews/senate/4222340-second-senate-democrat-calls-for-menendez-resignation/"
  },
  {
    "text": "Bob Menendez, Al Franken, and the presumption of innocence  —  “Bob Menendez has been a dedicated public servant and is always fighting hard for the people of New Jersey.  He has a right to due process and a fair trial.”  —  That was the response of Senate Majority Leader Chuck Schumer … ",
    "url": "https://popular.info/p/bob-menendez-al-franken-and-the-presumption"
  },
  {
    "text": "U.S. Sen. Sherrod Brown calls on indicted Sen. Bob Menendez to resign  —  WASHINGTON, D. C.  - U.S. Sen. Sherrod Brown on Monday joined calls for the resignation of his Democratic U.S. Senate colleague Bob Menendez of New Jersey, who has been indicted on bribery charges that allege he used … ",
    "url": "https://www.cleveland.com/news/2023/09/us-sen-sherrod-brown-calls-on-indicted-sen-bob-menendez-to-resign.html"
  },
  {
    "text": "Trump Floats the Idea of Executing Joint Chiefs Chairman Milley  —  The former president is inciting violence against the nation's top general.  America's response is distracted and numb.  —  Late Friday night, the former president of the United States—and a leading candidate to be the next president … ",
    "url": "https://www.theatlantic.com/ideas/archive/2023/09/trump-milley-execution-incitement-violence/675435/"
  },
  {
    "text": "Trump Tells South Carolina ‘This Country Is Finished’ if He Doesn't Win 2024: 'I Hate To Say It.  It's Horrible'  —  The former president targeted ‘Bidenomics’ and promised to ‘drill, baby, drill’ at the campaign stop  —  A Facebook icon representing an external link to share the article … ",
    "url": "https://themessenger.com/politics/trump-tells-south-carolina-this-country-is-finished-if-he-doesnt-win-2024-i-hate-to-say-it-its-horrible"
  },
  {
    "text": "Trump appears to remain worried that 2024 won't be rigged to his benefit  —  Former president Donald Trump has never been particularly adept at masking his true feelings.  He feels confident in his ability to close the deal, however robustly he's previously undermined his position.",
    "url": "https://www.washingtonpost.com/politics/2023/09/25/trump-pennsylvania-voting/"
  },
  {
    "text": "Trump doesn't buy gun after saying he wants to in South Carolina  — The Trump campaign walked back a claim that former President Donald Trump bought a Glock handgun in South Carolina.  — A since-deleted video posted on social media by Trump's spokesman, Steven Cheung … ",
    "url": "https://www.cnbc.com/2023/09/25/trump-says-he-is-buying-glock-handgun-at-south-carolina-event.html"
  },
  {
    "text": "Could a discharge petition keep the government open?  —  Good morning, Early Birds.  If you observe Yom Kippur, have an easy fast.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.  —  In today's edition ...  Sen. Bob Menendez holds … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/25/could-discharge-petition-keep-government-open/"
  },
  {
    "text": "Biden suggests Americans should ‘stop electing’ House Republicans if they shut down government  —  President Biden on Monday bashed House Republicans for heading towards a government shutdown, saying that they shouldn't be elected if they can't do their job to fund the government.",
    "url": "https://thehill.com/homenews/administration/4222325-biden-suggests-americans-should-stop-electing-house-republicans-if-they-shut-down-government/"
  },
  {
    "text": "Newsom and DeSantis agree to debate on Fox News  —  Florida Gov. and Republican presidential candidate Ron DeSantis (R) and California Gov. Gavin Newsom (D) have agreed to participate in a televised debate in November that will be moderated by Fox News host Sean Hannity.",
    "url": "https://thehill.com/homenews/4221793-newsom-desantis-agree-fox-news-debate-nov-30/"
  },
  {
    "text": "Deal!  WGA, AMPTP Reach Historic Contract Agreement to End 146-Day Writers Strike: ‘This Deal Is Exceptional’  —  Hollywood heaves a sigh of relief.  The WGA and major studios and streamers have reached a tentative agreement on a new three-year contract that promises to end the 146-day strike … ",
    "url": "https://variety.com/2023/biz/news/writers-strike-ends-wga-amptp-deal-2-1235733452/"
  },
  {
    "text": "I served in the House for 28 years.  It's now more dysfunctional than ever.  —  I was back on Capitol Hill last week, where I had the dual experiences of meaningful memories of the past colliding with realities of the present.  —  Former staff members from my personal office … ",
    "url": "https://thehill.com/opinion/campaign/4221898-i-served-in-the-house-for-28-years-its-now-more-dysfunctional-than-ever/"
  },
  {
    "text": "Leader of Canada's House of Commons apologizes for honoring man who fought for Nazis  —  The speaker of Canada's House of Commons apologized Sunday for recognizing a man who fought for a Nazi military unit during World War II.  Just after Ukrainian President Volodymyr Zelenskyy delievered … ",
    "url": "https://apnews.com/article/canada-parliament-apology-ukraine-nazi-eedc22e1d810011c412953168a4cee46"
  },
  {
    "text": "2 Looming Rulings Could Shape Trump's Fraud Trial in New York  —  Donald J. Trump has adopted a long-shot legal strategy to try to delay his upcoming civil trial and severely limit the case against him.  —  After four years of investigating and litigating, Letitia James was finally due for her day in court against Donald J. Trump.",
    "url": "https://www.nytimes.com/2023/09/25/nyregion/trump-letitia-james-fraud-lawsuit-trial.html"
  },
  {
    "text": "Before Jan. 6, the FBI predicted extremists would be ‘very willing to take action’ over a 2020 election dispute  —  An FBI “red cell” report predicted that law enforcement action and a “lack of coordination” between groups would prevent widespread violence in response to a disputed election.",
    "url": "https://www.nbcnews.com/politics/justice-department/jan-6-fbi-predicted-extremists-willing-take-action-2020-election-dispu-rcna117173"
  },
  {
    "text": "Millions of women, children risk losing WIC's nutrition assistance if government shuts down  —  “[WIC] expires ... immediately when the shutdown occurs,” Vilsack said.  —  Nearly 7 million mothers and their children could lose the nutrition assistance they receive from the federal government … ",
    "url": "https://abcnews.go.com/Politics/millions-women-children-risk-losing-wics-nutrition-assistance/story?id=103473348"
  },
  {
    "text": "8 hospitalized after ‘sudden severe turbulence’ on Florida-bound flight  —  FORT LAUDERDALE, Fla. (WFLA) — Eight people were hospitalized Monday after being injured during rough skies on a flight to Florida.  —  Passengers and crew aboard the JetBlue flight experienced “sudden severe turbulence” … ",
    "url": "https://thehill.com/policy/transportation/4222399-8-hospitalized-after-sudden-severe-turbulence-on-florida-bound-flight/"
  },
  {
    "text": "GOP donor wants his money back after candidate hires Corey Lewandowski  —  An alleged unwanted advance causes ripples in Louisiana's gubernatorial primary two years later.  —  John Odom, a major Republican donor, has been a top backer of Louisiana gubernatorial candidate Jeff Landry.",
    "url": "https://www.politico.com/news/2023/09/25/john-odom-jeff-landry-corey-lewandowski-00117843"
  }
]