[
  {
    "text": "Trump says abortion should be left to states, declines to endorse national limit  —  Former president Donald Trump, who has wavered between highlighting and downplaying his role in curtailing abortion rights, suggested Monday that the politically volatile issue should be left to states, after months of mixed signals about his position.",
    "url": "https://www.washingtonpost.com/elections/2024/04/08/trump-abortion-statement/"
  },
  {
    "text": "Nation's leading anti-abortion group rebukes Trump  —  “We are deeply disappointed in President Trump's position,” said Marjorie Dannenfelser, president of Susan B. Anthony Pro-Life America.  —  One of the nation's most prominent anti-abortion groups rebuked former President Donald Trump Monday … ",
    "url": "https://www.politico.com/news/2024/04/08/trump-anti-abortion-group-ban-00151037"
  },
  {
    "text": "Jamie Dimon on Ukraine: Staying on sidelines not an option  —  JP Morgan Chase CEO Jamie Dimon, a key voice in U.S. business and finance circles, said the U.S. cannot stand on the sidelines in Ukraine's fight against Russia, pushing back on calls from some in the GOP to pull back from the war.",
    "url": "https://thehill.com/business/4580742-jamie-dimon-on-ukraine-staying-on-sidelines-not-an-option/"
  },
  {
    "text": "It's time to put up on Ukraine, Speaker Johnson  —  The House of Representatives returns to session on Tuesday.  It faces no question more urgent than assistance for Ukraine, which is running low on the weapons it needs to defend against the invading Russian army.",
    "url": "https://thehill.com/opinion/4580374-its-time-to-put-up-on-ukraine-speaker-johnson/"
  },
  {
    "text": "Trump's $175 Million Bond Is Even Shadier Than It Looks  —  BOILERPLATE  —  New information shows that the insurance company that swooped in and bailed out Trump with a $175 million bond isn't on a list of vetted companies—and wrote a bizarre contract.",
    "url": "https://www.thedailybeast.com/trumps-dollar175-million-bond-is-even-shadier-than-it-looks"
  },
  {
    "text": "Biden to announce new plans to provide student debt relief for millions  —  More than 30 million Americans would benefit from the plans in combination with other actions the administration has taken, the White House said.  —  President Joe Biden on Monday is expected to announce revised plans … ",
    "url": "https://www.nbcnews.com/politics/white-house/biden-announce-new-plans-provide-student-debt-relief-millions-rcna146806"
  },
  {
    "text": "President Joe Biden Outlines New Plans to Deliver Student Debt Relief to Over 30 Million Americans Under the Biden-Harris Administration  —  Today, Biden-Harris Administration leaders will fan out across the country as President Biden announces his Administration's new plans to cancel student debt for tens of millions of Americans.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/04/08/president-joe-biden-outlines-new-plans-to-deliver-student-debt-relief-to-over-30-million-americans-under-the-biden-harris-administration/"
  },
  {
    "text": "House intelligence chair says Republicans are ‘absolutely’ repeating Russian propaganda  —  Mike Turner, the Ohio Republican, echoes a similar claim made recently by another rightwing American lawmaker  —  Mike Turner, the chairperson of the US House intelligence committee … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/08/republican-mike-turner-russia-propaganda"
  },
  {
    "text": "Trump's RNC takeover triggers strife and staff exits as purge partly backfires  —  Presumptive Republican nominee installed allies to run party but loyalty tests have led to weakening of certain areas, including data  —  Donald Trump's allies installed to run the Republican National Committee … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/08/rnc-trump-takeover-republican-strife"
  },
  {
    "text": "Traduzione in lingua inglese  —  Declaration “Dignitas Infinita”  —  on Human Dignity Presentation  —  During the Congresso of 15 March 2019, the then-Congregation for the Doctrine of the Faith decided to commence “the drafting of a text highlighting the indispensable nature of the dignity … ",
    "url": "https://press.vatican.va/content/salastampa/it/bollettino/pubblico/2024/04/08/0284/00588.html#en"
  },
  {
    "text": "Trump to Sue Judge in Last-Ditch Attempt to Avert Manhattan Trial  —  Donald J. Trump's lawyers indicated they would file an action asking an appeals court to delay the first prosecution of a former president.  The move is unlikely to succeed.  —  Donald J. Trump, a week away from standing trial … ",
    "url": "https://www.nytimes.com/2024/04/08/nyregion/trump-hush-money-trial-delay.html"
  },
  {
    "text": "Biden could miss the deadline for the November ballot in Ohio, the state's election office says  —  President Joe Biden could be left off the ballot in Ohio this fall unless the state's Republican-dominated legislature creates an exception to the ballot deadline or the Democratic Party moves … ",
    "url": "https://thehill.com/homenews/ap/ap-politics/ap-biden-could-miss-the-deadline-for-the-november-ballot-in-ohio-the-states-election-office-says/"
  },
  {
    "text": "Cruz's corrupt bargain  —  After the Supreme Court's 2010 decision in Citizens United, there are few restrictions on spending money in federal elections.  But Senator Ted Cruz (R-TX) may have violated one of the last legal guardrails to secure hundreds of thousands of dollars in support of his reelection campaign.",
    "url": "https://popular.info/p/cruzs-corrupt-bargain"
  },
  {
    "text": "Trump's Cabinet was in flux.  Biden's has barely changed.  —  Former president Donald Trump saw more turnover in his Cabinet than any other recent president, and it's not close.  President Biden, on the other hand, has had relatively little change in his administration's top roles so far.",
    "url": "https://www.washingtonpost.com/politics/2024/04/08/trump-biden-cabinet-turnover/"
  },
  {
    "text": "Scoop: Trump, GOP plot 2025 criminal probe of Bidens … - A source close to the Trump campaign said that “everything you have seen from the Biden DOJ,” in terms of the charges against Trump, “you can expect to see from the Trump DOJ.”  — One Trump ally argued that there is precedent … ",
    "url": "https://www.axios.com/2024/04/08/trump-gop-plot-biden-probe-2025"
  },
  {
    "text": "Inside the Election Denial Groups Planning to Disrupt November  —  Groups like True the Vote and Michael Flynn's America Project want to mobilize thousands of Trump supporters by pushing baseless claims about election fraud—and are rolling out new technology to fast-track their efforts.",
    "url": "https://www.wired.com/story/election-denial-groups-november-2024/"
  },
  {
    "text": "A “wonkish” professor is Democrats' big draw in the 2024 campaign … - “We're in the fight of our lives for democracy and freedom, and those are kind of my hobby horse,” said Raskin, a former Jan. 6 committee member and Trump impeachment manager who's the leading Democrat on the House Oversight Committee.",
    "url": "https://www.axios.com/2024/04/08/raskin-big-draw-democrats-2024-campaign"
  }
]