[
  {
    "text": "Skadden, a Top Law Firm, Is in Talks to Avert an Executive Order  —  The discussions come as other major firms are said to be trying to cut deals with the White House.  —  The elite law firm Skadden, Arps, Slate, Meagher & Flom has had discussions with President Trump's advisers about a deal … ",
    "url": "https://www.nytimes.com/2025/03/27/business/trump-law-firms-skadden-arps.html?unlocked_article_code=1.7E4.3mWR.RWGkLydk7UHE"
  },
  {
    "text": "Addressing Risks From WilmerHale  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Background.  My Administration is committed to addressing the significant risks associated with law firms … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/addressing-risks-from-wilmerhale/"
  },
  {
    "text": "A DHS staffer faces serious punishment for accidentally adding a reporter to a group email  —  The episode, which has not been previously reported, raises questions about unequal punishment for inadvertent leakers in the Trump administration.  —  A federal worker accidentally includes … ",
    "url": "https://www.nbcnews.com/politics/national-security/dhs-staffer-faces-serious-punishment-accidentally-adding-reporter-grou-rcna198233"
  },
  {
    "text": "Bondi Indicates Signal Chat Episode Will Not Be Criminally Investigated  —  The attorney general said the focus should be on the success of the U.S. military strike in Yemen, not that military information was shared in advance in a group text among top officials.",
    "url": "https://www.nytimes.com/2025/03/27/us/politics/signal-leak-prosecution-bondi.html"
  },
  {
    "text": "Top Senate Republican Protests Trump Bid to Withhold Spending  —  Senator Susan Collins of Maine, the chairwoman of the Appropriations Committee, joined top Democrats in insisting that the president does not have the power to “pick and choose” what to fund.  —  A top Senate Republican … ",
    "url": "https://www.nytimes.com/2025/03/27/us/politics/susan-collins-appropriations-trump.html"
  },
  {
    "text": "Trump executive order on Smithsonian targets funding to programs with ‘improper ideology’  —  President Donald Trump revealed his intentions to reshape the Smithsonian Institution with an executive order Thursday that targets funding to programs with “divisive narratives” and “improper ideology.”",
    "url": "https://apnews.com/article/trump-smithsonian-executive-order-improper-ideology-558ebfab722f603e94e02a1a4b06ed4d"
  },
  {
    "text": "Fact Sheet: President Donald J. Trump Restores Truth and Sanity to American History  —  RESTORING TRUTH IN AMERICAN HISTORY: Today, President Donald J. Trump signed an Executive Order restoring truth and sanity to American history by revitalizing key cultural institutions and reversing the spread of divisive ideology.",
    "url": "https://www.whitehouse.gov/fact-sheets/2025/03/fact-sheet-president-donald-j-trump-restores-truth-and-sanity-to-american-history/"
  },
  {
    "text": "Restoring Truth and Sanity to American History  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose and Policy.  Over the past decade, Americans have witnessed a concerted … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/restoring-truth-and-sanity-to-american-history/"
  },
  {
    "text": "ICE Makes Another Student Disappear—and No One Knows Why  —  The Trump administration has detained another international student, but this time has not provided any justification.  —  University of Alabama doctoral student Alireza Doroudi, an Iranian citizen, was picked up at his home on 5 … ",
    "url": "https://newrepublic.com/post/193253/ice-iranian-international-student-alireza-doroudi-alabama"
  },
  {
    "text": "Trump Warned U.S. Automakers Not to Raise Prices in Response to Tariffs  —  Threat came in a call earlier this month, in which carmakers feared punishment if prices go up  —  When President Trump convened CEOs of some of the country's top automakers for a call earlier this month … ",
    "url": "https://www.wsj.com/business/autos/trump-tariffs-automaker-prices-warning-928bc7a9?st=FbeQ4v&reflink=article_copyURL_share"
  },
  {
    "text": "How Kristi Noem's $50,000 Rolex in a Salvadoran prison became a political flashpoint  —  The high-end Swiss watch lent a striking contrast to her tour of a notoriously overcrowded mega-prison in one of Latin America's poorest countries.  —  Just now  —  When Homeland Security Secretary … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/27/kristi-noem-rolex-controversy/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzMDQ4MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0NDMwMzk5LCJpYXQiOjE3NDMwNDgwMDAsImp0aSI6ImE5YTVjMjNhLTRkNDMtNGE4ZS04NTBiLTE2MzVhNDY2ODA2NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzI3L2tyaXN0aS1ub2VtLXJvbGV4LWNvbnRyb3ZlcnN5LyJ9.haZ-hHrOzjHyyEU-KSePC8IAtp-ohHNx4XrzTV6vaQo&itid=gfta"
  },
  {
    "text": "Israel Supplied Intelligence in Airstrike Discussed in Signal Chat, Officials say  —  Houthi missile expert was tracked with help of Israeli human source in Yemen  —  WASHINGTON—Israel provided sensitive intelligence from a human source in Yemen on a key Houthi military operative targeted … ",
    "url": "https://www.wsj.com/politics/national-security/israel-supplied-intelligence-in-airstrike-discussed-in-signal-chat-officials-say-9a9e0abf?st=ToysDc&reflink=mobilewebshare_permalink"
  },
  {
    "text": "Russian scientist from Harvard Medical School detained in U.S., faces deportation and likely arrest upon return due to anti-war stance  —  A Russian scientist working at Harvard Medical School has been detained in the United States and placed in immigration detention.",
    "url": "https://theins.press/en/news/280037"
  },
  {
    "text": "RFK Jr.'s massive cuts stun staff, leave senior employees scrambling  —  The cuts sent shockwaves through the department's sprawling workforce, prompting a scramble among senior agency officials to figure out which employees and policy priorities were affected.",
    "url": "https://www.politico.com/news/2025/03/27/very-few-people-know-whats-happening-rfk-jr-cuts-surprise-and-alarm-00254822"
  },
  {
    "text": "Fact Sheet: President Donald J. Trump Exempts Agencies with National Security Missions from Federal Collective Bargaining Requirements  —  PROTECTING OUR NATIONAL SECURITY: Today, President Donald J. Trump signed an Executive Order using authority granted by the Civil Service Reform Act of 1978 … ",
    "url": "https://www.whitehouse.gov/fact-sheets/2025/03/fact-sheet-president-donald-j-trump-exempts-agencies-with-national-security-missions-from-federal-collective-bargaining-requirements/"
  },
  {
    "text": "Internal White House document details layoff plans across U.S. agencies  —  While officials stressed the estimates were subject to change, the snapshot suggests how agencies are working to meet Trump's mandate to shrink government.  —  Just now  —  Federal officials are preparing for agencies … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/27/federal-worker-layoffs-government-agencies/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzMDQ4MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0NDMwMzk5LCJpYXQiOjE3NDMwNDgwMDAsImp0aSI6ImIyZTNhZjA0LWU0OTEtNGNhMS04ZjUyLTViYjE2MzQ3Y2M1NSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzI3L2ZlZGVyYWwtd29ya2VyLWxheW9mZnMtZ292ZXJubWVudC1hZ2VuY2llcy8ifQ.ZhLUWAC6kS9DZEhxOy5BeViRYcRkYvIsFgeNBNFIlsY&itid=gfta"
  },
  {
    "text": "Signal Chat Leak Angers U.S. Military Pilots  —  Men and women who have taken to the air on behalf of the United States expressed bewilderment after the leak of attack plans.  “You're going to kill somebody,” one pilot said.  —  The intelligence breach was bad enough, current and former fighter pilots said.",
    "url": "https://www.nytimes.com/2025/03/27/us/politics/pilots-signal-leak.html?unlocked_article_code=1.7E4.ZPcI.ZHMyML38GPF9&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "This Is the Land of Wolves Now  —  1. POWs  —  Two weeks ago Donald Trump invoked the Alien Enemies Act, a law that grants the president extraordinary powers during times of war.  Here's his proclamation: … Some of the individuals who have been apprehended under the Alien Enemies Act … ",
    "url": "https://www.thebulwark.com/p/this-is-the-land-of-wolves-now"
  },
  {
    "text": "Even More Venmo Accounts Tied to Trump Officials in Signal Group Chat Left Data Public  —  WIRED has found four new Venmo accounts that appear to be associated with Trump officials who were in an infamous Signal chat.  One made a payment with a note consisting solely of an eggplant emoji.",
    "url": "https://www.wired.com/story/even-more-venmo-accounts-tied-to-trump-officials-in-signal-group-chat-left-data-public/"
  },
  {
    "text": "Bill Gates: Within 10 years, AI will replace many doctors and teachers—humans won't be needed ‘for most things’  —  Over the next decade, advances in artificial intelligence will mean that humans will no longer be needed “for most things” in the world, says Bill Gates.",
    "url": "https://www.nbcchicago.com/news/business/money-report/bill-gates-within-10-years-ai-will-replace-many-doctors-and-teachers-humans-wont-be-needed-for-most-things/3706507/"
  },
  {
    "text": "Vance addresses Marines as White House deals with fallout of Signal group chat leak  —  As Vice President JD Vance was giving a motivational speech to the Marine Corps Base at Quantico Wednesday afternoon, White House press secretary Karoline Leavitt was simultaneously pushing back against fallout … ",
    "url": "https://www.washingtonexaminer.com/news/white-house/3359207/vance-marines-white-house-fallout-sharing-signal-military-attack/"
  }
]