[
  {
    "text": "Harvard Says It Will Not Comply With Trump Administration's Demands  —  Federal officials said Harvard must enact “merit-based reform” in hiring and admissions, among other things.  Harvard called the demands unlawful.  —  Harvard University said on Monday that it had rejected policy changes requested … ",
    "url": "https://www.nytimes.com/2025/04/14/us/harvard-trump-reject-demands.html"
  },
  {
    "text": "Harvard Will Fight Trump's Demands  —  Harvard will not comply with the Trump administration's demands to dismantle its diversity programming and limit student protests in exchange for its federal funding, University President Alan M. Garber '76 announced in a message to affiliates Monday afternoon.",
    "url": "https://www.thecrimson.com/article/2025/4/15/harvard-denies-trump-demands/"
  },
  {
    "text": "The Promise of American Higher Education  —  For three-quarters of a century, the federal government has awarded grants and contracts to Harvard and other universities to help pay for work that, along with investments by the universities themselves, has led to groundbreaking innovations across … ",
    "url": "https://www.harvard.edu/president/news/2025/the-promise-of-american-higher-education/"
  },
  {
    "text": "Salvadoran president says he won't return wrongly deported man to U.S.  —  Salvadoran President Nayib Bukele said Monday that he does not plan to return to Kilmar Abrego García to the United States.  “How can I return him to the United States?”  Bukele asked Monday during a meeting … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/14/trump-presidency-news-tariffs-deportations/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0NjAzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1OTg1NTk5LCJpYXQiOjE3NDQ2MDMyMDAsImp0aSI6IjRmM2RjYWMwLTNhMGYtNGE3Yy1iNDQ4LTkyYWIxYWUzMGQ4MyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA0LzE0L3RydW1wLXByZXNpZGVuY3ktbmV3cy10YXJpZmZzLWRlcG9ydGF0aW9ucy8ifQ.hZb2Ub_MMIgoinvra0B8PoWuSGkoBStMCaevwUm9cpE&itid=gfta"
  },
  {
    "text": "Trump administration freezes $2.2 billion in grants to Harvard over campus activism  —  The federal government says it's freezing more than $2.2 billion in grants and $60 million in contracts to Harvard University, since the institution said Monday it won't comply with the Trump administration's demands to limit activism on campus.",
    "url": "https://apnews.com/article/harvard-trump-administration-federal-cuts-antisemitism-0a1fb70a2c1055bda7c4c5a5c476e18d"
  },
  {
    "text": "The Trump Administration Is Sticking to Its Gulag Plan in Defiance of the Supreme Court  —  The Trump administration escalated its defiance of federal court orders over the weekend, adamantly refusing to reverse its illegal deportation of a Maryland father, Kilmar Abrego Garcia, to an El Salvador prison.",
    "url": "https://slate.com/news-and-politics/2025/04/trump-defying-supreme-court-el-salvador-bukele.html"
  },
  {
    "text": "The Constitutional Crisis Is Here  —  Between the path of outright defiance of the Supreme Court and following its order to “facilitate” the return of Kilmar Abrego Garcia from El Salvador's infamous Centro de Confinamiento del Terrorismo (CECOT), the Trump administration has chosen a third way … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/04/bukele-trump-court-order/682432/?gift=Je3D9AQS-C17lUTOnl2W8FIcAJ_15fkw4XWpbB8kiu0&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Bukele's Offense Against the American People  —  Here's how I look at today's White House spectacle.  —  I don't really care what these two men say.  The only next step I'm focused on is the one that now faces the Supreme Court.  The White House is now brazenly ignoring the crystal clear import … ",
    "url": "https://talkingpointsmemo.com/edblog/bukeles-offense-against-the-american-people"
  },
  {
    "text": "Trump's new favorite authoritarian is helping him sidestep court orders  —  El Salvador President Nayib Bukele is urging Trump to emulate his iron-fisted playbook.  —  Move over Kim Jong Un, Vladimir Putin and Viktor Orban.  Donald Trump's latest strongman bromance is with “President B.”",
    "url": "https://www.politico.com/news/2025/04/14/trump-bukele-sidestep-court-orders-00290220"
  },
  {
    "text": "Van Hollen Requests Meeting with President Bukele to Discuss Return of Kilmar Abrego Garcia; Announces Intent to Travel to El Salvador This Week if Abrego Garcia is Not Returned  —  U.S. Senator Chris Van Hollen (D-Md.) has requested a meeting with Salvadoran President Nayib Bukele … ",
    "url": "https://www.vanhollen.senate.gov/news/press-releases/van-hollen-requests-meeting-with-president-bukele-to-discuss-return-of-kilmar-abrego-garcia-announces-intent-to-travel-to-el-salvador-this-week-if-abrego-garcia-is-not-returned"
  },
  {
    "text": "Columbia Activist Arrested by ICE at His Appointment for Citizenship  —  Mohsen Mahdawi, a legal permanent resident, has lived in the United States for 10 years and was arrested in Vermont.  He has not been charged with a crime.  —  Mohsen Mahdawi, an organizer of pro-Palestinian demonstrations … ",
    "url": "https://www.nytimes.com/2025/04/14/nyregion/columbia-student-palestinian-arrested-ice.html?unlocked_article_code=1._k4.8_ZE.-FIbFnHAlLiG&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Palestinian Student Leader Was Called In for Citizenship Interview — Then Arrested by ICE  —  Mohsen K. Mahdawi arrived at the U.S. Citizenship and Immigration Services office in Colchester, Vermont, on Monday.  A Palestinian student at Columbia University, he hoped that, after 10 years in the U.S. … ",
    "url": "https://theintercept.com/2025/04/14/ice-columbia-student-mohsen-mahdawi-citizenship-interview/"
  },
  {
    "text": "Despite a court order, White House bars AP from Oval Office event  —  Despite a court order, a reporter and photographer from The Associated Press were barred from an Oval Office news conference on Monday with President Donald Trump and his counterpart from El Salvador, Nayib Bukele.",
    "url": "https://apnews.com/article/trump-ap-press-freedom-court-gulf-caffd32aa8ec6b04a50b8c5277d7c9cb"
  },
  {
    "text": "AP says journalists blocked from Oval Office after judge's order  —  The Associated Press on Monday said its journalists were barred from covering an Oval Office event featuring President Trump and El Salvador President Nayib Bukele in defiance of a court injunction.",
    "url": "https://thehill.com/homenews/media/5248116-ap-blocked-white-house/"
  },
  {
    "text": "White House to Ask Congress to Claw Back Funding From NPR and PBS  —  Trump administration officials want legislators to rescind $1.1 billion for the Corporation for Public Broadcasting, which provides some support for public media.  —  The White House is planning to ask Congress to claw … ",
    "url": "https://www.nytimes.com/2025/04/14/business/media/trump-npr-pbs-funding.html"
  },
  {
    "text": "Greene Bought Market Dip Before Trump Paused Tariffs, Profiting From the Rally  —  The Georgia congresswoman purchased at least tens of thousands of dollars in stock the day before and the day of President Trump's pause of a sweeping set of tariffs that sent the market soaring.",
    "url": "https://www.nytimes.com/2025/04/14/us/politics/marjorie-taylor-greene-bought-stock-trump-tariffs-pause.html"
  },
  {
    "text": "Suspect in arson at Pennsylvania Gov. Josh Shapiro's residence being treated at hospital, police say  —  A man who authorities said scaled an iron security fence in the middle of the night, eluded police and broke into the Pennsylvania governor's mansion where he set a fire is in police custody … ",
    "url": "https://apnews.com/article/josh-shapiro-arson-charges-pennsylvania-governor-c3ccfc0f23a40f2b10bd6ba767d53f80"
  },
  {
    "text": "Trump urges the FCC to punish ‘60 Minutes’ over reports on Greenland and Ukraine  —  President Donald Trump has a “hope” for his Federal Communications Commission: that the agency will punish CBS for airing “60 Minutes” reports he doesn't like.  —  Apparently angered by Sunday night's … ",
    "url": "https://cnn.com/2025/04/14/media/trump-fcc-60-minutes-cbs"
  },
  {
    "text": "JD Vance drops Ohio State's national championship trophy at White House celebration  —  WASHINGTON ― It was nearly a disastrous late-game turnover.  —  JD Vance fumbled the college football National Championship Trophy as he tried to hoist it up during a White House celebration … ",
    "url": "https://www.usatoday.com/story/news/politics/2025/04/14/jd-vance-trophy-ohio-state-national-championship/83087486007/"
  },
  {
    "text": "Albuquerque Man Charged in Connection with Arson Attacks on Tesla Dealership and Republican Party of New Mexico Office  —  For Immediate Release  —  Note: View the criminal complaint.  —  Federal charges have been filed against Jamison Wagner, 40, an Albuquerque resident … ",
    "url": "https://www.justice.gov/opa/pr/albuquerque-man-charged-connection-arson-attacks-tesla-dealership-and-republican-party-new"
  },
  {
    "text": "U.S. businesses sue to block Trump tariffs, say trade deficits are not an emergency  —  The lawsuit alleges Trump has illegally usurped Congress' power to levy tariffs by claiming trade deficits with other countries constitute an emergency.  —  A group of five small businesses … ",
    "url": "https://www.nbcnews.com/business/business-news/us-businesses-sue-block-trump-tariffs-say-trade-deficits-are-not-emerg-rcna201213"
  },
  {
    "text": "How to Turn Trump's Economic Chaos Against Him  —  In many ways, President Trump is a one-trick Shetland pony: He talks a big game, like building a border wall or ending Covid, and then tries to distract Americans when his promises go belly up.  Back in office this winter … ",
    "url": "https://www.nytimes.com/2025/04/14/opinion/trump-tariffs-economy-carville.html"
  },
  {
    "text": "Trump plan would slash State Dept. funding by nearly half, memo says  —  An internal document reviewed by The Post targets spending on humanitarian assistance, global health and international organizations such as the U.N. and NATO.  —  Just now  —  The Trump administration proposed to cut … ",
    "url": "https://www.washingtonpost.com/national-security/2025/04/14/state-department-budget-cuts-trump-rubio/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0NjAzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1OTg1NTk5LCJpYXQiOjE3NDQ2MDMyMDAsImp0aSI6IjE1NDdiYjAxLWRlZDYtNDljNi1hZmRiLWY5YjE0OTBkZDRiNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA0LzE0L3N0YXRlLWRlcGFydG1lbnQtYnVkZ2V0LWN1dHMtdHJ1bXAtcnViaW8vIn0.F7ds15z8Jr2uxxjiB_toIyPj9AB9t8eYhPW4vBtefEg&itid=gfta"
  },
  {
    "text": "NVIDIA to Manufacture American-Made AI Supercomputers in US for First Time  —  NVIDIA is working with its manufacturing partners to design and build factories that, for the first time, will produce NVIDIA AI supercomputers entirely in the U.S.  —  Together with leading manufacturing partners … ",
    "url": "https://blogs.nvidia.com/blog/nvidia-manufacture-american-made-ai-supercomputers-us/"
  },
  {
    "text": "Trump Moves to Put New Tariffs on Computer Chips and Drugs  —  Citing a national security statute, the administration has begun a process to investigate the impact of imported semiconductors and pharmaceuticals.  —  The Trump administration took steps on Monday that appear likely to result … ",
    "url": "https://www.nytimes.com/2025/04/14/business/economy/trump-semiconductor-tariffs-china.html"
  }
]