[
  {
    "text": "Clarence Thomas' 38 Vacations: The Other Billionaires Who Have Treated the Supreme Court Justice to Luxury Travel  —  Co-published with CNN  —  Friends of the Court: SCOTUS Justices' Beneficial Relationships With Billionaire Donors  —  Supreme Court Justice Clarence Thomas' decadeslong friendship … ",
    "url": "https://www.propublica.org/article/clarence-thomas-other-billionaires-sokol-huizenga-novelly-supreme-court"
  },
  {
    "text": "‘Anonymous’ Trump critic mulled Election Day suicide  —  A Trump administration insider who waged war against the president under the moniker “Anonymous” said he considered suicide on election night 2020 when it appeared that the former president was going to win.",
    "url": "https://www.washingtonexaminer.com/news/washington-secrets/anonymous-trump-critic-mulled-election-day-suicide"
  },
  {
    "text": "Trump unleashes on Biden as legal problems mount  —  Former President Trump on Thursday unleashed a torrent of insults against President Biden, attacking him in personal terms as Trump's legal problems continue to mount.  —  “What Crooked Joe Biden, who can't string two sentences together … ",
    "url": "https://thehill.com/homenews/administration/4147012-trump-unleashes-on-biden-as-legal-problems-mount/"
  },
  {
    "text": "Pelosi reemerges as top Trump adversary  —  Rep. Nancy Pelosi is off the bench as former President Trump's top adversary on Capitol Hill.  —  After stepping down as Speaker last year, Pelosi (D-Calif.) has flown largely under the radar in the Democratic caucus, allowing a crop of new leaders … ",
    "url": "https://thehill.com/homenews/house/4146274-pelosi-trump-adversary/"
  },
  {
    "text": "The truth about Monique Worrell  —  On November 3, 2020, Monique Worrell (D) was elected state's attorney in Florida's 9th Judicial District, which includes Orange and Osceola counties.  Worrell won in resounding fashion, collecting 395,979 votes and defeating her opponent by a two-to-one margin.",
    "url": "https://popular.info/p/the-truth-about-monique-worrell"
  },
  {
    "text": "Suspended Soros-linked central Florida prosecutor blasts DeSantis as a ‘dictator’  —  State Attorney Monique Worrell likened Gov. Ron DeSantis (R-FL) to a “weak dictator” after he suspended her for allegedly neglecting her prosecutorial duties in central Florida.",
    "url": "https://www.washingtonexaminer.com/news/suspended-florida-prosecutor-blasts-desantis-dictator"
  },
  {
    "text": "Trump, aide plead not guilty in documents case.  De Oliveira does not enter plea  —  FORT PIERCE, Fla. — Donald Trump and one of his two co-defendants on Thursday pleaded not guilty in federal court to multiple charges alleging that the former president kept classified documents at his Florida property and … ",
    "url": "https://www.washingtonpost.com/national-security/2023/08/10/trump-aide-carlos-de-oliveira-arraignment/"
  },
  {
    "text": "Racing to Stop Trump, Republicans Descend on a Strange New Iowa  —  As the state fair and its Republican pageantry begin, Donald Trump's rivals face a transformed political environment in Iowa, where he holds a comfortable edge in polls despite rarely visiting.",
    "url": "https://www.nytimes.com/2023/08/10/us/politics/trump-republicans-iowa-state-fair.html"
  },
  {
    "text": "Wildfires just destroyed a Maui town.  Next year could be worse.  —  The raging fires have killed at least 36 people and caused what is expected to be billions of dollars in damages.  Climate change could prompt more of the same.  —  This post has been updated.  —  Nelly Niumatalolo couldn't believe it when she heard it.",
    "url": "https://grist.org/wildfires/wildfires-just-destroyed-a-maui-town-next-year-could-be-worse/"
  },
  {
    "text": "Maui fires live updates: 6 dead as thousands flee ‘unprecedented’ disaster … Former President Barack Obama and first lady Michelle are thinking of all those affected by the wildfires in the state of Hawaii, and shared a way to help with his more than 131 million followers on social media.",
    "url": "https://www.nbcnews.com/news/us-news/live-blog/maui-fires-live-updates-thousands-flee-unprecedented-disaster-rcna99164"
  },
  {
    "text": "Why the Ohio Special Election Backfired for the GOP  —  “AS I THOUGHT ABOUT THIS VOTE more and more, what they were trying to do and the way they were trying to do it was just kind of creepy.”  —  Outside a polling place in Cleveland on Tuesday, a thirtysomething art teacher was explaining to me her … ",
    "url": "https://plus.thebulwark.com/p/why-the-ohio-special-election-backfired-for-gop"
  },
  {
    "text": "GOP Candidate Plagiarized Massive Segments of His College Thesis  —  Controversial GOP congressional candidate Anthony Sabatini appears to have lifted massive segments of his college thesis from Wikipedia and gotten away with it—until now. … Right-wing Florida Republican congressional … ",
    "url": "https://www.thedailybeast.com/gop-candidate-anthony-sabatini-plagiarized-massive-segments-of-his-college-thesis"
  },
  {
    "text": "Anti-corruption presidential candidate slain at campaign event in Ecuador's capital  —  An Ecuadorian presidential candidate known for speaking up against corruption was shot and killed Wednesday at a political rally in the capital, an attack that comes amid a wave of startling violence in the South American country.",
    "url": "https://apnews.com/article/ecuador-villavicencio-presidential-candidate-killed-ee9c726b82c09e16e5dacde2d6f005ff"
  },
  {
    "text": "Trump adviser groped 2 women in 2021 at Scottsdale club, one tells police  —  A woman says Boris Epshteyn, a special adviser to Donald Trump, repeatedly groped her and her sister inside a Scottsdale nightclub in 2021, according to police body camera footage obtained by The Arizona Republic.",
    "url": "https://www.azcentral.com/story/news/politics/elections/2023/08/10/trump-adviser-boris-epshteyn-groped-2-women-in-scottsdale-one-says/70562482007/"
  },
  {
    "text": "Indictment charges former soldier with stealing vehicle, crashing into Army facility  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of Georgia  —  Charges carry possible sentence of up to 20 years in prison  —  SAVANNAH, GA:  A retired U.S. Army soldier … ",
    "url": "https://www.justice.gov/usao-sdga/pr/indictment-charges-former-soldier-stealing-vehicle-crashing-army-facility"
  },
  {
    "text": "Biden's first climate czar, Gina McCarthy, is getting a big new gig  —  Good morning and welcome to The Climate 202!  As a scheduling reminder, the newsletter is only publishing Tuesday through Thursday during the congressional recess.  We'll be back in your inbox on Tuesday.",
    "url": "https://www.washingtonpost.com/politics/2023/08/10/biden-first-climate-czar-gina-mccarthy-is-getting-big-new-gig/"
  },
  {
    "text": "July CPI report shows inflation gauge rose 3.2%, less than expected  —  WATCH NOW  —  Inflation gauge rose 3.2% annually in July, less than expected  —  The consumer price index rose 3.2% from a year ago in July, a sign that inflation has lost at least some of its grip on the U.S. economy.",
    "url": "https://www.cnbc.com/2023/08/10/cpi-inflation-july-2023-.html"
  },
  {
    "text": "Rewild the National Mall  —  Mr. Nazaryan is a writer and gardener.  —  I recently committed an act of sabotage at one of the most revered landmarks in the United States, a transgression against my relatively new home of Washington, D.C. Walking across the National Mall … ",
    "url": "https://www.nytimes.com/2023/08/10/opinion/national-mall-wildflower-meadow.html"
  },
  {
    "text": "The Montgomery Brawl Was, for Some, a Clarifying Moment  —  The Alabama Sweet Tea Party.  —  That was one nickname people gave to a brawl this past Saturday on a Montgomery, Ala., riverfront dock, captured in viral videos, after a group of white people attacked Damien Pickett … ",
    "url": "https://www.nytimes.com/2023/08/09/opinion/montgomery-brawl.html"
  },
  {
    "text": "Trump Seeks to Review Classified Evidence at His Own Secure Facility  —  Lawyers for the former president proposed using “a previously approved facility at or near his residence” — presumably Mar-a-Lago — instead of a secure location run by the federal courts.",
    "url": "https://www.nytimes.com/2023/08/09/us/politics/trump-classified-evidence.html"
  }
]